---
title: Variables and Basic Data Types 
localeTitle: Переменные и основные типы данных
---
# Переменные и основные типы данных

## Что такое переменная?

Переменные хранят значения. Упрощенно говоря, вы даете имя сохраненному значению, которое хотите использовать позже. Важно отметить, что одна переменная может в конкретный момент хранить только одно значение. Однако вы можете изменять сохраненные значения, а также присвоить значение одной переменной другой.

> Когда вы создаете переменную, это называется `объявление` , а когда вы даете ей значение для хранения, это называется `присваивание` . Если вы даете переменной значение одновременно с объявлением, это называется `инициализация` . C строго следит за тем, как вы создаете переменные и что вы храните в них. C - `сильно типизированный` язык, что означает, что вы должны определять тип и имя для каждой переменной в момент ее объявления. Имя переменной может состоять из букв, цифр и символа подчеркивания.

## Основные типы

В стандартном C есть четыре важных основных типа данных: `int` , `float` , `double` , `char` .

### Целые числа

Для целочисленных значений используется ключевое слово `int` (сокращение от integer, целое число). Давайте посмотрим на простую программу:

```C
 #include <stdio.h> 
 int main(void ){  
    int a; // Объявление переменной, хранящей целочисленные значения и называющейся 'a' 
    int b = 5; // Инициализация целочисленной переменной 'b' значением 5 
    a = 6; // Присваивание значения 6 переменной 'a' 
    int c; 
    c = a + b; // Присваивание суммы 'a' и 'b' переменной c 
    int d = a + c; // Можно также инициализировать подобным образом 

    //Для красоты 
    printf("%d \n", c); 
    printf("%d %d \n", a, b); 

    return 0; 
 } 
```

Давайте разберем, что мы сделали под `Для красоты` :

```C
printf("%d \n", c); 
```

Чтобы распечатать значение переменной `c` , вы можете использовать функцию `printf()` . Обратите внимание на `%d` заключенную в двойные кавычки. Это говорит компьютеру, чтобы он ожидал десятичное значение, и что оно идет после запятой.

```C
printf("%d %d \n", a, b); 
```

Вы можете распечатать несколько целых чисел в порядке, указанном после запятой.

Обратите внимание, что если вы пытаетесь сохранить вещественное десятичное значение в `int` , вы получите только его целую часть, поскольку оно будет урезано.

Мы также можем написать программу следующим образом:

```c
 #include <stdio.h> 
 int main(void){ 
 
    int a = 3, b = 4, c; // Мы также можем объявить и инициализировать несколько переменных на одной строке 
    c = a + b; // Присвоить сумму 'a' и 'b' переменной c 

    printf("%d %d \n", a, b); 
    printf("%d \n", c); 

    return 0; 
 } 
```

### float и double

Чтобы хранить вещественные десятичные значения, можно использовать ключевые слова `float` и `double`. Разница между ними - точность, `double` имеет около 13 цифр, а `float` - около 7, но это отличается от CPU до CPU. 

```c
#include <stdio.h>
int main(void){
   double a = 3.23;
   printf("The variable a has the value: %f \n", a); // Значения double печатаются с помощью %f
return 0;
}
```

### Символы

 Можно хранить одиночный символ, используя ключевое слово `char`. О хранении нескольких символов подряд пойдет речь чуть позже, когда будет введено понятие `массив`. Взглянем на данный код: 
```c
#include <stdio.h>
int main(void){
 char a = 'A'; // Инициализация char значением 'A', обратите внимание на одинарные кавычки!
 printf("The character was: %c ", a) // char можно печатать с помощью %c
return 0;
}
```

## Булев тип
Позже в C был добавлен еще один тип, называемый `bool`. Он хранит занчения истина/ложь, которые очень пригождаются, если в коде нужно принимать решения. Правда, для того чтобы его использовать, необходимо помимо `<stdio.h>` подключить заголовочный файл `<stdbool.h>`. 

```c
#include <stdio.h>
#include <stdbool.h>
int main(void){
   bool a = true;
   bool b = false;
   return 0;
}
```

## Комментарии

Тип переменной сообщает компилятору, сколько места выделить для переменной. Теперь вы видели основные типы данных, но для них существуют модификаторы для изменения объема пространства, выделяемого для переменной. Модификаторы могут увеличивать или уменьшать значения по умолчанию. C имеет 5 модификаторов: `short` , `long` , `signed` , `unsigned` , `long long` . Они пишутся перед ключевымсловом основного типа.
