{
  "responsive-web-design": {
    "title": "(レガシー) レスポンシブウェブデザイン チャレンジ課題",
    "intro": [
      "このレスポンシブウェブデザイン認定講座では、開発者がウェブページを実装するために使う言語について学びます。ページの内容には HTML (Hypertext Markup Language)、デザインには CSS (Cascading Style Sheets) を使用します。",
      "初めに、HTML と CSS の基礎を学ぶために、猫の写真アプリを作ります。その後、ペンギンの絵を作りながら CSS 変数等のモダンなテクニックを学びます。そしてウェブフォームを作りながらアクセシビリティのベストプラクティスを学びます。",
      "最後に、Flexbox を使った Twitter カードや CSS グリッドを使った複雑なブログレイアウトの作成を通じて、さまざまな画面サイズに応答するウェブページを作成する方法を学びます。"
    ],
    "note": "注意: 広告ブロッカーやダークモード拡張などの、一部のブラウザ拡張機能がテストに干渉する可能性があります。問題が発生した場合、コース受講中はページのコンテンツやレイアウトを変更する拡張機能を無効にすることをお勧めします。"
  },
  "2022/responsive-web-design": {
    "title": "レスポンシブウェブデザイン",
    "intro": [
      "このレスポンシブウェブデザイン認定講座では、開発者がウェブページを実装するために使う言語について学びます。ページの内容には HTML (Hypertext Markup Language)、デザインには CSS (Cascading Style Sheets) を使用します。",
      "初めに、HTML と CSS の基礎を学ぶために、猫の写真アプリを作ります。その後、ペンギンの絵を作りながら CSS 変数等のモダンなテクニックを学びます。そしてクイズサイトを作りながらアクセシビリティのベストプラクティスを学びます。",
      "最後に、フレックスボックスを使ったフォトギャラリーや、CSS グリッドを使った雑誌記事のレイアウトの作成を通じて、さまざまな画面サイズに応じて表示されるウェブページの作成方法を学びます。"
    ],
    "note": "注意: 広告ブロッカーやダークモード拡張などの、一部のブラウザ拡張機能がテストに干渉する可能性があります。問題が発生した場合、コース受講中はページのコンテンツやレイアウトを変更する拡張機能を無効にすることをお勧めします。"
  },
  "javascript-algorithms-and-data-structures": {
    "title": "(レガシー) JavaScript アルゴリズムとデータ構造",
    "intro": [
      "HTML と CSS はページの内容とスタイルを制御しますが、JavaScript はそれを対話式にすることを手掛けます。JavaScript アルゴリズムとデータ構造認定講座では、変数、配列、オブジェクト、ループ、そして関数を含む JavaScript の基礎を学習します。",
      "いったん基礎を習得すれば、その知識を応用して文字列を扱うためのアルゴリズムを作成したり、数の階乗を計算したり、さらに国際宇宙ステーションの軌道を計算することもできます。",
      "途中で、オブジェクト指向プログラミング (OOP) と関数型プログラミング (FP) の 2 つの重要なプログラミングの様式または典型について学習します。"
    ],
    "note": "注: 広告ブロッカーやスクリプトブロッカーのようないくつかのブラウザ拡張機能は、テストを妨害することがあります。もし問題に直面したら、受講中はページの内容を変更もしくはブロックする拡張機能を無効にすることをお勧めします。"
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "JavaScript Algorithms and Data Structures",
    "intro": [
      "Developers use HTML and CSS to control the content and styling of a page. And they use JavaScript to make that page interactive.",
      "In this JavaScript Algorithm and Data Structures Certification, you'll learn the JavaScript fundamentals like variables, arrays, objects, loops, functions, the DOM and more.",
      "You'll also learn about Object Oriented Programming (OOP), Functional Programming, algorithmic thinking, how to work with local storage, and how to fetch data using an API."
    ],
    "note": "注: 広告ブロッカーやスクリプトブロッカーのようなブラウザ拡張機能は、テストを妨害することがあります。もし問題に直面したら、受講中はページの内容を変更もしくはブロックする拡張機能を無効にすることをお勧めします。"
  },
  "front-end-development-libraries": {
    "title": "フロントエンド開発ライブラリ",
    "intro": [
      "今やあなたは HTML、CSS、そして JavaScript に精通しているので、業界内で最も一般的なフロントエンドライブラリのいくつかを学習することで技能を向上させましょう。",
      "フロントエンド開発ライブラリ認定講座では、Bootstrap でサイトを手軽に整える方法を学習します。Sass を利用して、CSS スタイルに論理的な処理を加えて拡張する方法についても学習します。",
      "後ほど、ショッピングカートや他のアプリケーションを構築しながら、強力なシングルページアプリケーション (SPA) を React と Redux で作成する方法を学習します。"
    ],
    "note": ""
  },
  "data-visualization": {
    "title": "データ可視化",
    "intro": [
      "データは至る所にありますが、形状と文脈なしではあまり意味を表しません。",
      "データ可視化認定講座では、D3.js ライブラリを使用して、様々な種類のデータを表すチャート、グラフ、およびマップを構築します。",
      "また JSON (JavaScript Object Notation) について、そして API (Application Programming Interface) を使用してオンラインでデータを扱う方法についても学習します。"
    ],
    "note": ""
  },
  "relational-database": {
    "title": "リレーショナルデータベース",
    "intro": [
      "このコースでは、VS Code、PostgreSQL、そして Linux / Unix コマンドラインを含む本格的な開発者ツールとソフトウェアを使用して、インタラクティブなチュートリアルを完了し、プロジェクトを構築します。",
      "これらのコースは基本的な Bash コマンドから始まります。ターミナルを使用して、ファイルシステムの移動や操作から、Bash 内でのスクリプト、幅広い高度な使用法まで、すべてを学習します。",
      "次に、データベース管理システムである PostgreSQL と、これらデータベースの言語である SQL を使用して、リレーショナルデータベースの作成、操作方法を学習します。",
      "最後に、すべての開発者にとって不可欠なツールである、バージョン管理システムの Git について学習します。"
    ]
  },
  "back-end-development-and-apis": {
    "title": "バックエンド開発と API",
    "intro": [
      "ここまでは、JavaScript をフロントエンドで使用して、ページに対話性を加えたり、アルゴリズムチャレンジを解決したり、SPA を構築したりしてきました。しかし JavaScript は、バックエンド (サーバー) でも使用でき、ウェブアプリケーション全体を構築することができます。",
      "現在、アプリケーションを構築する一般的な方法の一つはマイクロサービスを使用する方法です。これは、小さなモジュール式のアプリケーションを組み合わせて、より大きな全体を形成する方法です。",
      "バックエンド開発と API 認定講座では、Node.js と npm を使用してバックエンドアプリを記述する方法を学習します。Express フレームワークでウェブアプリケーションを構築し、MongoDB と Mongoose ライブラリで People Finder マイクロサービスを構築します。"
    ],
    "note": ""
  },
  "quality-assurance": {
    "title": "品質保証",
    "intro": [
      "プログラムまたはウェブアプリケーションがより複雑になるにつれて、新たな変更が元の機能を破壊しないか確かめるために、それらをテストしたくなるでしょう。",
      "品質保証認定講座では、アプリケーションが期待通りに動作することを保証するために、Chai でテストを記述する方法を学習します。",
      "そして、高度な Node と Express の概念を学習するためにチャットアプリケーションを構築します。また、テンプレートエンジンとして Pug を、認証のために Passport を、そしてサーバーと接続されているクライアントの間のリアルタイム通信を行うために Socket.io を使用します。"
    ],
    "note": ""
  },
  "scientific-computing-with-python": {
    "title": "Scientific Computing with Python",
    "intro": [
      "The Scientific Computing with Python curriculum will equip you with the skills to analyze and manipulate data using Python, a powerful and versatile programming language. You'll learn key concepts like data structures, algorithm, Object Oriented Programming, and how to perform complex calculations using a variety of tools.",
      "This comprehensive course will guide you through the fundamentals of scientific computing, including data structures, and algorithms."
    ],
    "note": ""
  },
  "data-analysis-with-python": {
    "title": "Python を用いたデータ分析",
    "intro": [
      "データ分析はずっと以前からありました。しかし数年前までは、開発者は Tableau のような高額で、クローズドソースのツールを用いてそれを実践していました。しかし最近では、Python、SQL、そして他のオープンなライブラリがデータ分析を永遠に変えてしまいました。",
      "Python を用いたデータ分析認定講座では、Python を用いたデータ分析の基礎を学習します。この認定講座の終わりまでに、CSV や SQL のような情報源からデータを読み出す方法と、Numpy、Pandas、Matplotlib、そして Seaborn といったライブラリを、データを加工し可視化するために使用する方法がわかるようになります。"
    ],
    "note": ""
  },
  "information-security": {
    "title": "情報セキュリティ",
    "intro": [
      "オンラインで行うすべてのことに伴い、膨大な量の取り扱いに注意すべき情報が危険にさらされます。電子メールアドレス、パスワード、電話番号、その他にもたくさんの情報があります。",
      "情報セキュリティ認定講座では、オンラインで人々の情報を保護する基本を学習するために、 HelmetJS で安全なウェブアプリを構築します。",
      "また、Python で TCP クライアントと、Nmap およびポートスキャナーを構築します。これは優れた情報セキュリティにおいて重要な構成要素である、ペネトレーションテストの基本の学習に役立ちます。"
    ],
    "note": ""
  },
  "machine-learning-with-python": {
    "title": "Python を用いた機械学習",
    "intro": [
      "機械学習には、プロジェクト内または仕事中に使用することができる多くの実用的なアプリケーションがあります。",
      "Python を用いた機械学習認定講座では、TensorFlow フレームワークを使用して、いくつかのニューラルネットワークを構築し、自然言語処理や強化学習のようなより高度な技術も探究します。",
      "またニューラルネットワークを掘り下げて、ディープ、回帰型、そして畳み込みニューラルネットワークの仕組みの背後にある原理を学習します。"
    ],
    "note": ""
  },
  "college-algebra-with-python": {
    "title": "Python を用いた代数学",
    "intro": [
      "このコースは 1 学期の大学講座として作成されました。講義動画、インタラクティブに手を動かしながら学べる Google Colaboratory ノートブック、課題、そして挑戦しがいのあるプロジェクトで構成されています。",
      "コースの各パートを順に進めていく中で、代数学、そして Python のコードを書いて代数の問題を解く方法がしっかりと理解できます。",
      "また、コース全体を通して、カスタム計算機として使える Algebra Colab ノートブックを作り上げます。この講座 (およびこれからあなたが書くコード) が、数学とデータサイエンスをより深く理解するための基礎となるでしょう。"
    ],
    "note": ""
  },
  "python-for-everybody": {
    "title": "(レガシー) みんなの Python",
    "intro": [
      "Python は現在最も一般的で適応性のあるプログラミング言語です。基本的なスクリプトから機械学習まで幅広く使用することができます。"
    ],
    "note": ""
  },
  "coding-interview-prep": {
    "title": "コーディング面接対策",
    "intro": [
      "次回の就職面接に備えて無料のコーディング演習をお探しでしたら、こちらにご用意しています。",
      "This section contains dozens of coding challenges that test your knowledge of algorithms, data structures, and mathematics. It also has a number of take-home projects you can use to strengthen your skills, or add to your portfolio.",
      "This work incorporates material from <a href=\"https://www.wikipedia.org/\" target=\"_blank\">Wikipedia</a>, which is licensed under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\" target=\"_blank\">Creative Commons Attribution-ShareAlike License 4.0</a>. The original content might have been modified and adapted. For the unaltered version and additional details, see the original page on <a href=\"https://www.wikipedia.org/\" target\"_blank\">Wikipedia</a>."
    ]
  },
  "the-odin-project": {
    "title": "The Odin Project - freeCodeCamp Remix",
    "intro": [
      "The Odin Project was created in 2013 by a lone developer, Erik Trautman. Over the years, an open source community has sprung up to maintain and expand the project.",
      "freeCodeCamp has expanded upon the open source curriculum to make it run interactively in the browser, with tests to evaluate your code and ensure you've understood key concepts.",
      "If you want the original experience of configuring all of The Odin Project to run on your local computer, you can check out the original Odin Project on <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>The Odin Project website</a>. A huge thanks to The Odin Project community for continuing to maintain this valuable learning resource for developers all around the world.",
      "This course is unofficial, and not endorsed by The Odin Project. Changes to The Odin Project curriculum content have been made, and all instructional material for this course is licensed under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; The Odin Project</a>",
      "This course includes content from <a href='https://javascript.info/' target='_blank' rel='noopener noreferrer nofollow'>JavaScript.info</a>, which is licensed under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>."
    ]
  },
  "project-euler": {
    "title": "プロジェクト・オイラー",
    "intro": [
      "かの偉大なプロジェクト・オイラー・アーカイブを元にした、以下のプログラミングチャレンジを完成させてください。これらの問題でアルゴリズムと数学の知識が強化できるでしょう。",
      "問題は易しい物から難しい物まであり、その多くで帰納的連鎖学習のような体験ができます。つまり、ある問題を解くことによって新しい概念を学ぶことができ、以前はとっつきにくかった問題に取り組めるようになるでしょう。すべての問題を解けるでしょうか？"
    ]
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "Free Foundational C# with Microsoft Certification",
    "intro": [
      "このコースは、C# プログラミングについての総合的な入門講座です。中心となる概念、構文、ソフトウェア開発における実践的な応用例などをカバーします。",
      "以下のハンズオン演習とプロジェクトを通して、変数、データ型、制御構造、オブジェクト指向プログラミングの原則など、C# の基礎を学習します。",
      "このコースを完了する頃には、C# を使いこなしてアプリケーションを作成できる実践的なスキルと知識が身についていることでしょう。"
    ],
    "note": "以下の各セクションでは、それぞれ関連するトロフィーを Microsoft Learn プラットフォームで獲得する必要があります。それぞれのトロフィーを獲得後、freeCodeCamp のサイトで確認を実行してください。すべてのトロフィーの確認が完了すると、認定試験の受験資格が得られます。"
  },
  "a2-english-for-developers": {
    "title": "A2 English for Developers (Beta) Certification",
    "intro": [
      "In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the A2 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.",
      "The first half of the curriculum will help you get comfortable with English grammar and usage. It will give you tons of hands-on practice. You'll learn basics like introducing yourself, making small talk, and discussing your work.",
      "In the second half, you'll practice vocabulary specific to software development. You'll learn how to describe code, discuss tech trends, and participate in stand-up meetings.",
      "This entire A2-level curriculum includes 105 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting."
    ]
  },
  "b1-english-for-developers": {
    "title": "B1 English for Developers (Beta) Certification",
    "intro": [
      "In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the B1 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.",
      "It will help you strengthen your foundational skills while introducing more complex grammar and usage. You'll learn how to describe places and things, share past experiences, and confidently use tenses like Present Perfect and Future. Practical communication strategies are included as well, such as managing conversations, expressing opinions, and building agreement or disagreement in discussions.",
      "You'll also focus on applying these skills in professional and technical settings. You'll practice vocabulary and phrases essential for developers, such as describing code, participating in stand-up meetings, and discussing tech trends. Advanced topics include conditionals, comparative structures, and conversation management, so you can prepare for real-world interactions in the tech industry.",
      "This entire B1-level curriculum includes 73 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting."
    ]
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Level up your creative problem solving skills with these free programming tasks from the classic Rosetta Code library.",
      "These challenges can prove to be difficult, but they will push your algorithm logic to new heights.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Attribute: Rosetta Code</a>"
    ]
  },
  "full-stack-developer": {
    "title": "Certified Full Stack Developer Curriculum",
    "intro": [
      "This course provides a comprehensive pathway to becoming a Certified Full Stack Developer, covering all the essential technologies required to build modern, scalable web applications from start to finish.",
      "Through a blend of interactive lessons, coding exercises, and real-world projects, you will master both frontend and backend development. You'll work with HTML, CSS, and JavaScript to build responsive user interfaces, explore React and TypeScript for advanced web applications, and learn to manage data with relational databases - and on the backend, you'll use Git, Npm, Node.js, and Python to create powerful server-side solutions.",
      "By the end of this course, you'll have the practical skills and experience to confidently develop complete web applications, preparing you for a successful career as a Full Stack Developer.",
      "This certification will take you a substantial amount of time and effort to complete. If you start now, you may be ready to start the remaining material and final exam when we launch it in the coming months."
    ],
    "chapters": {
      "html": "HTML",
      "css": "CSS",
      "javascript": "JavaScript",
      "frontend-libraries": "Front End Libraries",
      "relational-databases": "Relational Databases",
      "backend-javascript": "Backend JavaScript",
      "python": "Python",
      "career": "Career"
    },
    "modules": {
      "basic-html": "Basic HTML",
      "semantic-html": "Semantic HTML",
      "html-forms-and-tables": "Forms and Tables",
      "html-and-accessibility": "Accessibility",
      "review-html": "HTML Review",
      "exam-html": "HTML Exam",
      "computer-basics": "Computer Basics",
      "basic-css": "Basic CSS",
      "design-for-developers": "Design",
      "absolute-and-relative-units": "Absolute and Relative Units",
      "pseudo-classes-and-elements": "Pseudo Classes and Elements",
      "css-colors": "Colors",
      "styling-forms": "Styling Forms",
      "css-box-model": "The Box Model",
      "css-flexbox": "Flexbox",
      "css-typography": "Typography",
      "css-and-accessibility": "Accessibility",
      "attribute-selectors": "Attribute Selectors",
      "css-positioning": "Positioning",
      "responsive-design": "Responsive Design",
      "css-variables": "Variables",
      "css-grid": "Grid",
      "css-animations": "Animations",
      "review-css": "CSS Review",
      "exam-css": "CSS Exam",
      "code-editors": "Code Editors",
      "javascript-variables-and-strings": "Variables and Strings",
      "javascript-booleans-and-numbers": "Booleans and Numbers",
      "javascript-functions": "Functions",
      "javascript-arrays": "Arrays",
      "javascript-objects": "Objects",
      "javascript-loops": "Loops",
      "review-javascript-fundamentals": "JavaScript Fundamentals Review",
      "higher-order-functions-and-callbacks": "Higher Order Functions and Callbacks",
      "dom-manipulation-and-events": "DOM Manipulation and Events",
      "js-a11y": "JavaScript and Accessibility",
      "debugging-javascript": "Debugging",
      "basic-regex": "Basic Regex",
      "form-validation": "Form Validation",
      "javascript-dates": "Dates",
      "audio-and-video-events": "Audio and Video Events",
      "maps-and-sets": "Maps and Sets",
      "localstorage-and-crud-operations": "localStorage and CRUD Operations",
      "classes-and-the-this-keyword": "Classes",
      "recursion": "Recursion",
      "functional-programming": "Functional Programming",
      "asynchronous-javascript": "Asynchronous JavaScript",
      "review-javascript": "JavaScript Review",
      "exam-javascript": "JavaScript Exam",
      "react-fundamentals": "React Fundamentals",
      "react-state-hooks-and-routing": "React State, Hooks, and Routing",
      "performance": "Performance",
      "testing": "Testing",
      "css-libraries-and-frameworks": "CSS Libraries and Frameworks",
      "data-visualization": "Data Visualization and D3",
      "typescript-fundamentals": "TypeScript Fundamentals",
      "review-front-end-libraries": "Front End Libraries Review",
      "exam-front-end-libraries": "Front End Libraries Exam",
      "python-basics": "Python Basics",
      "python-loops-and-sequences": "Loops and Sequences",
      "python-dictionaries-and-sets": "Dictionaries and Sets",
      "python-error-handling": "Error Handling",
      "python-classes-and-objects": "Classes and Objects",
      "python-object-oriented-programming": "Object-Oriented Programming (OOP)",
      "python-linear-data-structures": "Linear Data Structures",
      "python-algorithms": "Algorithms",
      "python-graphs-and-trees": "Graphs and Trees",
      "python-dynamic-programming": "Dynamic Programming",
      "review-python": "Python Review",
      "exam-python": "Python Exam",
      "bash-fundamentals": "Bash Fundamentals",
      "sql-and-postgresql": "SQL and PostgreSQL",
      "bash-scripting": "Bash Scripting",
      "sql-and-bash": "SQL and Bash",
      "git": "Git",
      "review-relational-databases": "Relational Databases Review",
      "exam-relational-databases": "Relational Databases Exam",
      "introduction-to-nodejs": "Introduction to Node.js",
      "nodejs-core-libraries": "Node.js Core Libraries",
      "node-package-manager": "Node Package Manager",
      "http-and-the-web-standards-model": "HTTP and the Web Standards Model",
      "rest-api-and-web-services": "REST API and Web Services",
      "introduction-to-express": "Introduction to Express",
      "express-middleware": "Express Middleware",
      "error-handling-in-express": "Error Handling in Express",
      "websockets": "WebSockets",
      "node-and-sql": "Node and SQL",
      "security-and-privacy": "Security and Privacy",
      "authentication": "Authentication",
      "tooling-and-deployment": "Tooling and Deployment",
      "how-to-get-a-developer-job": "How to Get a Developer Job",
      "capstone-project": "Capstone Project",
      "certified-full-stack-developer-exam": "Certified Full Stack Developer Exam"
    },
    "module-intros": {
      "data-visualization": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will be introduced to data visualization and learn how to work with the D3 library."
        ]
      },
      "typescript-fundamentals": {
        "note": "Coming Fall 2025",
        "intro": [
          "In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz."
        ]
      },
      "python-classes-and-objects": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-object-oriented-programming": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-linear-data-structures": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-algorithms": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-graphs-and-trees": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-dynamic-programming": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge."
        ]
      },
      "bash-fundamentals": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge."
        ]
      },
      "sql-and-postgresql": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "bash-scripting": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz."
        ]
      },
      "sql-and-bash": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz."
        ]
      },
      "git": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz."
        ]
      },
      "introduction-to-nodejs": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz."
        ]
      },
      "nodejs-core-libraries": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz."
        ]
      },
      "node-package-manager": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz."
        ]
      },
      "http-and-the-web-standards-model": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz."
        ]
      },
      "rest-api-and-web-services": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge."
        ]
      },
      "introduction-to-express": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz."
        ]
      },
      "express-middleware": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz."
        ]
      },
      "error-handling-in-express": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz."
        ]
      },
      "websockets": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz."
        ]
      },
      "node-and-sql": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge."
        ]
      },
      "security-and-privacy": {
        "note": "Coming Fall 2025",
        "intro": [
          "In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge."
        ]
      },
      "authentication": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz."
        ]
      },
      "tooling-and-deployment": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge."
        ]
      },
      "how-to-get-a-developer-job": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more."
        ]
      },
      "capstone-project": {
        "note": "Coming Late 2026",
        "intro": [
          "This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification."
        ]
      },
      "certified-full-stack-developer-exam": {
        "note": "Coming Late 2026",
        "intro": [
          "This will be a 90 question exam testing what you have learned throughout this certification."
        ]
      }
    }
  },
  "javascript-v9": {
    "title": "JavaScript Certification",
    "intro": [
      "This course teaches you core JavaScript programming concepts such as working with variables, functions, objects, arrays, and control flow. You'll also learn how to manipulate the DOM, handle events, and apply techniques like asynchronous programming, functional programming, and accessibility best practices.",
      "To qualify for the exam, you must complete the following projects:",
      "- Build a Markdown to HTML Converter",
      "- Build a Drum Machine",
      "- Build a Voting System",
      "- Build a Bank Account Management Program",
      "- Build a Weather App",
      "Pass the exam to earn your JavaScript Certification."
    ],
    "chapters": {
      "javascript": "JavaScript"
    },
    "modules": {
      "javascript-variables-and-strings": "Variables and Strings",
      "javascript-booleans-and-numbers": "Booleans and Numbers",
      "javascript-functions": "Functions",
      "javascript-arrays": "Arrays",
      "javascript-objects": "Objects",
      "javascript-loops": "Loops",
      "review-javascript-fundamentals": "JavaScript Fundamentals Review",
      "higher-order-functions-and-callbacks": "Higher Order Functions and Callbacks",
      "dom-manipulation-and-events": "DOM Manipulation and Events",
      "js-a11y": "JavaScript and Accessibility",
      "debugging-javascript": "Debugging",
      "basic-regex": "Basic Regex",
      "lab-markdown-to-html-converter": "Build a Markdown to HTML Converter",
      "form-validation": "Form Validation",
      "javascript-dates": "Dates",
      "audio-and-video-events": "Audio and Video Events",
      "lab-drum-machine": "Build a Drum Machine",
      "maps-and-sets": "Maps and Sets",
      "lab-voting-system": "Build a Voting System",
      "localstorage-and-crud-operations": "localStorage and CRUD Operations",
      "classes-and-the-this-keyword": "Classes",
      "lab-bank-account-manager": "Build a Bank Account Management Program",
      "recursion": "Recursion",
      "functional-programming": "Functional Programming",
      "asynchronous-javascript": "Asynchronous JavaScript",
      "lab-weather-app": "Build a Weather App",
      "review-javascript": "JavaScript Review",
      "javascript-certification-exam": "JavaScript Certification Exam"
    }
  },
  "front-end-development-libraries-v9": {
    "title": "Front End Development Libraries Certification",
    "intro": [
      "This course teaches you the libraries that developers use to build webpages: React, TypeScript, and more.",
      "To earn your Front End Development Libraries Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Front End Development Libraries Certification exam."
    ],
    "chapters": {
      "front-end-development-libraries": "Front End Development Libraries"
    },
    "modules": {
      "front-end-development-libraries-certification-exam": "Front End Development Libraries Certification Exam"
    }
  },
  "python-v9": {
    "title": "Python Certification",
    "intro": [
      "This course teaches you the fundamentals of Python programming.",
      "To earn your Python Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Python Certification exam."
    ],
    "chapters": {
      "python": "Python"
    },
    "modules": {
      "python-certification-exam": "Python Certification Exam"
    }
  },
  "relational-databases-v9": {
    "title": "Relational Databases Certification",
    "intro": [
      "This course teaches you the fundamentals of relational databases.",
      "To earn your Relational Databases Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Relational Databases Certification exam."
    ],
    "chapters": {
      "relational-databases": "Relational Databases"
    },
    "modules": {
      "relational-databases-certification-exam": "Relational Databases Certification Exam"
    }
  },
  "back-end-development-and-apis-v9": {
    "title": "Back End Development and APIs Certification",
    "intro": [
      "This course teaches you the fundamentals of back end development and APIs.",
      "To earn your Back End Development and APIs Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Back End Development and APIs Certification exam."
    ],
    "chapters": {
      "back-end-development-and-apis": "Back End Development and APIs"
    },
    "modules": {
      "back-end-development-and-apis-certification-exam": "Back End Development and APIs Certification Exam"
    }
  },
  "a1-professional-spanish": {
    "title": "A1 Professional Spanish Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"],
    "chapters": {
      "es-a1-chapter-welcome-to-a1-professional-spanish": "Welcome to A1 Professional Spanish",
      "es-a1-chapter-letters-and-sounds": "Letters and Sounds",
      "es-a1-chapter-greetings-and-introductions": "Greetings and Introductions"
    },
    "modules": {
      "es-a1-module-introduction-and-certification-overview": "Introduction and Certification Overview",
      "es-a1-module-alphabet-accents-and-punctuation": "Alphabet, Accents, and Punctuation",
      "es-a1-module-greetings-and-farewells": "Greetings and Farewells",
      "es-a1-module-introducing-yourself": "Introducing Yourself",
      "es-a1-module-first-questions": "First Questions"
    },
    "module-intros": {
      "es-a1-module-introduction-and-certification-overview": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-alphabet-accents-and-punctuation": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-greetings-and-farewells": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-introducing-yourself": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-first-questions": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      }
    }
  },
  "responsive-web-design-v9": {
    "title": "Responsive Web Design Certification",
    "intro": [
      "This course teaches the fundamentals of HTML and CSS, including modern layout, design, accessibility, and responsive web development. You'll build practical projects and gain the skills to create professional, user-friendly webpages.",
      "To qualify for the exam, you must complete the following projects:",
      "- Build a Survey Form",
      "- Build a Page of Playing Cards",
      "- Build a Book Inventory App",
      "- Build a Technical Documentation Page",
      "- Build a Product Landing Page",
      "Pass the exam to earn your Responsive Web Design Certification."
    ],
    "chapters": {
      "html": "HTML",
      "css": "CSS",
      "responsive-web-design-certification-exam": "Responsive Web Design Certification Exam"
    },
    "modules": {
      "basic-html": "Basic HTML",
      "semantic-html": "Semantic HTML",
      "html-forms-and-tables": "Forms and Tables",
      "html-and-accessibility": "Accessibility",
      "review-html": "HTML Review",
      "computer-basics": "Computer Basics",
      "basic-css": "Basic CSS",
      "design-for-developers": "Design",
      "absolute-and-relative-units": "Absolute and Relative Units",
      "pseudo-classes-and-elements": "Pseudo Classes and Elements",
      "css-colors": "Colors",
      "styling-forms": "Styling Forms",
      "css-box-model": "The Box Model",
      "css-flexbox": "Flexbox",
      "css-typography": "Typography",
      "css-and-accessibility": "Accessibility",
      "attribute-selectors": "Attribute Selectors",
      "css-positioning": "Positioning",
      "responsive-design": "Responsive Design",
      "css-variables": "Variables",
      "css-grid": "Grid",
      "css-animations": "Animations",
      "review-css": "CSS Review",
      "lab-survey-form": "Build a Survey Form",
      "lab-page-of-playing-cards": "Build a Page of Playing Cards",
      "lab-book-inventory-app": "Build a Book Inventory App",
      "lab-technical-documentation-page": "Build a Technical Documentation Page",
      "lab-product-landing-page": "Build a Product Landing Page",
      "responsive-web-design-certification-exam": "Responsive Web Design Certification Exam"
    }
  },
  "a2-professional-spanish": {
    "title": "A2 Professional Spanish Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"]
  },
  "a2-professional-chinese": {
    "title": "A2 Professional Chinese Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"]
  },
  "a1-professional-chinese": {
    "title": "A1 Professional Chinese Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"]
  },
  "basic-html": {
    "title": "Basic HTML",
    "summary": [
      "Learn how to build simple webpages using HTML tags to add text, images, and links."
    ],
    "intro": ["Larger intro for the superblock page."]
  },
  "semantic-html": {
    "title": "Semantic HTML",
    "summary": [
      "Discover how to write cleaner, more meaningful HTML using semantic tags that improve structure, accessibility, and SEO."
    ],
    "intro": ["Larger intro for the superblock page."]
  },
  "dev-playground": {
    "title": "Dev Playground",
    "intro": ["Playground for creating and testing challenges"]
  },
  "full-stack-open": {
    "title": "Full Stack Open",
    "intro": ["A good intro is to be added here."],
    "chapters": {
      "part-0": "Fundamentals of Web Apps",
      "part-1": "Introduction to React",
      "part-2": "Communicating with Servers",
      "part-3": "Programming a Server with NodeJS and Express",
      "part-4": "Testing Express Servers, User Administration",
      "part-5": "Testing React Apps",
      "part-6": "Advanced State Management",
      "part-7": "React router, custom hooks, styling app with CSS and webpack",
      "part-8": "GraphQL",
      "part-9": "TypeScript",
      "part-10": "React Native",
      "part-11": "CI/CD",
      "part-12": "Containers",
      "part-13": "Using Relational Databases"
    },
    "modules": {
      "basic-html": "Basic HTML"
    },
    "module-intros": {
      "basic-html": {
        "title": "Basic HTML",
        "intro": [
          "Learn how to build simple webpages using HTML tags to add text, images, and links."
        ]
      }
    }
  },
  "daily-coding-challenge": {
    "title": "Daily Coding Challenge"
  },
  "misc-text": {
    "browse-other": "Browse our other free certifications",
    "courses": "コース一覧",
    "steps": "ステップ",
    "expand": "コースを展開",
    "collapse": "コースを閉じる",
    "legacy-header": "レガシーコース",
    "legacy-desc": "このコースは認定講座から除外されましたが、追加の学習用に引き続きご利用いただけます。",
    "legacy-go-back": "カリキュラムの最新版へ移動",
    "course-maintenance": "こちらのコースは現在メンテナンス中です。アクセスできない場合、こちらの記事の方法でローカル実行することも可能です:\n <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>",
    "course-disabling-soon": "The browser version of these courses will be temporarily disabled soon and your virtual machines will be deleted. Any progress in your virtual machines will be lost. If you have any files you want from them, you should save them to your computer. We apologize for any inconvenience. We hope to have an improved browser version of these courses available again in the next few weeks.",
    "course-disabled": "These courses are temporarily unavailable to run in the browser. We apologize for any inconvenience. You can learn how to run them locally at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. We hope to have an improved browser version available again soon.",
    "run-locally": "For now, we recommend running the courses locally on your computer. You can learn how at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "ただしローカルで実行する場合には、進捗状況は freeCodeCamp アカウントに反映されません。",
    "go-back-to-learn": "カリキュラムの安定版へ戻る。",
    "read-database-cert-article": "続行する前に、こちらのフォーラム投稿をお読みください。",
    "enable-cookies": "サードパーティーの Cookie が有効になっていることを確認してから開始してください。",
    "english-only": "このセクションのコースは、英語版でのみ利用可能です。現時点ではタイトルと紹介文のみが翻訳に対応しており、レッスン自体は翻訳されておりません。",
    "exam-english-only": "認定試験は現在、英語のみとなっています。その他の部分は翻訳版が提供されている可能性があります。"
  }
}
