{
  "name": "Web Design",
  "order": 8,
  "time": "5 minutes",
  "challenges": [
    {
      "id": "56f8369eabe05f3de07f990e",
      "title": "Web Design: Development vs Design",
      "description": [
        "I'm Anthony also known as dapperAuteur on Free Code Camp and GitHub.",
        "Thank you for joining me on this short hike about web design vs web development.",
        "The web design is the how. The web development is the what.",
        "Today we're going to discuss how they work together to build a beautiful experience for you and everyone else that visits the internet.",
        "The web designer, what they do will impact the 'How' the UI and UX looks and feels.",
        "The web developer, what they do will impact 'What' the UX and UI will do once you start to click on buttons.",
        "An example is the login process.",
        "A designer will decide where the login process will start on the page.",
        "A developer will decide what that process will entail. Are you logging in with your email address, username or social media account?",
        "Another example is building a car. A designer will choose what color the car is. Is it red, white, or blue? Cloth or leather seats? Tinted windows?",
        "A developer will decide if it's a V6 or V8 engine. Is it a gasoline, hybrid or all electric vehicle?",
        "Together, they work to build a beautiful experience for you and everyone else that visits the internet.",
        "Again, a web designer is the how and the web developer is the what."
      ],
      "challengeSeed": [
        "160534000"
      ],
      "tests": [
        [
          "The designer impacts the look and feel of the web site.",
          true
          ],
        [
          "The designer will decide what the login process will entail.",
          false,
          "Generally, planning that involves how information interacts will be the developer's responsiblity."
        ],
        [
          "Developers choose the colors of the website.",
          false,
          "Assuming the developers are working on a team with designers, the color choices would be up to the designers."
        ]
      ],
      "type": "hike",
      "challengeType": 6
  ]
}
