{
  "responsive-web-design": {
    "title": "Desafios do design responsivo para a web legado",
    "intro": [
      "Nessa certificação de Design responsivo para a web, você aprenderá as linguagens que os desenvolvedores usam para construir sites: HTML (Linguagem de Marcação de Hipertexto) para o conteúdo e CSS (Folha de Estilo em Cascata) para o design.",
      "Primeiro, você vai construir um aplicativo de fotos de gato para aprender o básico de HTML e CSS. Mais tarde, você aprenderá técnicas modernas como variáveis CSS construindo um pinguim, e melhores práticas de acessibilidade criando um formulário web.",
      "Finalmente, você vai aprender a fazer páginas web que respondem a diferentes tamanhos de telas construindo um card do Twitter com Flexbox, e um layout complexo de blog com o CSS Grid."
    ],
    "note": "Observação: algumas extensões de navegador, como bloqueadores de anúncios e extensões de modo escuro podem interferir nos testes. Se você tiver problemas, recomendamos desabilitar extensões que modifiquem o conteúdo ou o layout das páginas durante o curso.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "HTML e HTML5 básicos",
        "intro": [
          "HTML é uma linguagem de marcação que usa uma sintaxe ou notação especial para descrever a estrutura de uma página da Web para o navegador. Os elementos HTML geralmente têm tags de abertura e fechamento que os circundam e dão significado ao conteúdo. Elementos diferentes, por exemplo, podem descrever o texto como um título, um parágrafo ou item da lista.",
          "Neste curso, você vai construir um aplicativo de fotografia de gatos para aprender alguns dos elementos HTML mais comuns: os blocos de construção de qualquer página da web."
        ]
      },
      "basic-css": {
        "title": "CSS básico",
        "intro": [
          "O CSS, ou Folhas de Estilo em Cascata, diz ao navegador como exibir o texto e outros conteúdos que você escreve em HTML. Com o CSS, você pode controlar a cor, fonte, tamanho, espaçamento e muitos outros aspectos dos elementos HTML.",
          "Agora que você descreveu a estrutura do seu aplicativo de fotos de gatos, aplique um pouco de estilo com o CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Design visual aplicado",
        "intro": [
          "O design visual é uma combinação de tipografia, teoria de cores, gráficos, animação, layout da página e mais para ajudar a entregar sua mensagem única.",
          "Neste curso, você vai aprender como aplicar esses diferentes elementos do design visual em suas páginas da web."
        ]
      },
      "applied-accessibility": {
        "title": "Acessibilidade aplicada",
        "intro": [
          "No desenvolvimento web, a acessibilidade refere-se ao conteúdo da web e uma UI (interface do usuário) que pode ser compreendida, navegada e interagida por um público amplo. Isto inclui pessoas com deficiência visual, auditiva, de mobilidade ou cognitiva.",
          "Nesse curso, você aprenderá as melhores práticas para a construção de páginas da Web que sejam acessíveis a todos."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Princípios do design responsivo para a web",
        "intro": [
          "Existem muitos dispositivos que podem acessar a Internet, de todas as formas e tamanhos. O Design responsivo para a web é a prática de se projetar sites flexíveis, que podem responder a diferentes tamanhos de telas, orientações e resoluções.",
          "Neste curso, você vai aprender a usar CSS para fazer suas páginas ficarem bonitas, não importa em qual dispositivo elas estão sendo visualizadas."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "O Flexbox é um método de layout poderoso e com bastante suporte, que foi introduzido na versão mais recente do CSS, o CSS3. Com o Flexbox, é fácil centralizar os elementos na página e criar interfaces dinâmicas que diminuem e aumentam de tamanho automaticamente.",
          "Nesse curso, você aprenderá os fundamentos de flexbox e layouts dinâmicos construindo um card do Twitter."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "O CSS Grid é um padrão mais recente, que torna fácil construir layouts responsivos complexos. Ele funciona transformando um elemento HTML em uma grade e permite que você coloque elementos filhos em qualquer lugar dentro dele.",
          "Nesse curso, você aprenderá os fundamentos do CSS Grid construindo diferentes layouts complexos, incluindo um blog."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Design responsivo para a web",
    "intro": [
      "Nessa certificação de Design responsivo para a web, você aprenderá as linguagens que os desenvolvedores usam para construir sites: HTML (Linguagem de Marcação de Hipertexto) para o conteúdo e CSS (Folha de Estilo em Cascata) para o design.",
      "Primeiro, você vai construir um aplicativo de fotos de gato para aprender o básico de HTML e CSS. Mais tarde, você aprenderá técnicas modernas como variáveis CSS construindo um pinguim, e melhores práticas de acessibilidade criando um site de questionário.",
      "Finalmente, você vai aprender a fazer páginas web que respondem a diferentes tamanhos de telas construindo uma galeria de fotos com o Flexbox, e um layout de artigo de revista com o CSS Grid."
    ],
    "note": "Observação: algumas extensões de navegador, como bloqueadores de anúncios e extensões de modo escuro podem interferir nos testes. Se você tiver problemas, recomendamos desabilitar extensões que modifiquem o conteúdo ou o layout das páginas durante o curso.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Página de tributo",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará uma página de tributo para alguém de sua escolha, fictício ou real."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Página de portfólio pessoal",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará sua própria página pessoal de portfólio."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Página inicial para um produto",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará uma página inicial de produto para comercializar um produto de sua escolha."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Formulário de pesquisa",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará um formulário de pesquisa para coletar dados de seus usuários."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Página de documentação técnica",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará uma página de documentação técnica para servir como instrução ou referência para um tópico."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Aprenda HTML criando um aplicativo de fotos de gatos",
        "intro": [
          "Tags HTML dão a uma página web sua estrutura. Você pode usar tags HTML para adicionar fotos, botões e outros elementos à sua página da web.",
          "Neste curso, você vai aprender as tags HTML mais comuns criando o seu próprio aplicativo de fotos de gatos."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Aprenda CSS básico criando um menu de restaurante",
        "intro": [
          "O CSS informa ao navegador como exibir sua página da web. Você pode usar o CSS para definir cor, fonte, tamanho e outros aspectos dos elementos HTML.",
          "Neste curso, você aprenderá CSS criando uma página de menu para uma página da web para um café."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Aprenda o box model do CSS criando uma pintura de Rothko",
        "intro": [
          "Cada elemento HTML é uma caixa própria, com seu próprio espaçamento e borda. A isso chamamos de Modelo de Caixa, ou Box Model.",
          "Nesse curso, você usará o CSS e o Box Model para criar suas próprias obras de arte retangulares ao estilo de Rothko."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Aprenda variáveis em CSS criando o horizonte em uma cidade",
        "intro": [
          "As variáveis CSS ajudam você a organizar seus estilos e a reutilizá-los.",
          "Neste curso, você vai construir um céu na cidade. Você vai aprender como configurar variáveis CSS para que você possa reutilizá-las quando quiser."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Aprenda formulários em HTML criando um formulário de registro",
        "intro": [
          "Você pode usar formulários HTML para coletar informações de pessoas que visitam sua página da web.",
          "Neste curso, você aprenderá formulários HTML construindo uma página de cadastro. Você aprenderá como controlar quais tipos de dados as pessoas podem digitar em seu formulário e algumas novas ferramentas CSS para estilizar sua página."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Aprenda acessibilidade criando um questionário",
        "intro": [
          "A acessibilidade facilita a utilização da sua página da web para todos – mesmo para as pessoas com deficiência.",
          "Neste curso, você vai criar um questionário na página. Você aprenderá ferramentas de acessibilidade, como atalhos de teclado, atributos ARIA e melhores práticas."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Aprenda CSS intermediário criando uma pintura de Picasso",
        "intro": [
          "Neste curso, você aprenderá a utilizar algumas técnicas de CSS intermediárias programando sua própria página de uma pintura de Picasso. Você vai aprender sobre ícones SVG, posicionamento em CSS e revisar outras habilidades CSS que você aprendeu."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Aprenda design responsivo para a web criando um piano",
        "intro": [
          "O design responsivo diz à sua página da web como ela deve ficar em telas de tamanho diferente.",
          "Neste curso, você vai usar o Design Responsivo e o CSS para codificar um piano. Você também vai aprender mais sobre consultas de mídia e pseudosseletores."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Aprenda CSS Flexbox criando uma galeria de fotos",
        "intro": [
          "O Flexbox ajuda você a projetar sua página da web para que fique bem em qualquer tamanho de tela.",
          "Neste curso, você vai usar o Flexbox para construir uma página da galeria de fotos responsiva."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Aprenda sobre CSS Grid criando uma revista",
        "intro": [
          "O CSS Grid dá a você o controle sobre as linhas e colunas do seu design de página da web.",
          "Neste curso, você vai construir um artigo de revista. Você aprenderá a usar o CSS Grid, incluindo conceitos como linhas e colunas de grade."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Aprenda tipografia criando um rótulo nutricional",
        "intro": [
          "A tipografia é a arte de estilizar seu texto para ser facilmente legível e adequado ao seu propósito.",
          "Neste curso, você usará a tipografia para construir uma página da web de rótulo nutricional. Você aprenderá como estilizar texto, ajustar a altura da linha e posicionar seu texto usando CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Aprenda transformações em CSS criando um pinguim",
        "intro": [
          "Você pode transformar elementos HTML para criar projetos atraentes que chamam a atenção do seu leitor. Você pode usar transformações para girar elementos, dimensionar e muito mais.",
          "Neste curso, você criará um pinguim. Você usará transformações em CSS para posicionar e redimensionar as partes do seu pinguim, criar um plano de fundo e animar o seu trabalho."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Aprenda animação em CSS construindo uma roda gigante",
        "intro": [
          "Você pode usar a animação em CSS para chamar a atenção para seções específicas da sua página e torná-la mais envolvente.",
          "Neste curso, você vai construir uma roda-gigante. Você vai aprender como usar o CSS para animar elementos, transformá-los e ajustar sua velocidade."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Aprenda mais sobre pseudosseletores de CSS criando uma folha de saldo",
        "intro": [
          "Você pode usar pseudosseletores em CSS para alterar elementos HTML específicos.",
          "Neste curso, você criará uma folha de balanço usando pseudosseletores. Você aprenderá como alterar o estilo de um elemento ao passar o mouse sobre ele e acionar outros eventos em sua página da web."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Aprenda cores em CSS criando um conjunto de marcadores coloridos",
        "intro": [
          "Selecionar as cores corretas para sua página da web pode melhorar muito o apelo estético para os seus leitores.",
          "Neste curso, você criará um conjunto de marcadores coloridos. Você aprenderá maneiras diferentes de definir valores de cores e como combinar cores uma com a outra."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Aprenda CSS intermediário criando a pintura de um gato",
        "intro": [
          "Dominar o posicionamento em CSS é essencial para criar layouts visualmente atraentes e responsivos para a web",
          "Neste curso, você criará a pintura de um gato. Você aprenderá a trabalhar com o posicionamento absoluto, com a propriedade z-index e com a propriedade transform."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Algoritmos e estrutura de dados em JavaScript legado",
    "intro": [
      "Enquanto o HTML e o CSS controlam o conteúdo e o estilo de uma página, o JavaScript é usado para torná-lo interativo. Na certificação de Algoritmos e Estruturas de Dados em JavaScript, você aprenderá os fundamentos do JavaScript, incluindo variáveis, arrays, objetos, laços e funções.",
      "Assim que souber os fundamentos abaixo, você aplicará esse conhecimento, criando algoritmos para manipular strings, fatorar números e até mesmo calcular a órbita da Estação Espacial Internacional.",
      "Durante o processo, você também aprenderá dois estilos ou paradigmas de programação importantes: a Programação Orientada a Objetos (POO) e a Programação Funcional (PF)."
    ],
    "note": "Observação: algumas extensões de navegador, como bloqueadores de anúncios e bloqueadores de scripts, podem interferir nos testes. Se você tiver problemas, recomendamos desabilitar extensões que modifiquem ou bloqueiem o conteúdo das páginas durante o curso.",
    "blocks": {
      "basic-javascript": {
        "title": "JavaScript básico",
        "intro": [
          "O JavaScript é uma linguagem de script que você pode usar para tornar as páginas da web interativas. É uma das principais tecnologias da web, juntamente com o HTML e o CSS e tem o suporte de todos os navegadores modernos.",
          "Neste curso, você aprenderá conceitos básicos de programação em JavaScript. Você vai começar com estruturas básicas de dados, como números e strings. Então, você aprenderá a trabalhar com arrays, objetos, funções, laços, instruções if/else e muito mais."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, ou ES, é uma versão padronizada do JavaScript. Como todos os principais navegadores seguem essa especificação, os termos ECMAScript e JavaScript são intercambiáveis.",
          "A maior parte do JavaScript que você aprendeu até este momento estava na ES5 (ECMAScript 5), que foi finalizada em 2009. Mesmo que você ainda possa escrever programas em ES5, saiba que o JavaScript está constantemente em evolução e, por isso, novas funcionalidades são lançadas todos os anos.",
          "O ES6, lançado em 2015, adicionou muitos recursos novos e poderosos à linguagem. Neste curso, você aprenderá quais são eles, incluindo arrow functions, desestruturação, classes, promises e módulos."
        ]
      },
      "regular-expressions": {
        "title": "Expressões regulares",
        "intro": [
          "Expressões regulares, muitas vezes abreviadas como \"regex\" ou \"regexp\", são padrões que ajudam programadores a encontrar correspondências, pesquisar e substituir texto. Expressões regulares são muito poderosas, mas podem ser difíceis de ler porque usam caracteres especiais para fazer correspondências mais complexas e flexíveis.",
          "Neste curso, você aprenderá a usar caracteres especiais, grupos de captura, buscas positivas e negativas e outras técnicas para encontrar correspondências com o texto desejado."
        ]
      },
      "debugging": {
        "title": "Depuração",
        "intro": [
          "A depuração é o processo de revisão de código, procurando qualquer problema e corrigindo-o.",
          "Os problemas no código geralmente chegam em três formas: erros de sintaxe, que impedem que o programa seja executado, erros de tempo de execução, onde o código tem um comportamento inesperado, ou erros lógicos, onde o código não faz o que você pretendia.",
          "Neste curso, você aprenderá a usar o console do JavaScript para depurar programas e prevenir erros comuns antes de que aconteçam."
        ]
      },
      "basic-data-structures": {
        "title": "Estruturas de dados básicas",
        "intro": [
          "Os dados podem ser guardados e acessados de muitas formas. Você já conhece algumas estruturas de dados comuns em JavaScript: os arrays e os objetos.",
          "Neste curso de Estruturas de Dados Básicas, você vai aprender mais sobre as diferenças entre arrays e objetos, e qual deles usar em diferentes situações. Também aprenderá a usar métodos úteis do JS, como <code>splice()</code> e <code>Object.keys()</code>, para acessar e manipular dados."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Programação de algoritmos básicos",
        "intro": [
          "Um algoritmo é uma série de instruções passo a passo, que descrevem como fazer alguma coisa.",
          "Para escrever um algoritmo eficiente, é importante saber dividir o problema em partes menores e pensar atentamente sobre maneiras de resolver cada uma dessas partes com código.",
          "Nesse curso, você aprenderá os fundamentos do raciocínio algorítmico escrevendo algoritmos que fazem de tudo, desde a conversão de temperaturas ao tratamento de arrays bidimensionais complexos."
        ]
      },
      "object-oriented-programming": {
        "title": "Programação Orientada a Objetos",
        "intro": [
          "A POO, ou Programação Orientada a Objetos, é uma das abordagens principais do processo de desenvolvimento de software. Na POO, os objetos e as classes são usados para organizar o código, descrever coisas e o que elas podem fazer.",
          "Neste curso, você aprenderá os princípios básicos de POO em JavaScript, incluindo a palavra-chave <code>this</code>, cadeias de protótipos, construtores e herança."
        ]
      },
      "functional-programming": {
        "title": "Programação Funcional",
        "intro": [
          "Programação funcional é outra abordagem popular em desenvolvimento de software. Na programação funcional, o código é organizado em funções menores e básicas, que podem ser combinadas para criar programas complexos.",
          "Neste curso, você aprenderá os conceitos principais da Programação Funcional, incluindo funções puras, como evitar mutações e como escrever código mais limpo com métodos como <code>.map()</code> e <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Programação de algoritmos intermediários",
        "intro": [
          "Agora que você conhece as noções básicas de raciocínio algorítmico, juntamente com POO e Programação Funcional, teste suas habilidades com os desafios de Programação de Algoritmos Intermediários."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "Projetos de algoritmos e estruturas de dados em JavaScript",
        "intro": [
          "É hora de colocar suas novas habilidades em JavaScript para funcionar. Estes projetos são similares aos desafios de programação de algoritmos que você fez antes — só que muito mais difíceis.",
          "Conclua estes 5 projetos de JavaScript para ganhar a certificação de Algoritmos e Estruturas de Dados do JavaScript."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "Algoritmos e estruturas de dados em JavaScript (Beta)",
    "intro": [
      "Desenvolvedores usam HTML e CSS para controlar os componentes e estilizar a página. Eles também usam o JavaScript para tornar essa página interativa.",
      "Neste certificado de Algoritmos e estruturas de dados em JavaScript, você aprenderá os fundamentos de JavaScript como variáveis, arrays, objetos, laços, funções, o DOM e mais.",
      "Você também aprenderá sobre Programação Orientada a Objetos (POO), Programação Funcional, pensamento algorítmico, como trabalhar com armazenamento local e como buscar dados usando uma API."
    ],
    "note": "Observação: algumas extensões de navegadores, como bloqueadores de anúncios e scripts, podem interferir com os testes. Se você tiver problemas, recomendamos desabilitar as funções de bloqueio de conteúdos de páginas durante o curso.",
    "blocks": {
      "build-a-pokemon-search-app-project": {
        "title": "Projeto de criação de uma aplicação de busca de Pokémons",
        "intro": [
          "Este é um dos projetos necessários para obter a certificação.",
          "Para esse projeto, você criará uma aplicação para a busca de Pokémons."
        ]
      },
      "build-a-cash-register-project": {
        "title": "Projeto de criação de uma caixa registradora",
        "intro": [
          "Este é um dos projetos necessários para obter a certificação.",
          "Para esse projeto, você criará uma aplicação de caixa registradora para a web."
        ]
      },
      "build-a-palindrome-checker-project": {
        "title": "Projeto de criação de verificador de palíndromo",
        "intro": [
          "Este é um dos projetos necessários para obter a certificação.",
          "Para esse projeto, você criará uma aplicação que verifica se uma determinada palavra é um palíndromo."
        ]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Projeto de criação de um conversor de números romanos",
        "intro": [
          "Este é um dos projetos necessários para obter a certificação.",
          "Para esse projeto, você criará uma aplicação que converte números inteiros em números romanos."
        ]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Projeto de criação de um validador de número telefônico",
        "intro": [
          "Este é um dos projetos necessários para obter a certificação.",
          "Para esse projeto, você criará uma aplicação que verifica se o número de telefone é um número válido de telefone dos Estados Unidos."
        ]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Aprenda JavaScript básico criando um jogo de RPG",
        "intro": [
          "O JavaScript é uma poderosa linguagem de script que você pode usar para fazer sites interativos. É uma das tecnologias essenciais da web, junto do HTML e do CSS. Todos os navegadores modernos suportam JavaScript.",
          "Nesse projeto prático, você aprenderá conceitos fundamentais de programação em JavaScript programando o próprio RPG. Você aprenderá a trabalhar com arrays, strings, objetos, funções, laços, instruções <code>if/else</code> e mais."
        ]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Aprenda validação de formulário construindo um contador de calorias",
        "intro": [
          "Às vezes quando você está programando uma aplicação web, você irá precisar conseguir aceitar uma entrada de um usuário. Neste projeto de contador de calorias, você irá aprender a validar a entrada do usuário, executar cálculos baseados naquela entrada, e atualizar dinamicamente a sua interface para exibir os resultados.",
          "Neste projeto prático, você aprenderá expressões regulares básicas, template literals, o método <code>addEventListener()</code>, e mais."
        ]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Aprenda programação funcional criando uma planilha",
        "intro": [
          "A programação funcional é uma abordagem popular para desenvolvimento de software. Na programação funcional, os desenvolvedores organizam o código em funções menores, então combinam essas funções para criar programas complexos.",
          "Nesse projeto de aplicação de planilha, você aprenderá sobre análise e avaliação de expressões matemáticas, implementando funções de planilha, manipulando referências de células e criando interfaces da web interativas. Você aprenderá como atualizar dinamicamente a página baseada na entrada do usuário.",
          "Este projeto abrangerá conceitos como os métodos <code>map()</code>, <code>find()</code> e <code>includes()</code> e a função <code>parseInt()</code>."
        ]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Aprenda métodos modernos de JavaScript criando cards de equipes de futebol",
        "intro": [
          "Um aspecto comum da criação de aplicações web é trabalhar com o processamento de conjuntos de dados e, em seguida, enviar informações para a tela. Nesse projeto de cartões da equipe de futebol, você aprenderá como trabalhar com a manipulação do DOM, desestruturação de objetos, manipulação de eventos, e filtragem de dados.",
          "Este projeto abrangerá conceitos como parâmetros padrão, <code>Object.freeze()</code> e reforçará seu conhecimento sobre a instrução <code>switch</code> e sobre o método <code>map()</code>."
        ]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Aprenda métodos de arrays avançados criando uma calculadora de estatística",
        "intro": [
          "À medida que você expande suas habilidades em JavaScript, vai querer se sentir confortável com métodos de manipulação de arrays, como <code>map()</code>, <code>reduce()</code> e <code>filter()</code>.",
          "Nesse projeto de calculadora de estatísticas, você ganhará experiência com a manipulação de entradas do usuário, manipulação do DOM e métodos de encadeamento. Você praticará realizando cálculos estatísticos como média, mediana, moda, variância e desvio padrão."
        ]
      },
      "learn-basic-oop-by-building-a-shopping-cart": {
        "title": "Aprenda POO básica criando um carrinho de compras",
        "intro": [
          "POO, ou Programação Orientada a Objetos, é uma das principais abordagens do processo de desenvolvimento de software. Na POO, os desenvolvedores usam objetos e classes para estruturar seus códigos.",
          "Nesse projeto do carrinho de compras, você aprenderá como definir e usar classes. Você criará instâncias de classes e implementará métodos para a manipulação de dados.",
          "Esse projeto abrangerá conceitos como operador ternário, o operador spread, a palavra-chave <code>this</code> e muito mais."
        ]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Aprenda Fetch e Promises criando uma página de autores do fCC",
        "intro": [
          "Um aspecto comum do desenvolvimento web é aprender a buscar dados de uma API externa e, em seguida, trabalhar com JavaScript assíncrono.",
          "Esse projeto da página de autores do freeCodeCamp mostrará a você como usar o método fetch e a atualizar dinamicamente o DOM para exibir os dados obtidos.",
          "Esse projeto também ensinará você a paginar os dados para poder carregar os resultados em lotes."
        ]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Aprenda expressões regulares criando um filtro de spam",
        "intro": [
          "Expressões regulares, frequentemente abreviadas como \"regex\" ou \"regexp\", são padrões que ajudam os programadores a corresponder, buscar e substituir texto. As expressões regulares são poderosas, mas podem ser difíceis de entender porque usam muitos caracteres especiais.",
          "Neste projeto de filtro de spam, você aprenderá a usar caracteres especiais, grupos de captura, buscas positivas e negativas, bem como outras técnicas para encontrar correspondências com o texto desejado."
        ]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Aprenda o raciocínio básico de algoritmos criando uma ordenação numérica",
        "intro": [
          "Na ciência da computação, existem algoritmos de classificação fundamentais que todos os desenvolvedores devem aprender. Neste projeto de criação de um ordenador de números, você aprenderá a implementar e visualizar diferentes algoritmos de classificação, como o Bubble Sort, o Selection Sort e o Insertion Sort usando JavaScript.",
          "Este projeto ajudará você a entender os conceitos fundamentais por trás desses algoritmos, e como você pode aplicá-los para classificar dados numéricos em aplicações para a web."
        ]
      },
      "review-algorithmic-thinking-by-building-a-dice-game": {
        "title": "Revise o raciocínio algorítmico criando um jogo de dados",
        "intro": [
          "Raciocínio algorítmico implica a capacidade de dividir problemas complexos em uma sequência de instruções passo a passo e bem definidas.",
          "Neste projeto de jogo de dados, você aprenderá como gerenciar o estado do jogo, implementar a lógica do jogo para rolar os dados, manter a pontuação e aplicar as regras para várias combinações.",
          "O projeto aborda conceitos como manipulação de eventos, manipulação de arrays, lógica condicional e atualização dinâmica da interface de usuário baseada no estado do jogo."
        ]
      },
      "learn-intermediate-oop-by-building-a-platformer-game": {
        "title": "Aprenda POO intermediária criando um jogo de plataforma",
        "intro": [
          "Programar um jogo é uma ótima maneira de entender os princípios fundamentais da programação e, ao mesmo tempo, criar uma experiência interativa de jogos.",
          "Neste projeto de jogo de plataforma, você continuará a aprender sobre classes, objetos, herança e encapsulamento. Você também aprenderá a projetar e organizar eficientemente os elementos de jogo e saberá mais sobre a resolução de problemas e a reutilização de código."
        ]
      },
      "learn-localstorage-by-building-a-todo-app": {
        "title": "Aprenda armazenamento local criando uma aplicação de lista de tarefas",
        "intro": [
          "O armazenamento local é um recurso dos navegadores da web que permite que aplicações para a web armazenem pares de chave-valor de maneira persistente no navegador do usuário. Isso permite que aplicações para a web salvem dados durante uma sessão e os recuperem em uma sessão posterior.",
          "Nesta aplicação de lista de tarefas, você aprenderá a lidar com entradas de formulário, a gerenciar o armazenamento local, a executar operações de CRUD (Criar, Ler, Atualizar, Apagar) em tarefas, a implementar ouvintes de eventos e a alternar elementos da interface do usuário."
        ]
      },
      "learn-the-date-object-by-building-a-date-formatter": {
        "title": "Aprenda sobre o objeto Date criando um formatador de data",
        "intro": [
          "Trabalhar com datas em JavaScript pode ser desafiador. Você tem que navegar por vários métodos, formatos e fusos horários. Neste projeto, você aprenderá a trabalhar com o objeto Date no JavaScript, incluindo os seus métodos e propriedades. Você também aprenderá a formatar datas corretamente.",
          "Este projeto abrangerá conceitos como os métodos: <code>getDate()</code>, <code>getMonth()</code> e <code>getFullYear()</code>."
        ]
      },
      "learn-asynchronous-programming-by-building-an-fcc-forum-leaderboard": {
        "title": "Aprenda programação assíncrona criando uma tabela de classificação para o fórum do fCC",
        "intro": [
          "JavaScript é uma linguagem de programação assíncrona. Este projeto ajudará você a entender melhor os conceitos assíncronos. Você programará a sua própria tabela de classificação do fórum do freeCodeCamp.",
          "Este projeto cobrirá a Fetch API, promises, async/await e a declaração try... catch."
        ]
      },
      "learn-basic-string-and-array-methods-by-building-a-music-player": {
        "title": "Aprenda métodos básicos de strings e arrays criando um reprodutor de músicas",
        "intro": [
          "Agora, vamos aprender alguns métodos essenciais de strings e arrays como <code>find()</code>, <code>forEach()</code>, <code>map()</code> e <code>join()</code>. Esses métodos são cruciais para o desenvolvimento de aplicações para a web dinâmicas.",
          "Neste projeto, você programará um reprodutor de MP3 básico usando HTML, CSS e JavaScript. O projeto abrange conceitos fundamentais, como o processamento de reprodução de áudio, gerenciamento de uma lista de reprodução, implementação das funcionalidades de reproduzir, parar, passar para a próxima música, voltar para a música anterior e reproduzir uma música aleatória. Você aprenderá ainda a atualizar dinamicamente a interface do usuário com base na música atual."
        ]
      },
      "learn-recursion-by-building-a-decimal-to-binary-converter": {
        "title": "Aprenda recursão criando um conversor de decimal para binário",
        "intro": [
          "Recursão é um conceito de programação onde uma função chama a si mesma. Isso pode reduzir um problema complexo em subprogramas mais simples, até que eles se tornem fáceis de resolver.",
          "Neste projeto, você criará um conversor de decimal para binário usando JavaScript. Você aprenderá os conceitos fundamentais de recursão, explorará a pilha de chamadas e criará uma representação visual do processo de recursão por meio de uma animação."
        ]
      },
      "learn-introductory-javascript-by-building-a-pyramid-generator": {
        "title": "Aprenda JavaScript introdutório criando um gerador de pirâmide",
        "intro": [
          "O JavaScript é uma linguagem de script poderosa que você pode usar para fazer sites interativos. É uma das tecnologias essenciais da web, junto do HTML e do CSS. Todos os navegadores modernos suportam JavaScript.",
          "Nesse projeto prático, você aprenderá conceitos fundamentais de programação em JavaScript programando um gerador de pirâmide. Você aprenderá a trabalhar com arrays, strings, objetos, funções, laços, instruções <code>if/else</code> e mais."
        ]
      },
      "review-js-fundamentals-by-building-a-gradebook-app": {
        "title": "Revise os fundamentos de JavaScript criando uma aplicação de quadro de notas",
        "intro": [
          "Neste miniprojeto, você poderá revisar alguns fundamentos de JavaScript, como funções, variáveis, condicionais e muito mais, ao criar uma aplicação de quadro de notas.",
          "Isso dará a você a oportunidade de resolver pequenos problemas e de compreender entender os fundamentos."
        ]
      },
      "learn-basic-debugging-by-building-a-random-background-color-changer": {
        "title": "Aprenda depuração básica criando um alterador aleatório de cor de fundo",
        "intro": [
          "A depuração é o processo de revisão de código, procurando qualquer problema e corrigindo-o.",
          "Neste projeto, você ajudará o CamperBot a criar um alterador aleatório de cores e vai ajudá-lo a encontrar e corrigir erros."
        ]
      },
      "review-dom-manipulation-by-building-a-rock-paper-scissors-game": {
        "title": "Revise a manipulação do DOM criando um jogo de pedra, papel e tesoura",
        "intro": [
          "Nos projetos anteriores, você aprendeu a trabalhar com a manipulação básica do DOM. Agora, é hora de rever o que você aprendeu criando um jogo de pedra, papel e tesoura.",
          "Neste miniprojeto, você vai rever condicionais, funções, <code>getElementById</code> e mais. Esse projeto dará a você a oportunidade de resolver pequenos problemas e de compreender melhor os fundamentos."
        ]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Bibliotecas de desenvolvimento em front-end",
    "intro": [
      "Agora que você está familiarizado com HTML, CSS e JavaScript, melhore suas habilidades aprendendo algumas das bibliotecas front-end mais populares do setor.",
      "Na certificação de bibliotecas de desenvolvimento em front-end, você aprenderá a estilizar seu site rapidamente com Bootstrap. Você também aprenderá a adicionar a lógica aos seus estilos CSS e a ampliá-los com Sass.",
      "Mais tarde, você construirá um carrinho de compras e outras aplicações para aprender a criar Aplicativos de Página Única (Single Page Applications - SPA) poderosos com React e Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "O Bootstrap é um framework de front-end usado para projetar páginas da web e aplicativos responsivos. Ele adota uma abordagem mobile-first para o desenvolvimento na web e inclui estilos e classes CSS pré-construídos, além de algumas funcionalidades JavaScript.",
          "Neste curso, você aprenderá a criar sites responsivos com Bootstrap, e usará as classes que ele tem para estilizar botões, imagens, formulários, navegação e outros elementos comuns."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "O jQuery é uma das bibliotecas JavaScript mais usadas no mundo.",
          "Em 2006, quando foi lançado, todos os principais navegadores lidavam com JavaScript de forma ligeiramente diferente. O jQuery simplificou o processo de escrita de JavaScript do lado do cliente, além de assegurar que seu código funcionasse da mesma forma em todos os navegadores.",
          "Neste curso, você aprenderá a usar jQuery para selecionar, remover, clonar e modificar diferentes elementos na página."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, ou \"Stylesheets Sintaticamente Incríveis\", do inglês \"Syntactically Awesome StyleSheets\", é uma extensão da linguagem CSS. A extensão adiciona recursos que não estão disponíveis no CSS básico, facilitando a simplificação e manutenção dos arquivos de estilo de seus projetos.",
          "Neste curso sobre Sass, você aprenderá a armazenar dados em variáveis, aninhar CSS, criar estilos reutilizáveis com mixins, adicionar lógica e loops aos seus estilos, e mais."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React é uma biblioteca JavaScript popular para a criação de interfaces de usuário reutilizáveis e orientadas por componentes para páginas ou aplicações.",
          "O React combina HTML com funcionalidade JavaScript em sua própria linguagem markup, chamada JSX. Ele também facilita a gestão do fluxo de dados por toda a aplicação.",
          "Neste curso, você vai aprender a criar diferentes componentes do React, a gerenciar dados na forma de propriedades de estado (\"state props\"), a utilizar diferentes métodos de ciclo de vida, como o <code>componentDidMount</code>, e muito mais."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "À medida que as aplicações crescem em tamanho e escopo, o gerenciamento de dados compartilhados torna-se muito mais difícil. O Redux é definido como um \"contêiner de estado previsível para aplicações JavaScript\", o que ajuda a garantir que suas aplicações funcionem de forma previsível e que sejam mais fáceis de testar.",
          "Embora você possa usar o Redux com qualquer biblioteca de visualizações, apresentamos o Redux aqui antes de combiná-lo com React no próximo conjunto de cursos.",
          "Nesse curso, você vai aprender os fundamentos das stores, actions, reducers e middlewares do Redux para gerenciar dados por toda sua aplicação."
        ]
      },
      "react-and-redux": {
        "title": "React e Redux",
        "intro": [
          "React e Redux são muitas vezes mencionados juntos, e por uma boa razão. O desenvolvedor que criou o Redux era um desenvolvedor do React que queria facilitar o compartilhamento de dados entre diferentes componentes.",
          "Agora que você sabe como gerenciar o fluxo de dados compartilhados com Redux, é hora de combinar esse conhecimento com React. Nos cursos do React e Redux, você vai construir um componente React e aprender como gerenciar estado localmente, ao nível do componente e por toda aplicação com Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Projetos de desenvolvimento com bibliotecas de front-end",
        "intro": [
          "É hora de testar suas habilidades nas bibliotecas de desenvolvimento de front-end. Use Bootstrap, jQuery, Sass, React e Redux para criar 5 projetos que testarão tudo o que você aprendeu até agora.",
          "Complete todos os 5 projetos e você ganhará a certificação em Bibliotecas de Desenvolvimento Front-End."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Visualização de dados",
    "intro": [
      "Os dados estão ao nosso redor, mas isso não quer dizer muita coisa se eles não tiverem forma ou contexto.",
      "Na certificação de visualização de dados, você criará tabelas, gráficos e mapas para apresentar diferentes tipos de dados com a biblioteca D3.js.",
      "Você também aprenderá sobre JSON (JavaScript Object Notation) e sobre como trabalhar com dados on-line usando uma API (Application Programming Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Visualização de dados com D3",
        "intro": [
          "D3, ou D3.js, significa Documentos Orientados aos Dados. É uma biblioteca JavaScript para criar visualizações de dados dinâmicas e interativas no navegador.",
          "O D3 foi criado para funcionar com padrões web comuns, como o HTML, o CSS e os Scalable Vector Graphics (SVG).",
          "O D3 suporta vários tipos diferentes de formatos de dados de entrada. Usando os poderosos métodos integrados do D3, você consegue transformar esses dados em diferentes gráficos, diagramas e mapas.",
          "Nos cursos de visualização de dados com o D3, você aprenderá a trabalhar com dados para criar diferentes diagramas, gráficos, elementos \"hover\" e outros componentes para gerar visualizações de dados dinâmicas e atrativas."
        ]
      },
      "json-apis-and-ajax": {
        "title": "APIs JSON e AJAX",
        "intro": [
          "Da mesma forma como as IUs ajudam as pessoas a usarem os programas, as APIs (Interfaces de Programação de Aplicação) ajudam programas a interagir com outros programas. As APIs são ferramentas que os computadores usam para se comunicarem uns com os outros, em parte, para enviar e receber dados.",
          "Programadores frequentemente usam AJAX (JavaScript e XML assíncronos) quando estão trabalhando com APIs. AJAX refere-se a um conjunto de tecnologias que faz solicitações assíncronas para um servidor transferir dados e, em seguida, carregar os dados que forem retornados para a página. Os dados transferidos entre o navegador e o servidor frequentemente estão em um formato chamado JSON (JavaScript Object Notation).",
          "Este curso ensinará o básico sobre como trabalhar com APIs e diferentes tecnologias AJAX no browser."
        ]
      },
      "data-visualization-projects": {
        "title": "Projetos de visualização de dados",
        "intro": [
          "Agora que você aprendeu a trabalhar com D3, APIs e tecnologias AJAX, teste suas habilidades com esses 5 projetos de Visualização de Dados.",
          "Nestes projetos, você precisará buscar dados e analisar um conjunto de dados e, em seguida, usar D3 para criar diferentes visualizações de dados. Conclua todos para receber a sua certificação de Visualização de Dados."
        ]
      },
      "d3-dashboard": {
        "title": "Painel do D3",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Bancos de dados relacionais",
    "intro": [
      "Para estes cursos, você usará ferramentas e software reais de desenvolvedor, incluindo o VS Code, PostgreSQL e a linha de comando do Linux/Unix para completar tutoriais interativos e criar projetos.",
      "Estes cursos começam com comandos básicos do Bash. Usando o terminal, você aprenderá tudo, de navegar e manipular um sistema de arquivos e fazer scripts no Bash, até usos mais avançados.",
      "Depois, você aprenderá a criar e trabalhar com bancos de dados relacionados usando o PostgreSQL, um sistema de gerenciamento de banco de dados, e o SQL, a linguagem destes bancos de dados.",
      "Por fim, você aprenderá o Git, o sistema de controle de versão, uma ferramenta essencial de cada desenvolvedor."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "Banco de dados de corpos celestiais",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você vai construir um banco de dados de corpos celestiais usando PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Jogo de adivinhação de números",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você usará scripts de Bash, PostgreSQL e o Git para criar um jogo de sugestões de números que será executado no terminal e que gravará as informações de usuários."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "Banco de dados da tabela periódica",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará um script no Bash para obter informações sobre elementos químicos de um banco de dados de tabela periódica."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Agendador de compromissos do salão de beleza",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará um programa de bash interativo que utiliza PostgreSQL para acompanhar os clientes e horários marcados em seu salão."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "Banco de dados da Copa do Mundo",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará um script do Bash que insere informações de jogos da Copa do Mundo no PostgreSQL. Depois, você vai consultar o banco de dados para obter estatísticas úteis."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Aprenda Bash avançado construindo um tradutor de Kitty Ipsum",
        "intro": [
          "Há mais comandos do Bash do que você imagina.",
          "Neste curso de 140 aulas, você aprenderá alguns comandos mais complexos e detalhes de como funcionam os comandos."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Aprenda Bash e SQL criando uma loja de aluguel de bicicletas",
        "intro": [
          "Neste curso de 210 aulas, você vai construir um programa de Bash interativo que armazena informações de aluguel para sua loja de aluguel de bicicletas utilizando PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Aprenda Bash criando um boilerplate",
        "intro": [
          "O terminal permite que você envie comandos de texto para o seu computador que podem manipular o sistema de arquivos, executar programas, automatizar tarefas e muito mais.",
          "Neste curso de 170 aulas, você aprenderá comandos do terminal criando o boilerplate de um site usando apenas a linha de comando."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Aprenda Bash Scripting desenvolvendo cinco programas",
        "intro": [
          "Os scripts do Bash combinam comandos de terminal e lógica em programas que podem executar ou automatizar tarefas e muito mais.",
          "Neste curso de 220 aulas, você aprenderá mais comandos do terminal e como usá-los dentro de scripts do Bash, criando cinco programas pequenos."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Aprenda Git criando um objeto de referência SQL",
        "intro": [
          "O Git é um sistema de controle de versão que mantém o controle de todas as alterações feitas em sua base de código.",
          "Neste curso de 240 aulas, você aprenderá como o Git mantém o controle do seu código, criando um objeto que contém comandos SQL comumente usados."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Aprenda Nano criando um castelo",
        "intro": [
          "O Nano é um programa que permite editar arquivos diretamente no terminal.",
          "Neste curso de 40 aulas, você aprenderá a editar arquivos no terminal com o nano e construirá um castelo."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Aprenda bancos de dados relacionais criando um banco de dados sobre Mario",
        "intro": [
          "Um banco de dados relacional organiza dados em tabelas que são ligadas entre si através de relações.",
          "Neste curso de 165 aulas, você aprenderá o essencial sobre bancos de dados relacionais, criando um banco de dados PostgreSQL com vários personagens de videogame."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Aprenda SQL criando um banco de dados de alunos: Parte 1",
        "intro": [
          "O SQL, ou linguagem de consulta estruturada, é a linguagem de comunicação com um banco de dados relacional.",
          "Neste curso de 140 aulas, você criará um script do Bash que utiliza SQL para inserir informações sobre seus alunos de ciência da computação no PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Aprenda SQL criando um banco de dados de alunos: Parte 2",
        "intro": [
          "Comandos join do SQL são usados para combinar informações de várias tabelas em um banco de dados relacional",
          "Neste curso de 140 aulas, você completará seu banco de dados de alunos, mergulhando mais fundo nos comandos SQL."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "APIs e desenvolvimento de back-end",
    "intro": [
      "Até esse ponto, você usou JavaScript apenas no front-end para adicionar interatividade a uma página, resolver desafios de algoritmos ou construir uma SPA. Mas o JavaScript também pode ser usado no back-end, ou servidor, para construir aplicações web inteiras.",
      "Hoje em dia, uma das formas populares de se criar aplicações é através do uso de microsserviços, que são pequenas aplicações modulares que trabalham em conjunto para formar uma aplicação maior inteira.",
      "Na certificação de APIs e desenvolvimento de back-end, você aprenderá a escrever aplicações de back-end com o Node.js e o npm. Você também vai construir aplicações web com o framework Express e criará um microsserviço de localização de pessoas com o MongoDB e com a biblioteca Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Gerenciamento de pacotes com o NPM",
        "intro": [
          "O npm (Node Package Manager) é uma ferramenta de linha de comando para instalar, criar e compartilhar pacotes de código JavaScript escritos para Node.js. Há muitos pacotes de código aberto disponíveis no npm. Então, antes de iniciar um projeto, explore os pacotes que já existem para que você não acabe recriando do zero coisas como trabalhar com datas ou buscar dados de uma API.",
          "Neste curso, você aprenderá o básico sobre como usar o npm, incluindo como trabalhar com o <code>package.json</code> e como gerenciar suas dependências instaladas."
        ]
      },
      "basic-node-and-express": {
        "title": "Básico sobre Node e Express",
        "intro": [
          "O Node.js é um ambiente de execução em Javascript que permite que os desenvolvedores escrevam programas de back-end (no lado do servidor) em JavaScript. O Node.js vem com diversos módulos internos — pequenos programas independentes — que ajudam com isso. Alguns dos principais módulos incluem o HTTP, que atua como um servidor, e um sistema de arquivos, que atua como um módulo para ler e modificar arquivos.",
          "Nos últimos cursos, você aprendeu a instalar e gerenciar pacotes a partir do npm, que são coleções de pequenos módulos. Estes pacotes podem ajudá-lo a construir aplicações maiores e mais complexas.",
          "O Express é um framework leve para a criação de aplicações web, sendo um dos pacotes mais populares no npm. O Express torna muito mais fácil criar um servidor e lidar com o roteamento para seu aplicativo, lidando com coisas como direcionar as pessoas para a página correta quando elas visitam um determinado endpoint, como <pre>/blog</pre>.",
          "Neste curso, você aprenderá o básico do Node e do Express, incluindo como criar um servidor, manusear arquivos diferentes e manipular diferentes solicitações de um navegador."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB e Mongoose",
        "intro": [
          "O MongoDB é uma aplicação de banco de dados que armazena documentos JSON (ou registros) que podem ser usados em sua aplicação. Ao contrário do SQL, outro tipo de banco de dados, o MongoDB é um banco de dados não relacional ou \"NoSQL\". Isto significa que o MongoDB armazena todos os dados associados dentro de um registro, em vez de armazená-los em muitas tabelas predefinidas, como em um banco de dados SQL.",
          "O Mongoose é um pacote popular do npm para a interação com o MongoDB. Com o Mongoose, você pode usar objetos JavaScript simples em vez de JSON, o que torna mais fácil trabalhar com o MongoDB. Além disso, ele permite que você crie projetos para seus documentos, chamados schemas, para que você não salve acidentalmente o tipo errado de dados e cause bugs mais tarde.",
          "Nos cursos de MongoDB e Mongoose, você aprenderá os fundamentos de trabalhar com dados persistentes, incluindo como configurar um modelo, salvar, excluir e buscar documentos no banco de dados."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Projetos de APIs e desenvolvimento de back-end",
        "intro": [
          "Você já trabalhou com APIs antes, mas agora que você conhece o npm, Node, Express, MongoDB e o Mongoose, é hora de construir a sua própria API. Utilize tudo o que você aprendeu até esse ponto para criar 5 microsserviços diferentes – aplicações menores e com escopo limitado.",
          "Depois de criá-las, você terá 5 APIs de microsserviço sensacionais, que poderão ser mostradas para amigos, familiares e potenciais empregadores. Ah, e você também terá uma Certificação em APIs e desenvolvimento de back-end novinha."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Garantia de qualidade",
    "intro": [
      "À medida que seus programas ou aplicativos da web se tornam mais complexos, você vai querer testá-los para garantir que novas alterações não quebrem as funcionalidades originais.",
      "Na certificação de garantia de qualidade, você aprenderá a escrever testes com o Chai para garantir que suas aplicações funcionem da maneira que você espera.",
      "Em seguida, você vai construir uma aplicação de chat para aprender conceitos avançados de Node e Express. Você também usará o Pug como um modelo de motor, o Passport, para autenticação, e o Socket.io, para comunicação em tempo real entre o servidor e os clientes conectados."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Garantia de qualidade e teste com o Chai",
        "intro": [
          "O Chai é uma biblioteca de testes do JavaScript que ajuda você a confirmar que seu programa ainda se comporta como você espera após realizar alterações no código.",
          "Usando o Chai, você pode escrever testes que descrevem as exigências do programa e ver se o programa as satisfaz.",
          "Neste curso, você aprenderá sobre afirmações, igualdade profunda, condição de verdade, testes de APIs e outros fundamentos para testar aplicações JavaScript."
        ]
      },
      "advanced-node-and-express": {
        "title": "Node e Express avançado",
        "intro": [
          "Agora é hora de fazer um mergulho profundo no Node.js e no Express.js, construindo uma aplicação de chat com um sistema de login.",
          "Para implementar o sistema de login de forma segura, você precisará saber sobre autenticação. Este é o ato de verificar a identidade de uma pessoa ou um processo.",
          "Neste curso, você aprenderá a usar o Passport, para gerenciar a autenticação, o Pug, para criar modelos reutilizáveis para a construção rápida do front-end, e web sockets, para a comunicação em tempo real entre os clientes e o servidor."
        ]
      },
      "quality-assurance-projects": {
        "title": "Projetos de garantia de qualidade",
        "intro": [
          "Agora que você conhece bem o front-end e o back-end, chegou a hora de aplicar todas as habilidades e conceitos que você aprendeu até agora. Você vai construir 5 aplicações web diferentes e escrever testes para cada uma, para garantir que estão funcionando e que podem lidar com casos diferentes.",
          "Depois de concluir estes projetos de garantia de qualidade (QA), você terá mais 5 projetos e uma nova certificação para exibir em seu portfólio."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Computação científica com Python (beta)",
    "intro": [
      "O currículo de Computação científica com Python (beta) equipará você com as habilidades para analizar e manipular dados usando o Python, uma linguaguem de programação poderosa e versátil. Você aprenderá conceitos-chave como estrutura de dados, algoritmos, Programação Orientada a Objetos e como realizar cálculos complexos usando uma variedade de ferramentas.",
      "Este curso abrangente guiará você através dos fundamentos da computação científica, incluindo estrutura de dados e algoritmos."
    ],
    "note": "",
    "blocks": {
      "learn-string-manipulation-by-building-a-cipher": {
        "title": "Aprenda manipulação de strings criando uma cifra",
        "intro": [
          "O Python é uma linguagem de programação poderosa e popular amplamente utilizada para ciência de dados, visualização de dados, desenvolvimento para a web, desenvolvimento de jogos, aprendizado de máquina e muito mais.",
          "Nesse projeto, você aprenderá conceitos fundamentais de programação em Python, como variáveis, funções, laços e instruções condicionais. Você os usará para programar seus primeiros programas."
        ]
      },
      "learn-how-to-work-with-numbers-and-strings-by-implementing-the-luhn-algorithm": {
        "title": "Aprenda a trabalhar com números e strings implementando o algoritmo de Luhn",
        "intro": [
          "O algoritmo de Luhn é amplamente utilizado para a verificação de erros em várias aplicações, como a verificação de números de cartões de crédito.",
          "Ao construir esse projeto, você ganhará experiência de trabalho com computação numérica e manipulação de strings."
        ]
      },
      "learn-list-comprehension-by-building-a-case-converter-program": {
        "title": "Aprenda compreensão de listas em Python criando um programa conversor de casos",
        "intro": [
          "A compreensão de listas é uma maneira de criar uma nova lista em Python de tipo iterável: listas, tuplas e strings. Tudo isso ocorre sem usar um loop for ou o método de lista `.append()`.",
          "Neste projeto, você escreverá um programa que recebe uma string formatada em Camel Case ou Pascal Case e a converte em Snake Case.",
          "O projeto tem duas fases: primeiro, você usará um loop for para implementar o programa. Em seguida, você aprenderá a usar a compreensão de lista em vez de um loop para obter os mesmos resultados."
        ]
      },
      "learn-regular-expressions-by-building-a-password-generator": {
        "title": "Aprenda expressões regulares criando um gerador de senha",
        "intro": [
          "Um módulo do Python é um arquivo que contém um conjunto de instruções e definições que podem ser usadas em seu código.",
          "Neste projeto, você aprenderá a importar módulos da biblioteca padrão do Python. Você também aprenderá a usar expressões regulares criando seu próprio programa de geração de senha."
        ]
      },
      "learn-algorithm-design-by-building-a-shortest-path-algorithm": {
        "title": "Aprenda design de algoritmos criando um algoritmo de caminho mais curto",
        "intro": [
          "Algoritmos são procedimentos passo a passo que desenvolvedores usam para realizar cálculos e resolver problemas computacionais.",
          "Neste projeto, você aprenderá a usar funções, laços, declarações condicionais e compreensões de dicionário para implementar um algoritmo do caminho mais curto."
        ]
      },
      "learn-recursion-by-solving-the-tower-of-hanoi-puzzle": {
        "title": "Aprenda recursão resolvendo o quebra-cabeças da Torre de Hanói",
        "intro": [
          "Recursão é uma abordagem de programação que permite que você resolva problemas complicados de computação com pouco código.",
          "Neste projeto, você começará com uma abordagem baseada em laços para resolver o quebra-cabeça matemático da Torre de Hanói. Depois, você aprenderá a implementar uma solução recursiva."
        ]
      },
      "learn-data-structures-by-building-the-merge-sort-algorithm": {
        "title": "Aprenda estrutura de dados criando o algoritmo de Merge Sort",
        "intro": [
          "O algoritmo de Merge Sort (ordenação por mistura ou mesclagem) é um algoritmo de classificação baseado no princípio \"dividir para conquistar\".",
          "Neste projeto, você aprenderá a interagir com estruturas de dados classificando uma lista de números aleatórios usando o algoritmo de Merge Sort."
        ]
      },
      "learn-classes-and-objects-by-building-a-sudoku-solver": {
        "title": "Aprenda classes e objetos criando um solucionador de Sudoku",
        "intro": [
          "Classes e objetos são conceitos importantes em programação. Essas ferramentas de Programação Orientada a Objetos ajudam os desenvolvedores a alcançar modularidade, abstração e legibilidade de código. Eles também promovem a reutilização.",
          "Neste projeto do solucionador de Sudoku, você aprenderá a usar classes e objetos para criar uma grade de Sudoku e a resolver um quebra-cabeças do Sudoku."
        ]
      },
      "learn-tree-traversal-by-building-a-binary-search-tree": {
        "title": "Aprenda travessia de árvores criando uma árvore binária de busca",
        "intro": [
          "Uma árvore binária de busca (em inglês, binary search tree ou BST) é uma estrutura de dados comum onde os dados são ordenados hierarquicamente.",
          "Neste projeto, você aprenderá como criar sua própria BST e executará uma travessia em ordem. Você também aprenderá operações-chave como inserção, pesquisa e exclusão."
        ]
      },
      "learn-lambda-functions-by-building-an-expense-tracker": {
        "title": "Aprenda funções lambda criando um controle de despesas",
        "intro": [
          "As funções lambda dão a você uma maneira concisa de escrever funções pequenas e descartáveis no seu código.",
          "Neste projeto, você explorará o poder das funções lambda criando um controle de despesas. A aplicação resultante demonstrará como você pode usar funções lambda para operações eficientes e simplificadas."
        ]
      },
      "build-an-arithmetic-formatter-project": {
        "title": "Projeto de criar um formatador aritmético",
        "intro": [
          "Este é um dos projetos necessários para obter a certificação."
        ]
      },
      "build-a-time-calculator-project": {
        "title": "Projeto de criar uma calculadora de tempo",
        "intro": [
          "Este é um dos projetos necessários para obter a certificação."
        ]
      },
      "build-a-budget-app-project": {
        "title": "Projeto de criar uma aplicação de orçamento",
        "intro": [
          "Este é um dos projetos necessários para obter a certificação."
        ]
      },
      "build-a-polygon-area-calculator-project": {
        "title": "Projeto de criar uma calculadora de área de polígonos",
        "intro": [
          "Este é um dos projetos necessários para obter a certificação."
        ]
      },
      "build-a-probability-calculator-project": {
        "title": "Projeto de criar uma calculadora de probabilidades",
        "intro": [
          "Este é um dos projetos necessários para obter a certificação."
        ]
      },
      "learn-interfaces-by-building-an-equation-solver": {
        "title": "Aprenda Interfaces criando um solucionador de equações",
        "intro": [
          "Classes abstratas permitem definir interfaces formais – objetos que agem como diagramas para as classes.",
          "Neste projeto, você descobrirá como implementar uma interface em Python ao criar um programa simples de resolução de equações."
        ]
      },
      "learn-special-methods-by-building-a-vector-space": {
        "title": "Aprenda métodos especiais criando um espaço vetorial",
        "intro": [
          "Os métodos especiais do Python são chamados em resposta a operações específicas e permitem que você personalize o comportamento dos objetos de modo detalhado e eficaz.",
          "Neste projeto, você vai explorar alguns dos métodos especiais mais comuns enquanto aprende sobre vetores criando um espaço vetorial."
        ]
      },
      "learn-encapsulation-by-building-a-projectile-trajectory-calculator": {
        "title": "Aprenda encapsulamento criando uma calculadora de trajetória de projéteis",
        "intro": [
          "Encapsulamento é um princípio fundamental da OOP baseado na escrita de código que limita o acesso direto aos dados.",
          "Neste projeto, você descobrirá novos conceitos relacionados ao encapsulamento, como getters, setters e name mangling. Você usará esses conceitos junto com o que você já aprendeu para criar um programa que calcula uma trajetória de projéteis."
        ]
      },
      "learn-the-bisection-method-by-finding-the-square-root-of-a-number": {
        "title": "Aprenda o método de bissecção encontrando a raiz quadrada de um número",
        "intro": [
          "Os métodos numéricos são usados para aproximar soluções para problemas matemáticos que são difíceis ou impossíveis de resolver analiticamente.",
          "Neste projeto, você explorará o método numérico de bisseção para encontrar a raiz quadrada de um número reduzindo iterativamente a variedade possível de valores que contêm a raiz quadrada."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Análise de dados com Python",
    "intro": [
      "A análise de dados já existe há um bom tempo. Porém, até poucos anos atrás, os desenvolvedores praticavam-na apenas usando ferramentas caras e de código fechado, como o Tableau. Recentemente, Python, SQL e outras bibliotecas abertas começaram a mudar a análise de dados para sempre.",
      "Na certificação em análise de dados com Python, você aprenderá os fundamentos da análise de dados com Python. No final desta certificação, você saberá ler dados de fontes como CSVs e SQL, além de usar bibliotecas como Numpy, Pandas, Matplolib e Seaborn para processar e visualizar dados."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Análise de dados com Python",
        "intro": [
          "Nestes cursos completos em vídeo, criados por Santiago Basulto, você aprenderá todo o processo de análise de dados. Você fará a leitura de dados a partir de múltiplas fontes (CSV, SQL, Excel), processará estes dados usando NumPy e Pandas, e os visualizará usando Matplotlib e Seaborn.",
          "Além disso, incluímos um curso completo sobre o Jupyter Notebook, bem como uma referência rápida para o Python para atualizar suas habilidades em programação."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Aprenda os conceitos básicos da biblioteca NumPy nos vídeos do curso a seguir, criado por Keith Galli.",
          "Neste curso, você vai aprender como a NumPy funciona e como ela se compara às listas incorporadas do Python. Você também aprenderá a escrever código com NumPy, indexação, remodelação, estatísticas aplicadas e muito mais."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Projetos de análise de dados com Python",
        "intro": [
          "Existem muitas maneiras de analisar dados com o Python. Ao completar esses projetos, você vai demonstrar que tem um bom conhecimento fundamental de análise de dados com Python.",
          "Conclua todos os cursos para solicitar a certificação em Análise de Dados com Python."
        ]
      }
    }
  },
  "information-security": {
    "title": "Segurança da informação",
    "intro": [
      "Com tudo o que fazemos on-line, há uma grande quantidade de informações sensíveis em risco: endereços de e-mail, senhas, números de telefone e muito mais.",
      "Com o certificado de segurança da informação, você criará um aplicativo web seguro com o HelmetJS para aprender os fundamentos de proteção de informações on-line.",
      "Você também vai construir um cliente TCP, um Nmap e um scanner de portas em Python. Isso ajudará você a aprender o básico do teste de intrusão — um componente importante de boa segurança da informação."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Segurança da informação com HelmetJS",
        "intro": [
          "Este curso de programação se concentra no HelmetJS, um tipo de middleware para aplicativos baseados em Express que define automaticamente os cabeçalhos HTTP. Desta forma, ele pode prevenir que informações confidenciais sejam transmitidas involuntariamente entre o servidor e o cliente.",
          "A conclusão dos cursos abaixo ajudará você a entender como proteger seu site de comportamentos maliciosos."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python para testes de intrusão",
        "intro": [
          "Estes cursos por vídeo ensinam você a fazer o teste de intrusão com Python. Também conhecido como pen test, o teste de intrusão é um ataque simulado a um sistema para verificar vulnerabilidades.",
          "Neste curso, você aprenderá a respeito de sockets, criará um cliente e um servidor TCP, construirá um scanner Nmap, além de outras ferramentas e técnicas que os testadores de intrusão usam diariamente."
        ]
      },
      "information-security-projects": {
        "title": "Projetos de segurança da informação",
        "intro": [
          "Agora é hora de colocar suas novas habilidades em segurança da informação para funcionar. Estes projetos darão a chance de você praticar as habilidades, princípios e conceitos de segurança da informação que aprendeu.",
          "Quando você tiver terminado, você terá aprendido diversos projetos de segurança da informação, juntamente com uma certificação que poderá mostrar a amigos, familiares e empregadores."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Aprendizado de máquina com Python",
    "intro": [
      "A aprendizagem de máquina tem várias aplicações práticas que você pode usar em seus projetos ou no trabalho.",
      "Na certificação de aprendizagem de máquina com Python, você usará o framework chamado TensorFlow para construir várias redes neurais e explorar técnicas mais avançadas, como o processamento de linguagem natural e a aprendizagem por reforço.",
      "Você também vai mergulhar em redes neurais e aprender os princípios por trás de como as redes neurais profundas, recorrentes e convolucionais funcionam."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "O TensorFlow é um framework de código aberto que facilita o uso da aprendizagem de máquina e das redes neurais.",
          "O curso por vídeos a seguir foi criado por Tim Ruscica, também conhecido como \"Tech With Tim\". Ele ajudará você a entender o TensorFlow e algumas de suas capacidades poderosas."
        ]
      },
      "how-neural-networks-work": {
        "title": "Como as redes neurais funcionam",
        "intro": [
          "As redes neurais estão no núcleo daquilo a que hoje chamamos de inteligência artificial. Mas, historicamente, elas foram difíceis de entender, especialmente para os iniciantes no campo de aprendizagem de máquina.",
          "Mesmo se você for completamente novo em redes neurais, esses cursos por vídeo de Brandon Rohrer farão com que você se sinta confortável com os conceitos e com a matemática por trás deles."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Projetos de aprendizagem de máquina com Python",
        "intro": [
          "A aprendizagem de máquina tem muitas aplicações práticas. Ao completar estes projetos de programação gratuitos e desafiadores, você vai demonstrar que tem um bom conhecimento nos fundamentos de aprendizagem de máquina, além de se qualificar para sua certificação em aprendizagem de máquina com Python."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "Álgebra para o ensino superior com Python",
    "intro": [
      "Este curso foi projetado como um curso universitário de um semestre. Ele consiste em vídeos instrutivos, com os notebooks do Google Colaboratory para acompanhar os desafios e projetos de modo interativo.",
      "À medida que você passa por cada parte do curso em sequência, você vai entender a álgebra e como escrever códigos em Python para resolver problemas de álgebra.",
      "Ao longo deste curso, você também criará seu próprio notebook de álgebra no Colaboratory, que poderá usar como uma calculadora personalizada. Este curso (e o código que você escreve aqui) dará a você a base para uma compreensão mais profunda da matemática e da ciência de dados."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Aprenda razões e proporções",
        "intro": [
          "Sua jornada começa aqui enquanto você aprende como configurar um notebook do Colaboratory que pode executar código em Python. Então, use o notebook para acompanhar os vídeos para aprender razões e proporções usando Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Aprenda a resolver para X",
        "intro": [
          "Esta unidade se concentrará em como resolver um número desconhecido (geralmente chamado de \"x\") usando código escrito em Python e álgebra."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Aprenda frações e números decimais",
        "intro": [
          "Esta unidade se concentrará na conversão de números decimais em frações e porcentagens."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Aprenda funções e gráficos",
        "intro": ["Esta unidade ensinará você sobre as funções matemáticas."]
      },
      "learn-linear-functions": {
        "title": "Aprenda funções lineares",
        "intro": [
          "Esta unidade mostrará para você como desenvolver equações lineares a partir de dois pontos."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Aprenda fatores comuns e raízes quadradas",
        "intro": [
          "Nesta unidade, você aprenderá a encontrar fatores comuns e a dividi-los. Isto será útil na simplificação de frações e fatoração de raízes quadradas."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Calculadora multifunção",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará uma calculadora multifunção."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Aprenda a criar sistemas gráficos de equações",
        "intro": [
          "Esta unidade se concentrará em construir o gráfico de duas equações no mesmo plano de coordenadas, para que você possa ver onde as linhas se cruzam."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Aprenda a resolver sistemas de equações",
        "intro": [
          "Nesta unidade, você aprenderá a resolver um sistema de duas equações (com duas variáveis) sem gráfico. Você verá como pode fatorar uma equação e resolver para uma determinada variável em Python. Ao final desta unidade, você será capaz de resolver e criar o gráfico do sistema com um bloco de código."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Aprenda aplicações de sistemas lineares",
        "intro": [
          "Nesta unidade, você verá como usar a álgebra que aprendeu até agora para resolver problemas do mundo real."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Aprenda equações quadráticas",
        "intro": [
          "Esta unidade vai além das equações lineares, para trabalhar com expoentes e parábolas em gráfico. Você aprenderá a encontrar pontos-chave nas parábolas e a resolver equações do segundo grau."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Calculadora gráfica",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará uma calculadora gráfica."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Aprenda gráficos e polinômios pais",
        "intro": [
          "Esta unidade vai mostrar para você muitos tipos diferentes de gráficos \"pai\", os padrões básicos que criam gráficos mais complicados. Os polinômios são expressões matemáticas com \"várias coisas\" – as equações mais complicadas que são construídas com padrões básicos. Você verá como esses gráficos se parecem, como modificá-los e como fazer tudo isso com código em Python."
        ]
      },
      "build-three-math-games-project": {
        "title": "Três jogos de matemática",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará três jogos de matemática."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Aprenda aplicações de negócios com álgebra do ensino superior",
        "intro": [
          "Esta unidade mostrará a você como aplicar as habilidades de resolução e criação de gráficos para encontrar custo, receita e lucro. Você escreverá um código para desenvolver uma função de demanda a partir de dois pontos. Você verá como o preço afeta o gráfico de lucros e como todas essas equações se relacionam entre si."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Aprenda juros simples e compostos",
        "intro": [
          "Esta unidade mostrará a você como calcular juros, pagamentos de empréstimos e o valor estimado dos investimentos. Você verá a fórmula matemática e a transformará em código. Como essas fórmulas tendem a ficar complicadas, você vai gostar de ter o código onde você pode apenas modificar alguns valores."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Aprenda expoentes e logaritmos",
        "intro": [
          "Esta unidade vai mostrar a você como expoentes e logaritmos são funções inversas e como você pode usar essas funções em várias aplicações."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Calculadora financeira",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará uma calculadora financeira."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "Álgebra do ensino superior com Python: conclusão",
        "intro": [
          "Esta será a última unidade deste curso. Vamos ver como você pode conectar seus conhecimentos matemáticos e Python a dados externos."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Explorador de gráfico de dados",
        "intro": [
          "Este é um dos projetos necessários para obter sua certificação.",
          "Para este projeto, você criará uma explorador de gráfico de dados."
        ]
      }
    }
  },
  "python-for-everybody": {
    "title": "Python para todos legado",
    "intro": [
      "O Python é uma das linguagens de programação mais populares e flexíveis atualmente. Você pode usá-la para tudo, da programação básica até a aprendizagem de máquina."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python para todos",
        "intro": [
          "Python para todos é uma série gratuita de cursos em vídeos que ensina o básico para usar o Python 3.",
          "Os cursos foram criados pelo Dr. Charles Severance (também conhecido como Dr. Chuck). Ele é professor clínico na Escola de Informação da Universidade de Michigan, onde leciona vários cursos orientados à tecnologia, incluindo programação, projeto de banco de dados e desenvolvimento para a web."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Preparação para entrevistas de programação",
    "intro": [
      "Se estiver procurando exercícios gratuitos de programação para se preparar para sua próxima entrevista de emprego, nós temos o que você precisa.",
      "Esta seção contém centenas de desafios de programação que testam seu conhecimento de algoritmos, estruturas de dados e matemática. Ela também possui vários projetos adicionais, que você pode usar para fortalecer suas habilidades ou adicionar ao seu portfólio."
    ],
    "note": "O Projeto Euler e o Rosetta Code foram transferidos para seus próprios cursos. Volte para o currículo para ver a lista de cursos que oferecemos.",
    "blocks": {
      "algorithms": {
        "title": "Algoritmos",
        "intro": [
          "Esses exercícios de programação gratuitos ensinam alguns algoritmos comuns que você provavelmente encontrará na vida real. Eles são uma grande oportunidade para melhorar suas habilidades de lógica e programação.",
          "Estes algoritmos são frequentemente usados em entrevistas de trabalho para testar as habilidades de um candidato. Nós vamos oferecer explicações claras e concisas sobre como esses vários algoritmos funcionam para que você possa implementar uma solução para cada um."
        ]
      },
      "data-structures": {
        "title": "Estruturas de dados",
        "intro": [
          "Esses cursos de programação gratuitos têm o objetivo de ajudá-lo a lidar com estruturas de dados grandes e complexas com as quais você ainda não está familiarizado.",
          "Trabalhando com os cursos abaixo, você aprenderá sobre cada tipo de estrutura de dados e implementará algoritmos para reforçar seu entendimento sobre eles."
        ]
      },
      "take-home-projects": {
        "title": "Projetos para levar para casa",
        "intro": [
          "Entrevistas de programação sempre foram estressantes. Os candidatos a empregos às vezes recebem um projeto para levar para casa, a ser concluído fora da entrevista. Esses tipos de entrevistas geralmente exigem muito trabalho, mas são uma ótima maneira para os empregadores verem como você se sairia no trabalho.",
          "Realize os projetos de codificação adicionais abaixo para uma prática extra. Não tenha pressa, melhore-os e coloque no seu currículo ou portfólio para mostrar a possíveis empregadores."
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "O Odin Project – versão do freeCodeCamp (beta)",
    "intro": [
      "O Odin Project foi criado em 2013 por um único desenvolvedor, Erik Trautman. Ao longo dos anos, uma comunidade de código aberto surgiu para manter e expandir o projeto.",
      "O freeCodeCamp expandiu o currículo de código aberto para ser executado de maneira interativa no navegador, com testes para avaliar seu código e garantir que você tenha entendido os conceitos principais.",
      "Se você quiser a experiência original de configurar todo o Odin Project para ser executado no seu computador local, você pode conferir o Odin Project original no <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>site do projeto</a>. Agradecemos imensamente à comunidade do Odin Project por continuar a manter esse valioso recurso de aprendizagem para desenvolvedores de todo o mundo.",
      "Este curso não é oficial e não endossado pelo Odin Project. Foram feitas alterações no conteúdo curricular do Odin Project e todo o material instrucional do curso está licenciado sob a <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; The Odin Project</a>",
      "Este curso inclui conteúdo de <a href='javascript.info'>JavaScript.info</a>, que está sob a licença<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>"
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Aprenda o básico de HTML",
        "intro": [
          "Obtenha uma compreensão sólida dos fundamentos do HTML com este curso. Desde a estruturação de páginas da web até a compreensão de tags semânticas, você construirá uma base sólida para criar conteúdo bem organizado e acessível na web."
        ]
      },
      "top-working-with-text": {
        "title": "Trabalhando com textos",
        "intro": [
          "Explore as complexidades de trabalhar com textos em desenvolvimento para a web. Aprenda sobre formatação, manipulação e apresentação de textos para melhorar suas habilidades na criação de conteúdo para a web."
        ]
      },
      "top-links-and-images": {
        "title": "Links e imagens",
        "intro": [
          "Aprenda a incorporar links e imagens em seus projetos para a web. Este curso cobre os fundamentos da criação de links e da incorporação de imagens para tornar seus sites mais interativos e visualmente atraentes."
        ]
      },
      "top-build-a-recipe-project": {
        "title": "Aprenda o básico de HTML criando uma página de receitas",
        "intro": [
          "Coloque suas habilidades HTML em prática construindo uma página de receitas. Este projeto prático permite que você aplique seu conhecimento e crie uma página funcional para a web e, simultaneamente, reforce os conceitos-chave de desenvolvimento em HTML."
        ]
      },
      "top-learn-css-foundations": {
        "title": "Aprenda o básico de CSS",
        "intro": [
          "Mergulhe no mundo das folhas de estilo em cascata (CSS) e aprenda a estilizar seus elementos do HTML. Explore propriedades de estilo, seletores e layouts para dar vida às suas páginas da web."
        ]
      },
      "top-learn-css-foundations-projects": {
        "title": "Projetos para aprender o básico de CSS",
        "intro": [
          "Leve suas habilidades em CSS para o próximo nível, trabalhando em projetos práticos. Este curso fornece experiência prática na aplicação de CSS para criar projetos responsivos para cenários reais."
        ]
      },
      "top-learn-css-specificity": {
        "title": "Aprenda especificidade no CSS",
        "intro": [
          "Aprenda especificidade em CSS e obtenha uma melhor compreensão de como os estilos são aplicados aos elementos do HTML. Este curso explora as nuances das regras do CSS e ajuda você a escrever estilos eficientes e direcionados para suas páginas da web."
        ]
      },
      "top-the-box-model": {
        "title": "Aprenda sobre o modelo de caixas",
        "intro": [
          "Aprenda o modelo de caixas do CSS com este curso. Entenda como elementos são renderizados na web e aprenda a manipular espaçamento, bordas e preenchimento para atingir o layout e o design desejado."
        ]
      },
      "top-introduction-to-flexbox": {
        "title": "Introdução ao Flexbox",
        "intro": [
          "Descubra o poder do Flexbox, um modelo de layout que simplifica o design de layouts flexíveis e responsivos da web. Aprenda a criar estruturas de páginas dinâmicas e adaptáveis com facilidade."
        ]
      },
      "top-learn-block-and-inline": {
        "title": "Aprenda a diferença entre bloco e em linha",
        "intro": [
          "Explore as distinções entre elementos de bloco e elementos em linha no HTML e CSS. Este curso fornece informações sobre como esses tipos de exibição afetam o layout e o comportamento, permitindo que você tome decisões informadas de design."
        ]
      },
      "top-learn-variables-and-operators": {
        "title": "Aprenda variáveis e operadores",
        "intro": [
          "Comece a usar o JavaScript aprendendo sobre variáveis e operadores. Este curso abrange os fundamentos da programação em JavaScript, incluindo tipos de dados, operadores e declarações de variáveis."
        ]
      },
      "top-learn-data-types-and-conditionals": {
        "title": "Aprenda tipos de dados e condicionais",
        "intro": ["Aprenda sobre tipos de dados e condicionais em JavaScript."]
      },
      "top-learn-function-basics": {
        "title": "Aprenda funções básicas",
        "intro": ["Aprenda funções em JavaScript."]
      },
      "top-basic-function-projects": {
        "title": "Projetos de funções básicas",
        "intro": [
          "Teste suas habilidades de JavaScript criando funções básicas."
        ]
      },
      "top-learn-arrays-and-loops": {
        "title": "Aprenda arrays e laços",
        "intro": ["Aprenda sobre arrays e laços de repetição em JavaScript."]
      },
      "top-learn-to-solve-problems-and-understand-errors": {
        "title": "Aprenda a resolver problemas e a entender erros",
        "intro": [
          "Aprenda a resolver problemas e a entender os erros em JavaScript."
        ]
      },
      "top-build-a-rock-paper-scissors-game": {
        "title": "Crie um jogo de pedra, papel e tesoura",
        "intro": [
          "Teste suas habilidades em JavaScript criando um jogo de pedra, papel e tesoura."
        ]
      }
    }
  },
  "project-euler": {
    "title": "Projeto Euler",
    "intro": [
      "Complete os desafios de programação abaixo, diretamente dos grandes arquivos do Projeto Euler. Isso fortalecerá seu conhecimento de algoritmos e de matemática.",
      "Esses problemas variam em dificuldade e, para muitos, a experiência é uma aprendizagem em sequência indutiva. Ou seja, ao resolver um problema, você será exposto a um novo conceito que permite a você resolver um problema que antes era inacessível. Você consegue concluir todos eles?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Problemas do Projeto Euler de 1 a 100",
        "intro": [
          "Neste primeiro conjunto de desafios, você usará conceitos matemáticos como a sequência de Fibonacci, teoria dos números primos e análise combinatória para escrever algoritmos eficientes para resolver esses problemas."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Problemas do Projeto Euler de 101 a 200",
        "intro": [
          "Neste conjunto de desafios, você vai desenvolver as habilidades que aprendeu na primeira parte do curso e usar conceitos mais avançados, como computação vetorial, pirâmide de Pascal e o algoritmo RSA para resolver esses problemas de modo eficiente."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Problemas do Projeto Euler de 201 a 300",
        "intro": [
          "Neste conjunto de desafios, você continuará a desenvolver as habilidades que aprendeu anteriormente e usará conceitos como o teorema dos binômios, números de Hamming e a sequência de Collatz para desenvolver ainda mais suas habilidades matemáticas e de resolução de problemas."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Problemas do Projeto Euler de 301 a 400",
        "intro": [
          "Aqui, você continuará a exercitar suas habilidades matemáticas e algorítmicas ao usar conceitos como a teoria combinatória dos jogos, operações bitwise e a sequência autodescritiva de Golomb para desenvolver soluções eficientes para estes problemas."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Problemas do Projeto Euler de 401 a 480",
        "intro": [
          "Neste conjunto final de desafios, você precisará utilizar tudo o que aprendeu até este ponto e usar conceitos avançados como divisores unitários, a rotina de Kaprekar e muito mais para resolver estes problemas complexos."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "(Novo) Fundamentos de C# com a Microsoft",
    "intro": [
      "Este curso oferece uma introdução abrangente à programação em C#, cobrindo seus conceitos principais, sintaxe e aplicação prática em desenvolvimento de software.",
      "Através de exercícios e projetos práticos, você aprenderá os fundamentos de C#, incluindo variáveis, tipos de dados, estruturas de controle e princípios de programação orientada a objetos.",
      "Ao final deste curso, você terá obtido as habilidades práticas e conhecimentos necessários para programar em C# com confiança para criar aplicações."
    ],
    "note": "Cada seção abaixo tem um troféu associado a ela. Você deve obtê-lo na plataforma Microsoft Learn. Depois de ganhar cada troféu, você precisa verificá-lo no freeCodeCamp. Só então você poderá se qualificar para o exame de certificação.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Escreva seu primeiro código em C#",
        "intro": [
          "Comece sua jornada aprendendo a escrever seu primeiro código em C#. Desenvolva bem seus conhecimentos básicos enquanto explora os fundamentos e a sintaxe da linguagem, preparando o terreno para suas aventuras em programação."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Crie e execute aplicações simples de console em C#",
        "intro": [
          "Domine a arte de criar e executar aplicações simples de console em C#. Mergulhe no mundo da programação baseada em consoles, onde você ganhará a experiência prática de executar seu código e vê-lo em ação."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Adicione lógica a aplicações de console em C#",
        "intro": [
          "Libere o poder da lógica nas aplicações de console em C#. Aprenda a adicionar lógica e recursos de tomada de decisão ao código, permitindo que suas aplicações façam escolhas dinâmicas e respondam inteligentemente a diferentes cenários."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Trabalhe com dados variáveis em aplicações de console do C#",
        "intro": [
          "Descubra a versatilidade de dados variáveis nas aplicações de console em C#. Aproveite a capacidade de armazenar e manipular diferentes tipos de dados, como números e texto, aprofundando em conceitos essenciais de variáveis e manipulação de dados."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Crie métodos em aplicações de console em C#",
        "intro": [
          "Torne mais avançadas suas aplicações de console em C# dominando a arte de criar métodos. Aprenda a organizar e modularizar seu código, tornando-o mais controlável, reutilizável e eficiente."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Depure aplicações de console em C#",
        "intro": [
          "Aprimore suas habilidades de solução de problemas ao mergulhar no mundo da depuração de aplicações de console em C#. Obtenha a capacidade de identificar e corrigir problemas no código, garantindo que as aplicações sejam executadas sem problemas e apresentem os resultados desejados."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Exame de fundamentos de C# com certificação da Microsoft",
        "intro": [
          "Use o que aprendeu para passar no exame e ganhar suas Certificação da Microsoft em Fundamentos de C#"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Próximo Python",
    "intro": ["placeholder"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Aprenda Python criando um jogo de Blackjack",
        "intro": ["Aprenda Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Próximo projeto de Python",
        "intro": ["placeholder"]
      }
    }
  },
  "a2-english-for-developers": {
    "title": "A2 Inglês para Desenvolvedores (Beta)",
    "note": "Esta certificação está atualmente em desenvolvimento ativo. Embora não haja uma certificação disponível para esta seção no momento, teremos uma disponível em breve. Enquanto isso, você pode explorar os cursos que criamos abaixo.",
    "intro": [
      "Neste currículo de inglês para desenvolvedores, você aprenderá o essencial da comunicação em inglês. O currículo seguirá o nível A2 do Quadro de Referência Comum Europeu (CEFR). Nosso foco é no vocabulário, particularmente útil para desenvolvedores.",
      "A primeira metade do currículo ajudará você a se sentir confortável com a gramática e o uso do inglês. Isso dará a você diversas oportunidades de praticar. Você aprenderá o básico como se apresentar, ter conversas mais simples e discutir seu trabalho.",
      "Na segunda metade, você praticará vocabulário específico para o desenvolvimento de software. Você aprenderá como descrever código, como discutir tendências em tecnologia e como participar de reuniões de equipe.",
      "O currículo inteiro do nível A2 inclui 105 diálogos diferentes. Cada um é projetado para construir seu vocabulário e aumentar sua confiança ao falar em um ambiente profissional da área de tecnologia."
    ],
    "blocks": {
      "learn-greetings-in-your-first-day-at-the-office": {
        "title": "Aprenda saudações em seu primeiro dia no escritório",
        "intro": [
          "Neste primeiro curso, você aprenderá expressões comuns para situações que você pode encontrar no seu primeiro dia no trabalho. Você vai aprender sobre apresentações, conhecer pessoas, pedir recomendações para almoço e obter um cartão de acesso com o pessoal da segurança."
        ]
      },
      "learn-introductions-in-an-online-team-meeting": {
        "title": "Aprenda apresentações em uma reunião on-line com a equipe",
        "intro": [
          "Neste curso, você aprenderá a fazer uma apresentação pessoal. Você também aprenderá a declarar sua profissão e a compartilhar seus objetivos nas reuniões em grupo."
        ]
      },
      "learn-conversation-starters-in-the-break-room": {
        "title": "Aprenda a começar uma conversa na sala de descanso",
        "intro": [
          "Neste curso, você aprenderá a iniciar uma conversa em ambientes casuais. Você também aprenderá a falar sobre seus passatempos e características de sua personalidade. Você também aprenderá a perguntar sobre lugares na cidade."
        ]
      },
      "learn-how-to-talk-about-a-typical-workday-and-tasks": {
        "title": "Aprenda a falar sobre um dia típico e tarefas",
        "intro": [
          "Neste curso, você aprenderá a falar sobre seu dia de trabalho e sobre as tarefas que você executa no local de trabalho, além de como compartilhar isso com os outros. O foco principal está nas estruturas usadas para descrever suas atividades e no vocabulário relacionado a tarefas."
        ]
      },
      "learn-how-to-discuss-your-morning-or-evening-routine": {
        "title": "Aprenda a discutir sobre sua rotina diária ou noturna",
        "intro": [
          "Neste curso, você aprenderá a falar sobre detalhes de sua rotina e a compartilhá-los com alguém. O foco principal está nas estruturas utilizadas para declarar ações de rotina e no vocabulário relacionado."
        ]
      },
      "learn-how-to-describe-your-current-project": {
        "title": "Aprenda a descrever seu projeto atual",
        "intro": [
          "Neste curso, você aprenderá a falar sobre os projetos nos quais você está envolvido e a informar aos outros sobre o que você está fazendo nesses projetos. O foco principal está nas estruturas utilizadas para dar essas informações e no vocabulário relacionado."
        ]
      },
      "learn-how-to-ask-and-share-about-educational-and-professional-background": {
        "title": "Aprenda a pedir informações sobre histórico educacional e profissional e como compartilhá-las",
        "intro": [
          "Neste curso, você aprenderá a perguntar sobre o histórico educacional e profissional de outra pessoa e a compartilhar informações sobre seu próprio histórico."
        ]
      },
      "learn-how-to-talk-about-hobbies-and-interests": {
        "title": "Aprenda a falar sobre passatempos e interesses",
        "intro": [
          "Neste curso, você aprenderá diferentes maneiras de falar sobre passatempos e coisas que interessam a você. Você também aprenderá a perguntar sobre os passatempos de outras pessoas e a convidá-los a se juntar a você nessas atividades."
        ]
      },
      "learn-how-to-discuss-roles-and-responsibilies": {
        "title": "Aprenda a discutir funções e responsabilidades",
        "intro": [
          "Neste curso, você vai discutir os papéis e as responsabilidades das pessoas em uma empresa e fora dela. Você descobrirá como perguntar sobre essas funções e responsabilidades e como compartilhar informações sobre você relacionadas ao tópico."
        ]
      },
      "learn-how-to-have-a-conversation-about-preferences-and-motivations": {
        "title": "Aprenda a ter uma conversa sobre preferências e motivações",
        "intro": [
          "Neste curso, você aprenderá a perguntar sobre o que motiva as pessoas em suas vidas pessoais e profissionais, a responder perguntas relacionadas às suas motivações, e a conversar sobre as preferências das pessoas."
        ]
      },
      "learn-how-to-discuss-popular-trends-in-technology": {
        "title": "Aprenda a discutir tendências populares em tecnologia",
        "intro": [
          "Neste curso, você aprenderá a conversar sobre assuntos em tecnologia a respeito dos quais todos estão falando nos dias de hoje."
        ]
      },
      "learn-how-to-clarify-information-in-different-interactions": {
        "title": "Aprenda a esclarecer as informações em diferentes interações",
        "intro": [
          "Neste curso, você aprenderá a verificar se as informações que você tinha estão corretas e a pedir esclarecimentos quando algo não estiver claro para você."
        ]
      },
      "learn-how-to-use-basic-programming-vocabulary-in-conversations": {
        "title": "Aprenda a usar o vocabulário básico de programação em conversas",
        "intro": [
          "Este curso apresentará um vocabulário básico relacionado à programação. Você aprenderá a fazer perguntas relacionadas aos conceitos básicos de programação."
        ]
      },
      "learn-how-to-use-code-related-concepts-and-terms": {
        "title": "Aprenda a usar conceitos e termos relacionados à programação",
        "intro": [
          "Neste curso, você verá termos relacionados à programação e aprenderá a usá-los em uma conversa."
        ]
      },
      "learn-how-to-discuss-tech-trends-and-updates": {
        "title": "Aprenda a debater tendências em tecnologia e atualizações",
        "intro": [
          "Neste curso, você verá algumas tendências recentes no mundo da tecnologia e aprenderá a discuti-las em inglês."
        ]
      },
      "learn-how-to-help-a-coworker-troubleshoot-on-github": {
        "title": "Aprenda a ajudar um colega de trabalho a resolver problemas no GitHub",
        "intro": [
          "Neste curso, você verá expressões relacionadas a como pedir ajuda a um colega e a como oferecer ajuda a eles."
        ]
      },
      "learn-how-to-share-your-progress-in-weekly-stand-up-meetings": {
        "title": "Aprenda a compartilhar seu progresso em reuniões semanais de equipe",
        "intro": [
          "Este curso mostrará como falar sobre seus projetos em termos do que você já fez e do que está fazendo neles neste momento."
        ]
      },
      "learn-how-to-ask-for-clarification-on-code-understanding": {
        "title": "Aprenda a pedir esclarecimento na compreensão do código",
        "intro": [
          "Neste curso, você verá como pode fazer perguntas para esclarecer coisas que não estão muito claras para você em um código."
        ]
      },
      "learn-how-to-document-code-for-a-project": {
        "title": "Aprenda a documentar o código para um projeto",
        "intro": [
          "Este curso mostrará expressões relacionadas ao que fazer ao documentar o código."
        ]
      },
      "learn-how-to-read-and-understand-code-documentation": {
        "title": "Aprenda a ler e entender a documentação do código",
        "intro": [
          "Este curso apresentará mais expressões relacionadas à documentação de código e dará dicas sobre como entendê-la."
        ]
      },
      "learn-how-to-analyze-code-documentation": {
        "title": "Aprenda a analisar a documentação de código",
        "intro": [
          "Neste curso, você verá algumas ideias para ajudá-lo a lidar com a documentação e a analisá-la em termos simples."
        ]
      },
      "learn-how-to-share-progress-and-accomplishments": {
        "title": "Aprenda a compartilhar progresso e realizações",
        "intro": [
          "Neste curso, você aprenderá a compartilhar seu progresso com os colegas de trabalho e a falar sobre os sucessos que teve em seus projetos."
        ]
      },
      "learn-how-to-talk-about-updates-and-plans-for-tasks-and-projects": {
        "title": "Aprenda a falar sobre atualizações e planos para tarefas e projetos",
        "intro": [
          "Este curso mostrará como falar sobre os avanços mais recentes em seus projetos e sobre seus planos."
        ]
      },
      "learn-how-to-express-agreement-or-disagreement": {
        "title": "Aprenda a expressar concordância e desacordo",
        "intro": [
          "Este curso introduzirá maneiras de dizer que concordamos com o que uma outra pessoa diz e de dizer a elas educadamente que não estamos de acordo com elas."
        ]
      },
      "learn-how-to-offer-technical-support-and-guidance": {
        "title": "Aprenda a oferecer suporte técnico e orientação",
        "intro": [
          "Nesse curso, você verá maneiras de oferecer alguma ajuda em termos de especificações técnicas a outra pessoa."
        ]
      },
      "learn-how-to-request-and-receive-guidance": {
        "title": "Aprenda a solicitar e receber orientação",
        "intro": [
          "Este curso mostrará como pedir ajuda a um colega de trabalho quando você precisar."
        ]
      },
      "learn-how-to-provide-explanations-when-helping-others": {
        "title": "Aprenda a fornecer explicações quando estiver ajudando outros",
        "intro": [
          "Este curso mostrará maneiras de explicar algo a outras pessoas enquanto as ajuda."
        ]
      }
    }
  },
  "b1-english-for-developers": {
    "title": "B1 Inglês para Desenvolvedores (Beta)",
    "note": "Esta certificação está atualmente em desenvolvimento ativo. Embora não haja uma certificação disponível para esta seção no momento, teremos uma disponível em breve. Enquanto isso, você pode explorar os cursos que criamos abaixo.",
    "intro": ["Modelo de introdução"],
    "blocks": {
      "learn-how-to-describe-places-and-events": {
        "title": "Aprenda a descrever locais e eventos",
        "intro": [""]
      },
      "learn-how-to-talk-about-past-experiences": {
        "title": "Aprenda a falar sobre experiências passadas",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-past-activities": {
        "title": "Aprenda a falar sobre atividades passadas",
        "intro": ["", ""]
      },
      "learn-present-perfect-while-talking-about-accessibility": {
        "title": "Aprenda o Present Perfect ao falar sobre acessibilidade",
        "intro": ["", ""]
      },
      "learn-how-to-plan-future-events": {
        "title": "Aprenda a planejar eventos futuros",
        "intro": ["", ""]
      },
      "learn-future-continuous-while-describing-actions": {
        "title": "Aprenda o Future Continuous ao descrever ações",
        "intro": ["", ""]
      },
      "learn-how-to-use-conditionals": {
        "title": "Aprenda a usar condicionais",
        "intro": ["", ""]
      },
      "learn-how-to-share-feedback": {
        "title": "Aprenda a compartilhar feedback",
        "intro": ["", ""]
      },
      "learn-how-to-share-your-opinion": {
        "title": "Aprenda como compartilhar suas opiniões",
        "intro": ["", ""]
      },
      "learn-how-to-express-agreement": {
        "title": "Aprenda a expressar concordância",
        "intro": ["", ""]
      },
      "learn-how-to-express-disagreement": {
        "title": "Aprenda a expressar discordância",
        "intro": ["", ""]
      },
      "learn-how-to-express-concerns": {
        "title": "Aprenda a expressar preocupações",
        "intro": ["", ""]
      },
      "learn-how-to-express-decisions-based-on-comparisons": {
        "title": "Aprenda a expressar decisões com base em comparações",
        "intro": ["", ""]
      },
      "learn-how-to-use-modal-verbs": {
        "title": "Aprenda a usar os verbos modais",
        "intro": ["", ""]
      },
      "learn-how-to-manage-a-conversation": {
        "title": "Aprenda a gerenciar uma conversa",
        "intro": ["", ""]
      },
      "learn-how-to-clarify-misunderstandings": {
        "title": "Aprenda a esclarecer mal-entendidos",
        "intro": ["", ""]
      },
      "learn-about-speculation-and-requests": {
        "title": "Aprenda sobre especulação e solicitações",
        "intro": ["", ""]
      },
      "learn-about-adverbial-phrases": {
        "title": "Aprenda sobre os expressões adverbiais",
        "intro": ["", ""]
      },
      "learn-how-to-use-adjectives-in-conversations": {
        "title": "Aprenda a usar adjetivos em conversas",
        "intro": ["", ""]
      },
      "learn-determiners-and-advanced-use-of-articles": {
        "title": "Aprenda determinantes e o uso avançado de artigos",
        "intro": ["", ""]
      },
      "learn-how-to-use-reported-speech": {
        "title": "Aprenda a usar o discurso indireto",
        "intro": ["", ""]
      },
      "learn-how-to-use-prepositions-according-to-context": {
        "title": "Aprenda a usar pré-posições de acordo com o contexto",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-numbers-with-a-coworker": {
        "title": "Aprenda a falar sobre números com um colega de trabalho",
        "intro": ["", ""]
      },
      "learn-common-phrasal-verbs-and-idioms": {
        "title": "Aprenda expressões verbais e expressões idiomáticas comuns",
        "intro": ["", ""]
      }
    }
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Aumente o nível de suas habilidades criativas de resolução de problemas com essas tarefas de programação gratuitas da biblioteca clássica do Rosetta Code.",
      "Esses desafios podem ser difíceis, mas levarão sua lógica de algoritmos a novos patamares.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Atributo: Rosetta Code</a>"
    ],
    "blocks": {
      "rosetta-code-challenges": {
        "title": "Desafios do Rosetta Code",
        "intro": ["Estes são os desafios para o Rosetta Code."]
      }
    }
  },
  "front-end-development": {
    "title": "Desenvolvimento de front-end",
    "intro": ["placeholder"],
    "blocks": {
      "learn-basic-html-by-building-a-recipe-page": {
        "title": "Aprenda HTML básico criando uma página de receitas",
        "intro": ["", ""]
      },
      "lab-recipe-page": {
        "title": "Página de receita",
        "intro": [
          "Neste laboratório, você criará uma página da web com sua receita favorita."
        ]
      },
      "front-end-development-certification-exam": {
        "title": "Exame de certificação de desenvolvimento de front-end",
        "intro": ["", ""]
      },
      "workshop-blog-page": {
        "title": "Build a Cat Blog Page",
        "intro": [
          "In this workshop, you will learn how to build an HTML only blog page using semantic elements including the main, nav, article and footer elements."
        ]
      }
    }
  },
  "misc-text": {
    "certification": "Certificação {{cert}}",
    "browse-other": "Navegue por nossas outras certificações gratuitas\n(recomendamos fazer isto em sequência)",
    "courses": "Cursos",
    "steps": "Passos",
    "expand": "Expandir o curso",
    "collapse": "Recolher o curso",
    "legacy-header": "Cursos anteriores",
    "legacy-desc": "Estes cursos não fazem mais parte do caminho de certificação, mas ainda estão disponíveis para você continuar aprendendo.",
    "legacy-go-back": "Vá para a versão atual do currículo.",
    "course-maintenance": "Estes cursos estão passando por manutenção. Se eles não estiverem funcionando, você pode aprender como executá-los localmente em <0>https://www.freecodecamp.org/portuguese/news/curso-de-bancos-de-dados-relacionais-como-aprender-sql-no-vscode-usando-o-docker-e-o-freecodecamp/</0>.",
    "course-disabling-soon": "A versão para o navegador desses cursos será temporariamente desativada em breve e suas máquinas virtuais serão excluídas. Qualquer progresso em suas máquinas virtuais será perdido. Se você tiver quaisquer arquivos que quiser neles, deve salvá-los no seu computador. Pedimos desculpas por qualquer inconveniente. Esperamos ter uma versão melhorada desses cursos para o navegador novamente nas próximas semanas.",
    "course-disabled": "Estes cursos estão temporariamente indisponíveis para serem executados no navegador. Pedimos desculpas por qualquer inconveniência. Você pode aprender a executá-los localmente em <0>https://www.freecodecamp. rg/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. Esperamos ter uma versão para o navegador melhorada disponível novamente em breve.",
    "run-locally": "Por enquanto, recomendamos rodar os cursos localmente em seu computador. Você pode aprender a fazer isso em <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "O progresso não será salvo em sua conta do freeCodeCamp quando executá-los localmente.",
    "go-back-to-learn": "Voltar à versão estável do currículo.",
    "read-database-cert-article": "Leia esta publicação no fórum antes de prosseguir.",
    "enable-cookies": "Você deve habilitar cookies de terceiros antes de iniciar.",
    "english-only": "Os cursos desta seção estão disponíveis apenas em inglês. Neste momento, só podemos traduzir os títulos e as introduções, não as próprias lições.",
    "exam-english-only": "Observe que o exame de certificação está atualmente disponível apenas em inglês. O restante dos cursos está disponível em alguns idiomas."
  }
}
