{
  "responsive-web-design": {
    "title": "Desafios do design responsivo para a web legado",
    "intro": [
      "Nessa certificação de Design responsivo para a web, você aprenderá as linguagens que os desenvolvedores usam para construir sites: HTML (Linguagem de Marcação de Hipertexto) para o conteúdo e CSS (Folha de Estilo em Cascata) para o design.",
      "Primeiro, você vai construir um aplicativo de fotos de gato para aprender o básico de HTML e CSS. Mais tarde, você aprenderá técnicas modernas como variáveis CSS construindo um pinguim, e melhores práticas de acessibilidade criando um formulário web.",
      "Finalmente, você vai aprender a fazer páginas web que respondem a diferentes tamanhos de telas construindo um card do Twitter com Flexbox, e um layout complexo de blog com o CSS Grid."
    ],
    "note": "Observação: algumas extensões de navegador, como bloqueadores de anúncios e extensões de modo escuro podem interferir nos testes. Se você tiver problemas, recomendamos desabilitar extensões que modifiquem o conteúdo ou o layout das páginas durante o curso."
  },
  "2022/responsive-web-design": {
    "title": "Design responsivo para a web",
    "intro": [
      "Nessa certificação de Design responsivo para a web, você aprenderá as linguagens que os desenvolvedores usam para construir sites: HTML (Linguagem de Marcação de Hipertexto) para o conteúdo e CSS (Folha de Estilo em Cascata) para o design.",
      "Primeiro, você vai construir um aplicativo de fotos de gato para aprender o básico de HTML e CSS. Mais tarde, você aprenderá técnicas modernas como variáveis CSS construindo um pinguim, e melhores práticas de acessibilidade criando um site de questionário.",
      "Finalmente, você vai aprender a fazer páginas web que respondem a diferentes tamanhos de telas construindo uma galeria de fotos com o Flexbox, e um layout de artigo de revista com o CSS Grid."
    ],
    "note": "Observação: algumas extensões de navegador, como bloqueadores de anúncios e extensões de modo escuro podem interferir nos testes. Se você tiver problemas, recomendamos desabilitar extensões que modifiquem o conteúdo ou o layout das páginas durante o curso."
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Algoritmos e estrutura de dados em JavaScript legado",
    "intro": [
      "Enquanto o HTML e o CSS controlam o conteúdo e o estilo de uma página, o JavaScript é usado para torná-lo interativo. Na certificação de Algoritmos e Estruturas de Dados em JavaScript, você aprenderá os fundamentos do JavaScript, incluindo variáveis, arrays, objetos, laços e funções.",
      "Assim que souber os fundamentos abaixo, você aplicará esse conhecimento, criando algoritmos para manipular strings, fatorar números e até mesmo calcular a órbita da Estação Espacial Internacional.",
      "Durante o processo, você também aprenderá dois estilos ou paradigmas de programação importantes: a Programação Orientada a Objetos (POO) e a Programação Funcional (PF)."
    ],
    "note": "Observação: algumas extensões de navegador, como bloqueadores de anúncios e bloqueadores de scripts, podem interferir nos testes. Se você tiver problemas, recomendamos desabilitar extensões que modifiquem ou bloqueiem o conteúdo das páginas durante o curso."
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "Algoritmos em JavaScript e Estruturas de Dados",
    "intro": [
      "Desenvolvedores usam HTML e CSS para controlar os componentes e estilizar a página. Eles também usam o JavaScript para tornar essa página interativa.",
      "Neste certificado de Algoritmos e estruturas de dados em JavaScript, você aprenderá os fundamentos de JavaScript como variáveis, arrays, objetos, laços, funções, o DOM e mais.",
      "Você também aprenderá sobre Programação Orientada a Objetos (POO), Programação Funcional, pensamento algorítmico, como trabalhar com armazenamento local e como buscar dados usando uma API."
    ],
    "note": "Observação: algumas extensões de navegadores, como bloqueadores de anúncios e scripts, podem interferir com os testes. Se você tiver problemas, recomendamos desabilitar as funções de bloqueio de conteúdos de páginas durante o curso."
  },
  "front-end-development-libraries": {
    "title": "Bibliotecas de desenvolvimento em front-end",
    "intro": [
      "Agora que você está familiarizado com HTML, CSS e JavaScript, melhore suas habilidades aprendendo algumas das bibliotecas front-end mais populares do setor.",
      "Na certificação de bibliotecas de desenvolvimento em front-end, você aprenderá a estilizar seu site rapidamente com Bootstrap. Você também aprenderá a adicionar a lógica aos seus estilos CSS e a ampliá-los com Sass.",
      "Mais tarde, você construirá um carrinho de compras e outras aplicações para aprender a criar Aplicativos de Página Única (Single Page Applications - SPA) poderosos com React e Redux."
    ],
    "note": ""
  },
  "data-visualization": {
    "title": "Visualização de dados",
    "intro": [
      "Os dados estão ao nosso redor, mas isso não quer dizer muita coisa se eles não tiverem forma ou contexto.",
      "Na certificação de visualização de dados, você criará tabelas, gráficos e mapas para apresentar diferentes tipos de dados com a biblioteca D3.js.",
      "Você também aprenderá sobre JSON (JavaScript Object Notation) e sobre como trabalhar com dados on-line usando uma API (Application Programming Interface)."
    ],
    "note": ""
  },
  "relational-database": {
    "title": "Bancos de dados relacionais",
    "intro": [
      "Para estes cursos, você usará ferramentas e software reais de desenvolvedor, incluindo o VS Code, PostgreSQL e a linha de comando do Linux/Unix para completar tutoriais interativos e criar projetos.",
      "Estes cursos começam com comandos básicos do Bash. Usando o terminal, você aprenderá tudo, de navegar e manipular um sistema de arquivos e fazer scripts no Bash, até usos mais avançados.",
      "Depois, você aprenderá a criar e trabalhar com bancos de dados relacionados usando o PostgreSQL, um sistema de gerenciamento de banco de dados, e o SQL, a linguagem destes bancos de dados.",
      "Por fim, você aprenderá o Git, o sistema de controle de versão, uma ferramenta essencial de cada desenvolvedor."
    ]
  },
  "back-end-development-and-apis": {
    "title": "APIs e desenvolvimento de back-end",
    "intro": [
      "Até esse ponto, você usou JavaScript apenas no front-end para adicionar interatividade a uma página, resolver desafios de algoritmos ou construir uma SPA. Mas o JavaScript também pode ser usado no back-end, ou servidor, para construir aplicações web inteiras.",
      "Hoje em dia, uma das formas populares de se criar aplicações é através do uso de microsserviços, que são pequenas aplicações modulares que trabalham em conjunto para formar uma aplicação maior inteira.",
      "Na certificação de APIs e desenvolvimento de back-end, você aprenderá a escrever aplicações de back-end com o Node.js e o npm. Você também vai construir aplicações web com o framework Express e criará um microsserviço de localização de pessoas com o MongoDB e com a biblioteca Mongoose."
    ],
    "note": ""
  },
  "quality-assurance": {
    "title": "Garantia de qualidade",
    "intro": [
      "À medida que seus programas ou aplicativos da web se tornam mais complexos, você vai querer testá-los para garantir que novas alterações não quebrem as funcionalidades originais.",
      "Na certificação de garantia de qualidade, você aprenderá a escrever testes com o Chai para garantir que suas aplicações funcionem da maneira que você espera.",
      "Em seguida, você vai construir uma aplicação de chat para aprender conceitos avançados de Node e Express. Você também usará o Pug como um modelo de motor, o Passport, para autenticação, e o Socket.io, para comunicação em tempo real entre o servidor e os clientes conectados."
    ],
    "note": ""
  },
  "scientific-computing-with-python": {
    "title": "Computação Científica com Python",
    "intro": [
      "O currículo de Computação Científica com Python equipará você com as habilidades para analizar e manipular dados usando o Python, uma linguagem de programação poderosa e versátil. Você aprenderá conceitos-chave como estrutura de dados, algoritmos, Programação Orientada a Objetos e como realizar cálculos complexos usando uma variedade de ferramentas.",
      "Este curso abrangente guiará você através dos fundamentos da computação científica, incluindo estrutura de dados e algoritmos."
    ],
    "note": ""
  },
  "data-analysis-with-python": {
    "title": "Análise de dados com Python",
    "intro": [
      "A análise de dados já existe há um bom tempo. Porém, até poucos anos atrás, os desenvolvedores praticavam-na apenas usando ferramentas caras e de código fechado, como o Tableau. Recentemente, Python, SQL e outras bibliotecas abertas começaram a mudar a análise de dados para sempre.",
      "Na certificação em análise de dados com Python, você aprenderá os fundamentos da análise de dados com Python. No final desta certificação, você saberá ler dados de fontes como CSVs e SQL, além de usar bibliotecas como Numpy, Pandas, Matplolib e Seaborn para processar e visualizar dados."
    ],
    "note": ""
  },
  "information-security": {
    "title": "Segurança da informação",
    "intro": [
      "Com tudo o que fazemos on-line, há uma grande quantidade de informações sensíveis em risco: endereços de e-mail, senhas, números de telefone e muito mais.",
      "Com o certificado de segurança da informação, você criará um aplicativo web seguro com o HelmetJS para aprender os fundamentos de proteção de informações on-line.",
      "Você também vai construir um cliente TCP, um Nmap e um scanner de portas em Python. Isso ajudará você a aprender o básico do teste de intrusão — um componente importante de boa segurança da informação."
    ],
    "note": ""
  },
  "machine-learning-with-python": {
    "title": "Aprendizado de máquina com Python",
    "intro": [
      "A aprendizagem de máquina tem várias aplicações práticas que você pode usar em seus projetos ou no trabalho.",
      "Na certificação de aprendizagem de máquina com Python, você usará o framework chamado TensorFlow para construir várias redes neurais e explorar técnicas mais avançadas, como o processamento de linguagem natural e a aprendizagem por reforço.",
      "Você também vai mergulhar em redes neurais e aprender os princípios por trás de como as redes neurais profundas, recorrentes e convolucionais funcionam."
    ],
    "note": ""
  },
  "college-algebra-with-python": {
    "title": "Álgebra para o ensino superior com Python",
    "intro": [
      "Este curso foi projetado como um curso universitário de um semestre. Ele consiste em vídeos instrutivos, com os notebooks do Google Colaboratory para acompanhar os desafios e projetos de modo interativo.",
      "À medida que você passa por cada parte do curso em sequência, você vai entender a álgebra e como escrever códigos em Python para resolver problemas de álgebra.",
      "Ao longo deste curso, você também criará seu próprio notebook de álgebra no Colaboratory, que poderá usar como uma calculadora personalizada. Este curso (e o código que você escreve aqui) dará a você a base para uma compreensão mais profunda da matemática e da ciência de dados."
    ],
    "note": ""
  },
  "python-for-everybody": {
    "title": "Python para todos legado",
    "intro": [
      "O Python é uma das linguagens de programação mais populares e flexíveis atualmente. Você pode usá-la para tudo, da programação básica até a aprendizagem de máquina."
    ],
    "note": ""
  },
  "coding-interview-prep": {
    "title": "Preparação para entrevistas de programação",
    "intro": [
      "Se estiver procurando exercícios gratuitos de programação para se preparar para sua próxima entrevista de emprego, nós temos o que você precisa.",
      "Esta seção contém dezenas de desafios de programação que testam seu conhecimento de algoritmos, estruturas de dados e matemática. Ela também possui vários projetos adicionais, que você pode usar para fortalecer suas habilidades ou adicionar ao seu portfólio.",
      "Este trabalho incorpora material da <a href=\"https://www.wikipedia.org/\" target=\"_blank\">Wikipedia</a>, que está licenciada sob a <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\" target=\"_blank\">Creative Commons Attribution-ShareAlike License 4.0</a>. O conteúdo original pode ter sido modificado e adaptado. Para a versão inalterada e detalhes adicionais, veja a página original na <a href=\"https://www.wikipedia.org/\" target\"_blank\">Wikipedia</a>."
    ]
  },
  "the-odin-project": {
    "title": "The Odin Project - freeCodeCamp Remix",
    "intro": [
      "O Odin Project foi criado em 2013 por um único desenvolvedor, Erik Trautman. Ao longo dos anos, uma comunidade de código aberto surgiu para manter e expandir o projeto.",
      "O freeCodeCamp expandiu o currículo de código aberto para ser executado de maneira interativa no navegador, com testes para avaliar seu código e garantir que você tenha entendido os conceitos principais.",
      "Se você quiser a experiência original de configurar todo o Odin Project para ser executado no seu computador local, você pode conferir o Odin Project original no <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>site do projeto</a>. Agradecemos imensamente à comunidade do Odin Project por continuar a manter esse valioso recurso de aprendizagem para desenvolvedores de todo o mundo.",
      "Este curso não é oficial e não endossado pelo Odin Project. Foram feitas alterações no conteúdo curricular do Odin Project e todo o material instrucional do curso está licenciado sob a <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; The Odin Project</a>",
      "Este curso inclui conteúdo de <a href='https://javascript.info/' target='_blank' rel='noopener noreferrer nofollow'>JavaScript.info</a>, que está sob a licença <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>."
    ]
  },
  "project-euler": {
    "title": "Projeto Euler",
    "intro": [
      "Complete os desafios de programação abaixo, diretamente dos grandes arquivos do Projeto Euler. Isso fortalecerá seu conhecimento de algoritmos e de matemática.",
      "Esses problemas variam em dificuldade e, para muitos, a experiência é uma aprendizagem em sequência indutiva. Ou seja, ao resolver um problema, você será exposto a um novo conceito que permite a você resolver um problema que antes era inacessível. Você consegue concluir todos eles?"
    ]
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "Fundamentação Grátis de C# com a Certificação Microsoft",
    "intro": [
      "Este curso oferece uma introdução abrangente à programação em C#, cobrindo seus conceitos principais, sintaxe e aplicação prática em desenvolvimento de software.",
      "Através de exercícios e projetos práticos, você aprenderá os fundamentos de C#, incluindo variáveis, tipos de dados, estruturas de controle e princípios de programação orientada a objetos.",
      "Ao final deste curso, você terá obtido as habilidades práticas e conhecimentos necessários para programar em C# com confiança para criar aplicações."
    ],
    "note": "Cada seção abaixo tem um troféu associado a ela. Você deve obtê-lo na plataforma Microsoft Learn. Depois de ganhar cada troféu, você precisa verificá-lo no freeCodeCamp. Só então você poderá se qualificar para o exame de certificação."
  },
  "a2-english-for-developers": {
    "title": "Certificação Inglês A2 para Desenvolvedores (Beta)",
    "intro": [
      "Neste currículo de inglês para desenvolvedores, você aprenderá o essencial da comunicação em inglês. O currículo seguirá o nível A2 do Quadro de Referência Comum Europeu (CEFR). Nosso foco é no vocabulário, particularmente útil para desenvolvedores.",
      "A primeira metade do currículo ajudará você a se sentir confortável com a gramática e o uso do inglês. Isso dará a você diversas oportunidades de praticar. Você aprenderá o básico como se apresentar, ter conversas mais simples e discutir seu trabalho.",
      "Na segunda metade, você praticará vocabulário específico para o desenvolvimento de software. Você aprenderá como descrever código, como discutir tendências em tecnologia e como participar de reuniões de equipe.",
      "O currículo inteiro do nível A2 inclui 105 diálogos diferentes. Cada um é projetado para construir seu vocabulário e aumentar sua confiança ao falar em um ambiente profissional da área de tecnologia."
    ]
  },
  "b1-english-for-developers": {
    "title": "Certificação B1 de Inglês para Desenvolvedores (Beta)",
    "intro": [
      "Neste Currículo de Inglês para Desenvolvedores, você aprenderá o essencial da comunicação em inglês. Isso seguirá o nível B1 do Quadro Europeu Comum de Referência (CEFR). E nós nos concentramos no vocabulário que é particularmente útil para os desenvolvedores.",
      "Isso ajudará você a fortalecer suas habilidades fundamentais enquanto introduz gramática e uso mais complexos. Você aprenderá como descrever lugares e coisas, compartilhar experiências passadas e usar com confiança tempos como Presente Perfeito e Futuro. Estratégias práticas de comunicação também estão incluídas, como gerenciar conversas, expressar opiniões e construir acordo ou discordância em discussões.",
      "Você também se concentrará em aplicar essas habilidades em contextos profissionais e técnicos. Você praticará vocabulário e frases essenciais para desenvolvedores, como descrever código, participar de reuniões stand-up e discutir tendências tecnológicas. Tópicos avançados incluem condicionais, estruturas comparativas e gerenciamento de conversas, para que você possa se preparar para interações no mundo real na indústria de tecnologia.",
      "Todo este currículo de nível B1 inclui 73 diálogos diferentes. Cada um é projetado para construir seu vocabulário e aumentar sua confiança ao falar em um ambiente profissional de tecnologia."
    ]
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Aumente o nível de suas habilidades criativas de resolução de problemas com essas tarefas de programação gratuitas da biblioteca clássica do Rosetta Code.",
      "Esses desafios podem ser difíceis, mas levarão sua lógica de algoritmos a novos patamares.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Atributo: Rosetta Code</a>"
    ]
  },
  "full-stack-developer": {
    "title": "Currículo de Desenvolvedor Full Stack Certificado ",
    "intro": [
      "Este curso oferece um caminho abrangente para se tornar um Desenvolvedor Full Stack Certificado, cobrindo todas as tecnologias essenciais necessárias para desenvolver aplicações web modernas e escaláveis do início ao fim.",
      "Por meio de uma combinação de lições interativas, exercícios de codificação e projetos do mundo real, você dominará o desenvolvimento frontend e backend. Você trabalhará com HTML, CSS e JavaScript para criar interfaces de usuário responsivas, explorará React e TypeScript para aplicações web avançadas e aprenderá a gerenciar dados com bancos de dados relacionais - no backend, você usará Git, Npm, Node.js e Python para criar soluções poderosas do lado do servidor.",
      "Ao final deste curso, você terá as habilidades práticas e a experiência para desenvolver aplicações web completas com confiança, preparando-se para uma carreira de sucesso como Desenvolvedor Full Stack.",
      "Esta certificação vai exigir uma quantidade substancial de tempo e esforço para ser concluída. Se você começar agora, poderá estar pronto para iniciar o material restante e o exame final quando o lançarmos nos próximos meses."
    ],
    "chapters": {
      "html": "HTML",
      "css": "CSS",
      "javascript": "JavaScript",
      "frontend-libraries": "Bibliotecas Front End",
      "relational-databases": "Bancos de Dados Relacionais",
      "backend-javascript": "JavaScript Backend",
      "python": "Python",
      "career": "Carreira"
    },
    "modules": {
      "basic-html": "HTML Básico",
      "semantic-html": "HTML Semântico",
      "html-forms-and-tables": "Formulários e Tabelas",
      "html-and-accessibility": "Acessibilidade",
      "review-html": "Revisão do HTML",
      "exam-html": "Exame de HTML",
      "computer-basics": "Fundamentos do Computador",
      "basic-css": "CSS Básico",
      "design-for-developers": "Design",
      "absolute-and-relative-units": "Unidades Absolutas e Relativas",
      "pseudo-classes-and-elements": "Pseudoclasses e Pseudoelementos",
      "css-colors": "Cores",
      "styling-forms": "Estilização de Formulários",
      "css-box-model": "O Modelo de Caixa",
      "css-flexbox": "Flexbox",
      "css-typography": "Tipografia",
      "css-and-accessibility": "Acessibilidade",
      "attribute-selectors": "Seletores de Atributo",
      "css-positioning": "Posicionamento",
      "responsive-design": "Design Responsivo",
      "css-variables": "Variáveis",
      "css-grid": "Grid",
      "css-animations": "Animações",
      "review-css": "Revisão de CSS",
      "exam-css": "Exame de CSS",
      "code-editors": "Editores de Código",
      "javascript-variables-and-strings": "Variáveis e Strings",
      "javascript-booleans-and-numbers": "Booleanos e Números",
      "javascript-functions": "Funções",
      "javascript-arrays": "Arrays",
      "javascript-objects": "Objetos",
      "javascript-loops": "Laços de Repetição",
      "review-javascript-fundamentals": "Revisão dos Fundamentos do JavaScript",
      "higher-order-functions-and-callbacks": "Funções de Ordem Superior e Callbacks",
      "dom-manipulation-and-events": "Manipulação do DOM e Eventos",
      "js-a11y": "JavaScript e Acessibilidade",
      "debugging-javascript": "Depuração",
      "basic-regex": "Expressões Regulares Básicas",
      "form-validation": "Validação de Formulários",
      "javascript-dates": "Datas",
      "audio-and-video-events": "Eventos de Áudio e Vídeo",
      "maps-and-sets": "Maps e Sets",
      "localstorage-and-crud-operations": "Armazenamento local e Operações CRUD",
      "classes-and-the-this-keyword": "Classes",
      "recursion": "Recursão",
      "functional-programming": "Programação Funcional",
      "asynchronous-javascript": "JavaScript Assíncrono",
      "review-javascript": "Revisão de JavaScript",
      "exam-javascript": "Exame de JavaScript",
      "react-fundamentals": "Fundamentos do React",
      "react-state-hooks-and-routing": "Estado, Hooks e Roteamento no React",
      "performance": "Desempenho",
      "testing": "Testes",
      "css-libraries-and-frameworks": "Bibliotecas e Frameworks do CSS",
      "data-visualization": "Visualização de dados e D3",
      "typescript-fundamentals": "Fundamentos do TypeScript",
      "review-front-end-libraries": "Revisão de Bibliotecas Front-End",
      "exam-front-end-libraries": "Exame de Bibliotecas Front-End",
      "python-basics": "Noções básicas de Python",
      "python-loops-and-sequences": "Laços e Sequências",
      "python-dictionaries-and-sets": "Dicionários e Conjuntos",
      "python-error-handling": "Tratamento de Erros",
      "python-classes-and-objects": "Classes e Objetos",
      "python-object-oriented-programming": "Programação Orientada a Objetos (OOP)",
      "python-linear-data-structures": "Estruturas de Dados Lineares",
      "python-algorithms": "Algoritmos",
      "python-graphs-and-trees": "Grafos e Árvores",
      "python-dynamic-programming": "Programação Dinâmica",
      "review-python": "Revisão de Python",
      "exam-python": "Exame de Python",
      "bash-fundamentals": "Fundamentos de Bash",
      "sql-and-postgresql": "SQL and PostgreSQL",
      "bash-scripting": "Scripts Bash",
      "sql-and-bash": "SQL e Bash",
      "git": "Git",
      "review-relational-databases": "Relational Databases Review",
      "exam-relational-databases": "Relational Databases Exam",
      "introduction-to-nodejs": "Introdução a Node.js",
      "nodejs-core-libraries": "Bibliotecas Principais do Node.js",
      "node-package-manager": "Node Package Manager",
      "http-and-the-web-standards-model": "HTTP e o Modelo de Padrões Web",
      "rest-api-and-web-services": "API REST e Serviços Web",
      "introduction-to-express": "Introdução ao Express",
      "express-middleware": "Middleware do Express",
      "error-handling-in-express": "Tratamento de Erros no Express",
      "websockets": "WebSockets",
      "node-and-sql": "Node e SQL",
      "security-and-privacy": "Segurança e Privacidade",
      "authentication": "Autenticação",
      "tooling-and-deployment": "Ferramentas e Implantação",
      "how-to-get-a-developer-job": "Como Conseguir um Emprego de Desenvolvedor",
      "capstone-project": "Projeto Final",
      "certified-full-stack-developer-exam": "Exame de Desenvolvedor Full Stack Certificado"
    },
    "module-intros": {
      "data-visualization": {
        "note": "Disponível no Inverno de 2025",
        "intro": [
          "Neste módulo, você conhecerá a visualização de dados e aprenderá a trabalhar com a biblioteca D3."
        ]
      },
      "typescript-fundamentals": {
        "note": "Próximo Lançamento: Outono de 2025",
        "intro": [
          "Neste módulo, você será apresentado ao TypeScript, que é um superset do JavaScript que permite adicionar tipagem estática ao seu código JavaScript. Você realizará vários workshops e laboratórios que darão a você prática trabalhando com genéricos, narrowing de tipos, TSX e mais. Depois, testará seu conhecimento em fundamentos do TypeScript com um pequeno questionário."
        ]
      },
      "python-classes-and-objects": {
        "note": "Próximo Lançamento: Inverno de 2025",
        "intro": [
          "Neste módulo, você aprenderá a trabalhar com classes, métodos, atributos e propriedades. Em seguida, você realizará workshops e laboratórios para praticar esses conceitos e fará um breve questionário para testar seu conhecimento."
        ]
      },
      "python-object-oriented-programming": {
        "note": "Próximo Lançamento: Inverno de 2025",
        "intro": [
          "Neste módulo, você aprenderá sobre conceitos de programação orientada a objetos, como encapsulamento, herança, polimorfismo e mais. Você realizará workshops e laboratórios para praticar esses conceitos e fará um breve questionário para testar seu conhecimento."
        ]
      },
      "python-linear-data-structures": {
        "note": "Próximo Lançamento: Inverno de 2025",
        "intro": [
          "Neste módulo, você aprenderá sobre estruturas de dados, incluindo pilhas, filas, listas vinculadas, e mais. Você criará um workshop e laboratório para praticar esses conceitos e fará um breve questionário para testar seu conhecimento."
        ]
      },
      "python-algorithms": {
        "note": "Próximo Lançamento: Inverno de 2025",
        "intro": [
          "Neste módulo, você aprender sobre algoritmos comuns, incluindo busca binária, merge sort, selection sort, e mais. Você realizará workshops e laboratórios para praticar esses conceitos e fará um breve questionário para testar seu conhecimento."
        ]
      },
      "python-graphs-and-trees": {
        "note": "Próximo Lançamento: Inverno de 2025",
        "intro": [
          "Neste módulo, você aprenderá sobre gráficos na ciência da computação, bem como listas de adjacência, árvores, tries, e mais. Você realizará workshops e laboratórios para praticar esses conceitos e fará um breve questionário para testar seu conhecimento."
        ]
      },
      "python-dynamic-programming": {
        "note": "Próximo Lançamento: Inverno de 2025",
        "intro": [
          "Neste módulo, você vai aprender sobre programação dinâmica e praticar estes conceitos construindo um laboratório de sequência de Fibonacci. Em seguida, você fará um curto questionário para testar seu conhecimento."
        ]
      },
      "bash-fundamentals": {
        "note": "Próximo Lançamento: Inverno de 2025",
        "intro": [
          "Neste módulo, você aprenderá sobre a linha de comando e comandos Bash comuns. Em seguida, você praticará suas habilidades com um workshop e fará um curto quiz para testar seu conhecimento."
        ]
      },
      "sql-and-postgresql": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "bash-scripting": {
        "note": "Próximo Lançamento: Inverno de 2025",
        "intro": [
          "Neste módulo, você aprenderá sobre scripts Bash e praticará essas habilidades criando cinco programas. Então, você poderá testar seus conhecimentos destes conceitos fazendo um breve questionário."
        ]
      },
      "sql-and-bash": {
        "note": "Próximo Lançamento: Inverno de 2025",
        "intro": [
          "Neste módulo, você aprenderá sobre normalização, injeção de SQL e o problema N+1. Então, você irá praticar trabalhando com SQL e Bash construindo vários workshops e laboratórios. Depois, você poderá testar seus conhecimentos desses conceitos fazendo um breve questionário."
        ]
      },
      "git": {
        "note": "Próximo Lançamento: Inverno de 2025",
        "intro": [
          "Neste módulo, você aprenderá a usar Git, Nano e GitHub. Em seguida, você praticará trabalhando com Git construindo vários workshops e laboratórios. Você poderá testar seus conhecimentos destes conceitos fazendo um breve questionário."
        ]
      },
      "introduction-to-nodejs": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você será apresentado ao Node.js, que é um ambiente de execução JavaScript que permite construir aplicações de backend usando JavaScript. Você vai praticar conceitos fundamentais criando um pequeno workshop e testará seu conhecimento com um breve questionário."
        ]
      },
      "nodejs-core-libraries": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você aprenderá sobre bibliotecas Node.js core comuns, incluindo fs, os, path e mais. Em seguida, você praticará o que aprendeu através de workshops e laboratórios e testará seus conhecimentos através de um breve questionário."
        ]
      },
      "node-package-manager": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você será apresentado ao Node Package Manager, que os desenvolvedores usam para gerenciar dependências de projetos e scripts. Então você praticará o que aprendeu através de workshops e laboratórios e testará seu conhecimento com um breve questionário."
        ]
      },
      "http-and-the-web-standards-model": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você aprenderá sobre HTTP (Protocolo de Transferência de Hipertexto) e outros conceitos importantes, incluindo o modelo de resposta a pedidos, códigos de resposta comuns, DNS, TCP/IP, e mais. Em seguida, você praticará o que aprendeu através de um workshop para construir seu próprio servidor web e testará seu conhecimento com um breve questionário."
        ]
      },
      "rest-api-and-web-services": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você aprenderá sobre a API REST (Interface de Programação de Aplicações de Transferência de Estado Representacional) e como funcionam os microserviços. Em seguida, você fará um breve questionário para testar seu conhecimento."
        ]
      },
      "introduction-to-express": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você será apresentado ao Express.js, que é um framework usado para construir APIs RESTful. Em seguida, você praticará suas habilidades através de workshops e laboratórios e testará seu conhecimento com um breve questionário."
        ]
      },
      "express-middleware": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você aprenderá sobre middleware no Express.js, que é usado para lidar com pedidos e respostas entre o cliente e o servidor. Em seguida, você praticará suas habilidades através de um workshop e laboratório e testará seu conhecimento com um breve questionário."
        ]
      },
      "error-handling-in-express": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você aprenderá sobre como manejo de erros, depuração e verificações de saúde funcionam no Express.js. Em seguida, você praticará o que aprendeu em um laboratório e testará seu conhecimento com um breve questionário."
        ]
      },
      "websockets": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você será apresentado aos WebSockets, que são um protocolo utilizado para comunicação em tempo real com o cliente e o servidor. Em seguida, você praticará o que aprendeu em laboratórios e workshops e testará seu conhecimento com um breve questionário."
        ]
      },
      "node-and-sql": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você praticará criando aplicações com Node e SQL. Em seguida, você fará um breve questionário para testar seu conhecimento."
        ]
      },
      "security-and-privacy": {
        "note": "Próximo Lançamento: Outono de 2025",
        "intro": [
          "Neste módulo, você aprenderá sobre as diferenças entre segurança e privacidade, assim como outros conceitos, incluindo CSPs, Políticas de Permissões, PII, trabalho com CORS, e mais. Em seguida, você fará um breve questionário para testar seu conhecimento."
        ]
      },
      "authentication": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você aprenderá sobre como funciona a autenticação em aplicações web junto com outros conceitos importantes, incluindo JWTs, CSRFs, Passport, Helmet, criptografia e encriptação, e mais. Em seguida, você praticará o que aprendeu em laboratórios e workshops e testará seu conhecimento com um breve questionário."
        ]
      },
      "tooling-and-deployment": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, você aprenderá sobre ferramentas comuns usadas na indústria para implantar suas aplicações full stack. Em seguida, você fará um breve questionário para testar seu conhecimento."
        ]
      },
      "how-to-get-a-developer-job": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Neste módulo, Quincy Larson (Fundador e professor do freeCodeCamp) falará sobre estratégias que você pode usar para se preparar para conseguir um emprego como desenvolvedor. Quincy abordará assuntos importantes como currículos, portfólios, pesquisa de mercado, preparação para entrevistas técnicas, e muito mais."
        ]
      },
      "capstone-project": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Esta será sua oportunidade de criar uma aplicação full stack abrangendo o que você aprendeu ao longo desta certificação."
        ]
      },
      "certified-full-stack-developer-exam": {
        "note": "Próximo Lançamento: Final de 2026",
        "intro": [
          "Este será um exame de 90 questões testando o que você aprendeu ao longo desta certificação."
        ]
      }
    }
  },
  "javascript-v9": {
    "title": "JavaScript Certification",
    "intro": [
      "This course teaches you core JavaScript programming concepts such as working with variables, functions, objects, arrays, and control flow. You'll also learn how to manipulate the DOM, handle events, and apply techniques like asynchronous programming, functional programming, and accessibility best practices.",
      "To qualify for the exam, you must complete the following projects:",
      "- Build a Markdown to HTML Converter",
      "- Build a Drum Machine",
      "- Build a Voting System",
      "- Build a Bank Account Management Program",
      "- Build a Weather App",
      "Pass the exam to earn your JavaScript Certification."
    ],
    "chapters": {
      "javascript": "JavaScript"
    },
    "modules": {
      "javascript-variables-and-strings": "Variables and Strings",
      "javascript-booleans-and-numbers": "Booleans and Numbers",
      "javascript-functions": "Functions",
      "javascript-arrays": "Arrays",
      "javascript-objects": "Objects",
      "javascript-loops": "Loops",
      "review-javascript-fundamentals": "JavaScript Fundamentals Review",
      "higher-order-functions-and-callbacks": "Higher Order Functions and Callbacks",
      "dom-manipulation-and-events": "DOM Manipulation and Events",
      "js-a11y": "JavaScript and Accessibility",
      "debugging-javascript": "Debugging",
      "basic-regex": "Basic Regex",
      "lab-markdown-to-html-converter": "Build a Markdown to HTML Converter",
      "form-validation": "Form Validation",
      "javascript-dates": "Dates",
      "audio-and-video-events": "Audio and Video Events",
      "lab-drum-machine": "Build a Drum Machine",
      "maps-and-sets": "Maps and Sets",
      "lab-voting-system": "Build a Voting System",
      "localstorage-and-crud-operations": "localStorage and CRUD Operations",
      "classes-and-the-this-keyword": "Classes",
      "lab-bank-account-manager": "Build a Bank Account Management Program",
      "recursion": "Recursion",
      "functional-programming": "Functional Programming",
      "asynchronous-javascript": "Asynchronous JavaScript",
      "lab-weather-app": "Build a Weather App",
      "review-javascript": "JavaScript Review",
      "javascript-certification-exam": "JavaScript Certification Exam"
    }
  },
  "front-end-development-libraries-v9": {
    "title": "Front End Development Libraries Certification",
    "intro": [
      "This course teaches you the libraries that developers use to build webpages: React, TypeScript, and more.",
      "To earn your Front End Development Libraries Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Front End Development Libraries Certification exam."
    ],
    "chapters": {
      "front-end-development-libraries": "Front End Development Libraries"
    },
    "modules": {
      "front-end-development-libraries-certification-exam": "Front End Development Libraries Certification Exam"
    }
  },
  "python-v9": {
    "title": "Python Certification",
    "intro": [
      "This course teaches you the fundamentals of Python programming.",
      "To earn your Python Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Python Certification exam."
    ],
    "chapters": {
      "python": "Python"
    },
    "modules": {
      "python-certification-exam": "Python Certification Exam"
    }
  },
  "relational-databases-v9": {
    "title": "Relational Databases Certification",
    "intro": [
      "This course teaches you the fundamentals of relational databases.",
      "To earn your Relational Databases Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Relational Databases Certification exam."
    ],
    "chapters": {
      "relational-databases": "Relational Databases"
    },
    "modules": {
      "relational-databases-certification-exam": "Relational Databases Certification Exam"
    }
  },
  "back-end-development-and-apis-v9": {
    "title": "Back End Development and APIs Certification",
    "intro": [
      "This course teaches you the fundamentals of back end development and APIs.",
      "To earn your Back End Development and APIs Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Back End Development and APIs Certification exam."
    ],
    "chapters": {
      "back-end-development-and-apis": "Back End Development and APIs"
    },
    "modules": {
      "back-end-development-and-apis-certification-exam": "Back End Development and APIs Certification Exam"
    }
  },
  "a1-professional-spanish": {
    "title": "Certificação de Espanhol Profissional A1 (Beta)",
    "note": "Esta certificação está atualmente em desenvolvimento ativo. Embora não haja uma certificação disponível no momento, em breve haverá. Enquanto isso, você pode explorar os cursos que criamos abaixo.",
    "intro": ["Introdução de Espaço Reservado"],
    "chapters": {
      "es-a1-chapter-welcome-to-a1-professional-spanish": "Bem-vindo ao A1 Espanhol Profissional",
      "es-a1-chapter-letters-and-sounds": "Letras e Sons",
      "es-a1-chapter-greetings-and-introductions": "Saudações e Apresentações"
    },
    "modules": {
      "es-a1-module-introduction-and-certification-overview": "Introdução e Visão Geral da Certificação",
      "es-a1-module-alphabet-accents-and-punctuation": "Alfabeto, Acentos e Pontuação",
      "es-a1-module-greetings-and-farewells": "Saudações e Despedidas",
      "es-a1-module-introducing-yourself": "Apresentando-se",
      "es-a1-module-first-questions": "Primeiras Perguntas"
    },
    "module-intros": {
      "es-a1-module-introduction-and-certification-overview": {
        "note": "Inverno de 2025",
        "intro": ["PLACEHOLDER: Escreva a introdução do módulo aqui."]
      },
      "es-a1-module-alphabet-accents-and-punctuation": {
        "note": "Inverno de 2025",
        "intro": ["PLACEHOLDER: Escreva a introdução do módulo aqui."]
      },
      "es-a1-module-greetings-and-farewells": {
        "note": "Inverno de 2025",
        "intro": ["PLACEHOLDER: Escreva a introdução do módulo aqui."]
      },
      "es-a1-module-introducing-yourself": {
        "note": "Disponível no Inverno de 2025",
        "intro": ["MARCADOR DE LUGAR: Escreva a introdução do módulo aqui."]
      },
      "es-a1-module-first-questions": {
        "note": "Disponível no Inverno de 2025",
        "intro": ["MARCADOR DE LUGAR: Escreva a introdução do módulo aqui."]
      }
    }
  },
  "responsive-web-design-v9": {
    "title": "Responsive Web Design Certification",
    "intro": [
      "This course teaches the fundamentals of HTML and CSS, including modern layout, design, accessibility, and responsive web development. You'll build practical projects and gain the skills to create professional, user-friendly webpages.",
      "To qualify for the exam, you must complete the following projects:",
      "- Build a Survey Form",
      "- Build a Page of Playing Cards",
      "- Build a Book Inventory App",
      "- Build a Technical Documentation Page",
      "- Build a Product Landing Page",
      "Pass the exam to earn your Responsive Web Design Certification."
    ],
    "chapters": {
      "html": "HTML",
      "css": "CSS",
      "responsive-web-design-certification-exam": "Responsive Web Design Certification Exam"
    },
    "modules": {
      "basic-html": "Basic HTML",
      "semantic-html": "Semantic HTML",
      "html-forms-and-tables": "Forms and Tables",
      "html-and-accessibility": "Accessibility",
      "review-html": "HTML Review",
      "computer-basics": "Computer Basics",
      "basic-css": "Basic CSS",
      "design-for-developers": "Design",
      "absolute-and-relative-units": "Absolute and Relative Units",
      "pseudo-classes-and-elements": "Pseudo Classes and Elements",
      "css-colors": "Colors",
      "styling-forms": "Styling Forms",
      "css-box-model": "The Box Model",
      "css-flexbox": "Flexbox",
      "css-typography": "Typography",
      "css-and-accessibility": "Accessibility",
      "attribute-selectors": "Attribute Selectors",
      "css-positioning": "Positioning",
      "responsive-design": "Responsive Design",
      "css-variables": "Variables",
      "css-grid": "Grid",
      "css-animations": "Animations",
      "review-css": "CSS Review",
      "lab-survey-form": "Build a Survey Form",
      "lab-page-of-playing-cards": "Build a Page of Playing Cards",
      "lab-book-inventory-app": "Build a Book Inventory App",
      "lab-technical-documentation-page": "Build a Technical Documentation Page",
      "lab-product-landing-page": "Build a Product Landing Page",
      "responsive-web-design-certification-exam": "Responsive Web Design Certification Exam"
    }
  },
  "a2-professional-spanish": {
    "title": "Certificação Profissional de Espanhol A2 (Beta)",
    "note": "Esta certificação está atualmente em desenvolvimento ativo. Embora não haja uma certificação disponível para esta seção no momento, uma estará disponível em breve. Enquanto isso, sinta-se à vontade para explorar os cursos que criamos abaixo.",
    "intro": ["Introdução ao Modelo"]
  },
  "a2-professional-chinese": {
    "title": "Certificação Profissional de Chinês A2 (Beta)",
    "note": "Esta certificação está atualmente em desenvolvimento ativo. Embora não haja uma certificação disponível nesta seção no momento, haverá uma disponível em breve. Enquanto isso, você está convidado a explorar os cursos que criamos abaixo.",
    "intro": ["Introdução ao Modelo"]
  },
  "a1-professional-chinese": {
    "title": "Certificação Profissional de Chinês A1 (Beta)",
    "note": "Esta certificação está atualmente em desenvolvimento ativo. Embora não haja uma certificação disponível no momento, em breve haverá. Enquanto isso, você pode explorar os cursos que criamos abaixo.",
    "intro": ["Introdução de Espaço Reservado"]
  },
  "basic-html": {
    "title": "HTML Básico",
    "summary": [
      "Aprenda a construir páginas web simples usando tags HTML para adicionar textos, imagens e links."
    ],
    "intro": ["Grande introdução para a página superblock."]
  },
  "semantic-html": {
    "title": "HTML Semântico",
    "summary": [
      "Descubra como escrever HTML mais limpo e significativo usando tags semânticas que melhoram a estrutura, a acessibilidade e o SEO."
    ],
    "intro": ["Grande introdução para a página superblock."]
  },
  "dev-playground": {
    "title": "Playground Dev",
    "intro": ["Playground para criar e testar desafios"]
  },
  "full-stack-open": {
    "title": "Full Stack Open",
    "intro": ["Uma boa introdução será adicionada aqui."],
    "chapters": {
      "part-0": "Fundamentos de Aplicativos Web",
      "part-1": "Introdução ao React",
      "part-2": "Comunicação com Servidores",
      "part-3": "Programando um Servidor com NodeJS e Express",
      "part-4": "Testando Servidores Express, Administração de Usuários",
      "part-5": "Testando Aplicativos React",
      "part-6": "Gerenciamento Avançado de Estado",
      "part-7": "React router, hooks personalizados, estilizando aplicativo com CSS e webpack",
      "part-8": "GraphQL",
      "part-9": "TypeScript",
      "part-10": "React Native",
      "part-11": "CI/CD",
      "part-12": "Containers",
      "part-13": "Usando Bancos de Dados Relacionais"
    },
    "modules": {
      "basic-html": "HTML Básico"
    },
    "module-intros": {
      "basic-html": {
        "title": "HTML Básico",
        "intro": [
          "Aprenda a criar páginas da web simples usando tags HTML para adicionar texto, imagens e links."
        ]
      }
    }
  },
  "daily-coding-challenge": {
    "title": "Desafio de Código Diário"
  },
  "misc-text": {
    "browse-other": "Browse our other free certifications",
    "courses": "Cursos",
    "steps": "Passos",
    "expand": "Expandir o curso",
    "collapse": "Recolher o curso",
    "legacy-header": "Cursos anteriores",
    "legacy-desc": "Estes cursos não fazem mais parte do caminho de certificação, mas ainda estão disponíveis para você continuar aprendendo.",
    "legacy-go-back": "Vá para a versão atual do currículo.",
    "course-maintenance": "Estes cursos estão passando por manutenção. Se eles não estiverem funcionando, você pode aprender como executá-los localmente em <0>https://www.freecodecamp.org/portuguese/news/curso-de-bancos-de-dados-relacionais-como-aprender-sql-no-vscode-usando-o-docker-e-o-freecodecamp/</0>.",
    "course-disabling-soon": "A versão para o navegador desses cursos será temporariamente desativada em breve e suas máquinas virtuais serão excluídas. Qualquer progresso em suas máquinas virtuais será perdido. Se você tiver quaisquer arquivos que quiser neles, deve salvá-los no seu computador. Pedimos desculpas por qualquer inconveniente. Esperamos ter uma versão melhorada desses cursos para o navegador novamente nas próximas semanas.",
    "course-disabled": "Estes cursos estão temporariamente indisponíveis para serem executados no navegador. Pedimos desculpas por qualquer inconveniência. Você pode aprender a executá-los localmente em <0>https://www.freecodecamp. rg/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. Esperamos ter uma versão para o navegador melhorada disponível novamente em breve.",
    "run-locally": "Por enquanto, recomendamos rodar os cursos localmente em seu computador. Você pode aprender a fazer isso em <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "O progresso não será salvo em sua conta do freeCodeCamp quando executá-los localmente.",
    "go-back-to-learn": "Voltar à versão estável do currículo.",
    "read-database-cert-article": "Leia esta publicação no fórum antes de prosseguir.",
    "enable-cookies": "Você deve habilitar cookies de terceiros antes de iniciar.",
    "english-only": "Os cursos desta seção estão disponíveis apenas em inglês. Neste momento, só podemos traduzir os títulos e as introduções, não as próprias lições.",
    "exam-english-only": "Observe que o exame de certificação está atualmente disponível apenas em inglês. O restante dos cursos está disponível em alguns idiomas."
  }
}
