{
  "name": "basics",
  "order" : 0.001,
  "challenges": [
    {
      "_id": "bd7126d8c441eddfaeb5bd3e",
      "name": "Meet Other Campers in your City",
      "difficulty": 0.065,
      "challengeSeed": "127358841",
      "description": [
        "One of the best ways to stay motivated when learning to code is to hang out with other campers.",
        "Slack and Camper News are great ways to communicate with other campers, but there's no substitute for meeting people in-person.",
        "The easiest way to meet other campers in your city is to join your city's Facebook Group. Click <a href='/field-guide/how-can-i-find-other-free-code-camp-campers-in-my-city' target='_blank'>here</a> to view our growing list of local groups.",
        "Click the link to your city, then, once Facebook loads, click \"Join group\".",
        "Our local groups are new, so if you don't see your city on this list, you should follow the directions to create a Facebook group for your city.",
        "If you don't have a Facebook account, we strongly recommend you create one, even if it's just for the purpose of coordinating with campers in your city through this group.",
        "Our groups allow you to create events, coordinate those events, and share photos from the events afterward.",
        "Whether you're hosting a study group, pair programming at your local library, or going to a weekend hackathon, your city's group will help you make it happen."
      ],
      "challengeType": 2,
      "tests": []
    },
    {
      "_id": "bd7137d8c441eddfaeb5bdef",
      "name": "Get Help the Hacker Way with RSAP",
      "difficulty": 0.07,
      "challengeSeed": "125407432",
      "description": [
        "Let's cover one last thing before you start working through our lessons: how to get help.",
        "Any time you get stuck or don't know what to do next, follow this simple algorithm (procedure): RSAP (Read, Search, Ask, Post).",
        "First, R - Read the documentation or error message. A key skill that good coders have is the ability to interpret and then follow instructions.",
        "Next, S - Search Google. Good Google queries take a lot of practice. When you search Google, you usually want to include the language or framework you're using. You also want to limit the results to a recent period.",
        "Then, if you still haven't found an answer to your question, A - Ask your friends. If you have trouble, you can ask your fellow campers. We have a special chat room specifically for getting help with tools you learn through these Free Code Camp Challenges. Go to <a href='https://freecode.slack.com/messages/help/' target='_blank'>https://freecode.slack.com/messages/help/</a>. Keep this chat open while you work on the remaining challenges.",
        "Finally, P - Post on Stack Overflow. Before you attempt to do this, read Stack Overflow's guide to asking good questions: <a href='http://stackoverflow.com/help/how-to-ask'>http://stackoverflow.com/help/how-to-ask</a>.",
        "Here's our detailed field guide on getting help: <a href='/field-guide/how-do-i-get-help-when-i-get-stuck' target='_blank'>http://freecodecamp.com/field-guide/how-do-i-get-help-when-i-get-stuck</a>.",
        "Now you have a clear algorithm to follow when you need help! Let's start coding! Move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": []
    },
    {
      "_id": "bd7127d8c441eddfaeb5bdef",
      "name": "Build a Landing Page with HTML",
      "difficulty": 0.08,
      "challengeSeed": "125671867",
      "description": [
        "Now it's time for us to start our actual coding lessons. We've curated a series of free, self-paced, browser-based lessons from providers like Codecademy and Stanford University.",
        "These lessons will cover a lot of ground quickly, and will hold your hand throughout the process. Don't try to memorize everything - you'll spend more than a thousand hours practicing these later, and you can always look things up. Just keep moving.",
        "If you've learned HTML and CSS before, these next few Waypoints will be a valuable review. If you haven't learned HTML or CSS before, you're in for a treat!",
        "This Codecademy will quickly cover HTML, CSS and even Responsive Design with Bootstrap.",
        "If you don't already have a Codecademy account, create one here: <a href='http://www.codecademy.com' target='_blank'>http://www.codecademy.com</a>.",
        "Go to <a href='http://www.codecademy.com/en/skills/make-a-website/topics/html-elements' target='_blank'>http://www.codecademy.com/en/skills/make-a-website/topics/html-elements</a> and complete the section.",
        "Once you're done, mark this Waypoint complete and move on the next Waypoint."
      ],
      "challengeType": 2,
      "tests": []
    }
  ]
}