{
  "name": "Applied Responsive Web Design Projects",
  "order": 6,
  "time": "150 hours",
  "helpRoom": "Help",
  "challenges": [
    {
      "id": "587d78af367417b2b2512b02",
      "title": "Get Set for our Responsive Web Design Projects",
      "description": [
        [
          "//i.imgur.com/OAD6SJz.png",
          "An image of a Simon game, one our front end projects.",
          "Our front end development projects will give you a chance to apply the front end skills you've developed up to this point. We'll use a popular browser-based code editor called CodePen.",
          ""
        ],
        [
          "//i.imgur.com/WBetuBa.jpg",
          "A programmer punching through his laptop screen in frustration.",
          "These projects are hard. It takes most campers several days to build each project. You will get frustrated. But don't quit. This gets easier with practice.",
          ""
        ],
        [
          "//i.imgur.com/p2TpOQd.jpg",
          "A cute dog jumping over a hurdle and winking and pointing his paw at you.",
          "When you get stuck, just use the Read-Search-Ask methodology. Don't worry - you've got this.",
          ""
        ],
        [
          "//i.imgur.com/G1saeDt.gif",
          "A gif showing how to create a Codepen account.",
          "For our front end project challenges, we'll use a popular browser-based code editor called CodePen. Click the \"Open link in new tab\" button below to open CodePen's signup page. Fill out the form and click \"Sign up\". <br><div class=\"small\">Note: If you already have a CodePen account, you can skip this step by clicking \"Open link in new tab\", closing the new tab that opens, then clicking \"go to my next step\". We removed our \"skip step\" button because many people would just click it repeatedly without doing these important steps.</div>",
          "https://codepen.io/signup/free"
        ],
        [
          "//i.imgur.com/U4y9RJ1.gif",
          "A gif showing that you can type \"hello world\" will output \"hello world\" in the preview window. You can also drag windows to resize them, and change their orientation.",
          "In the HTML box, create an <code>h1</code> element with the text \"Hello World\". You can drag the frames around to resize them. You can also click the \"Change View\" button and change the orientation of the frames.",
          ""
        ],
        [
          "//i.imgur.com/G9KFQDL.gif",
          "A gif showing the process of adding Bootstrap to your pen.",
          "Click the gear in the upper left hand corner of the CSS box, then scroll down to \"Quick add\" and choose Bootstrap. Now give your <code>h1</code> element the class of <code>text-primary</code> to change its color and prove that Bootstrap is now available.",
          ""
        ],
        [
          "//i.imgur.com/m0pWik2.gif",
          "A gif showing the process of turning off auto update preview",
          "When using CodePen and Ajax, it is a good idea to turn off automatic preview updating so API calls are not made too often. Too many API calls can sometimes lead to temporary blockages, and may require waiting periods before they can be used again. <br> <div class=\"small\"> To disable automatic preview updating click the \"Settings\" button at the top of the page, then click the \"Behavior\" tab. At the bottom of the page, un-check \"AUTO UPDATE PREVIEW\". Now press \"Run\" at the top of the page to update the preview, and click \"Save\".</div>",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "isRequired": false,
      "challengeType": 7,
      "translations": {
        "es": {
          "title": "Prepárate para los Proyectos de Desarrollo de Interfaces",
          "description": [
            [
              "//i.imgur.com/OAD6SJz.png",
              "Una imagen del juego Simón, uno de nuestros proyectos de interfaz.",
              "Nuestros proyectos de desarrollo de interfaces te darán oportunidad de aplicar las habilidades con interfaces que has desarrollado hasta este momento.  Usaremos un editor de código basado en el navegador llamado CodePen.",
              ""
            ],
            [
              "//i.imgur.com/WBetuBa.jpg",
              "Un programador frustado golpeando la pantalla de su computador.",
              "Nuestros desafíos sobre algoritmos son difíciles.  Algunos pueden requerir muchas horas para resolverse.  Podrás frustarte, pero no te rindas. Se vuelve fácil con práctica.",
              ""
            ],
            [
              "//i.imgur.com/p2TpOQd.jpg",
              "Un tierno perro que salta sobre un obstáculo, pica el ojo y te apunta con su pata.",
              "Cuando te atasques, usa la metodología Leer-Buscar-Preguntar. No te preocupes -  lo tienes resuelto.",
              ""
            ],
            [
              "//i.imgur.com/G1saeDt.gif",
              "Un gif que muestra cómo crear una cuenta en Codepen.",
              "Para nuestros desafíos de interfaces, usaremos un editor de código basado en el navegador que es muy famoso llamado Codepen. Pulsa en el botón de abajo \"Open link in new tab\" para abrir la página de registro de CodePen. Rellena el formulario y pulsa \"Sign up\". <br><div class=\"small\">Nota: Si ya tienes una cuenta de CodePen, puedes omitir este paso pulsando \"Open link in new tab\", cierra la nueva pestaña que se abre, entonces pulsa \"go to my next step\". Eliminamos nuestro botón \"skip step\" porque mucha gente solamente pulsa el botón sin realizar estos importantes pasos.</div>",
              "https://codepen.io/signup/free"
            ],
            [
              "//i.imgur.com/U4y9RJ1.gif",
              "Un gif que muestra que puedes escribir \"hello world\" en el editor, lo cual escribirá \"hello world\" en la ventana de vista previa. También puedes mover las ventanas para cambiar su tamaño, y cambiar su orientación.",
              "En la ventana de HTML, crea un elemento h1 con el texto \"Hola mundo\". Puedes arrastrar los bordes de las ventanas para cambiar su tamaño. También puedes pulsar el botón de \"Change View\" para cambiar la orientación de las ventanas.",
              ""
            ],
            [
              "//i.imgur.com/G9KFQDL.gif",
              "Un gif que muestra el proceso de agregar Bootstrap a tu proyecto.",
              "Pulsa el engrane en la esquina superior izquierda de la ventana de CSS, luego ve hacia abajo hasta donde dice \"Quick add\" y elige Bootstrap. Ahora dale a tu elemento h1 la clase \"text-primary\" para cambiar su color y verificar que Bootstrap está activado.",
              ""
            ]
          ]
        },
        "pt-br": {
          "title": "Prepare-se para nossos Projetos de Desenvolvimento Front End",
          "description": [
            [
              "//i.imgur.com/OAD6SJz.png",
              "A imagem de um jogo Simon, um de nossos projetos front end.",
              "Nossos projetos de Desenvolvimento front end vão dar a você a chance de aplicar as habilidades front end que você desenvolveu até esse ponto. Nós vamos usar um editor popular chamado CodePen que funciona direto no navegador.",
              ""
            ],
            [
              "//i.imgur.com/WBetuBa.jpg",
              "Um programador atravessando a tela de seu laptop com um soco em frustração.",
              "Esses projetos são difíceis. A maioria dos campistas leva alguns dias para contruir cada projeto. Você vai ficar frustrado. Mas não desista. Isso fica mais fácil com a prática.",
              ""
            ],
            [
              "//i.imgur.com/p2TpOQd.jpg",
              "Um cachorro fofo pulando sobre um obstáculo, piscando e apontando sua pata a você.",
              "Quando ficar travado, use a metodologia Ler-Buscar-Perguntar. Não se preocupe - você consegue.",
              ""
            ],
            [
              "//i.imgur.com/G1saeDt.gif",
              "Um gif mostrando com criar uma conta CodePen.",
              "Para nossos projetos front end, usaremos um popular editor de código baseado em navegador chamado CodePen. Clique no botão \"Open link in new tab\" abaixo para abrir a página de resgistro do CodePen. Preencha o formulário e clique em \"Sign up\". <br><div class=\"small\">Nota: Se você já tem uma conta CodePen, você pode pular esse passo clicando em \"Open link in new tab\", fechando a nova aba que abrir, e clicando em \"go to my next step\". Nós removemos nosso botão \"skip step\" pois muitas pessoas iam simplesmente clicar nele repetidamente sem passar por esses passos importantes.</div>",
              "https://codepen.io/signup/free"
            ],
            [
              "//i.imgur.com/U4y9RJ1.gif",
              "Um gif mostrando que você pode digitar \"hello world\" e será mostrado \"hello world\" na janela de visualização. Você também pode arrastar janelas para redimensioná-las e mudar a orientação das mesmas.",
              "Na caixa do HTML, crie um elemento <code>h1</code> com o texto \"Hello World\". Você pode arrastar as bordas para redimensioná-las. Você pode também clicar no botão \"Change View\" e mudar a orientação das janelas.",
              ""
            ],
            [
              "//i.imgur.com/G9KFQDL.gif",
              "Um gif mostrando como adicionar o Bootstrap à sua pen.",
              "Clique na engrenagem no canto superior esquerdo da caixa do CSS, então role para baixo até \"Quick add\" e escolha Bootstrap. Agora adicione ao seu elemento <code>h1</code> a classe <code>text-primary</code> para mudar sua cor e provar que o Bootstrap agora está disponível.",
              ""
            ],
            [
              "//i.imgur.com/m0pWik2.gif",
              "Um gif mostrando o processo de desativar o update automático da janela de visualização",
              "Ao usar CodePen e Ajax, é uma boa idea desativar o update automático da janela de visualização para que as chamadas para as APIs não sejam feitas a todo momento. Muitas chamadas para API pode levar à bloqueios temporários e podem requerer períodos de esperar para que possam ser usadas novamente. <br> <div class=\"small\"> Para desativar o update automático da janela de visualização clique no botão \"Settings\" no topo da página, então clique na aba \"Behavior\". No final da página, desmarque \"AUTO UPDATE PREVIEW\". Agora clique em \"Run\" no topo da página para atualizar a janela de visualização e clique \"Save\".</div>",
              ""
            ]
          ]
        },
        "ru": {
          "title": "Приготовьтесь к разработке фронтенд проектов",
          "description": [
            [
              "//i.imgur.com/OAD6SJz.png",
              "Игра Саймона - один из фронтенд проектов.",
              "Наши фронтенд проекты дадут вам шанс применить полученные к этому моменту знания по фронтенд разработке. Мы будем использовать популярный браузерный редактор кода - CodePen.",
              ""
            ],
            [
              "//i.imgur.com/WBetuBa.jpg",
              "Программист от отчаяния кулаком пробивает экран своего ноутбука.",
              "Это трудные проекты. Разработка каждого занимает у большинства кэмперов несколько дней. У вас может возникнуть чувство отчаяния. Несмотря на это не сдавайтесь. С практикой этот процесс станет проще.",
              ""
            ],
            [
              "//i.imgur.com/p2TpOQd.jpg",
              "Милый пес, прыгающий через препятствие, указывает на вас лапой и подмигивает.",
              "Если что-то не получается, воспользуйтесь Read-Search-Ask. Не волнуйтесь - вы сможете это сделать.",
              ""
            ],
            [
              "//i.imgur.com/G1saeDt.gif",
              "Гифка показывающая как зарегистрироваться на CodePen.",
              "Для заданий по фронтенд разработке, мы будем использовать популярный браузерный редактор кода под названием CodePen. Откройте страницу регистрации на сайте CodePen, нажав на расположенную чуть ниже кнопку \"Open link in new tab\". Заполните форму и нажмите \"Sign up\". <br><div class=\"small\">Замечание: Если у вас уже есть аккаунт CodePen, то этот шаг можно пропустить: нажмите на кнопку \"Open link in new tab\", закройте появившуюся вкладку и затем кликните \"go to my next step\". Мы убрали кнопку \"skip step\", ввиду того что большинство людей просто нажимали бы ее несколько раз подряд и пропускали бы эти важные инструкции.</div>",
              "https://codepen.io/signup/free"
            ],
            [
              "//i.imgur.com/U4y9RJ1.gif",
              "Гифка показывающая набор в редакторе заголовка с текстом \"hello world\", который затем отображается в окошке предпросмотра. А также указывающая как изменить размер окон редактора или поменять их расположение.",
              "В окошке HTML создайте элемент h1 с текстом \"Hello World\". Ухватив края окон можно изменить их размер. А нажав на кнопку \"Change View\" поменять их расположение.",
              ""
            ],
            [
              "//i.imgur.com/G9KFQDL.gif",
              "Гифка показывающая как в CodePen добавить к проекту Bootstrap.",
              "Нажмите на звездочку в левом верхнем углу окошка CSS, найдите внизу поле \"Quick add\" и выберите в нем Bootstrap. Добавьте к элементу h1 класс \"text-primary\", чтобы изменить его цвет и удостовериться, что Bootstrap подключен.",
              ""
            ]
          ]
        }
      }
    },
    {
      "id": "bd7158d8c442eddfaeb5bd18",
      "title": "Build a Tribute Page",
      "description": [
        "Fulfill the user stories by getting all of the tests to pass. Use whichever libraries you need. Give it your own personal style.",
        "Here's a <a href='http://codepen.io/freeCodeCamp/full/zNqgVx' target='_blank'>working example</a>. Try not to look at its code.",
        "You can build your project by forking <a href='http://codepen.io/FCC_test_suites/pen/JbgXab' target='_blank'>this CodePen pen</a>. Or you can use this CDN link to run the tests in any environment you like: <code>https://gitcdn.link/repo/no-stack-dub-sack/testable-projects-fcc/master/build/bundle.js</code>",
        "Once you're done, submit below the URL to your working project with all its tests passing.",
        "Remember to use the <a href='https://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> method if you get stuck."
      ],
      "releasedOn": "January 1, 2016",
      "challengeSeed": [
"Nk0DzQi"
      ],
      "tests": [],
      "type": "zipline",
      "isRequired": true,
      "challengeType": 3,
      "translations": {
        "es": {
          "title": "Construye una página Tributo",
          "description": []
        },
        "pt-br": {
          "title": "Construa uma Página Tributo",
          "description": []
        },
        "ru": {
          "title": "Создайте страницу посвященную тому что вас вдохновляет",
          "description": []
        }
      }
    },
    {
      "id": "587d78af367417b2b2512b03",
      "title": "Build a Survey Form",
      "description": [
        "Fulfill the user stories by getting all of the tests to pass. Use whichever libraries you need. Give it your own personal style.",
        "Here's a <a href='http://codepen.io/freeCodeCamp/full/VPaoNP' target='_blank'>working example</a>. Try not to look at its code.",
        "You can build your project by forking <a href='http://codepen.io/FCC_test_suites/pen/JbgXab' target='_blank'>this CodePen pen</a>. Or you can use this CDN link to run the tests in any environment you like: <code>https://gitcdn.link/repo/no-stack-dub-sack/testable-projects-fcc/master/build/bundle.js</code>",
        "Once you're done, submit below the URL to your working project with all its tests passing.",
        "Remember to use the <a href='https://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> method if you get stuck."
      ],
      "releasedOn": "January 15, 2017",
      "challengeSeed": [
        "A7Pn5zw"
      ],
      "tests": [],
      "type": "zipline",
      "isRequired": true,
      "challengeType": 3,
      "translations": {
        "es": {
          "title": "",
          "description": []
        },
        "ru": {
          "title": "",
          "description": []
        }
      }
    },
    {
      "id": "587d78af367417b2b2512b04",
      "title": "Build a Product Landing Page",
      "description": [
        "Fulfill the user stories by getting all of the tests to pass. Use whichever libraries you need. Give it your own personal style.",
        "Here's a <a href='http://codepen.io/freeCodeCamp/pen/RKRbwL' target='_blank'>working example</a>. Try not to look at its code.",
        "You can build your project by forking <a href='http://codepen.io/FCC_test_suites/pen/JbgXab' target='_blank'>this CodePen pen</a>. Or you can use this CDN link to run the tests in any environment you like: <code>https://gitcdn.link/repo/no-stack-dub-sack/testable-projects-fcc/master/build/bundle.js</code>",
        "Once you're done, submit below the URL to your working project with all its tests passing.",
        "Remember to use the <a href='https://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> method if you get stuck."
      ],
      "releasedOn": "January 15, 2017",
      "challengeSeed": [
        "ExCJjAT"
      ],
      "tests": [],
      "type": "zipline",
      "isRequired": true,
      "challengeType": 3,
      "translations": {
        "es": {
          "title": "",
          "description": []
        },
        "ru": {
          "title": "",
          "description": []
        }
      }
    },
    {
      "id": "587d78b0367417b2b2512b05",
      "title": "Build a Technical Documentation Page",
      "description": [
        "Fulfill the user stories by getting all of the tests to pass. Use whichever libraries you need. Give it your own personal style.",
        "Here's a <a href='http://codepen.io/freeCodeCamp/full/NdrKKL' target='_blank'>working example</a>. Try not to look at its code.",
        "You can build your project by forking <a href='http://codepen.io/FCC_test_suites/pen/JbgXab' target='_blank'>this CodePen pen</a>. Or you can use this CDN link to run the tests in any environment you like: <code>https://gitcdn.link/repo/no-stack-dub-sack/testable-projects-fcc/master/build/bundle.js</code>",
        "Once you're done, submit below the URL to your working project with all its tests passing.",
        "Remember to use the <a href='https://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> method if you get stuck."
      ],
      "releasedOn": "January 15, 2017",
      "challengeSeed": [
        "cDIfODs"
      ],
      "tests": [],
      "type": "zipline",
      "isRequired": true,
      "challengeType": 3,
      "translations": {
        "es": {
          "title": "",
          "description": []
        },
        "ru": {
          "title": "",
          "description": []
        }
      }
    },
    {
      "id": "587d78b0367417b2b2512b06",
      "title": "Build a Personal Portfolio Webpage",
      "description": [
        "Fulfill the user stories by getting all of the tests to pass. Use whichever libraries you need. Give it your own personal style.",
        "Here's a <a href='http://codepen.io/freeCodeCamp/full/zNBOYG' target='_blank'>working example</a>. Try not to look at its code.",
        "You can build your project by forking <a href='http://codepen.io/FCC_test_suites/pen/JbgXab' target='_blank'>this CodePen pen</a>. Or you can use this CDN link to run the tests in any environment you like: <code>https://gitcdn.link/repo/no-stack-dub-sack/testable-projects-fcc/master/build/bundle.js</code>",
        "Once you're done, submit below the URL to your working project with all its tests passing.",
        "Remember to use the <a href='https://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> method if you get stuck."
      ],
      "challengeSeed": [
        "Uw6sYKY"
      ],
      "tests": [],
      "type": "zipline",
      "isRequired": true,
      "challengeType": 3,
      "translations": {
        "es": {
          "title": "Construye una página web para tu portafolio",
          "description": []
        },
        "pt-br": {
          "title": "Construa uma Página de Portfólio Pessoal",
          "description": [
          ]
        },
        "ru": {
          "title": "Создайте сайт-портфолио",
          "description": [
          ]
        }
      }
    }
  ]
}
