{
  "responsive-web-design": {
    "title": "Legacy Responsive Web Design Challenges",
    "intro": [
      "In dieser Zertifizierung für \"Responsives Webdesign\" lernst Du die Sprachen, die Entwickler verwenden, um Webseiten zu erstellen: HTML (Hypertext Markup Language) für Inhalte, und CSS (Cascading Style Sheets) für Design.",
      "Zuerst erstellst Du eine Katzenfoto-App, um die Grundlagen von HTML und CSS zu erlernen. Später lernst Du moderne Techniken wie CSS-Variablen, indem Du einen Pinguin erstellst und bewährte Abläufe für die Barrierefreiheit beim Erstellen eines Web-Formulars nutzt.",
      "Schließlich lernst du, wie du Webseiten erstellst, die auf unterschiedliche Bildschirmgrößen reagieren, indem du eine Twitter-Karte mit Flexbox und ein komplexes Blog-Layout mit CSS Grid erstellst."
    ],
    "note": "Hinweis: Einige Browser-Erweiterungen, wie z. B. Ad-Blocker und Dark-Mode-Erweiterungen, können die Tests beeinträchtigen. Wenn du Probleme hast, empfehlen wir dir, Erweiterungen, die den Inhalt oder das Layout von Seiten verändern, zu deaktivieren, während du den Kurs machst.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "Grundlegendes HTML und HTML5",
        "intro": [
          "HTML ist eine Auszeichnungssprache, die eine spezielle Syntax oder Notation verwendet, um die Struktur einer Webseite für den Browser zu beschreiben. HTML-Elemente haben normalerweise öffnende und schließende Tags, die den Inhalt umgeben und ihm Bedeutung verleihen. Zum Beispiel können verschiedene Elemente Text als Überschrift, Absatz oder Listenelement beschreiben.",
          "In diesem Kurs wirst du eine Katzenfoto-App erstellen, um einige der häufigsten HTML-Elemente zu erlernen – das sind die Bausteine jeder Webseite."
        ]
      },
      "basic-css": {
        "title": "Die Grundlagen von CSS",
        "intro": [
          "CSS, oder Cascading Style Sheets, teilen dem Browser mit, wie der Text und andere Inhalte, die du in HTML schreibst, dargestellt werden sollen. Mit CSS kannst du die Farbe, die Schriftart, die Größe, die Abstände und viele andere Aspekte von HTML-Elementen steuern.",
          "Jetzt, wo du die Struktur deiner Katzenfoto-App definiert hast, kannst du ihr mit CSS etwas Stil verleihen."
        ]
      },
      "applied-visual-design": {
        "title": "Angewandtes visuelles Design",
        "intro": [
          "Visuelles Design ist eine Kombination aus Typografie, Farbtheorie, Grafik, Animation, Seitenlayout und mehr, um deine individuelle Botschaft zu vermitteln.",
          "In diesem Kurs lernst du, wie du diese verschiedenen Elemente des visuellen Designs auf deine Webseiten anwenden kannst."
        ]
      },
      "applied-accessibility": {
        "title": "Angewandte Barrierefreiheit",
        "intro": [
          "In der Webentwicklung bezieht sich Barrierefreiheit auf Webinhalte und eine UI (Benutzeroberfläche), die von einem breiten Publikum verstanden, navigiert und interagiert werden kann. Dies schließt Menschen mit Seh-, Hör-, Mobilitäts- oder kognitiven Behinderungen ein.",
          "In diesem Kurs lernst du die besten Vorgehensweisen, um Webseiten zu erstellen, die für jeden zugänglich sind."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Prinzipien des responsiven Webdesigns",
        "intro": [
          "Es gibt viele Geräte, die auf das Internet zugreifen können, und sie kommen in allen Formen und Größen vor. Responsives Webdesign ist die Praxis der Gestaltung flexibler Websites, die auf verschiedene Bildschirmgrößen, Ausrichtungen und Auflösungen reagieren können.",
          "In diesem Kurs lernst du, wie du CSS benutzt, um deine Webseiten gut aussehen zu lassen, egal auf welchem Gerät sie betrachtet werden."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox ist eine leistungsstarke, gut unterstützte Layout-Methode, die mit der neuesten Version von CSS, CSS3, eingeführt wurde. Mit Flexbox ist es einfach, Elemente auf der Seite zu zentrieren und dynamische Benutzeroberflächen zu erstellen, die sich automatisch verkleinern und vergrößern.",
          "In diesem Kurs lernst du die Grundlagen von Flexbox und dynamischen Layouts, indem du eine Twitter-Karte erstellst."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "Das CSS Grid ist ein neuerer Standard, der es einfach macht, komplexe responsive Layouts zu erstellen. Es funktioniert, indem es ein HTML-Element in ein Raster verwandelt und du darin überall Kindelemente platzieren kannst.",
          "In diesem Kurs lernst du die Grundlagen des CSS Grid, indem du verschiedene komplexe Layouts erstellst, darunter auch einen Blog."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Responsive Web Design",
    "intro": [
      "In dieser Zertifizierung für responsives Webdesign lernst du die Sprachen, die Entwickler/innen zum Erstellen von Webseiten verwenden: HTML (Hypertext Markup Language) für den Inhalt und CSS (Cascading Style Sheets) für das Design.",
      "Zunächst baust du eine Katzenfoto-App, um die Grundlagen von HTML und CSS zu erlernen. Später lernst du moderne Techniken wie CSS-Variablen, indem du einen Pinguin baust, und bewährte Praktiken für Barrierefreiheit, indem du eine Quiz-Site erstellst.",
      "Schließlich lernst du, wie du Webseiten erstellst, die auf unterschiedliche Bildschirmgrößen reagieren, indem du eine Fotogalerie mit Flexbox und ein Zeitschriftenartikel-Layout mit CSS Grid erstellst."
    ],
    "note": "Hinweis: Einige Browser-Erweiterungen, wie z. B. Werbeblocker und Dunkelmodus-Erweiterungen, können die Tests beeinträchtigen. Wenn du Probleme hast, empfehlen wir dir, Erweiterungen, die den Inhalt oder das Layout von Seiten verändern, während der Teilnahme am Kurs zu deaktivieren.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Tribut-Seite",
        "intro": [
          "Dies ist eines der Projekte, das du zum Erwerb deines Zertifikats benötigst.",
          "In diesem Projekt erstellst du eine Tributseite für ein Thema deiner Wahl, egal ob fiktiv oder real."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Persönliche Portfolio-Website",
        "intro": [
          "Dies ist eines der Projekte, die du für den Erhalt deines Zertifikats benötigst.",
          "Für dieses Projekt wirst du deine eigene Portfolioseite erstellen."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Produkt Landing Page",
        "intro": [
          "Dies ist eines der Projekte, das du zum Erwerb deiner Zertifizierung benötigst.",
          "In diesem Projekt wirst du eine Webseite erstellen, um ein Produkt deiner Wahl zu vermarkten."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Umfrageformular",
        "intro": [
          "Dies ist eines der Projekte, die du zum Erwerb deines Zertifikats benötigst.",
          "In diesem Projekt wirst du ein Umfrageformular erstellen, um Daten von deinen Nutzern zu sammeln."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Technische Dokumentationsseite",
        "intro": [
          "Dies ist eines der Projekte, die du zum Erwerb deines Zertifikats benötigst.",
          "In diesem Projekt wirst du eine technische Dokumentationsseite erstellen, die als Anleitung oder Referenz für ein Thema dient."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Lerne HTML, indem du eine Katzenfoto-App baust",
        "intro": [
          "HTML-Tags geben einer Webseite ihre Struktur. Du kannst HTML-Tags verwenden, um Fotos, Schaltflächen und andere Elemente in deine Webseite einzufügen.",
          "In diesem Kurs lernst du die gängigsten HTML-Tags kennen, indem du deine eigene Katzenfoto-App erstellst."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Lerne CSS-Grundlagen, indem du ein Cafe-Menü erstellst",
        "intro": [
          "CSS teilt dem Browser mit, wie deine Webseite angezeigt werden soll. Du kannst mit CSS die Farbe, Schriftart, Größe und andere Aspekte von HTML-Elementen festlegen.",
          "In diesem Kurs lernst du CSS, indem du eine Menüseite für eine Café-Webseite entwirfst."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Lerne das CSS-Box-Modell durch die Erstellung eines Rothko-Gemäldes",
        "intro": [
          "Jedes HTML-Element ist eine eigene Box - mit eigenem Abstand und einem Rahmen. Dies wird das Box-Modell genannt.",
          "In diesem Kurs verwendest du CSS und das Box-Modell, um deine eigenen rechteckigen Kunstwerke im Rothko-Stil zu erstellen."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Lerne CSS-Variablen, indem du eine Stadtsilhouette baust",
        "intro": [
          "CSS-Variablen helfen dir, deine Stile zu organisieren und sie wiederzuverwenden.",
          "In diesem Kurs wirst du eine Stadtsilhouette erstellen. Du lernst, wie du CSS-Variablen so konfigurierst, dass du sie jederzeit wiederverwenden kannst."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Erlerne HTML-Formulare, indem du ein Registrierungsformular erstellst",
        "intro": [
          "Du kannst HTML-Formulare verwenden, um Informationen von Personen zu sammeln, die deine Webseite besuchen.",
          "In diesem Kurs lernst du HTML-Formulare kennen, indem du eine Anmeldeseite erstellst. Du lernst, wie du steuern kannst, welche Daten in dein Formular eingegeben werden können, und wie du deine Seite mit neuen CSS-Tools gestalten kannst."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Erlerne Barrierefreiheit, indem du ein Quiz erstellst",
        "intro": [
          "Barrierefreiheit bedeutet, dass deine Webseite für alle Menschen leicht zu bedienen ist - auch für Menschen mit Beeinträchtigungen.",
          "In diesem Kurs erstellst du eine Quiz-Webseite. Du lernst Hilfsmittel für die Barrierefreiheit wie Tastenkombinationen, ARIA-Attribute und bewährte Praktiken für das Design kennen."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Erlerne CSS für Fortgeschrittene durch die Erstellung eines Picasso-Gemäldes",
        "intro": [
          "In diesem Kurs lernst du einige fortgeschrittene CSS-Techniken kennen, indem du deine eigene Webseite mit Picasso-Gemälden programmierst. Du lernst etwas über SVG-Symbole, CSS-Positionierung und wiederholst andere CSS-Kenntnisse, die du bereits gelernt hast."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Erlerne responsives Webdesign, indem du ein Klavier erstellst",
        "intro": [
          "Responsives Design beschreibt, wie deine Webseite auf unterschiedlich großen Bildschirmen aussehen soll.",
          "In diesem Kurs wirst du CSS und responsives Design verwenden, um ein Klavier zu programmieren. Außerdem erfährst du mehr über Media-Queries und Pseudoselektoren."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Erlerne CSS Flexbox durch die Erstellung einer Fotogalerie",
        "intro": [
          "Flexbox hilft dir, deine Webseite so zu gestalten, dass sie auf jeder Bildschirmgröße gut aussieht.",
          "In diesem Kurs verwendest du Flexbox, um eine responsive Fotogalerie-Webseite zu erstellen."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Erlerne das CSS-Raster (Grid) durch die Erstellung eines Magazins",
        "intro": [
          "Mit dem CSS Raster hast du die Kontrolle über die Zeilen und Spalten deines Webseitendesigns.",
          "In diesem Kurs wirst du einen Magazinartikel erstellen. Du lernst, wie du CSS Raster verwendest, einschließlich Konzepten wie Rasterzeilen und Rasterspalten."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Erlerne Typografie, indem du ein Ernährungsetikett erstellst",
        "intro": [
          "Typografie ist die Kunst, deinen Text so zu gestalten, dass er gut lesbar ist und seinem Zweck gerecht wird.",
          "In diesem Kurs entwickelst du mithilfe von Typografie eine Webseite mit Nährwertangaben. Du lernst, wie du Text formatieren, die Zeilenhöhe anpassen und deinen Text mit CSS positionieren kannst."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Erlerne CSS-Transformationen durch die Erstellung eines Pinguins",
        "intro": [
          "Du kannst HTML-Elemente transformieren, um ansprechende Designs zu erstellen, die das Auge des Lesers anziehen. Mit Transformationen kannst du Elemente drehen, skalieren und vieles mehr.",
          "In diesem Kurs wirst du einen Pinguin erstellen. Du verwendest CSS-Transformationen, um die Teile deines Pinguins zu positionieren und in der Größe zu verändern, einen Hintergrund zu erstellen und dein Werk zu animieren."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Erlerne CSS-Animationen durch die Erstellung eines Riesenrads",
        "intro": [
          "Du kannst CSS-Animationen verwenden, um die Aufmerksamkeit auf bestimmte Abschnitte deiner Webseite zu lenken und sie ansprechender zu gestalten.",
          "In diesem Kurs wirst du ein Riesenrad erstellen. Du lernst, wie du CSS verwendest, um Elemente zu animieren, sie zu transformieren und ihre Geschwindigkeit anzupassen."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Learn More About CSS Pseudo Selectors by Building A Balance Sheet",
        "intro": [
          "Du kannst CSS-Pseudoselektoren verwenden, um bestimmte HTML-Elemente zu ändern.",
          "In diesem Kurs erstellst du eine Bilanz mit Pseudoselektoren. Du lernst, wie du den Stil eines Elements änderst, wenn du mit der Maus darüber fährst, und wie du andere Ereignisse auf deiner Webseite auslösen kannst."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Erlerne CSS-Farben, indem du einen Satz farbiger Marker baust",
        "intro": [
          "Die Wahl der richtigen Farben für deine Webseite kann die Ästhetik für deine LeserInnen erheblich verbessern.",
          "In diesem Kurs erstellst du ein Set aus farbigen Markern. Du lernst verschiedene Möglichkeiten kennen, Farbwerte einzustellen und Farben miteinander zu kombinieren."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Learn Intermediate CSS by Building a Cat Painting",
        "intro": [
          "Mastering CSS positioning is essential for creating visually appealing and responsive web layouts",
          "In this course, you will build a cat painting. You'll learn about how to work with absolute positioning, the z-index property, and the transform property."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Legacy JavaScript Algorithms and Data Structures",
    "intro": [
      "Während HTML und CSS den Inhalt und das Styling einer Seite festlegen, wird JavaScript verwendet, um sie interaktiv zu gestalten. In der Zertifizierung \"JavaScript Algorithmen und Datenstrukturen\" lernst du die Grundlagen von JavaScript inklusive Variablen, Arrays, Objekten, Schleifen und Funktionen kennen.",
      "Sobald du die Grundlagen beherrschst, wendest du dieses Wissen an, indem du Algorithmen erstellst, um Strings zu manipulieren, Zahlen zu faktorisieren und sogar die Umlaufbahn der Internationalen Raumstation zu berechnen.",
      "Auf dem Weg dorthin wirst du auch zwei wichtige Programmierstile oder Paradigmen kennenlernen: Objektorientierte Programmierung (OOP) und funktionale Programmierung (FP)."
    ],
    "note": "Hinweis: Einige Browser-Erweiterungen, wie z. B. Ad-Blocker und Script-Blocker, können die Tests beeinträchtigen. Wenn du Probleme hast, empfehlen wir, Erweiterungen zu deaktivieren, die den Inhalt von Seiten verändern oder blockieren, während du den Kurs machst.",
    "blocks": {
      "basic-javascript": {
        "title": "Die Grundlangen von JavaScript",
        "intro": [
          "JavaScript ist eine Skriptsprache, mit der du Webseiten interaktiv gestalten kannst. Sie ist eine der Kerntechnologien des Webs, zusammen mit HTML und CSS, und wird von allen modernen Browsern unterstützt.",
          "In diesem Kurs lernst du fundamentale Programmierkonzepte in JavaScript. Du beginnst mit grundlegenden Datenstrukturen wie Zahlen und Strings. Dann lernst du, mit Arrays, Objekten, Funktionen, Schleifen, if/else-Anweisungen und mehr zu arbeiten."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, oder ES, ist eine standardisierte Version von JavaScript. Weil alle großen Browser-Hersteller dieser Spezifikation folgen, sind die Begriffe ECMAScript und JavaScript austauschbar.",
          "Das meiste JavaScript, das du bis zu diesem Punkt gelernt hast, war in ES5 (ECMAScript 5), das 2009 fertiggestellt wurde. Du kannst zwar immer noch Programme in ES5 schreiben, aber JavaScript wird ständig weiterentwickelt, und jedes Jahr werden neue Funktionen veröffentlicht.",
          "ES6, das 2015 veröffentlicht wurde, hat der Sprache viele leistungsstarke neue Funktionen hinzugefügt. In diesem Kurs lernst du diese neuen Funktionen kennen, darunter Pfeilfunktionen, Destrukturierung, Klassen, Promises und Module."
        ]
      },
      "regular-expressions": {
        "title": "Reguläre Ausdrücke",
        "intro": [
          "Reguläre Ausdrücke, oft abgekürzt als \"regex\" oder \"regexp\", sind Pattern (Muster), die Programmierern helfen, Text zu finden, zu suchen und zu ersetzen. Reguläre Ausdrücke sind sehr mächtig, können aber schwer zu lesen sein, weil sie Sonderzeichen verwenden, um komplexere, flexible Übereinstimmungen zu machen.",
          "In diesem Kurs lernst du, wie du Sonderzeichen, Capture-Gruppen, positive und negative Lookaheads und andere Techniken verwenden kannst, um jeden beliebigen Text zu finden."
        ]
      },
      "debugging": {
        "title": "Debugging",
        "intro": [
          "Debugging ist der Prozess, bei dem du deinen Code durchgehst, Probleme findest und sie behebst.",
          "Probleme im Code treten im Allgemeinen in drei Formen auf: Syntaxfehler, die verhindern, dass dein Programm läuft, Laufzeitfehler, bei denen dein Code ein unerwartetes Verhalten zeigt, oder logische Fehler, bei denen dein Code nicht das tut, was du beabsichtigt hast.",
          "In diesem Kurs lernst du, wie du die JavaScript-Konsole nutzen kannst, um Programme zu debuggen und häufige Probleme zu vermeiden, bevor sie auftreten."
        ]
      },
      "basic-data-structures": {
        "title": "Grundlegende Datenstrukturen",
        "intro": [
          "Daten können auf viele Arten gespeichert und abgerufen werden. Du kennst bereits einige gängige JavaScript Datenstrukturen - Arrays und Objekte.",
          "In diesem Kurs über grundlegende Datenstrukturen erfährst du mehr über die Unterschiede zwischen Arrays und Objekten und welche du in verschiedenen Situationen verwenden kannst. Außerdem lernst du, wie du hilfreiche JS-Methoden wie <code>splice()</code> und <code>Object.keys()</code> verwenden kannst, um auf Daten zuzugreifen und sie zu manipulieren."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Grundlagen des Algorithmus Scripting",
        "intro": [
          "Ein Algorithmus ist eine Reihe von Schritt-für-Schritt-Anweisungen, die beschreiben, wie etwas zu tun ist.",
          "Um einen effektiven Algorithmus zu schreiben, hilft es, ein Problem in kleinere Teile zu zerlegen und sorgfältig darüber nachzudenken, wie man jeden Teil mit Code löst.",
          "In diesem Kurs lernst du die Grundlagen des algorithmischen Denkens, indem du Algorithmen schreibst, die alles von der Umwandlung von Temperaturen bis hin zum Umgang mit komplexen 2D-Arrays tun."
        ]
      },
      "object-oriented-programming": {
        "title": "Objektorientierte Programmierung",
        "intro": [
          "OOP, oder objektorientierte Programmierung, ist einer der wichtigsten Ansätze für den Softwareentwicklungsprozess. In OOP organisieren Objekte und Klassen den Code, um Dinge zu beschreiben und was sie tun können.",
          "In diesem Kurs lernst du die Grundprinzipien der OOP in JavaScript kennen, einschließlich des <code>this</code>-Schlüsselworts, Prototypenketten, Konstruktoren und Vererbung."
        ]
      },
      "functional-programming": {
        "title": "Funktionale Programmierung",
        "intro": [
          "Funktionale Programmierung ist ein weiterer beliebter Ansatz für die Softwareentwicklung. Bei der funktionalen Programmierung wird der Code in kleinere, grundlegende Funktionen unterteilt, die zum Aufbau komplexer Programme kombiniert werden können.",
          "In diesem Kurs lernst du die Kernkonzepte der Funktionalen Programmierung, einschließlich reiner Funktionen, wie man Mutationen vermeidet und wie man saubereren Code mit Methoden wie <code>.map()</code> und <code>.filter()</code> schreibt."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Fortgeschrittenes Algorithmus Scripting",
        "intro": [
          "Jetzt, wo du die Grundlagen des algorithmischen Denkens, zusammen mit OOP und funktionaler Programmierung kennst, kannst du deine Fähigkeiten mit den fortgeschrittenen Algorithmus-Scripting-Herausforderungen testen."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "JavaScript Algorithmen- und Datenstrukturprojekte",
        "intro": [
          "Geschafft! Zeit, deine neuen JavaScript-Fähigkeiten zum Einsatz zu bringen. Diese Projekte ähneln den Herausforderungen des Algorithmus-Skriptens, die du zuvor durchgeführt hast – nur viel schwieriger.",
          "Schließe diese 5 JavaScript Projekte ab, um die JavaScript Algorithmen und Datenstrukturen Zertifizierung zu erhalten."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "JavaScript Algorithms and Data Structures (Beta)",
    "intro": [
      "Developers use HTML and CSS to control the content and styling of a page. And they use JavaScript to make that page interactive.",
      "In this JavaScript Algorithm and Data Structures Certification, you'll learn the JavaScript fundamentals like variables, arrays, objects, loops, functions, the DOM and more.",
      "You'll also learn about Object Oriented Programming (OOP), Functional Programming, algorithmic thinking, how to work with local storage, and how to fetch data using an API."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and script-blockers can interfere with the tests. If you face issues, we recommend disabling extensions that modify or block the content of pages while taking the course.",
    "blocks": {
      "build-a-pokemon-search-app-project": {
        "title": "Build a Pokémon Search App Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a Pokémon search app."
        ]
      },
      "build-a-cash-register-project": {
        "title": "Build a Cash Register Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you'll build a cash register web app."
        ]
      },
      "build-a-palindrome-checker-project": {
        "title": "Build a Palindrome Checker Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you'll build an application that checks whether a given word is a palindrome."
        ]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Build a Roman Numeral Converter Project",
        "intro": [
          "This is one of the required projects to claim your certification.",
          "For this project, you'll build an application that converts integers to Roman numerals."
        ]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Build a Telephone Number Validator Project",
        "intro": [
          "This is one of the required projects to claim your certification.",
          "For this project, you'll build an application that checks if a number is a valid United States phone number."
        ]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Learn Basic JavaScript by Building a Role Playing Game",
        "intro": [
          "JavaScript is a powerful scripting language that you can use to make web pages interactive. It's one of the core technologies of the web, along with HTML and CSS. All modern browsers support JavaScript.",
          "In this practice project, you'll learn fundamental programming concepts in JavaScript by coding your own Role Playing Game. You'll learn how to work with arrays, strings, objects, functions, loops, <code>if/else</code> statements, and more."
        ]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Learn Form Validation by Building a Calorie Counter",
        "intro": [
          "Sometimes when you're coding a web application, you'll need to be able to accept input from a user. In this calorie counter project, you'll learn how to validate user input, perform calculations based on that input, and dynamically update your interface to display the results.",
          "In this practice project, you'll learn basic regular expressions, template literals, the <code>addEventListener()</code> method, and more."
        ]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Learn Functional Programming by Building a Spreadsheet",
        "intro": [
          "Functional Programming is a popular approach to software development. In Functional Programming, developers organize code into smaller functions, then combine those functions to build complex programs.",
          "In this spreadsheet application project, you'll learn about parsing and evaluating mathematical expressions, implementing spreadsheet functions, handling cell references, and creating interactive web interfaces. You'll learn how to dynamically update the page based on user input.",
          "This project will cover concepts like the <code>map()</code>, <code>find()</code>, and <code>includes()</code> methods and the <code>parseInt()</code> function."
        ]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Learn Modern JavaScript Methods by Building Football Team Cards",
        "intro": [
          "One common aspect of building web applications: processing datasets, and then outputting information to the screen. In this sports team cards project, you'll learn how to work with DOM manipulation, object destructuring, event handling, and data filtering.",
          "This project will cover concepts like, default parameters, <code>Object.freeze()</code>, and reinforce your knowledge of the <code>switch</code> statement and <code>map()</code> method."
        ]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Learn Advanced Array Methods by Building a Statistics Calculator",
        "intro": [
          "As you expand your JavaScript skills, you'll want to get comfortable with array manipulation methods, such as <code>map()</code>, <code>reduce()</code>, and <code>filter()</code>.",
          "In this statistics calculator project, you'll gain experience with handling user input, DOM manipulation, and method chaining. You'll get practice by performing statistical calculations like mean, median, mode, variance, and standard deviation."
        ]
      },
      "learn-basic-oop-by-building-a-shopping-cart": {
        "title": "Learn Basic OOP by Building a Shopping Cart",
        "intro": [
          "OOP, or Object Oriented Programming, is one of the major approaches to the software development process. In OOP, developers use objects and classes to structure their code.",
          "In this shopping cart project, you'll learn how to define classes and use them. You'll create class instances and implement methods for data manipulation.",
          "This project will cover concepts like the ternary operator, the spread operator, the <code>this</code> keyword, and more."
        ]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Learn Fetch and Promises by Building an fCC Authors Page",
        "intro": [
          "One common aspect of web development is learning how to fetch data from an external API, then work with asynchronous JavaScript.",
          "This freeCodeCamp authors page project will show you how to use the fetch method, then dynamically update the DOM to display the fetched data.",
          "This project will also teach you how to paginate your data so you can load results in batches."
        ]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Learn Regular Expressions by Building a Spam Filter",
        "intro": [
          "Regular expressions, often shortened to \"regex\" or \"regexp\", are patterns that help programmers match, search, and replace text. Regular expressions are powerful, but can be difficult to understand because they use so many special characters.",
          "In this spam filter project, you'll learn about capture groups, positive lookaheads, negative lookaheads, and other techniques to match any text you want."
        ]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Learn Basic Algorithmic Thinking by Building a Number Sorter",
        "intro": [
          "In computer science, there are fundamental sorting algorithms that all developers should learn. In this number sorter project, you'll learn how to implement and visualize different sorting algorithms like bubble sort, selection sort, and insertion sort – all with JavaScript.",
          "This project will help you understand the fundamental concepts behind these algorithms, and how you can apply them to sort numerical data in web applications."
        ]
      },
      "review-algorithmic-thinking-by-building-a-dice-game": {
        "title": "Review Algorithmic Thinking by Building a Dice Game",
        "intro": [
          "Algorithmic thinking involves the ability to break down complex problems into a sequence of well-defined, step-by-step instructions.",
          "In this Dice game project, you’ll learn how to manage game state, implement game logic for rolling dice, keeping score, and applying rules for various combinations.",
          "This project covers concepts such as event handling, array manipulation, conditional logic, and updating the user interface dynamically based on game state."
        ]
      },
      "learn-intermediate-oop-by-building-a-platformer-game": {
        "title": "Learn Intermediate OOP by Building a Platformer Game",
        "intro": [
          "Coding a game is a great way to grasp fundamental programming principles, while also creating an interactive gaming experience.",
          "In this platformer game project, you'll continue to learn about classes, objects, inheritance, and encapsulation. You'll also learn how to design and organize game elements efficiently and gain insights into problem-solving and code reusability."
        ]
      },
      "learn-localstorage-by-building-a-todo-app": {
        "title": "Learn localStorage by Building a Todo App",
        "intro": [
          "Local storage is a web browser feature that lets web applications store key-value pairs persistently within a user's browser. This allows web apps to save data during one session, then retrieve it in a later page session.",
          "In this TODO application, you'll learn how to handle form inputs, manage local storage, perform CRUD (Create, Read, Update, Delete) operations on tasks, implement event listeners, and toggle UI elements."
        ]
      },
      "learn-the-date-object-by-building-a-date-formatter": {
        "title": "Learn the Date Object by Building a Date Formatter",
        "intro": [
          "Working with dates in JavaScript can be challenging. You have to navigate various methods, formats, and time zones. In this project, you'll learn how to work with the JavaScript Date object, including its methods and properties. You'll also learn how to correctly format dates.",
          "This project will cover concepts such as the <code>getDate()</code>, <code>getMonth()</code>, and <code>getFullYear()</code> methods."
        ]
      },
      "learn-asynchronous-programming-by-building-an-fcc-forum-leaderboard": {
        "title": "Learn Asynchronous Programming by Building an fCC Forum Leaderboard",
        "intro": [
          "JavaScript is an asynchronous programming language. And this project will help you gain proficiency in asynchronous concepts. You'll code your own freeCodeCamp forum leaderboard.",
          "This project will cover the Fetch API, promises, Async/Await, and the try..catch statement."
        ]
      },
      "learn-basic-string-and-array-methods-by-building-a-music-player": {
        "title": "Learn Basic String and Array Methods by Building a Music Player",
        "intro": [
          "Now let's learn some essential string and array methods like the <code>find()</code>, <code>forEach()</code>, <code>map()</code>, and <code>join()</code>. These methods are crucial for developing dynamic web applications.",
          "In this project, you'll code a basic MP3 player using HTML, CSS, and JavaScript. The project covers fundamental concepts such as handling audio playback, managing a playlist, implementing play, pause, next, previous, and shuffle functionalities. You'll even learn how to dynamically update your user interface based on the current song."
        ]
      },
      "learn-recursion-by-building-a-decimal-to-binary-converter": {
        "title": "Learn Recursion by Building a Decimal to Binary Converter",
        "intro": [
          "Recursion is a programming concept where a function calls itself. This can reduce a complex problem into simpler sub-problems, until they become straightforward to solve.",
          "In this project, you’ll build a decimal-to-binary converter using JavaScript. You’ll learn the fundamental concepts of recursion, explore the call stack, and build out a visual representation of the recursion process through an animation."
        ]
      },
      "learn-introductory-javascript-by-building-a-pyramid-generator": {
        "title": "Learn Introductory JavaScript by Building a Pyramid Generator",
        "intro": [
          "JavaScript is a powerful scripting language that you can use to make web pages interactive. It's one of the core technologies of the web, along with HTML and CSS. All modern browsers support JavaScript.",
          "In this practice project, you'll learn fundamental programming concepts in JavaScript by coding your own Pyramid Generator. You'll learn how to work with arrays, strings, functions, loops, <code>if/else</code> statements, and more."
        ]
      },
      "review-js-fundamentals-by-building-a-gradebook-app": {
        "title": "Review JavaScript Fundamentals by Building a Gradebook App",
        "intro": [
          "In this mini project, you will get to review JavaScript fundamentals like functions, variables, conditionals and more by building a gradebook app.",
          "This will give you an opportunity to solve small problems and get a better understanding of the basics."
        ]
      },
      "learn-basic-debugging-by-building-a-random-background-color-changer": {
        "title": "Learn Basic Debugging by Building a Random Background Color Changer",
        "intro": [
          "Debugging is the process of going through your code, finding any issues, and fixing them.",
          "In this project, you will help CamperBot build a random background color changer and help them find and fix errors."
        ]
      },
      "review-dom-manipulation-by-building-a-rock-paper-scissors-game": {
        "title": "Review DOM Manipulation by Building a Rock, Paper, Scissors Game",
        "intro": [
          "In the previous projects you learned how to work with basic DOM manipulation. Now it is time to review what you have learned by building a Rock, Paper, Scissors game.",
          "In this mini project, you will review conditionals, functions, <code>getElementById</code>, and more. This project will give you an opportunity to solve small problems and get a better understanding of the basics."
        ]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Front-End-Entwicklungsbibliotheken",
    "intro": [
      "Jetzt, wo du mit HTML, CSS und JavaScript vertraut bist, kannst du deine Fähigkeiten verbessern, indem du einige der beliebtesten Front-End-Bibliotheken der Branche lernst.",
      "In der Zertifizierung für Front-End-Entwicklungsbibliotheken lernst du, wie du deine Seite mit Bootstrap schnell gestalten kannst. Du lernst auch, wie du Logik zu deinen CSS-Styles hinzufügen und sie mit Sass erweitern kannst.",
      "Später baust du einen Warenkorb und andere Anwendungen, um zu lernen, wie du mit React und Redux leistungsstarke Single Page Applications (SPAs) erstellen kannst."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap ist ein Front-End-Framework, das für das Design von responsiven Webseiten und Anwendungen verwendet wird. Es verfolgt einen Mobile-First-Ansatz für die Webentwicklung und beinhaltet vorgefertigte CSS-Stile und -Klassen sowie einige JavaScript-Funktionen.",
          "In diesem Kurs lernst du, wie du mit Bootstrap responsive Websites erstellst und die enthaltenen Klassen nutzt, um Buttons, Bilder, Formulare, Navigation und andere gängige Elemente zu gestalten."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery ist eine der am meisten genutzten JavaScript-Bibliotheken der Welt.",
          "Im Jahr 2006, als es veröffentlicht wurde, behandelten alle großen Browser JavaScript etwas anders. jQuery vereinfachte den Prozess des Schreibens von clientseitigem JavaScript und stellte außerdem sicher, dass dein Code in allen Browsern auf die gleiche Weise funktioniert.",
          "In diesem Kurs lernst du, wie du jQuery verwenden kannst, um verschiedene Elemente auf der Seite auszuwählen, zu entfernen, zu klonen und zu verändern."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, oder \"Syntactically Awesome StyleSheets\", ist eine Spracherweiterung von CSS. Es fügt Funktionen hinzu, die im Basis-CSS nicht verfügbar sind, die es dir erleichtern, die Stylesheets für deine Projekte zu vereinfachen und zu pflegen.",
          "In diesem Sass Kurs lernst du, wie du Daten in Variablen speicherst, CSS verschachtelst, wiederverwendbare Styles mit Mixins erstellst, Logik und Schleifen zu deinen Styles hinzufügst und vieles mehr."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React ist eine beliebte JavaScript-Bibliothek, um wiederverwendbare, komponentengesteuerte Benutzeroberflächen für Webseiten oder Anwendungen zu erstellen.",
          "React kombiniert HTML mit JavaScript-Funktionalität in einer eigenen Auszeichnungssprache namens JSX. React macht es auch einfach, den Datenfluss in der gesamten Anwendung zu verwalten.",
          "In diesem Kurs lernst du, wie du verschiedene React-Komponenten erstellst, Daten in Form von State Props verwaltest, verschiedene Lifecycle-Methoden wie <code>componentDidMount</code> verwendest und vieles mehr."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "Wenn Anwendungen größer und umfangreicher werden, wird die Verwaltung von gemeinsam genutzten Daten viel schwieriger. Redux wird als \" vorhersagbarer Zustandscontainer für JavaScript-Apps\" definiert, der dabei hilft, dass deine Apps vorhersagbar funktionieren und einfacher zu testen sind.",
          "Obwohl du Redux mit jeder Ansichtsbibliothek verwenden kannst, stellen wir Redux hier vor, bevor wir es in den nächsten Kursen mit React kombinieren.",
          "In diesem Kurs lernst du die Grundlagen von Redux stores, actions, reducers und middleware, um Daten in deiner Anwendung zu verwalten."
        ]
      },
      "react-and-redux": {
        "title": "React und Redux",
        "intro": [
          "React und Redux werden oft zusammen erwähnt, und das aus gutem Grund. Der Entwickler, der Redux geschaffen hat, war ein React-Entwickler, der es einfacher machen wollte, Daten über verschiedene Komponenten hinweg zu teilen.",
          "Jetzt, wo du weißt, wie du den Fluss von geteilten Daten mit Redux verwalten kannst, ist es an der Zeit, dieses Wissen mit React zu kombinieren. In den React- und Redux-Kursen baust du eine React-Komponente und lernst, wie du den Zustand lokal auf der Komponentenebene und in der gesamten Anwendung mit Redux verwalten kannst."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Projekte für Front-End-Entwicklung-Bibliotheken",
        "intro": [
          "Es ist an der Zeit, deine Fähigkeiten im Bereich der Front-End-Entwicklungs-Bibliotheken auf die Probe zu stellen. Benutze Bootstrap, jQuery, Sass, React und Redux, um 5 Projekte zu bauen, die alles testen, was du bis zu diesem Punkt gelernt hast.",
          "Schließe alle 5 Projekte ab und du erhältst die Zertifizierung für Front-End-Entwicklungs-Bibliotheken."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Datenvisualisierung",
    "intro": [
      "Daten sind überall um uns herum, aber ohne Form und Kontext bedeuten sie nicht viel.",
      "In der Datenvisualisierung-Zertifizierung erstellst du Diagramme, Grafiken und Karten, um verschiedene Arten von Daten mit der D3.js Bibliothek zu präsentieren.",
      "Du lernst auch etwas über JSON (JavaScript Object Notation) und wie man mit Daten online über eine API (Application Programming Interface) arbeitet."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Datenvisualisierung mit D3",
        "intro": [
          "D3, oder D3.js, steht für Data Driven Documents. Es ist eine JavaScript Bibliothek, um dynamische und interaktive Datenvisualisierungen im Browser zu erstellen.",
          "D3 ist so aufgebaut, dass es mit gängigen Webstandards arbeitet - nämlich HTML, CSS und Scalable Vector Graphics (SVG).",
          "D3 unterstützt viele verschiedene Arten von Eingangsdatenformaten. Mit den leistungsstarken eingebauten Methoden kannst du diese Daten dann in verschiedene Diagramme, Graphen und Karten umwandeln.",
          "In den Kursen zur Datenvisualisierung mit D3 lernst du, wie du mit Daten arbeitest, um verschiedene Diagramme, Graphen, Hover-Elemente und andere Zutaten zu erstellen, um dynamische und attraktive Datenvisualisierungen zu erstellen."
        ]
      },
      "json-apis-and-ajax": {
        "title": "JSON APIs und AJAX",
        "intro": [
          "Ähnlich wie Benutzeroberflächen Menschen bei der Verwendung von Programmen helfen, helfen APIs (Application Programming Interfaces) Programmen bei der Interaktion mit anderen Programmen. APIs sind Werkzeuge, die Computer verwenden, um miteinander zu kommunizieren, unter anderem um Daten zu senden und zu empfangen.",
          "Programmierer verwenden häufig AJAX (Asynchronous JavaScript and XML), wenn sie mit APIs arbeiten. AJAX bezieht sich auf eine Gruppe von Technologien, die asynchrone Anfragen an einen Server stellen, um Daten zu übertragen, und dann alle zurückgegebenen Daten in die Seite laden. Und die Daten, die zwischen dem Browser und dem Server übertragen werden, liegen oft in einem Format namens JSON (JavaScript Object Notation) vor.",
          "In diesem Kurs lernst du die Grundlagen über die Arbeit mit APIs und verschiedenen AJAX Technologien im Browser."
        ]
      },
      "data-visualization-projects": {
        "title": "Datenvisualisierungsprojekte",
        "intro": [
          "Jetzt, wo du gelernt hast, wie man mit D3, APIs und AJAX-Technologien arbeitet, kannst du deine Fähigkeiten mit diesen 5 Datenvisualisierungsprojekten auf die Probe stellen.",
          "In diesen Projekten musst du Daten abrufen und einen Datensatz parsen und dann D3 verwenden, um verschiedene Datenvisualisierungen zu erstellen. Beende sie alle, um deine Datenvisualisierungs-Zertifizierung zu erhalten."
        ]
      },
      "d3-dashboard": {
        "title": "D3 Dashboard",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Relational Database",
    "intro": [
      "In diesen Kursen verwendest du echte Entwickler-Tools und Software wie VS Code, PostgreSQL und die Linux/Unix-Kommandozeile, um interaktive Tutorials zu absolvieren und Projekte zu erstellen.",
      "Diese Kurse beginnen mit den grundlegenden Bash-Befehlen. Über das Terminal lernst du alles von der Navigation und dem Umgang mit dem Dateisystem über das Skripting in der Bash bis hin zur fortgeschrittenen Nutzung.",
      "Als Nächstes lernst du, wie du eine relationale Datenbank mit PostgreSQL, einem Datenbankmanagementsystem, und SQL, der Sprache dieser Datenbanken, erstellst und verwendest.",
      "Schließlich lernst du Git kennen, das Versionskontrollsystem, ein unverzichtbares Werkzeug für jeden Entwickler."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "Himmelskörperdatenbank",
        "intro": [
          "Dies ist eines der Projekte, das du zum Erwerb deines Zertifikats benötigst.",
          "In diesem Projekt wirst du eine Datenbank für Himmelskörper mit PostgreSQL erstellen."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Zahlenratespiel",
        "intro": [
          "Dies ist eines der Projekte, das du zum Erwerb deines Zertifikats benötigst.",
          "In diesem Projekt verwendest du Bash-Skripte, PostgreSQL und Git, um ein Zahlenratespiel zu erstellen, das im Terminal läuft und Benutzerinformationen speichert."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "Periodensystemdatenbank",
        "intro": [
          "Dies ist eines der Projekte, das du zum Erwerb deines Zertifikats benötigst.",
          "For this project, you will create a Bash script to get information about chemical elements from a periodic table database."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Salon-Terminplaner",
        "intro": [
          "Dies ist eines der Projekte, das du zum Erwerb deines Zertifikats benötigst.",
          "In diesem Projekt erstellst du ein interaktives Bash-Programm, das PostgreSQL nutzt, um die Kunden und Termine deines Salons zu verwalten."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "WM-Datenbank",
        "intro": [
          "Dies ist eines der Projekte, das du zum Erwerb deines Zertifikats benötigst.",
          "In diesem Projekt erstellst du ein Bash-Skript, das Informationen von WM-Spielen in PostgreSQL übernimmt und dann die Datenbank nach nützlichen Statistiken abfragt."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Lerne Bash für Fortgeschrittene, indem du einen Kitty Ipsum Übersetzer erstellst",
        "intro": [
          "Hinter den Bash-Befehlen steckt mehr, als du vielleicht denkst.",
          "In diesem Kurs mit 140 Lektionen lernst du einige komplexere Befehle und die Details, wie die Befehle funktionieren."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Lerne Bash und SQL durch den Aufbau eines Fahrradverleihs",
        "intro": [
          "In diesem Kurs mit 210 Lektionen erstellst du ein interaktives Bash-Programm, das mit Hilfe von PostgreSQL Mietinformationen für deinen Fahrradverleih speichert."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Bash lernen durch das Erstellen eines Textbausteines (Boilerplate)",
        "intro": [
          "Mit dem Terminal kannst du Textbefehle an deinen Computer senden, mit denen du das Dateisystem manipulieren, Programme ausführen, Aufgaben automatisieren und vieles mehr kannst.",
          "In diesem Kurs mit 170 Lektionen lernst du Terminal-Befehle, indem du eine Website-Boilerplate nur über die Kommandozeile erstellst."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Lerne Bash-Scripting, indem du fünf Programme erstellst",
        "intro": [
          "Bash-Skripte kombinieren Terminalbefehle und Logik zu Programmen, die Aufgaben ausführen oder automatisieren können, und vieles mehr.",
          "In diesem Kurs mit 220 Lektionen lernst du weitere Terminalbefehle kennen und wie du sie in Bash-Skripten verwenden kannst, indem du fünf kleine Programme erstellst."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Git lernen durch Erstellen eines SQL-Referenzobjekts",
        "intro": [
          "Git ist ein Versionskontrollsystem, das alle Änderungen, die du an deiner Codebasis vornimmst, aufzeichnet.",
          "In diesem Kurs mit 240 Lektionen lernst du, wie Git den Überblick über deinen Code behält, indem es ein Objekt mit häufig verwendeten SQL-Befehlen erstellt."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Nano lernen durch den Bau einer Burg",
        "intro": [
          "Nano ist ein Programm, mit dem du Dateien direkt im Terminal bearbeiten kannst.",
          "In diesem Kurs mit 40 Lektionen lernst du, wie du Dateien im Terminal mit Nano bearbeitest, während du eine Burg baust."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Relationale Datenbanken lernen, indem du eine Mario-Datenbank erstellst",
        "intro": [
          "Eine relationale Datenbank organisiert die Daten in Tabellen, die durch Beziehungen miteinander verbunden sind.",
          "In diesem Kurs mit 165 Lektionen lernst du die Grundlagen einer relationalen Datenbank kennen, indem du eine PostgreSQL-Datenbank mit Videospielcharakteren erstellst."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Lerne SQL, indem du eine Schülerdatenbank aufbaust: Teil 1",
        "intro": [
          "SQL, oder Structured Query Language, ist die Sprache für die Kommunikation mit einer relationalen Datenbank.",
          "In diesem Kurs mit 140 Lektionen erstellst du ein Bash-Skript, das SQL verwendet, um Informationen über deine Informatikstudenten in PostgreSQL einzugeben."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Lerne SQL, indem du eine Schülerdatenbank aufbaust: Teil 2",
        "intro": [
          "SQL-Join-Befehle werden verwendet, um Informationen aus mehreren Tabellen in einer relationalen Datenbank zu kombinieren",
          "In diesem Kurs mit 140 Lektionen wirst du deine Schülerdatenbank vervollständigen und gleichzeitig tiefer in die SQL-Befehle eintauchen."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Back-End Entwicklung und APIs",
    "intro": [
      "Bis zu diesem Punkt hast du JavaScript nur im Front-End verwendet, um einer Seite Interaktivität hinzuzufügen, Aufgaben mit Algorithmen zu lösen oder eine SPA zu bauen. Aber JavaScript kann auch im Back-End, also auf dem Server, verwendet werden, um ganze Webanwendungen zu erstellen.",
      "Heutzutage ist eine der beliebtesten Arten, Anwendungen zu erstellen, Microservices. Das sind kleine, modulare Anwendungen, die zusammenarbeiten und ein größeres Ganzes bilden.",
      "In the Back End Development and APIs Certification, you'll learn how to write back end apps with Node.js and npm. You'll also build web applications with the Express framework, and build a People Finder microservice with MongoDB and the Mongoose library."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Pakete mit NPM verwalten",
        "intro": [
          "npm (Node Package Manager) ist ein Kommandozeilen-Tool zum Installieren, Erstellen und Teilen von Paketen mit JavaScript-Code, der für Node.js geschrieben wurde. Es gibt viele Open-Source-Pakete, die auf npm verfügbar sind. Bevor du also ein Projekt beginnst, solltest du dir etwas Zeit nehmen, um dich zu informieren, damit du nicht am Ende das Rad neu erfinden musst, wenn du z.B. mit Daten arbeitest oder Daten von einer API abrufst.",
          "In diesem Kurs lernst du die Grundlagen der Verwendung von npm. Du erfährst, wie du mit der <code>package.json</code> arbeitest und wie du deine installierten Abhängigkeiten (Dependencies) verwalten kannst."
        ]
      },
      "basic-node-and-express": {
        "title": "Basis Node und Express",
        "intro": [
          "Node.js ist eine JavaScript-Laufzeitumgebung, die es Entwicklern ermöglicht, Back-End-Programme (serverseitige Programme) in JavaScript zu schreiben. Node.js kommt mit einer Handvoll eingebauter Module - kleine, unabhängige Programme - die dabei helfen. Einige der Kernmodule sind HTTP, das wie ein Server agiert, und Dateisystem, ein Modul zum Lesen und Ändern von Dateien.",
          "In den letzten Kursen hast du gelernt, Pakete von npm zu installieren und zu verwalten, die Sammlungen von kleineren Modulen sind. Diese Pakete können dir helfen, größere, komplexere Anwendungen zu bauen.",
          "Express ist ein leichtgewichtiges Framework für Webanwendungen und eines der beliebtesten Pakete auf npm. Mit Express ist es viel einfacher, einen Server zu erstellen und das Routing für deine Anwendung zu verwalten. Damit wird z. B. sichergestellt, dass Besucher auf die richtige Seite geleitet werden, wenn sie einen bestimmten Endpunkt wie <pre>/blog</pre> besuchen.",
          "In diesem Kurs lernst du die Grundlagen von Node und Express. Du erfährst, wie du einen Server erstellst, verschiedene Dateien bereitstellst und verschiedene Anfragen des Browsers bearbeitest."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB und Mongoose",
        "intro": [
          "MongoDB ist eine Datenbankanwendung, die JSON-Dokumente (oder Datensätze) speichert, die du in deiner Anwendung verwenden kannst. Im Gegensatz zu SQL - einer anderen Art von Datenbank - ist MongoDB eine nicht-relationale oder \"NoSQL\"-Datenbank. Das bedeutet, dass MongoDB alle zugehörigen Daten innerhalb eines Datensatzes speichert, anstatt sie über viele voreingestellte Tabellen wie in einer SQL-Datenbank zu speichern.",
          "Mongoose ist ein beliebtes npm-Paket für die Interaktion mit MongoDB. Mit Mongoose kannst du einfache JavaScript-Objekte anstelle von JSON verwenden, was die Arbeit mit MongoDB einfacher macht. Außerdem kannst du mit Mongoose Schemas für deine Dokumente erstellen, damit du nicht aus Versehen den falschen Datentyp speicherst und später Fehler verursachst.",
          "In den MongoDB- und Mongoose-Kursen lernst du die Grundlagen der Arbeit mit persistenten Daten, einschließlich der Einrichtung eines Modells und dem Speichern, Löschen und Suchen von Dokumenten in der Datenbank."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Projekte für Back-End Entwicklung und APIs",
        "intro": [
          "Du hast bereits mit APIs gearbeitet, aber jetzt, wo du npm, Node, Express, MongoDB und Mongoose kennst, ist es an der Zeit, deine eigenen zu bauen. Nutze alles, was du bisher gelernt hast, um 5 verschiedene Microservices zu erstellen, also kleinere Anwendungen, die in ihrem Umfang begrenzt sind.",
          "Nachdem du diese erstellt hast, wirst du 5 coole Microservice-APIs haben, mit denen du bei Freunden, Familie und potentiellen Arbeitgebern angeben kannst. Oh, und du wirst auch eine glänzende neue Zertifizierung für Back-End-Entwicklung und APIs haben."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Qualitätssicherung",
    "intro": [
      "Wenn deine Programme oder Webanwendungen komplexer werden, solltest du sie testen, um sicherzustellen, dass neue Änderungen nicht die ursprüngliche Funktionalität zerstören.",
      "In der Qualitätssicherungs-Zertifizierung lernst du, wie du mit Chai Tests schreibst, um sicherzustellen, dass deine Anwendungen so funktionieren, wie du es von ihnen erwartest.",
      "Dann baust du eine Chat-Anwendung, um fortgeschrittene Node- und Express-Konzepte zu lernen. Du wirst auch Pug als Template-Engine, Passport für die Authentifizierung und Socket.io für die Echtzeitkommunikation zwischen dem Server und den verbundenen Clients verwenden."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Qualitätssicherung und Testen mit Chai",
        "intro": [
          "Chai ist eine JavaScript Testbibliothek, die dir hilft zu bestätigen, dass sich dein Programm immer noch so verhält, wie du es erwartest, nachdem du Änderungen an deinem Code vorgenommen hast.",
          "Mit Chai kannst du Tests schreiben, die die Anforderungen deines Programms beschreiben und sehen, ob dein Programm sie erfüllt.",
          "In diesem Kurs lernst du etwas über Assertions, Deep Equality, Wahrhaftigkeit (\"truthiness\"), das Testen von APIs und andere Grundlagen zum Testen von JavaScript-Anwendungen."
        ]
      },
      "advanced-node-and-express": {
        "title": "Node und Express für Fortgeschrittene",
        "intro": [
          "Jetzt ist es an der Zeit, tief in Node.js und Express.js einzutauchen, indem wir eine Chat-Anwendung mit einem Anmeldesystem bauen.",
          "Um das Anmeldesystem sicher zu implementieren, musst du etwas über Authentifizierung lernen. Dies ist der Akt der Identitätsprüfung einer Person oder eines Prozesses.",
          "In diesem Kurs lernst du, wie du mit Passport die Authentifizierung verwaltest, mit Pug wiederverwendbare Templates für die schnelle Erstellung des Front-Ends erstellst und Websockets für die Echtzeitkommunikation zwischen Clients und Server nutzt."
        ]
      },
      "quality-assurance-projects": {
        "title": "Qualitätssicherungsprojekte",
        "intro": [
          "Jetzt, wo du dich sowohl im Front-End als auch im Back-End gut auskennst, ist es an der Zeit, all die Fähigkeiten und Konzepte anzuwenden, die du bis zu diesem Punkt gelernt hast. Du wirst 5 verschiedene Webapplikationen erstellen und für jede einzelne Tests schreiben, um sicherzustellen, dass sie funktionieren und mit verschiedenen Randfällen umgehen können.",
          "Nachdem du diese Qualitätssicherungsprojekte abgeschlossen hast, hast du 5 weitere Projekte in der Tasche und eine neue Zertifizierung, die du in deinem Portfolio vorzeigen kannst."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Scientific Computing with Python (Beta)",
    "intro": [
      "The Scientific Computing with Python (Beta) curriculum will equip you with the skills to analyze and manipulate data using Python, a powerful and versatile programming language. You'll learn key concepts like data structures, algorithm, Object Oriented Programming, and how to perform complex calculations using a variety of tools.",
      "This comprehensive course will guide you through the fundamentals of scientific computing, including data structures, and algorithms."
    ],
    "note": "",
    "blocks": {
      "learn-string-manipulation-by-building-a-cipher": {
        "title": "Learn String Manipulation by Building a Cipher",
        "intro": [
          "Python is a powerful and popular programming language widely used for data science, data visualization, web development, game development, machine learning and more.",
          "In this project, you'll learn fundamental programming concepts in Python, such as variables, functions, loops, and conditional statements. You'll use these to code your first programs."
        ]
      },
      "learn-how-to-work-with-numbers-and-strings-by-implementing-the-luhn-algorithm": {
        "title": "Learn How to Work with Numbers and Strings by Implementing the Luhn Algorithm",
        "intro": [
          "The Luhn Algorithm is widely used for error-checking in various applications, such as verifying credit card numbers.",
          "By building this project, you'll gain experience working with numerical computations and string manipulation."
        ]
      },
      "learn-list-comprehension-by-building-a-case-converter-program": {
        "title": "Learn Python List Comprehension by Building a Case Converter Program",
        "intro": [
          "List Comprehension is a way to construct a new Python list from an iterable types: lists, tuples, and strings. All without using a for loop or the `.append()` list method.",
          "In this project, you'll write a program that takes a string formatted in Camel Case or Pascal Case, then converts it into Snake Case.",
          "The project has two phases: first you'll use a for loop to implement the program. Then you'll learn how to use List Comprehension instead of a loop to achieve the same results."
        ]
      },
      "learn-regular-expressions-by-building-a-password-generator": {
        "title": "Learn Regular Expressions by Building a Password Generator",
        "intro": [
          "A Python module is a file that contains a set of statements and definitions that you can use in your code.",
          "In this project, you'll learn how to import modules from the Python standard library. You'll also learn how to use Regular Expressions by building your own password generator program."
        ]
      },
      "learn-algorithm-design-by-building-a-shortest-path-algorithm": {
        "title": "Learn Algorithm Design by Building a Shortest Path Algorithm",
        "intro": [
          "Algorithms are step-by-step procedures that developers use to perform calculations and solve computational problems.",
          "In this project, you'll learn how to use functions, loops, conditional statements, and dictionary comprehensions to implement a Shortest Path algorithm."
        ]
      },
      "learn-recursion-by-solving-the-tower-of-hanoi-puzzle": {
        "title": "Learn Recursion by Solving the Tower of Hanoi Puzzle",
        "intro": [
          "Recursion is a programming approach that allows you to solve complicated computational problems with just a little code.",
          "In this project, you'll start with a loop-based approach to solving the tower of Hanoi mathematical puzzle. Then you'll learn how to implement a recursive solution."
        ]
      },
      "learn-data-structures-by-building-the-merge-sort-algorithm": {
        "title": "Learn Data Structures by Building the Merge Sort Algorithm",
        "intro": [
          "The Merge Sort Algorithm is a sorting algorithm based on the divide and conquer principle.",
          "In this project, you'll learn how to interact with data structures by sorting a list of random numbers using the Merge Sort Algorithm."
        ]
      },
      "learn-classes-and-objects-by-building-a-sudoku-solver": {
        "title": "Learn Classes and Objects by Building a Sudoku Solver",
        "intro": [
          "Classes and objects are important programming concepts. These Object-Oriented Programming tools help developers to achieve code modularity, abstraction, and readability. And they promote reusability.",
          "In this Sudoku Solver project, you'll learn how to use classes and objects to build a Sudoku grid and to solve a Sudoku puzzle."
        ]
      },
      "learn-tree-traversal-by-building-a-binary-search-tree": {
        "title": "Learn Tree Traversal by Building a Binary Search Tree",
        "intro": [
          "A Binary Search Tree (BST) is an common data structure where data is sorted hierarchically.",
          "In this project, you'll learn how to construct your own BST and perform an in-order traversal. You'll also learn key operations like insertion, search, and deletion."
        ]
      },
      "learn-lambda-functions-by-building-an-expense-tracker": {
        "title": "Learn Lambda Functions by Building an Expense Tracker",
        "intro": [
          "Lambda functions give you a concise way to write small, throwaway functions in your code.",
          "In this project, you'll explore the power of Lambda Functions by creating an expense tracker. Your resulting app will demonstrate how you can use Lambda Functions for efficient, streamlined operations."
        ]
      },
      "build-an-arithmetic-formatter-project": {
        "title": "Build an Arithmetic Formatter Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-time-calculator-project": {
        "title": "Build a Time Calculator Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-budget-app-project": {
        "title": "Build a Budget App Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-polygon-area-calculator-project": {
        "title": "Build a Polygon Area Calculator Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-probability-calculator-project": {
        "title": "Build a Probability Calculator Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "learn-interfaces-by-building-an-equation-solver": {
        "title": "Learn Interfaces by Building an Equation Solver",
        "intro": [
          "Abstract classes enable you to define formal interfaces - objects acting as blueprints for classes.",
          "In this project, you'll discover how to implement an interface in Python while building a simple equation solver program."
        ]
      },
      "learn-special-methods-by-building-a-vector-space": {
        "title": "Learn Special Methods by Building a Vector Space",
        "intro": [
          "Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.",
          "In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space."
        ]
      },
      "learn-encapsulation-by-building-a-projectile-trajectory-calculator": {
        "title": "Learn Encapsulation by Building a Projectile Trajectory Calculator",
        "intro": [
          "Encapsulation is a core OOP principle based on writing code that limits direct access to data.",
          "In this project, you'll discover new concepts related to encapsulation, such as getters, setters, and name mangling, and you'll use them together with what you already learned to create a program that calculates a projectile trajectory."
        ]
      },
      "learn-the-bisection-method-by-finding-the-square-root-of-a-number": {
        "title": "Learn the Bisection Method by Finding the Square Root of a Number",
        "intro": [
          "Numerical methods are used to approximate solutions to mathematical problems that are difficult or impossible to solve analytically.",
          "In this project, you will explore the numerical method of bisection to find the square root of a number by iteratively narrowing down the possible range of values that contain the square root."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Datenanalyse mit Python",
    "intro": [
      "Datenanalyse gibt es schon seit Langem. Aber bis vor ein paar Jahren haben Entwickler sie mit teuren, proprietären Tools wie Tableau praktiziert. Doch in letzter Zeit haben Python, SQL und andere offene Bibliotheken die Datenanalyse für immer verändert.",
      "In der Zertifizierung \"Datenanalyse mit Python\" lernst du die Grundlagen der Datenanalyse mit Python. Am Ende dieser Zertifizierung wirst du wissen, wie man Daten aus Quellen wie CSV und SQL einliest und wie man Bibliotheken wie Numpy, Pandas, Matplotlib und Seaborn verwendet, um Daten zu verarbeiten und zu visualisieren."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Datenanalyse mit Python",
        "intro": [
          "In diesen umfassenden Videokursen, erstellt von Santiago Basulto, lernst du den gesamten Prozess der Datenanalyse. Du liest Daten aus verschiedenen Quellen (CSV, SQL, Excel), verarbeitest diese Daten mit NumPy und Pandas und visualisierst sie mit Matplotlib und Seaborn,",
          "Zusätzlich haben wir einen ausführlichen Jupyter Notebook-Kurs und eine schnelle Python-Referenz zur Auffrischung deiner Programmierkenntnisse integriert."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Lerne die Grundlagen der NumPy Bibliothek in dem folgenden Videokurs, der von Keith Galli erstellt wurde.",
          "In diesem Kurs lernst du, wie NumPy funktioniert und wie es im Vergleich zu Pythons eingebauten Listen funktioniert. Außerdem lernst du, wie man mit NumPy Code schreibt, Indizierung, Reshaping, angewandte Statistik und vieles mehr."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Projekte Datenanalyse mit Python",
        "intro": [
          "Es gibt viele Möglichkeiten, Daten mit Python zu analysieren. Indem du diese Projekte abschließt, zeigst du, dass du ein gutes Grundwissen über Datenanalyse mit Python hast.",
          "Schließe sie alle ab, um deine Zertifizierung \"Datenanalyse mit Python\" zu erhalten."
        ]
      }
    }
  },
  "information-security": {
    "title": "Informationssicherheit",
    "intro": [
      "Bei sämtlichen Online-Aktivitäten ist eine große Menge an sensiblen Daten gefährdet: E-Mail-Adressen, Passwörter, Telefonnummern und vieles mehr.",
      "Mit der Zertifizierung für Informationssicherheit baust du eine sichere Web-App mit HelmetJS und lernst die Grundlagen zum Schutz der Daten von Menschen im Internet.",
      "Du wirst auch einen TCP-Client und einen Nmap- und Port-Scanner in Python bauen. So lernst du die Grundlagen von Penetrationstests - ein wichtiger Bestandteil guter Informationssicherheit."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Informationssicherheit mit HelmetJS",
        "intro": [
          "Dieser Programmierkurs konzentriert sich auf HelmetJS, eine Art Middleware für Express-basierte Anwendungen, die automatisch HTTP-Header setzt. Auf diese Weise kann sie verhindern, dass sensible Informationen ungewollt zwischen Server und Client weitergegeben werden.",
          "Das Absolvieren der folgenden Kurse wird dir helfen zu verstehen, wie du deine Webseite vor bösartigem Verhalten schützen kannst."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python für Penetrationstests",
        "intro": [
          "Diese Videokurse bringen dir Penetrationstests mit Python bei. Penetrationstests, auch bekannt als Pen-Test, sind simulierte Angriffe auf ein System, um es auf Schwachstellen zu überprüfen.",
          "In diesem Kurs lernst du etwas über Sockets, erstellst einen TCP-Server und -Client, baust einen Nmap-Scanner und andere Tools und Techniken, die Pen-Tester täglich verwenden."
        ]
      },
      "information-security-projects": {
        "title": "Projekte Informationssicherheit",
        "intro": [
          "Jetzt ist es an der Zeit, deine neuen Fähigkeiten im Bereich der Informationssicherheit in die Tat umzusetzen. Diese Projekte geben dir die Möglichkeit, die erlernten Fähigkeiten, Prinzipien und Konzepte der Informationssicherheit anzuwenden.",
          "Wenn du fertig bist, wirst du eine Menge Projekte zur Informationssicherheit in der Tasche haben, zusammen mit einer Zertifizierung, mit der du vor Freunden, Familie und Arbeitgebern angeben kannst."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Maschinelles Lernen mit Python",
    "intro": [
      "Maschinelles Lernen hat viele praktische Anwendungen, die du in deinen Projekten oder bei der Arbeit nutzen kannst.",
      "In der Zertifizierung \"Maschinelles Lernen mit Python\" verwendest du das TensorFlow-Framework, um verschiedene neuronale Netze zu erstellen und fortgeschrittene Techniken wie natürliche Sprachverarbeitung und Reinforcement Learning (Bestärkendes Lernen) zu erforschen.",
      "Du wirst auch in neuronale Netze eintauchen und die Prinzipien hinter der Funktionsweise von tiefen, rekurrenten und konvolutionären neuronalen Netzen lernen."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "TensorFlow",
        "intro": [
          "TensorFlow ist ein Open-Source-Framework, das maschinelles Lernen und neuronale Netzwerke leichter nutzbar macht.",
          "Der folgende Videokurs wurde von Tim Ruscica, auch bekannt als \"Tech With Tim\", erstellt. Es wird dir helfen, TensorFlow und einige seiner mächtigen Fähigkeiten zu verstehen."
        ]
      },
      "how-neural-networks-work": {
        "title": "Wie neuronale Netzwerke funktionieren",
        "intro": [
          "Neuronale Netzwerke sind der Kern dessen, was wir heute künstliche Intelligenz nennen. Aber in der Vergangenheit waren sie schwer zu verstehen. Vor allem für Anfänger auf dem Gebiet des maschinellen Lernens.",
          "Selbst wenn du völlig neu in der Materie der neuronalen Netze bist, werden dich diese Videokurse von Brandon Rohrer mit den Konzepten und der Mathematik dahinter vertraut machen."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Projekte Maschinelles Lernen mit Python",
        "intro": [
          "Maschinelles Lernen hat viele praktische Anwendungen. Indem du diese kostenlosen und herausfordernden Coding-Projekte absolvierst, zeigst du, dass du ein gutes Grundwissen über maschinelles Lernen hast und qualifizierst dich für deine Zertifizierung \"Machine Learning with Python\"."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "College Algebra with Python",
    "intro": [
      "This course is designed as a one-semester college course. It consists of instructional videos, with Google Colaboratory notebooks to follow along interactively, assignments, and challenging projects.",
      "As you go through each part of this course in sequence, you will gain a full understanding of Algebra and how to write Python code to solve Algebra problems.",
      "Throughout this course, you will also build your own Algebra Colab notebook that you will be able to use as your custom calculator. This course (and the code you write here) will give you the foundation for a deeper math and data science understanding."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Learn Ratios and Proportions",
        "intro": [
          "Your journey begins here as you learn how to set up a Colab Notebook that can run Python code. Then, use the notebook to follow along with the videos to learn ratios and proportions using Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Learn How to Solve for X",
        "intro": [
          "This unit will focus on how to solve for an unknown number (often referred to as \"x\") using written Algebra and Python code."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Learn Fractions and Decimals",
        "intro": [
          "This unit will focus on converting decimals to fractions and percents."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Learn Functions and Graphing",
        "intro": ["This unit will teach you about math functions."]
      },
      "learn-linear-functions": {
        "title": "Learn Linear Functions",
        "intro": [
          "This unit will show you how to develop linear equations from two points."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Learn Common Factors and Square Roots",
        "intro": [
          "In this unit, you will learn how to find common factors and divide them out. This will be useful when simplifying fractions and factoring square roots."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Multi-Function Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a multi-function calculator."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Learn How to Graph Systems of Equations",
        "intro": [
          "This unit will focus on graphing two equations on the same coordinate plane, so that you can see where the lines intersect."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Learn How to Solve Systems of Equations",
        "intro": [
          "In this unit, you will learn how to solve a system of two equations (with two variables) without graphing. You will see how you can factor an equation and solve for a certain variable in Python. By the end of this unit, you will be able to solve and graph the system with one block of code."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Learn Applications of Linear Systems",
        "intro": [
          "In this unit, you will see how you can use the algebra you learned so far to solve real world problems."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Learn Quadratic Equations",
        "intro": [
          "This unit will go beyond linear equations, to work with exponents and graph parabolas. You will learn how to find key points in parabolas and how to solve quadratic equations."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Graphing Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a graphing calculator."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Learn Parent Graphs and Polynomials",
        "intro": [
          "This unit will show you many different types of \"parent\" graphs, the basic patterns that make up more complicated graphs. Polynomials are mathematical expressions with \"multiple things\" - the more complicated equations that are built with basic patterns. You will see what these graphs look like, how to modify them, and how to do this all with Python code."
        ]
      },
      "build-three-math-games-project": {
        "title": "Three Math Games",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build three math games."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Learn Business Applications of College Algebra",
        "intro": [
          "This unit will show you how to apply your solving and graphing skills to find cost, revenue, and profit. You will write code to develop a demand function from two points. You will see how price affects the profit graph and how all of these equations relate to each other."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Learn Simple and Compound Interest",
        "intro": [
          "This unit will show you how to calculate interest, loan payments, and the estimated value of investments. You will see the math formula and turn that into code. Because these formulas tend to get complicated, you will appreciate having the code where you can just modify a few values."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Learn Exponents and Logarithms",
        "intro": [
          "This unit will show you how exponents and logarithms are inverse functions, and how you can use these functions in various applications."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Financial Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a financial calculator."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "College Algebra with Python: Conclusion",
        "intro": [
          "This will be the last unit in this course. Let's look at how you can connect your Math and Python knowledge with external data."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Data Graph Explorer",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a data graph explorer."
        ]
      }
    }
  },
  "python-for-everybody": {
    "title": "Legacy Python for Everybody",
    "intro": [
      "Python is one of the most popular, flexible programming languages today. You can use it for everything from basic scripting to machine learning."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python for Everybody",
        "intro": [
          "Python for everybody is a free video course series that teaches the basics of using Python 3.",
          "The courses were created by Dr. Charles Severance (also known as Dr. Chuck). He is a Clinical Professor at the University of Michigan School of Information, where he teaches various technology-oriented courses including programming, database design, and web development."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Vorbereitung auf Bewerbungsgespräche",
    "intro": [
      "Wenn du nach kostenlosen Coding-Übungen suchst, um dich auf dein nächstes Vorstellungsgespräch vorzubereiten, haben wir das Richtige für dich.",
      "Dieser Bereich enthält hunderte von Coding Challenges, die dein Wissen über Algorithmen, Datenstrukturen und Mathematik testen. Es gibt auch eine Reihe von Projekten, die du mit nach Hause nehmen kannst, um deine Fähigkeiten zu stärken oder dein Portfolio zu erweitern."
    ],
    "note": "The Project Euler Project and Rosetta Code have been moved to their own courses. Go back to the curriculum to see the list of courses we offer.",
    "blocks": {
      "algorithms": {
        "title": "Algorithmen",
        "intro": [
          "In diesen kostenlosen Programmierübungen lernst du einige gängige Algorithmen kennen, die dir wahrscheinlich im echten Leben begegnen werden. Sie sind eine großartige Möglichkeit, deine Logik- und Programmierfähigkeiten zu verbessern.",
          "Diese Algorithmen werden häufig in Vorstellungsgesprächen verwendet, um die Fähigkeiten eines Bewerbers zu testen. Wir geben dir klare und prägnante Erklärungen, wie diese verschiedenen Algorithmen funktionieren, damit du eine Lösung für jeden einzelnen implementieren kannst."
        ]
      },
      "data-structures": {
        "title": "Datenstrukturen",
        "intro": [
          "Diese kostenlosen Programmierkurse sollen dir helfen, mit großen und komplexen Datenstrukturen umzugehen, mit denen du vielleicht noch nicht vertraut bist.",
          "In den folgenden Kursen lernst du jede Art von Datenstruktur kennen und implementierst Algorithmen, um dein Verständnis für sie zu vertiefen."
        ]
      },
      "take-home-projects": {
        "title": "Projekte für das Selbststudium",
        "intro": [
          "Vorstellungsgespräche waren schon immer stressig. Manchmal wird den Bewerbern ein Projekt mit auf den Weg gegeben, das sie außerhalb des Vorstellungsgesprächs fertigstellen müssen. Diese Art von Vorstellungsgesprächen erfordert in der Regel eine Menge Arbeit, aber sie sind eine großartige Möglichkeit für Arbeitgeber, um zu sehen, wie du dich im Job schlagen könntest.",
          "Entwickle die untenstehenden Bonus-Coding-Projekte für zusätzliche Praxis. Nimm dir Zeit, mach sie großartig und füge sie in deinem Lebenslauf oder Portfolio hinzu, um sie potenziellen Arbeitgebern zu zeigen."
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "The Odin Project - freeCodeCamp Remix (Beta)",
    "intro": [
      "The Odin Project was created in 2013 by a lone developer, Erik Trautman. Over the years, an open source community has sprung up to maintain and expand the project.",
      "freeCodeCamp has expanded upon the open source curriculum to make it run interactively in the browser, with tests to evaluate your code and ensure you've understood key concepts.",
      "If you want the original experience of configuring all of The Odin Project to run on your local computer, you can check out the original Odin Project on <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>The Odin Project website</a>. A huge thanks to The Odin Project community for continuing to maintain this valuable learning resource for developers all around the world.",
      "This course is unofficial, and not endorsed by The Odin Project. Changes to The Odin Project curriculum content have been made, and all instructional material for this course is licenced under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; The Odin Project</a>",
      "This course includes content from <a href='javascript.info'>JavaScript.info</a>, which is licenced under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>"
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Learn HTML Foundations",
        "intro": [
          "Get a solid grasp of HTML essentials with this course. From structuring web pages to understanding semantic tags, you'll build a strong foundation for creating well-organized and accessible content on the web."
        ]
      },
      "top-working-with-text": {
        "title": "Working with Text",
        "intro": [
          "Explore the intricacies of working with text in web development. Learn about text formatting, manipulation, and presentation to enhance your skills in creating web content."
        ]
      },
      "top-links-and-images": {
        "title": "Links and Images",
        "intro": [
          "Learn how to incorporate links and images into your web projects. This course covers the fundamentals of creating links and embedding images to make your websites more interactive and visually appealing."
        ]
      },
      "top-build-a-recipe-project": {
        "title": "Learn HTML Foundations by Building a Recipe Page",
        "intro": [
          "Put your HTML skills into practice by building a recipe page. This hands-on project allows you to apply your knowledge and create a functional web page while reinforcing key concepts of HTML development."
        ]
      },
      "top-learn-css-foundations": {
        "title": "Learn CSS Foundations",
        "intro": [
          "Dive into the world of Cascading Style Sheets (CSS) and learn how to style your HTML elements. Explore styling properties, selectors, and layouts to bring your web pages to life."
        ]
      },
      "top-learn-css-foundations-projects": {
        "title": "Learn CSS Foundations Projects",
        "intro": [
          "Take your CSS skills to the next level by working on practical projects. This course provides hands-on experience in applying CSS to create responsive designs for real-world scenarios."
        ]
      },
      "top-learn-css-specificity": {
        "title": "Learn CSS Specificity",
        "intro": [
          "Learn CSS specificity and gain a better understanding of how styles are applied to HTML elements. This course explores the nuances of CSS rules and helps you write efficient and targeted styles for your web pages."
        ]
      },
      "top-the-box-model": {
        "title": "Learn the Box Model",
        "intro": [
          "Learn the CSS box model with this course. Understand how elements are rendered on the web, and learn to manipulate spacing, borders, and padding to achieve your desired layout and design."
        ]
      },
      "top-introduction-to-flexbox": {
        "title": "Introduction to Flexbox",
        "intro": [
          "Discover the power of Flexbox, a layout model that simplifies the design of flexible and responsive web layouts. Learn how to create dynamic and adaptive page structures with ease."
        ]
      },
      "top-learn-block-and-inline": {
        "title": "Learn the difference between Block and Inline",
        "intro": [
          "Explore the distinctions between block and inline elements in HTML and CSS. This course provides insights into how these display types affect layout and behavior, empowering you to make informed design decisions."
        ]
      },
      "top-learn-variables-and-operators": {
        "title": "Learn Variables and Operators",
        "intro": [
          "Get started with JavaScript by learning about variables and operators. This course covers the fundamentals of JavaScript programming, including data types, operators, and variable declarations."
        ]
      },
      "top-learn-data-types-and-conditionals": {
        "title": "Learn Data Types and Conditionals",
        "intro": ["Learn about data types and conditionals in JavaScript."]
      },
      "top-learn-function-basics": {
        "title": "Learn Function Basics",
        "intro": ["Learn about functions in JavaScript."]
      },
      "top-basic-function-projects": {
        "title": "Basic Function Projects",
        "intro": [
          "Put your JavaScript skills to the test by building basic functions."
        ]
      },
      "top-learn-arrays-and-loops": {
        "title": "Learn Arrays and Loops",
        "intro": ["Learn about arrays and loops in JavaScript."]
      },
      "top-learn-to-solve-problems-and-understand-errors": {
        "title": "Learn to Solve Problems and Understand Errors",
        "intro": [
          "Learn how to solve problems and understand errors in JavaScript."
        ]
      },
      "top-build-a-rock-paper-scissors-game": {
        "title": "Build a Rock Paper Scissor Game",
        "intro": [
          "Put your JavaScript skills to the test by building a Rock Paper Scissors game."
        ]
      }
    }
  },
  "project-euler": {
    "title": "Project Euler",
    "intro": [
      "Complete the programming challenges below, from the massive Project Euler archives. These will harden your algorithm and mathematics knowledge.",
      "These problems range in difficulty and, for many, the experience is inductive chain learning. That is, by solving one problem, it will expose you to a new concept that allows you to undertake a previously inaccessible problem. Can you finish them all?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Project Euler Problems 1 to 100",
        "intro": [
          "In this first set of challenges, you will use mathematical concepts like the Fibonacci sequence, prime number theory, and combinatorics to write efficient algorithms to solve these problems."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Project Euler Problems 101 to 200",
        "intro": [
          "In this set of challenges, you'll build upon the skills you learned in the first part of the course and use more advanced concepts like vector computation, Pascal's pyramid, and the RSA algorithm to solve these problems efficiently."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Project Euler Problems 201 to 300",
        "intro": [
          "In this set of challenges, you'll continue to build upon the skills you learned earlier and use concepts like the binomial theorem, Hamming numbers, and the Collatz sequence to further develop your math and problem solving skills."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Project Euler Problems 301 to 400",
        "intro": [
          "Here you will continue to flex your mathematical and algorithmic skills as you use concepts such as combinatorial game theory, bitwise operations, and Golomb's self-describing sequence to develop efficient solutions to these problems."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Project Euler Problems 401 to 480",
        "intro": [
          "In this final set of challenges, you will need draw upon everything you learned up to this point and use advanced concepts like unitary divisors, the Kaprekar routine, and much more to solve these complex problems."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "(New) Foundational C# with Microsoft",
    "intro": [
      "This course offers a comprehensive introduction to C# programming, covering its core concepts, syntax, and practical application in software development.",
      "Through hands-on exercises and projects, you will learn the fundamentals of C#, including variables, data types, control structures, and object-oriented programming principles.",
      "By the end of this course, you will have gained the practical skills and knowledge needed to confidently leverage C# for building applications."
    ],
    "note": "Each section below has a trophy associated with it that you must earn on the Microsoft Learn platform. After earning each trophy, you need to verify them on freeCodeCamp. Once you have done those, you can qualify for the certification exam.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Write Your First Code Using C#",
        "intro": [
          "Begin your journey by learning to write your first code using C#. Develop a strong foundation as you explore the fundamentals and syntax of the language, setting the stage for your programming adventures."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Create and Run Simple C# Console Applications",
        "intro": [
          "Master the art of creating and running simple C# console applications. Dive into the world of console-based programming, where you will gain hands-on experience executing your code and seeing it in action."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Add Logic to C# Console Applications",
        "intro": [
          "Unlock the power of logic in C# console applications. Learn how to add logic and decision-making capabilities to your code, enabling your applications to make dynamic choices and respond intelligently to different scenarios."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Work with Variable Data in C# Console Applications",
        "intro": [
          "Discover the versatility of variable data in C# console applications. Harness the ability to store and manipulate different types of data, such as numbers and text, as you delve into the essential concepts of variables and data handling."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Create Methods in C# Console Applications",
        "intro": [
          "Take your C# console applications to the next level by mastering the art of creating methods. Learn how to organize and modularize your code, making it more manageable, reusable, and efficient."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Debug C# Console Applications",
        "intro": [
          "Sharpen your troubleshooting skills as you dive into the world of debugging C# console applications. Gain the ability to identify and fix issues in your code, ensuring your applications run smoothly and deliver the desired results."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Foundational C# with Microsoft Certification Exam",
        "intro": [
          "Use what you've learned to pass the exam to earn your Foundational C# with Microsoft Certification"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Upcoming Python",
    "intro": ["placeholder"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Learn Python by Building a Blackjack Game",
        "intro": ["Learn Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Upcoming Python Project",
        "intro": ["placeholder"]
      }
    }
  },
  "a2-english-for-developers": {
    "title": "A2 English for Developers (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": [
      "In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the A2 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.",
      "The first half of the curriculum will help you get comfortable with English grammar and usage. It will give you tons of hands-on practice. You'll learn basics like introducing yourself, making small talk, and discussing your work.",
      "In the second half, you'll practice vocabulary specific to software development. You'll learn how to describe code, discuss tech trends, and participate in stand-up meetings.",
      "This entire A2-level curriculum includes 105 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting."
    ],
    "blocks": {
      "learn-greetings-in-your-first-day-at-the-office": {
        "title": "Learn Greetings in your First Day at the Office",
        "intro": [
          "In this first course, you'll learn common expressions for situations you may encounter on your first day at work. You'll learn about introductions, getting to know people, asking for lunch recommendations, and getting an access card from security."
        ]
      },
      "learn-introductions-in-an-online-team-meeting": {
        "title": "Learn Introductions in an Online Team Meeting",
        "intro": [
          "In this course, you'll learn how to give a personal introduction. You'll also learn how to state your profession, and share your goals in group meetings."
        ]
      },
      "learn-conversation-starters-in-the-break-room": {
        "title": "Learn Conversation Starters in the Break Room",
        "intro": [
          "In this course, you'll learn how to start a conversation in casual settings. You'll also learn how to talk about your hobbies and personality traits. You'll even learn how to ask about places around the town."
        ]
      },
      "learn-how-to-talk-about-a-typical-workday-and-tasks": {
        "title": "Learn How to Talk About a Typical Workday and Tasks",
        "intro": [
          "In this course, you'll learn how to talk about your workday and the tasks that you perform in the workplace and how to share them with others. It mainly focuses on the structures used for describing your activities and task-related vocabulary."
        ]
      },
      "learn-how-to-discuss-your-morning-or-evening-routine": {
        "title": "Learn How to Discuss Your Morning or Evening Routine",
        "intro": [
          "In this course, you'll learn how to talk about details of your routine and share them with someone else. It mainly focuses on the structures used for declaring routine actions and related vocabulary."
        ]
      },
      "learn-how-to-describe-your-current-project": {
        "title": "Learn How to Describe Your Current Project",
        "intro": [
          "In this course, you'll learn how to talk about the projects that you are involved in and how to inform others of what you are doing in these projects. It mainly focuses on the structures used for informing it and on the related vocabulary."
        ]
      },
      "learn-how-to-ask-and-share-about-educational-and-professional-background": {
        "title": "Learn How to Ask and Share About Educational and Professional Background",
        "intro": [
          "In this course, you'll learn how to ask about another person's educational and professional backgrounds and you'll learn how to share information about your background as well."
        ]
      },
      "learn-how-to-talk-about-hobbies-and-interests": {
        "title": "Learn How to Talk About Hobbies and Interests",
        "intro": [
          "In this course, you'll learn different ways to talk about hobbies and things that interest you. You'll also learn how to ask about other people's hobbies and how to invite them to join you in these activities."
        ]
      },
      "learn-how-to-discuss-roles-and-responsibilies": {
        "title": "Learn How to Discuss Roles and Responsibilities",
        "intro": [
          "In this course, you'll discuss people's roles and responsibilities in a company and out of it. You'll discover how to ask about these roles and responsibilities and how to share information about you related to the topic."
        ]
      },
      "learn-how-to-have-a-conversation-about-preferences-and-motivations": {
        "title": "Learn How to Have a Conversation About Preferences and Motivations",
        "intro": [
          "In this course, you'll learn how to ask about what motivates people in their personal and professional lives, answer questions related to your motivations, and discuss about people's preferences."
        ]
      },
      "learn-how-to-discuss-popular-trends-in-technology": {
        "title": "Learn How to Discuss Popular Trends in Technology",
        "intro": [
          "In this course, you'll learn how to discuss about things that everybody's talking about in technology these days."
        ]
      },
      "learn-how-to-clarify-information-in-different-interactions": {
        "title": "Learn How to Clarify Information in Different Interactions",
        "intro": [
          "In this course, you'll learn how to check to see if the information you had is correct and how to ask for clarification when something is not clear to you."
        ]
      },
      "learn-how-to-use-basic-programming-vocabulary-in-conversations": {
        "title": "Learn How to Use Basic Programming Vocabulary in Conversations",
        "intro": [
          "This course will present basic vocabulary related to programming. You'll learn how to ask questions related to basic programming concepts."
        ]
      },
      "learn-how-to-use-code-related-concepts-and-terms": {
        "title": "Learn How to Use Code-related Concepts and Terms",
        "intro": [
          "In this course, you will be introduced to terms related to coding and learn how to use them in conversation."
        ]
      },
      "learn-how-to-discuss-tech-trends-and-updates": {
        "title": "Learn How to Discuss Tech Trends and Updates",
        "intro": [
          "In this course, you will be introduced to some recent trends in the world of technology and learn how to discuss them in English."
        ]
      },
      "learn-how-to-help-a-coworker-troubleshoot-on-github": {
        "title": "Learn How to Help a Coworker Troubleshoot on GitHub",
        "intro": [
          "In this course, you will learn expression related to how to ask for help from a coworker as well as how to offer them some assistance."
        ]
      },
      "learn-how-to-share-your-progress-in-weekly-stand-up-meetings": {
        "title": "Learn How to Share Your Progress in Weekly Stand-up Meetings",
        "intro": [
          "This course will show you how to talk about your projects in terms of what you have already done and what you are currently doing in them."
        ]
      },
      "learn-how-to-ask-for-clarification-on-code-understanding": {
        "title": "Learn How to Ask for Clarification on Code Understanding",
        "intro": [
          "In this course, you will see how you can ask questions to clarify things which are not very clear to you in a code."
        ]
      },
      "learn-how-to-document-code-for-a-project": {
        "title": "Learn How to Document Code for a Project",
        "intro": [
          "This course will show you expressions related to what to do when documenting code."
        ]
      },
      "learn-how-to-read-and-understand-code-documentation": {
        "title": "Learn How to Read and Understand Code Documentation",
        "intro": [
          "This course will present more expressions related to code documentation and bring tips on how to understand it."
        ]
      },
      "learn-how-to-analyze-code-documentation": {
        "title": "Learn How to Analyze Code Documentation",
        "intro": [
          "In this course, you will see some ideas to help you to approach documentation and analyze it in simple terms."
        ]
      },
      "learn-how-to-share-progress-and-accomplishments": {
        "title": "Learn How to Share Progress and Accomplishments",
        "intro": [
          "In this course, you will learn how to share your progress with coworkers and tell about what successes you've had in your projects."
        ]
      },
      "learn-how-to-talk-about-updates-and-plans-for-tasks-and-projects": {
        "title": "Learn How to Talk about Updates and Plans for Tasks and Projects",
        "intro": [
          "This course will show you how to speak about the most recent advancements in your projects and about your plans."
        ]
      },
      "learn-how-to-express-agreement-or-disagreement": {
        "title": "Learn How to Express Agreement or Disagreement",
        "intro": [
          "This course will introduce how to say that you agree with what another person says and to tell them politely that you do not agree with them."
        ]
      },
      "learn-how-to-offer-technical-support-and-guidance": {
        "title": "Learn How to Offer Technical Support and Guidance",
        "intro": [
          "In this course, you will see ways of offering some help in terms of technical specifics to another person."
        ]
      },
      "learn-how-to-request-and-receive-guidance": {
        "title": "Learn How to Request and Receive Guidance",
        "intro": [
          "This course will show you how to ask for assistance from a coworker when you need it."
        ]
      },
      "learn-how-to-provide-explanations-when-helping-others": {
        "title": "Learn How to Provide Explanations When Helping Others",
        "intro": [
          "This course will provide you with ways to explain things to other people while assisting them."
        ]
      }
    }
  },
  "b1-english-for-developers": {
    "title": "B1 English for Developers (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"],
    "blocks": {
      "learn-how-to-describe-places-and-events": {
        "title": "Learn How to Describe Places and Events",
        "intro": [""]
      },
      "learn-how-to-talk-about-past-experiences": {
        "title": "Learn How to Talk About Past Experiences",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-past-activities": {
        "title": "Learn How to Talk About Past Activities",
        "intro": ["", ""]
      },
      "learn-present-perfect-while-talking-about-accessibility": {
        "title": "Learn Present Perfect while Talking About Accessibility",
        "intro": ["", ""]
      },
      "learn-how-to-plan-future-events": {
        "title": "Learn How to Plan Future Events",
        "intro": ["", ""]
      },
      "learn-future-continuous-while-describing-actions": {
        "title": "Learn Future Continuous while Describing Actions",
        "intro": ["", ""]
      },
      "learn-how-to-use-conditionals": {
        "title": "Learn How to Use Conditionals",
        "intro": ["", ""]
      },
      "learn-how-to-share-feedback": {
        "title": "Learn How to Share Feedback",
        "intro": ["", ""]
      },
      "learn-how-to-share-your-opinion": {
        "title": "Learn How to Share Your Opinion",
        "intro": ["", ""]
      },
      "learn-how-to-express-agreement": {
        "title": "Learn How to Express Agreement",
        "intro": ["", ""]
      },
      "learn-how-to-express-disagreement": {
        "title": "Learn How to Express Disagreement",
        "intro": ["", ""]
      },
      "learn-how-to-express-concerns": {
        "title": "Learn How to Express Concerns",
        "intro": ["", ""]
      },
      "learn-how-to-express-decisions-based-on-comparisons": {
        "title": "Learn How to Express Decisions Based on Comparisons",
        "intro": ["", ""]
      },
      "learn-how-to-use-modal-verbs": {
        "title": "Learn How to Use Modal Verbs",
        "intro": ["", ""]
      },
      "learn-how-to-manage-a-conversation": {
        "title": "Learn How to Manage a Conversation",
        "intro": ["", ""]
      },
      "learn-how-to-clarify-misunderstandings": {
        "title": "Learn How to Clarify Misunderstandings",
        "intro": ["", ""]
      },
      "learn-about-speculation-and-requests": {
        "title": "Learn About Speculation and Requests",
        "intro": ["", ""]
      },
      "learn-about-adverbial-phrases": {
        "title": "Learn About Adverbial Phrases",
        "intro": ["", ""]
      },
      "learn-how-to-use-adjectives-in-conversations": {
        "title": "Learn How to Use Adjectives in Conversations",
        "intro": ["", ""]
      },
      "learn-determiners-and-advanced-use-of-articles": {
        "title": "Learn Determiners and Advanced Use of Articles",
        "intro": ["", ""]
      },
      "learn-how-to-use-reported-speech": {
        "title": "Learn How to Use Reported Speech",
        "intro": ["", ""]
      },
      "learn-how-to-use-prepositions-according-to-context": {
        "title": "Learn How to Use Prepositions According to Context",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-numbers-with-a-coworker": {
        "title": "Learn How to Talk About Numbers with a Coworker",
        "intro": ["", ""]
      },
      "learn-common-phrasal-verbs-and-idioms": {
        "title": "Learn Common Phrasal Verbs and Idioms",
        "intro": ["", ""]
      }
    }
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Level up your creative problem solving skills with these free programming tasks from the classic Rosetta Code library.",
      "These challenges can prove to be difficult, but they will push your algorithm logic to new heights.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Attribute: Rosetta Code</a>"
    ],
    "blocks": {
      "rosetta-code-challenges": {
        "title": "Rosetta Code Challenges",
        "intro": ["These are the challenges for Rosetta Code."]
      }
    }
  },
  "front-end-development": {
    "title": "Front End Development",
    "intro": ["placeholder"],
    "blocks": {
      "efpl": {
        "title": "0",
        "intro": []
      },
      "xpmy": {
        "title": "1",
        "intro": []
      },
      "workshop-cat-photo-app": {
        "title": "Build a Cat Photo App",
        "intro": [
          "HTML stands for HyperText Markup Language and it represents the content and structure of a web page.",
          "In this workshop, you will learn how to work with basic HTML elements such as headings, paragraphs, images, links, and lists."
        ]
      },
      "lab-recipe-page": {
        "title": "Build a Recipe Page",
        "intro": [
          "For this lab, you will create a web page of your favorite recipe."
        ]
      },
      "gwyd": {
        "title": "4",
        "intro": []
      },
      "lab-travel-agency-page": {
        "title": "Build a Travel Agency Page",
        "intro": [
          "For this lab, you will create a web page of a travel agency."
        ]
      },
      "vipr": {
        "title": "6",
        "intro": []
      },
      "lab-video-compilation-page": {
        "title": "Build a Video Compilation Page",
        "intro": ["For this lab, you will create a video compilation web page."]
      },
      "bzfv": {
        "title": "8",
        "intro": []
      },
      "snuv": {
        "title": "9",
        "intro": []
      },
      "quiz-basic-html": {
        "title": "Basic HTML Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic HTML knowledge."
        ]
      },
      "evdc": {
        "title": "11",
        "intro": []
      },
      "workshop-blog-page": {
        "title": "Build a Cat Blog Page",
        "intro": [
          "In this workshop, you will learn how to build an HTML only blog page using semantic elements including the <code>main</code>, <code>nav</code>, <code>article</code> and <code>footer</code> elements."
        ]
      },
      "lab-event-hub": {
        "title": "Build an Event Hub",
        "intro": [
          "In this lab, you will build an event hub using semantic HTML."
        ]
      },
      "ijdq": {
        "title": "14",
        "intro": []
      },
      "quiz-semantic-html": {
        "title": "Semantic HTML Quiz",
        "intro": [
          "Test what you've learned in this quiz of semantic HTML knowledge."
        ]
      },
      "cfgp": {
        "title": "16",
        "intro": []
      },
      "workshop-hotel-feedback-form": {
        "title": "Build a Hotel Feedback Form",
        "intro": [
          "In this workshop, you will learn how to work with forms by building a Hotel Feedback Form.",
          "You will learn how to work with labels, inputs, fieldsets, legends, textareas and buttons."
        ]
      },
      "lab-survey-form": {
        "title": "Build a Survey Form",
        "intro": ["For this lab, you will create a survey form."]
      },
      "wgot": {
        "title": "19",
        "intro": []
      },
      "workshop-final-exams-table": {
        "title": "Build a Final Exams Table",
        "intro": [
          "In this workshop, you will learn how to work with HTML tables by building a table of final exams."
        ]
      },
      "lab-book-catalog-table": {
        "title": "Build a Book Catalog Table",
        "intro": [
          "In this lab, you will create table filled with book information."
        ]
      },
      "rsve": {
        "title": "22",
        "intro": []
      },
      "xzam": {
        "title": "23",
        "intro": []
      },
      "quiz-html-tables-and-forms": {
        "title": "HTML Tables and Forms Quiz",
        "intro": [
          "Test what you've learned in this quiz of HTML tables and forms."
        ]
      },
      "ghoc": {
        "title": "25",
        "intro": []
      },
      "lab-checkout-page": {
        "title": "Build a Checkout Page",
        "intro": ["In this lab, you will create an accessible checkout page."]
      },
      "fqai": {
        "title": "27",
        "intro": []
      },
      "quiz-html-accessibility": {
        "title": "HTML Accessibility Quiz",
        "intro": [
          "Test what you've learned in this quiz of HTML accessibility knowledge."
        ]
      },
      "pspj": {
        "title": "29",
        "intro": []
      },
      "qpra": {
        "title": "30",
        "intro": []
      },
      "joim": {
        "title": "31",
        "intro": []
      },
      "gvtb": {
        "title": "32",
        "intro": []
      },
      "cqhu": {
        "title": "33",
        "intro": []
      },
      "tmdc": {
        "title": "34",
        "intro": []
      },
      "quiz-computer-basics": {
        "title": "Computer Basics Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic computer knowledge."
        ]
      },
      "dxpc": {
        "title": "36",
        "intro": []
      },
      "workshop-cafe-menu": {
        "title": "Design a Cafe Menu",
        "intro": [
          "CSS tells the browser how to display your webpage. You can use CSS to set the color, font, size, and other aspects of HTML elements.",
          "In this workshop, you'll learn CSS by designing a menu page for a cafe webpage."
        ]
      },
      "lab-business-card": {
        "title": "Design a Business Card",
        "intro": [
          "In this lab, you'll create a business card and style it using CSS."
        ]
      },
      "gnuk": {
        "title": "39",
        "intro": []
      },
      "zlfj": {
        "title": "40",
        "intro": []
      },
      "quiz-basic-css": {
        "title": "Basic CSS Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic CSS knowledge."
        ]
      },
      "sdul": {
        "title": "42",
        "intro": []
      },
      "lab-stylized-to-do-list": {
        "title": "Build a Stylized To-Do List",
        "intro": [
          "In this lab, you'll build a To-Do list and apply different styles to the links"
        ]
      },
      "humj": {
        "title": "44",
        "intro": []
      },
      "pahx": {
        "title": "45",
        "intro": []
      },
      "rzdx": {
        "title": "46",
        "intro": []
      },
      "quiz-css-backgrounds-and-borders": {
        "title": "CSS Backgrounds and Borders Quiz",
        "intro": [
          "Test what you've learned in this quiz of backgrounds and borders in CSS."
        ]
      },
      "ljmt": {
        "title": "48",
        "intro": []
      },
      "lxpk": {
        "title": "49",
        "intro": []
      },
      "lzqy": {
        "title": "50",
        "intro": []
      },
      "gvel": {
        "title": "51",
        "intro": []
      },
      "quiz-design-fundamentals": {
        "title": "Design Fundamentals Quiz",
        "intro": [
          "Test what you've learned in this quiz of UI design fundamentals."
        ]
      },
      "bgrw": {
        "title": "53",
        "intro": []
      },
      "sbnz": {
        "title": "54",
        "intro": []
      },
      "lab-event-flyer-page": {
        "title": "Build an Event Flyer Page",
        "intro": [
          "In this lab, you will use absolute and relative CSS units to create an event flyer page."
        ]
      },
      "ywfm": {
        "title": "56",
        "intro": []
      },
      "quiz-css-relative-and-absolute-units": {
        "title": "CSS Relative and Absolute Units Quiz",
        "intro": [
          "Test what you've learned in this quiz of relative and absolute units in CSS."
        ]
      },
      "ohhu": {
        "title": "58",
        "intro": []
      },
      "syga": {
        "title": "59",
        "intro": []
      },
      "sdym": {
        "title": "60",
        "intro": []
      },
      "ivpx": {
        "title": "61",
        "intro": []
      },
      "quiz-css-pseudo-classes": {
        "title": "CSS Pseudo-classes Quiz",
        "intro": [
          "Test what you've learned in this quiz of pseudo-classes in CSS."
        ]
      },
      "fvcj": {
        "title": "63",
        "intro": []
      },
      "ogdb": {
        "title": "64",
        "intro": []
      },
      "zxiy": {
        "title": "65",
        "intro": []
      },
      "qpze": {
        "title": "66",
        "intro": []
      },
      "quiz-css-colors": {
        "title": "CSS Colors Quiz",
        "intro": [
          "Test what you've learned in this quiz of using colors in CSS."
        ]
      },
      "jnqt": {
        "title": "68",
        "intro": []
      },
      "vkei": {
        "title": "69",
        "intro": []
      },
      "lab-contact-form": {
        "title": "Design a Contact Form",
        "intro": [
          "In this lab, you will design a contact form in HTML and style it using CSS."
        ]
      },
      "ipmw": {
        "title": "71",
        "intro": []
      },
      "quiz-styling-forms": {
        "title": "Styling Forms Quiz",
        "intro": [
          "Test what you've learned in this quiz of how to style forms using CSS."
        ]
      },
      "qzcx": {
        "title": "73",
        "intro": []
      },
      "wozq": {
        "title": "74",
        "intro": []
      },
      "lab-confidential-email-page": {
        "title": "Build a Confidential Email Page",
        "intro": [
          "For this lab, you will create a web page of a confidential email using HTML and CSS."
        ]
      },
      "zter": {
        "title": "76",
        "intro": []
      },
      "quiz-css-layout-and-effects": {
        "title": "CSS Layout and Effects Quiz",
        "intro": [
          "Test what you've learned in this quiz of the box model, transforms, filters, and overflow in CSS."
        ]
      },
      "tcwi": {
        "title": "78",
        "intro": []
      },
      "uptf": {
        "title": "79",
        "intro": []
      },
      "lab-page-of-playing-cards": {
        "title": "Build a Page of Playing Cards",
        "intro": [
          "For this lab, you will use flexbox to create a webpage of playing cards."
        ]
      },
      "kqao": {
        "title": "81",
        "intro": []
      },
      "quiz-css-flexbox": {
        "title": "CSS Flexbox Quiz",
        "intro": [
          "Test what you've learned in this quiz of using flexbox in CSS."
        ]
      },
      "vqut": {
        "title": "83",
        "intro": []
      },
      "ujcf": {
        "title": "84",
        "intro": []
      },
      "lab-newspaper-article": {
        "title": "Build a Newspaper Article",
        "intro": [
          "In this lab, you will build a newspaper article page using HTML and CSS."
        ]
      },
      "hbme": {
        "title": "86",
        "intro": []
      },
      "quiz-css-typography": {
        "title": "CSS Typography Quiz",
        "intro": ["Test what you've learned in this quiz of typography in CSS."]
      },
      "dyvj": {
        "title": "88",
        "intro": []
      },
      "rjsv": {
        "title": "89",
        "intro": []
      },
      "lab-tribute-page": {
        "title": "Build a Tribute Page",
        "intro": [
          "For this lab, you will build a tribute page for a subject of your choosing, fictional or real."
        ]
      },
      "fnde": {
        "title": "91",
        "intro": []
      },
      "quiz-css-accessibility": {
        "title": "CSS Accessibility Quiz",
        "intro": [
          "Test what you've learned in this quiz of making your webpage accessible with CSS."
        ]
      },
      "swpl": {
        "title": "93",
        "intro": []
      },
      "hcje": {
        "title": "94",
        "intro": []
      },
      "lab-book-inventory-app": {
        "title": "Build a Book Inventory App",
        "intro": ["For this lab, you will create a book inventory app."]
      },
      "huyd": {
        "title": "96",
        "intro": []
      },
      "quiz-css-attribute-selectors": {
        "title": "CSS Attribute Selectors Quiz",
        "intro": [
          "Test what you've learned in this quiz of using attribute selectors in CSS."
        ]
      },
      "rxzk": {
        "title": "98",
        "intro": []
      },
      "xobh": {
        "title": "99",
        "intro": []
      },
      "lab-house-painting": {
        "title": "Build a House Painting",
        "intro": ["For this lab, you will build a house painting using CSS."]
      },
      "rrtt": {
        "title": "101",
        "intro": []
      },
      "quiz-css-positioning": {
        "title": "CSS Positioning Quiz",
        "intro": [
          "Test what you've learned in this quiz of how positioning works in CSS."
        ]
      },
      "xebj": {
        "title": "103",
        "intro": []
      },
      "jkdt": {
        "title": "104",
        "intro": []
      },
      "lab-technical-documentation-page": {
        "title": "Build a Technical Documentation Page",
        "intro": [
          "For this lab, you will build a technical documentation page to serve as instruction or reference for a topic."
        ]
      },
      "xcti": {
        "title": "106",
        "intro": []
      },
      "quiz-responsive-web-design": {
        "title": "Responsive Web Design Quiz",
        "intro": [
          "Test what you've learned in this quiz of making your webpage responsive."
        ]
      },
      "mtbl": {
        "title": "108",
        "intro": []
      },
      "vlov": {
        "title": "109",
        "intro": []
      },
      "lab-availability-table": {
        "title": "Build an Availability Table",
        "intro": ["For this lab, you will create an availability table."]
      },
      "sget": {
        "title": "111",
        "intro": []
      },
      "quiz-css-variables": {
        "title": "CSS Variables Quiz",
        "intro": [
          "Test what you've learned in this quiz of how using variables in CSS."
        ]
      },
      "agbl": {
        "title": "113",
        "intro": []
      },
      "ogko": {
        "title": "114",
        "intro": []
      },
      "harp": {
        "title": "115",
        "intro": []
      },
      "nsiq": {
        "title": "116",
        "intro": []
      },
      "lab-product-landing-page": {
        "title": "Build a Product Landing Page",
        "intro": [
          "For this project, you will build a product landing page to market a product of your choice."
        ]
      },
      "fdam": {
        "title": "118",
        "intro": []
      },
      "quiz-css-grid": {
        "title": "CSS Grid Quiz",
        "intro": ["Test what you've learned in this quiz of using grid in CSS."]
      },
      "dorc": {
        "title": "120",
        "intro": []
      },
      "adzu": {
        "title": "121",
        "intro": []
      },
      "lab-moon-orbit": {
        "title": "Build a Moon Orbit",
        "intro": [
          "For this lab, you will create an animation of the moon orbiting the earth."
        ]
      },
      "lugl": {
        "title": "123",
        "intro": []
      },
      "lab-personal-portfolio": {
        "title": "Build a Personal Portfolio",
        "intro": [
          "For this project, you will build your own personal portfolio page."
        ]
      },
      "lvqc": {
        "title": "125",
        "intro": []
      },
      "quiz-css-animations": {
        "title": "CSS Animations Quiz",
        "intro": [
          "Test what you've learned in this quiz of using animations in CSS."
        ]
      },
      "wvjx": {
        "title": "127",
        "intro": []
      },
      "uquz": {
        "title": "128",
        "intro": []
      },
      "kdgd": {
        "title": "129",
        "intro": []
      },
      "wryp": {
        "title": "130",
        "intro": []
      },
      "workshop-greeting-bot": {
        "title": "Build a Greeting Bot",
        "intro": [
          "For this workshop, you will learn how to work with JavaScript fundamentals by building a greeting bot.",
          "You will learn about variables, <code>let</code>, <code>const</code>, <code>console.log</code> and basic string usage."
        ]
      },
      "lab-javascript-trivia-bot": {
        "title": "Build a JavaScript Trivia Bot",
        "intro": [
          "In this lab, you will practice working with JavaScript variables and strings by building a trivia bot."
        ]
      },
      "dthi": {
        "title": "133",
        "intro": []
      },
      "yskn": {
        "title": "134",
        "intro": []
      },
      "quiz-javascript-variables-and-data-types": {
        "title": "JavaScript Variables and Data Types Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Variables and Data Types."
        ]
      },
      "hoec": {
        "title": "136",
        "intro": []
      },
      "workshop-teacher-chatbot": {
        "title": "Build a Teacher Chatbot",
        "intro": [
          "In this workshop, you will continue to learn more about JavaScript strings by building a chatbot.",
          "You will learn how to work with template literals, and the <code>indexOf</code> method."
        ]
      },
      "axgb": {
        "title": "138",
        "intro": []
      },
      "rwac": {
        "title": "139",
        "intro": []
      },
      "quiz-javascript-strings": {
        "title": "JavaScript Strings Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Strings."
        ]
      },
      "hxwa": {
        "title": "141",
        "intro": []
      },
      "workshop-mathbot": {
        "title": "Build a Mathbot",
        "intro": [
          "In this workshop, you will review how to work with the different Math object methods by building a Mathbot."
        ]
      },
      "lab-fortune-teller": {
        "title": "Build a Fortune Teller",
        "intro": [
          "In this lab, you will build a fortune teller by randomly selecting a fortune from the avaialble fortunes."
        ]
      },
      "wfyg": {
        "title": "144",
        "intro": []
      },
      "guqy": {
        "title": "145",
        "intro": []
      },
      "quiz-javascript-math": {
        "title": "JavaScript Math Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Math."]
      },
      "hafd": {
        "title": "147",
        "intro": []
      },
      "phko": {
        "title": "148",
        "intro": []
      },
      "quiz-javascript-comparisons-and-conditionals": {
        "title": "JavaScript Comparisons and Conditionals Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Comparisons and Conditionals."
        ]
      },
      "tsdq": {
        "title": "150",
        "intro": []
      },
      "workshop-calculator": {
        "title": "Build a Calculator",
        "intro": [
          "In this workshop, you will review working with functions by building a calculator."
        ]
      },
      "lab-email-masker": {
        "title": "Build an Email Masker",
        "intro": [
          "In this lab, you'll build an email masker that will take an email address and obscure it."
        ]
      },
      "lab-sentence-maker": {
        "title": "Build a Sentence Maker",
        "intro": [
          "In this lab, you will create different stories by assigning different words to different variables."
        ]
      },
      "workshop-loan-qualification-checker": {
        "title": "Build a Loan Qualification Checker",
        "intro": [
          "In this workshop, you will continue to learn how to work with conditionals by building a loan qualification checker app.",
          "You will learn more about <code>if</code> statements, and how to use comparison operators and multiple conditions in an <code>if</code> statement."
        ]
      },
      "lab-leap-year-calculator": {
        "title": "Build a Leap Year Calculator ",
        "intro": [
          "In this lab you will use conditional statements and loops to determine if a year is a leap year."
        ]
      },
      "pljo": {
        "title": "156",
        "intro": []
      },
      "quiz-javascript-functions": {
        "title": "JavaScript Functions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Functions."
        ]
      },
      "mexq": {
        "title": "158",
        "intro": []
      },
      "ifgn": {
        "title": "159",
        "intro": []
      },
      "workshop-shopping-list": {
        "title": "Build a Shopping List",
        "intro": [
          "In this workshop, you will practice working with arrays by building a shopping list.",
          "You will review how to add and remove elements from an array using methods like <code>push</code>, <code>pop</code>, <code>shift</code>, and <code>unshift</code>."
        ]
      },
      "lab-lunch-picker-program": {
        "title": "Build a Lunch Picker Program",
        "intro": [
          "In this lab, you will review working with arrays and random numbers by building a lunch picker program."
        ]
      },
      "mokm": {
        "title": "161",
        "intro": []
      },
      "froz": {
        "title": "162",
        "intro": []
      },
      "quiz-javascript-arrays": {
        "title": "JavaScript Arrays Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Arrays."]
      },
      "dvnt": {
        "title": "164",
        "intro": []
      },
      "ekdb": {
        "title": "165",
        "intro": []
      },
      "lab-quiz-game": {
        "title": "Build a Quiz Game",
        "intro": ["For this lab, you will build a quiz game."]
      },
      "lab-factorial-calculator": {
        "title": "Build a Factorial Calculator ",
        "intro": ["In this lab, you will build a factorial calculator."]
      },
      "quiz-javascript-objects": {
        "title": "JavaScript Objects Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Objects."
        ]
      },
      "kgtw": {
        "title": "169",
        "intro": []
      },
      "workshop-sentence-analyzer": {
        "title": "Build a Sentence Analyzer",
        "intro": [
          "In this workshop, you'll review working with JavaScript loops by building a sentence analyzer app."
        ]
      },
      "kcci": {
        "title": "171",
        "intro": []
      },
      "puhe": {
        "title": "172",
        "intro": []
      },
      "quiz-javascript-loops": {
        "title": "JavaScript Loops Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Loops."]
      },
      "hjtr": {
        "title": "174",
        "intro": []
      },
      "lab-pyramid-generator": {
        "title": "Build a Pyramid Generator",
        "intro": ["In this lab you will build a pyramid generator."]
      },
      "lab-gradebook-app": {
        "title": "Build a Gradebook App",
        "intro": ["For this lab, you will create a gradebook app."]
      },
      "epfc": {
        "title": "177",
        "intro": []
      },
      "lab-inventory-management-program": {
        "title": "Build an Inventory Management Program",
        "intro": [
          "For this lab, you will build an inventory management program using JavaScript."
        ]
      },
      "fbbn": {
        "title": "179",
        "intro": []
      },
      "lnmg": {
        "title": "180",
        "intro": []
      },
      "wead": {
        "title": "181",
        "intro": []
      },
      "quiz-javascript-fundamentals": {
        "title": "JavaScript Fundamentals Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Fundamentals Quiz."
        ]
      },
      "plic": {
        "title": "183",
        "intro": []
      },
      "vjmm": {
        "title": "184",
        "intro": []
      },
      "bxtv": {
        "title": "185",
        "intro": []
      },
      "xiqk": {
        "title": "186",
        "intro": []
      },
      "quiz-javascript-higher-order-functions": {
        "title": "JavaScript Higher Order Functions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Higher Order Functions."
        ]
      },
      "esfh": {
        "title": "188",
        "intro": []
      },
      "gibb": {
        "title": "189",
        "intro": []
      },
      "lab-favorite-icon-toggler": {
        "title": "Build a Favorite Icon Toggler",
        "intro": [
          "In this lab, you will build a favorite icon toggler by utilizing JavaScript click events."
        ]
      },
      "fhxc": {
        "title": "191",
        "intro": []
      },
      "quiz-dom-manipulation-and-click-event-with-javascript": {
        "title": "DOM Manipulation and Click Events with JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on DOM Manipulation and Click Events with JavaScript Quiz."
        ]
      },
      "ubpx": {
        "title": "193",
        "intro": []
      },
      "lbyi": {
        "title": "194",
        "intro": []
      },
      "lab-real-time-counter": {
        "title": "Build a Real Time Counter",
        "intro": ["In this lab, you will build a real-time character counter"]
      },
      "fmbk": {
        "title": "196",
        "intro": []
      },
      "lab-lightbox-viewer": {
        "title": "Build a Lightbox Viewer",
        "intro": [
          "In this lab, you will build a lighbox viewer for viewing images in a focused mode."
        ]
      },
      "workshop-rps-game": {
        "title": "Build a Rock, Paper, Scissors Game",
        "intro": [
          "In this workshop, you will review DOM manipulation and events by building a Rock, Paper, Scissors Game."
        ]
      },
      "lab-palindrome-checker": {
        "title": "Build a Palindrome Checker",
        "intro": [
          "For this lab, you'll build an application that checks whether a given word is a palindrome."
        ]
      },
      "lab-football-team-cards": {
        "title": "Build a Set of Football Team Cards",
        "intro": [
          "One common aspect of building web applications is processing datasets and outputting information to the screen. In this project, you will use DOM manipulation, object destructuring, event handling, and data filtering to build a set of football team cards."
        ]
      },
      "iejn": {
        "title": "201",
        "intro": []
      },
      "quiz-javascript-events": {
        "title": "JavaScript Events Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Events."]
      },
      "kaqq": {
        "title": "203",
        "intro": []
      },
      "lab-random-background-color-changer": {
        "title": "Debug a Random Background Color Changer",
        "intro": [
          "For this lab, you will debug a random background color changer and fix the errors to make it work properly."
        ]
      },
      "ksfc": {
        "title": "205",
        "intro": []
      },
      "quiz-debugging-javascript": {
        "title": "Debugging JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Debugging JavaScript."
        ]
      },
      "dqth": {
        "title": "207",
        "intro": []
      },
      "ilop": {
        "title": "208",
        "intro": []
      },
      "qrer": {
        "title": "209",
        "intro": []
      },
      "lab-regex-sandbox": {
        "title": "Build a RegEx Sandbox",
        "intro": ["In this lab you will build a regex sandbox."]
      },
      "svsl": {
        "title": "211",
        "intro": []
      },
      "quiz-javascript-regular-expressions": {
        "title": "JavaScript Regular Expressions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Regular Expressions."
        ]
      },
      "zalp": {
        "title": "213",
        "intro": []
      },
      "hhvp": {
        "title": "214",
        "intro": []
      },
      "egkv": {
        "title": "215",
        "intro": []
      },
      "qlvw": {
        "title": "216",
        "intro": []
      },
      "quiz-form-validation-with-javascript": {
        "title": "Form Validation with JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Form Validation with JavaScript."
        ]
      },
      "lupt": {
        "title": "218",
        "intro": []
      },
      "lab-date-conversion": {
        "title": "Build a Date Conversion Program",
        "intro": [
          "In this lab, you will build a program to convert a date from one format to another."
        ]
      },
      "xtfk": {
        "title": "220",
        "intro": []
      },
      "quiz-javascript-dates": {
        "title": "JavaScript Dates Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Dates."]
      },
      "lvts": {
        "title": "222",
        "intro": []
      },
      "foal": {
        "title": "223",
        "intro": []
      },
      "crzf": {
        "title": "224",
        "intro": []
      },
      "xofr": {
        "title": "225",
        "intro": []
      },
      "quiz-javascript-audio-and-video": {
        "title": "JavaScript Audio and Video Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Audio and Video."
        ]
      },
      "pehm": {
        "title": "227",
        "intro": []
      },
      "cvsw": {
        "title": "228",
        "intro": []
      },
      "lab-bookmark-manager-app": {
        "title": "Build a Bookmark Manager App",
        "intro": ["For this lab, you will build a bookmark manager app."]
      },
      "fgbp": {
        "title": "230",
        "intro": []
      },
      "quiz-local-storage-and-crud": {
        "title": "Local Storage and CRUD Quiz",
        "intro": [
          "Test what you've learned in this quiz on Local Storage and CRUD."
        ]
      },
      "jbst": {
        "title": "232",
        "intro": []
      },
      "peyf": {
        "title": "233",
        "intro": []
      },
      "bdqj": {
        "title": "234",
        "intro": []
      },
      "ndlf": {
        "title": "235",
        "intro": []
      },
      "quiz-recursion": {
        "title": "Recursion Quiz",
        "intro": ["Test what you've learned in this quiz on Recursion."]
      },
      "yshh": {
        "title": "237",
        "intro": []
      },
      "wyxz": {
        "title": "238",
        "intro": []
      },
      "lab-quicksort-algorithm": {
        "title": "Build the Quicksort Algorithm",
        "intro": [
          "For this lab, you will implement the Quicksort algorithm using JavaScript."
        ]
      },
      "dtfv": {
        "title": "240",
        "intro": []
      },
      "quiz-searching-and-sorting-algorithms": {
        "title": "Searching and Sorting Algorithms Quiz",
        "intro": [
          "Test what you've learned in this quiz on Searching and Sorting Algorithms."
        ]
      },
      "bnvw": {
        "title": "242",
        "intro": []
      },
      "xkhk": {
        "title": "243",
        "intro": []
      },
      "lab-roman-numeral-converter": {
        "title": "Build a Roman Numeral Converter",
        "intro": [
          "For this lab, you'll build an application that converts integers to Roman numerals."
        ]
      },
      "yaxm": {
        "title": "245",
        "intro": []
      },
      "lab-telephone-number-validator": {
        "title": "Build a Telephone Number Validator",
        "intro": [
          "For this lab, you'll build an application that checks if a number is a valid United States phone number."
        ]
      },
      "lab-cash-register": {
        "title": "Build a Cash Register",
        "intro": ["For this lab, you will build a cash register."]
      },
      "udia": {
        "title": "248",
        "intro": []
      },
      "quiz-javascript-problem-solving-and-algorithmic-thinking": {
        "title": "JavaScript Problem Solving and Algorithmic Thinking Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Problem Solving and Algorithmic Thinking."
        ]
      },
      "xayi": {
        "title": "250",
        "intro": []
      },
      "mjbe": {
        "title": "251",
        "intro": []
      },
      "byqx": {
        "title": "252",
        "intro": []
      },
      "alda": {
        "title": "253",
        "intro": []
      },
      "quiz-javascript-functional-programming": {
        "title": "JavaScript Functional Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Functional Programming."
        ]
      },
      "cvaf": {
        "title": "255",
        "intro": []
      },
      "tdgy": {
        "title": "256",
        "intro": []
      },
      "saxu": {
        "title": "257",
        "intro": []
      },
      "kagw": {
        "title": "258",
        "intro": []
      },
      "mbib": {
        "title": "259",
        "intro": []
      },
      "oxiv": {
        "title": "260",
        "intro": []
      },
      "quiz-javascript-object-oriented-programming": {
        "title": "JavaScript Object Oriented Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Object Oriented Programming."
        ]
      },
      "nixz": {
        "title": "262",
        "intro": []
      },
      "lab-stack-class": {
        "title": "Build a Stack Class",
        "intro": [
          "For this lab, you will build a stack class using JavaScript."
        ]
      },
      "lab-linked-list-class": {
        "title": "Build a Linked List Class",
        "intro": [
          "For this lab, you will build a linked list class using JavaScript."
        ]
      },
      "lab-hash-table-class": {
        "title": "Build a Hash Table Class",
        "intro": ["For this lab, you will build a hash table using JavaScript."]
      },
      "muyw": {
        "title": "266",
        "intro": []
      },
      "quiz-javascript-data-structures": {
        "title": "JavaScript Data Structures Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Data Structures."
        ]
      },
      "rmpy": {
        "title": "268",
        "intro": []
      },
      "lab-depth-first-search": {
        "title": "Implement the Depth-First Search Algorithm",
        "intro": [
          "For this lab, you will use JavaScript to implement the Depth-First Search algorithm."
        ]
      },
      "xdyh": {
        "title": "270",
        "intro": []
      },
      "quiz-graphs-and-trees": {
        "title": "Graphs and Trees Quiz",
        "intro": ["Test what you've learned in this quiz on Graphs and Trees."]
      },
      "vjgg": {
        "title": "272",
        "intro": []
      },
      "lab-nth-fibonacci-number-generator": {
        "title": "Build the nth Fibonacci number generator",
        "intro": [
          "For this lab, you will implement the nth Fibonacci number generator."
        ]
      },
      "kaui": {
        "title": "274",
        "intro": []
      },
      "quiz-dynamic-programming": {
        "title": "Dynamic Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on Dynamic Programming."
        ]
      },
      "sgau": {
        "title": "276",
        "intro": []
      },
      "clak": {
        "title": "277",
        "intro": []
      },
      "fcom": {
        "title": "278",
        "intro": []
      },
      "ffpt": {
        "title": "279",
        "intro": []
      },
      "lab-pokemon-search-app": {
        "title": "Build a Pokémon Search App",
        "intro": ["For this project, you will build a Pokémon search app."]
      },
      "vyzp": {
        "title": "281",
        "intro": []
      },
      "quiz-asynchronous-javascript": {
        "title": "Asynchronous JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Asynchronous JavaScript."
        ]
      },
      "icdr": {
        "title": "283",
        "intro": []
      },
      "zdsj": {
        "title": "284",
        "intro": []
      },
      "mzae": {
        "title": "285",
        "intro": []
      },
      "gjbf": {
        "title": "286",
        "intro": []
      },
      "mbpv": {
        "title": "287",
        "intro": []
      },
      "eeez": {
        "title": "288",
        "intro": []
      },
      "quiz-web-standards": {
        "title": "Web Standards Quiz",
        "intro": ["Test what you've learned in this quiz on Web Standards."]
      },
      "khuu": {
        "title": "290",
        "intro": []
      },
      "xdly": {
        "title": "291",
        "intro": []
      },
      "rhhl": {
        "title": "292",
        "intro": []
      },
      "trvf": {
        "title": "293",
        "intro": []
      },
      "kwmg": {
        "title": "294",
        "intro": []
      },
      "nodx": {
        "title": "295",
        "intro": []
      },
      "erfj": {
        "title": "296",
        "intro": []
      },
      "quiz-react-basics": {
        "title": "React Basics Quiz",
        "intro": ["Test what you've learned in this quiz on React Basics."]
      },
      "hfwi": {
        "title": "298",
        "intro": []
      },
      "rnwr": {
        "title": "299",
        "intro": []
      },
      "oeqv": {
        "title": "300",
        "intro": []
      },
      "rdzk": {
        "title": "301",
        "intro": []
      },
      "vtpz": {
        "title": "302",
        "intro": []
      },
      "dfwl": {
        "title": "303",
        "intro": []
      },
      "adzm": {
        "title": "304",
        "intro": []
      },
      "quiz-react-state-and-hooks": {
        "title": "React State and Hooks Quiz",
        "intro": [
          "Test what you've learned in this quiz on React State and Hooks."
        ]
      },
      "voks": {
        "title": "306",
        "intro": []
      },
      "uwum": {
        "title": "307",
        "intro": []
      },
      "ukem": {
        "title": "308",
        "intro": []
      },
      "sdjg": {
        "title": "309",
        "intro": []
      },
      "buzx": {
        "title": "310",
        "intro": []
      },
      "pexz": {
        "title": "311",
        "intro": []
      },
      "prlo": {
        "title": "312",
        "intro": []
      },
      "jsnd": {
        "title": "313",
        "intro": []
      },
      "quiz-advanced-react": {
        "title": "Advanced React Quiz",
        "intro": ["Test what you've learned in this quiz on Advanced React."]
      },
      "tkgg": {
        "title": "315",
        "intro": []
      },
      "coip": {
        "title": "316",
        "intro": []
      },
      "quiz-web-performance": {
        "title": "Web Performance Quiz",
        "intro": ["Test what you've learned in this quiz on Web Performance."]
      },
      "hzab": {
        "title": "318",
        "intro": []
      },
      "ggea": {
        "title": "319",
        "intro": []
      },
      "vgvz": {
        "title": "320",
        "intro": []
      },
      "jkfc": {
        "title": "321",
        "intro": []
      },
      "quiz-typescript": {
        "title": "TypeScript Quiz",
        "intro": ["Test what you've learned in this quiz on TypeScript."]
      },
      "zhhp": {
        "title": "323",
        "intro": []
      },
      "nwwd": {
        "title": "324",
        "intro": []
      },
      "quiz-css-libraries-and-frameworks": {
        "title": "CSS Libraries and Frameworks Quiz",
        "intro": [
          "Test what you've learned in this quiz on CSS Libraries and Frameworks."
        ]
      },
      "gora": {
        "title": "326",
        "intro": []
      },
      "vpkl": {
        "title": "327",
        "intro": []
      },
      "quiz-testing": {
        "title": "Testing Quiz",
        "intro": ["Test what you've learned in this quiz on Testing."]
      },
      "lzvx": {
        "title": "329",
        "intro": []
      },
      "mfwu": {
        "title": "330",
        "intro": []
      },
      "dfcd": {
        "title": "331",
        "intro": []
      },
      "workshop-bash-boilerplate": {
        "title": "Build a Boilerplate",
        "intro": [
          "The terminal allows you to send text commands to your computer that can manipulate the file system, run programs, automate tasks, and much more.",
          "In this 170-lesson workshop, you will learn terminal commands by creating a website boilerplate using only the command line."
        ]
      },
      "vfje": {
        "title": "333",
        "intro": []
      },
      "quiz-bash-commands": {
        "title": "Bash Commands Quiz",
        "intro": ["Test what you've learned in this quiz on Bash Commands."]
      },
      "thsj": {
        "title": "335",
        "intro": []
      },
      "workshop-mario-database": {
        "title": "Build a Mario Database",
        "intro": [
          "A relational database organizes data into tables that are linked together through relationships.",
          "In this 165-lesson workshop, you will learn the basics of a relational database by creating a PostgreSQL database filled with video game characters."
        ]
      },
      "lab-celestial-bodies-database": {
        "title": "Build a Celestial Bodies Database",
        "intro": [
          "For this project, you will build a database of celestial bodies using PostgreSQL."
        ]
      },
      "cvvu": {
        "title": "338",
        "intro": []
      },
      "quiz-relational-database": {
        "title": "Relational Database Quiz",
        "intro": [
          "Test what you've learned in this quiz on Relational Databases."
        ]
      },
      "ynqt": {
        "title": "340",
        "intro": []
      },
      "workshop-bash-five-programs": {
        "title": "Build Five Programs",
        "intro": [
          "Bash scripts combine terminal commands and logic into programs that can execute or automate tasks, and much more.",
          "In this 220-lesson workshop, you will learn more terminal commands and how to use them within Bash scripts by creating five small programs."
        ]
      },
      "hnta": {
        "title": "342",
        "intro": []
      },
      "quiz-bash-scripting": {
        "title": "Bash Scripting Quiz",
        "intro": ["Test what you've learned in this quiz on Bash Scripting."]
      },
      "pegc": {
        "title": "344",
        "intro": []
      },
      "workshop-sql-student-database-part-1": {
        "title": "Build a Student Database: Part 1",
        "intro": [
          "SQL, or Structured Query Language, is the language for communicating with a relational database.",
          "In this 140-lesson workshop, you will create a Bash script that uses SQL to enter information about your computer science students into PostgreSQL."
        ]
      },
      "workshop-sql-student-database-part-2": {
        "title": "Build a Student Database: Part 2",
        "intro": [
          "SQL join commands are used to combine information from multiple tables in a relational database",
          "In this 140-lesson workshop, you will complete your student database while diving deeper into SQL commands."
        ]
      },
      "lab-world-cup-database": {
        "title": "Build a World Cup Database",
        "intro": [
          "For this project, you will create a Bash script that enters information from World Cup games into PostgreSQL, then query the database for useful statistics."
        ]
      },
      "workshop-kitty-ipsum-translator": {
        "title": "Build a Kitty Ipsum Translator",
        "intro": [
          "There's more to Bash commands than you might think.",
          "In this 140-lesson workshop, you will learn some more complex commands, and the details of how commands work."
        ]
      },
      "workshop-bike-rental-shop": {
        "title": "Build a Bike Rental Shop",
        "intro": [
          "In this 210-lesson workshop, you will build an interactive Bash program that stores rental information for your bike rental shop using PostgreSQL."
        ]
      },
      "lab-salon-appointment-scheduler": {
        "title": "Build a Salon Appointment Scheduler",
        "intro": [
          "For this lab, you will create an interactive Bash program that uses PostgreSQL to track the customers and appointments for your salon."
        ]
      },
      "udfh": {
        "title": "351",
        "intro": []
      },
      "quiz-bash-and-sql": {
        "title": "Bash and SQL Quiz",
        "intro": ["Test what you've learned in this quiz on Bash and SQL."]
      },
      "movb": {
        "title": "353",
        "intro": []
      },
      "workshop-castle": {
        "title": "Build a Castle",
        "intro": [
          "Nano is a program that allows you to edit files right in the terminal.",
          "In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle."
        ]
      },
      "dzsr": {
        "title": "355",
        "intro": []
      },
      "quiz-nano": {
        "title": "Nano Quiz",
        "intro": ["Test what you've learned in this quiz on Nano."]
      },
      "pzmc": {
        "title": "357",
        "intro": []
      },
      "workshop-sql-reference-object": {
        "title": "Build an SQL Reference Object",
        "intro": [
          "Git is a version control system that keeps track of all the changes you make to your codebase.",
          "In this 240-lesson workshop, you will learn how Git keeps track of your code by creating an object containing commonly used SQL commands."
        ]
      },
      "lab-periodic-table-database": {
        "title": "Build a Periodic Table Database",
        "intro": [
          "For this lab, you will create a Bash script to get information about chemical elements from a periodic table database."
        ]
      },
      "lab-number-guessing-game": {
        "title": "Build a Number Guessing Game",
        "intro": [
          "For this lab, you will use Bash scripting, PostgreSQL, and Git to create a number guessing game that runs in the terminal and saves user information."
        ]
      },
      "nfoc": {
        "title": "361",
        "intro": []
      },
      "quiz-git": {
        "title": "Git Quiz",
        "intro": ["Test what you've learned in this quiz on Git."]
      },
      "ibmn": {
        "title": "363",
        "intro": []
      },
      "zpjj": {
        "title": "364",
        "intro": []
      },
      "ghfk": {
        "title": "365",
        "intro": []
      },
      "ugfq": {
        "title": "366",
        "intro": []
      },
      "quiz-security-and-privacy": {
        "title": "Security and Privacy Quiz",
        "intro": [
          "Test what you've learned in this quiz on Security and Privacy."
        ]
      },
      "qjov": {
        "title": "368",
        "intro": []
      },
      "workshop-npm-packages": {
        "title": "Managing Packages with npm",
        "intro": [
          "npm (Node Package Manager), is a command line tool to install, create, and share packages of JavaScript code written for Node.js. There are many open source packages available on npm, so before starting a project, take some time to explore so you don't end up recreating the wheel for things like working with dates or fetching data from an API.",
          "In this workshop, you'll learn the basics of using npm, including how to work with the <code>package.json</code> file and how to manage your installed dependencies."
        ]
      },
      "hjku": {
        "title": "370",
        "intro": []
      },
      "workshop-node-and-express": {
        "title": "Basic Node and Express",
        "intro": [
          "Node.js is a JavaScript runtime that allows developers to write backend (server-side) programs in JavaScript. Node.js comes with a handful of built-in modules — small, independent programs — that help with this. Some of the core modules include HTTP, which acts like a server, and File System, a module to read and modify files.",
          "In the last set of courses you learned to install and manage packages from npm, which are collections of smaller modules. These packages can help you build larger, more complex applications.",
          "Express is a lightweight web application framework, and is one of the most popular packages on npm. Express makes it much easier to create a server and handle routing for your application, which handles things like directing people to the correct page when they visit a certain endpoint like <pre>/blog</pre>.",
          "In this course, you'll learn the basics of Node and Express including how to create a server, serve different files, and handle different requests from the browser."
        ]
      },
      "lab-timestamp-microservice": {
        "title": "Build a Timestamp Microservice",
        "intro": ["In this lab you will build a timestamp microservice"]
      },
      "lab-request-header-parser-microservice": {
        "title": "Build a Request Header Parser Microservice",
        "intro": [
          "In this lab, you will build a request header parser microservice"
        ]
      },
      "lab-url-shortener-microservice": {
        "title": "Build a URL Shortener Microservice",
        "intro": ["In this lab, you will build a URL Shortener Microservice"]
      },
      "lab-exercise-tracker": {
        "title": "Build an Exercise Tracker",
        "intro": ["In this lab, you will build an exercise tracker"]
      },
      "lab-file-metadata-microservice": {
        "title": "Build a File Metadata Microservice",
        "intro": ["For this lab you will build a file metadata microservice"]
      },
      "kegi": {
        "title": "377",
        "intro": []
      },
      "quiz-backend-javascript": {
        "title": "Backend JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Backend JavaScript."
        ]
      },
      "vnfu": {
        "title": "379",
        "intro": []
      },
      "rlli": {
        "title": "380",
        "intro": []
      },
      "rjpv": {
        "title": "381",
        "intro": []
      },
      "xbri": {
        "title": "382",
        "intro": []
      },
      "quiz-tooling-and-deployment": {
        "title": "Tooling and Deployment Quiz",
        "intro": [
          "Test what you've learned in this quiz of tooling and deployment"
        ]
      },
      "nkjt": {
        "title": "384",
        "intro": []
      },
      "pgjj": {
        "title": "385",
        "intro": []
      },
      "exom": {
        "title": "386",
        "intro": []
      },
      "bvqc": {
        "title": "387",
        "intro": []
      },
      "xish": {
        "title": "388",
        "intro": []
      },
      "front-end-development-certification-exam": {
        "title": "Front End Development Certification Exam",
        "intro": ["", ""]
      }
    }
  },
  "misc-text": {
    "certification": "{{cert}} Zertifikat",
    "browse-other": "Stöbere in unseren anderen kostenlosen Zertifizierungen\n(Wir empfehlen, diese der Reihe nach zu erledigen)",
    "courses": "Kurse",
    "steps": "Schritte",
    "expand": "Kurs erweitern",
    "collapse": "Kurs einklappen",
    "legacy-header": "Alte Kurse",
    "legacy-desc": "Diese Kurse sind nicht mehr Teil des Zertifizierungsprogramms, stehen dir aber weiterhin zur Verfügung, um dich weiterzubilden.",
    "legacy-go-back": "Rufe die aktuelle Version des Lehrplans auf.",
    "course-maintenance": "These courses are undergoing maintenance. If they are not working, you can learn how to run them locally at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "course-disabling-soon": "The browser version of these courses will be temporarily disabled soon and your virtual machines will be deleted. Any progress in your virtual machines will be lost. If you have any files you want from them, you should save them to your computer. We apologize for any inconvenience. We hope to have an improved browser version of these courses available again in the next few weeks.",
    "course-disabled": "These courses are temporarily unavailable to run in the browser. We apologize for any inconvenience. You can learn how to run them locally at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. We hope to have an improved browser version available again soon.",
    "run-locally": "For now, we recommend running the courses locally on your computer. You can learn how at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "Your progress will not be saved to your freeCodeCamp account when running them locally.",
    "go-back-to-learn": "Gehe zurück zur stabilen Version des Lehrplans.",
    "read-database-cert-article": "Bitte lies diesen Forenbeitrag, bevor du fortfährst.",
    "enable-cookies": "Bevor du startest, muss du die Cookies von Drittanbietern aktivieren.",
    "english-only": "Die Kurse in diesem Bereich sind nur auf Englisch verfügbar. Im Moment können wir nur die Titel und Einführungen übersetzen, nicht aber die Lektionen selbst.",
    "exam-english-only": "Please note that the certification exam is currently available only in English. The rest of the courses are available in some languages."
  }
}
