{
  "responsive-web-design": {
    "title": "Legacy Responsive Web Design Challenges",
    "intro": [
      "في شهادة تصميم الويب المستجيب هذه، ستتعلم اللغات التي يستخدمها المطورين لبناء صفحات الويب: HTML (Hypertext Markup Language) للمحتوى، و CSS (Cascading Style Sheets) للتصميم.",
      "أولاً، سوف تبني تطبيق صورة قطة لتتعلم أساسيات HTML و CSS. لاحقاً، سوف تتعلم التقنيات الحديثة مثل متغيرات CSS عن طريق بناء بِطْرِيق، وأفضل الممارسات في إتاحة الوصول (accessibility) عن طريق بناء نموذج ويب.",
      "أخيراً، سوف تتعلم كيف تنشئ صفحات ويب تستجيب لأحجام الشاشات المختلفة عندما تبني بطاقة تويتر باستخدام Flexbox، وتخطيط معقد لمدونة باستخدام CSS Grid."
    ],
    "note": "ملاحظة: بعض إضافات المتصفح, مثل Ad-blockers وإضافات الوضع الليلي قد تتصادم مع نتائج الاختبارات, إذا واجهت مشكلات, ننصحك بتعطيل الإضافات التي قد تؤثر أو تعدل على مخطط الصفحات في أثناء حضورك للدورة.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "أساسيات HTML و HTML5",
        "intro": [
          "HTML هي لغة ترميز تستخدم سياق خاص أو رموز لوصف الهيكل الخاص بصفحة الويب للمتصفح، عناصر HTML عادة لديها علامة فتح وإغلاق تحيط المحتوى وتضيف معنى له. على سبيل المثال، عناصر مختلفة بإمكانها وصف النص كعنوان أو فَقَرة أو عنصر من قائمة.",
          "في هذه الدورة، ستبني تطبيق صورة القطة لتتعلم بعض من أكثر عناصر لغة HTML شيوعاً، وهي كتل البناء لأي صفحة على الويب."
        ]
      },
      "basic-css": {
        "title": "أساسيات CSS",
        "intro": [
          "CSS أو Cascading Style Sheets تخبر المتصفح كيف يعرض النص والعناصر الأخرى الذي قمت بكتابتها في مِلَفّ HTML. و بواسطة CSS تستطيع التحكم باللون والخط والحجم والمسافة والكثير من الأوجه المختلفة لعناصر HTML.",
          "الآن بعد أن وصفت بنية تطبيق صورة القطة الخاصة بك، أضف له بعض التصاميم باستخدام CSS."
        ]
      },
      "applied-visual-design": {
        "title": "التصميم المرئي المطبق",
        "intro": [
          "التصميم المرئي هو مزيج من الطباعة Typography، ونظرية الألوان، والرسوم، والرسوم المتحركة، وتخطيط الصفحات، وأكثر من ذلك للمساعدة في إيصال رسالتك الفريدة.",
          "في هذه الدورة، ستتعلم كيفية تطبيق هذه العناصر المختلفة للتصميم المرئي على صفحات الويب الخاصة بك."
        ]
      },
      "applied-accessibility": {
        "title": "امكانية الوصول المطبقة",
        "intro": [
          "في تطوير المواقع، إماكنية الوصول تشير إلى محتوى ويب وواجهة مستخدم (UI - User Interface) يمكن فهمها والتنقل بها والتفاعل معها من قبل جَمهور عريض. هذا يتضمن أشخاص مصابين بإعاقات بصرية أو سمعية أو حركية أو إدراكية.",
          "في هذه الدورة، ستتعلم أفضل الممارسات لبناء صفحات الويب التي يمكن للجميع الوصول إليها وفهمها."
        ]
      },
      "responsive-web-design-principles": {
        "title": "مبادئ تصميم الويب المتجاوب Responsive",
        "intro": [
          "هناك العديد من الاجهزة التي يمكنها الوصول إلى الويب، وتأتي هذه الأجهزة بمختلف الأشكال والمقاسات. التصميم المتجاوب هو الممارسة في تصميم مواقع مرنة ومتجاوبة تستجيب لمختلف احجام الشاشات والاتجاهات ودقة الشاشات.",
          "في هذه الدورة، ستتعلم كيفية استخدام CSS لجعل صفحات الويب الخاصة بك تبدو جيدة، بغض النظر عن الجهاز الذي يتم مشاهدة الموقع منه."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox هو طريقة تخطيط قوية مدعومة جيدا تم تقديمها مع أحدث إصدار من CSS, CSS3. مع Flexbox، من السهل تركيز العناصر على الصفحة وإنشاء واجهات ديناميكية للمستخدم تتقلص وتتوسع تلقائيا.",
          "في هذه الدورة ، ستتعلم أساسيات flexbox والتخطيطات الديناميكية من خلال بناء بطاقة تويتر."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "تُعد CSS Grid معياراً جديداً تجعل من السهل إنشاء تخطيطات معقدة ومتجاوبة. إنها تعمل عن طريق تحويل عنصر HTML إلى Grid ، وتسمح لك بوضع العناصر الفرعية في أي مكان بداخلها.",
          "في هذه الدورة أنت سوف تتعلّم أساسيات CSS grid من خلال بناء تخطيطات معقّدة مختلفة بما في ذلك بناء مدونة."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Responsive Web Design",
    "intro": [
      "في شهادة تصميم الويب المستجيب هذه، ستتعلم اللغات التي يستخدمها المطورين لبناء صفحات الويب: HTML (Hypertext Markup Language) للمحتوى، و CSS (Cascading Style Sheets) للتصميم.",
      "أولاً، سوف تبني تطبيق صور لقطط لتتعلم أساسيات HTML وCSS. لاحقاً، سوف تتعلم التقنيات الحديثة مثل متغيرات CSS عن طريق بناء بِطْرِيق، وأفضل الممارسات في أمكانية الوصول عن طريق بناء اختبار فس موقع.",
      "وأخيرا، ستتعلم كيفية إنشاء صفحات الويب التي تستجيب لأحجام الشاشة المختلفة عن طريق بناء معرض للصور باستخدام Flexbox، وتصميم لمقال في مجلة باستخدام CSS Grid."
    ],
    "note": "ملاحظة: بعض إضافات المتصفح, مثل Ad-blockers وإضافات الوضع الليلي قد تتصادم مع نتائج الاختبارات, إذا واجهت مشاكل, ننصحك بتعطيل الإضافات التي قد تؤثر أو تعدل على مخطط الصفحات, أثناء حضورك للدورة.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "صفحة الثناء",
        "intro": [
          "هذا هو أحد المشاريع المطلوبة للحصول على شهادتك.",
          "في هذا المشروع، سوف تنشئ صفحة إثناء لموضوع من اختيارك سواء كان الموضوع من وحي خيالك أو حقيقي."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "معرضا لأعمالك الخاصة",
        "intro": [
          "هذا هو أحد المشروعات المطلوبة للحصول على شهادتك.",
          "في هذا المشروع، سوف تتشئ صفحة ويب معرضا لأعمالك الخاصة."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "صفحة لعرض المنتج",
        "intro": [
          "هذا هو أحد المشروعات المطلوبة للحصول على شهادتك.",
          "في هذا المشروع، ستنشئ صفحة لعرض المنتج من اختيارك للتسويق له."
        ]
      },
      "build-a-survey-form-project": {
        "title": "نموذج استطلاع رأي",
        "intro": [
          "هذا هو أحد المشروعات المطلوبة للحصول على شهادتك.",
          "في هذا المشروع، سوف تنشئ نموذج استطلاع رأي لجمع بيانات من مستخدميك."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "صفحة التوثيق التقنية",
        "intro": [
          "هذا هو أحد المشروعات المطلوبة للحصول على شهادتك.",
          "في هذا المشروع، ستنشئ صفحة نموذج استطلاع رأي لتقوم مقام التعليمات أو المرجع لموضوع ما."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "تعلم HTML عن طريق بناء تطبيق صورة القطة",
        "intro": [
          "تعطي وسوم HTML صفحة الويب هيكلها. يمكنك استخدام وسوم HTML لإضافة الصور والأزرار والعناصر الأخرى إلى صفحة الويب الخاصة بك.",
          "في هذه الدورة، ستتعلم وسوم HTML الأكثر شيوعاً عن طريق بناء تطبيقك صورة القطة."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "تعلم اساسيات CSS عن طريق بناء قائمة مقهى",
        "intro": [
          "يخبر CSS المتصفح كيف تعرض صفحتك الويب. يمكنك استخدام CSS لتعيين اللون والخطوط والحجم والجوانب الأخرى لعناصر HTML.",
          "في هذه الدورة، سوف تتعلم CSS عن طريق تصميم صفحة قائمة لصفحة ويب لمقهى."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "تعلم CSS Box Model عن طريق بناء رسم لـRothko",
        "intro": [
          "كل عنصر من عناصر HTML هو صندوقه - مع مساحته الخاصة وحدوده. وهذا يسمى نموذج الصندوق Box Model.",
          "في هذه الدورة، ستستخدم CSS و Box Model لإنشاء قطع فنية مستطيلة على تصممك لوحة روثكو."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "تعلم متغيرات CSS عن طريق أنشئ ناطحة السحاب بالمدينة",
        "intro": [
          "تساعدك متغيرات CSS على تنظيم تصميماتك وإعادة استخدامها.",
          "في هذه الدورة، ستبني ناطحة سحب بالمدينة. ستتعلم كيفية إعداد متغيرات CSS حتى تتمكن من إعادة استخدامها كلما أردت."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "تعلم نموذجات HTML عن طريق بناء نموذج تسجيل",
        "intro": [
          "يمكنك استخدام نموذجات HTML لجمع المعلومات من الأشخاص الذين يزورون صفحتك الويب.",
          "في هذه الدورة، ستتعلم نماذج HTML عن طريق بناء صفحة التسجيل. ستتعلم كيفية التحكم في أنواع البيانات التي يمكن للناس كتابتها في النموذج، وبعض أدوات CSS الجديدة لتصميم صفحتك."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "تعلم تسهيل المنال Accessibility عن طريق بناء اختبار",
        "intro": [
          "الاهتمام بتسهيل المنال إلى صفحتك الويب سهلة الاستخدام لجميع الناس - حتى الأشخاص ذوي الإعاقة.",
          "في هذه الدورة، ستبني صفحة ويب لاختبار. ستتعلم أدوات تسهل المنال مثل اختصارات لوحة المفاتيح، سمات ARIA وأفضل الممارسات في التصميم."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "تعلم المستوي المتوسط من CSS عن طريق بناء لوحة لبيكاسو",
        "intro": [
          "في هذه الدورة، سوف تتعلم بعض تقنيات المستوي المتوسط من CSS عن طريق برمجة صفحتك الويب لرسوم بيكاسو. ستتعلم أيقونات SVG، أيضاً CSS positioning لتنسيق العناصر، ومراجعة مهارات CSS الأخرى التي تعلمتها."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "تعلم تصميم الويب المستجيب Responsive Web Design عن طريق بناء بيانو",
        "intro": [
          "يخبر التصميم المستجيب صفحتك الويب كيف ينبغي أن تبدو على شاشات مختلفة الحجم.",
          "في هذه الدورة، ستستخدم CSS والتصميم المستجيب لبرمجة وبناء بيانو. كما ستتعلم المزيد عن media queries و pseudo selectors."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "تعلم CSS Flexbox من خلال بناء معرض للصور",
        "intro": [
          "يساعدك Flexbox في تصميم صفحتك الويب بحيث تبدو جيدة على أي حجم شاشة.",
          "في هذه الدورة، ستستخدم Flexbox لإنشاء موقع ويب مستجيب Responsive لمعرض صور."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "تعلم CSS Grid عن طريق بناء مجلة",
        "intro": [
          "تمنحك CSS Grid التحكم في صفوف وأعمدة تصميم صفحتك الويب.",
          "في هذه الدورة، ستقوم ببناء مقال في مجلة. ستتعلم كيفية استخدام CSS Grid، بما في ذلك مفاهيم مثل صفوف الشبكة Grid rows وأعمدة الشبكة Grid columns."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "تعلم الطباعة Typography عن طريق بناء علامة التغذية",
        "intro": [
          "إن تشكيل الخط فن لتصميم نصك ليسهل قراءة ويلائم غرضه.",
          "في هذه الدورة، ستستخدم typography لإنشاء صفحة ويب لتسمية التغذية. ستتعلم كيفية تغيير تشكيل النص، وتعديل ارتفاع الخط line-height، و تغيير وضع position نصك باستخدام CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "تعلم تحويلات CSS Transforms عن طريق بناء بطريق",
        "intro": [
          "يمكنك تحويل عناصر HTML لإنشاء تصاميم جذابة. يمكنك استخدام التحولات transforms لتدوير العناصر، وتغيير حجمها، والمزيد.",
          "في هذه الدورة ، ستبني بطريق. ستستخدم تحولات CSS transforms لوضع أجزاء البطريق وتغيير حجمها، وإنشاء خلفية، وتحريك عملك."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "تعلم التحريك CSS Animation عن طريق بناء عجلة Ferris",
        "intro": [
          "يمكنك استخدام CSS animation لتوجيه الانتباه إلى أقسام محددة من صفحة الويب الخاصة بك وجعلها أكثر تفاعلية.",
          "في هذه الدورة، ستبني عجلة Ferris. ستتعلم كيفية استخدام CSS لتحريك العناصر، وتحويلها وتعديل سرعتها."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Learn More About CSS Pseudo Selectors by Building A Balance Sheet",
        "intro": [
          "يمكنك استخدام CSS pseudo selectors لتغيير عناصر HTML محددة.",
          "في هذه الدورة، ستبني ميزانية عامة باستخدام المنتقات الزائفة pseudo selectors. سوف تتعلم كيفية تغيير تصميم عنصر ما عندما تحوم فوقه بماوسك، وتفعيل أحداث أخرى على صفحتك الويب."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "تعلم ألوان CSS عن طريق إنشاء مجموعة من العلامات الملونة",
        "intro": [
          "يمكن أن يؤدي تحديد الألوان الصحيحة لصفحة الويب الخاصة بك إلى تحسين المظهر الجمالي لقرائك بشكل كبير.",
          "في هذه الدورة، ستبني مجموعة من العلامات الملونة. سوف تتعلم طرق مختلفة لتعيين قيم الألوان وكيفية إقران الألوان مع بعضها البعض."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Learn Intermediate CSS by Building a Cat Painting",
        "intro": [
          "Mastering CSS positioning is essential for creating visually appealing and responsive web layouts",
          "In this course, you will build a cat painting. You'll learn about how to work with absolute positioning, the z-index property, and the transform property."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Legacy JavaScript Algorithms and Data Structures",
    "intro": [
      "في حين أن HTML و CSS يتحكمان في محتوى الصفحة وتصميم الصفحة، يستخدم Javascript لجعلها تفاعلية. في شهادة الخوارزميات وهياكل البيانات في JavaScript، ستتعلم أساسيات JavaScript بما في ذلك المتغيرات variables, والقوائم arrays, والكائنات objects والحلقات loops, والوظائف functions.",
      "بمجرد أن يكون لديك الأساسيات، ستطبق تلك المعرفة عن طريق إنشاء خوارزميات للتلاعب بالسلاسل strings، تحديد الأعداد، بل وحساب مدار محطة الفضاء الدولية.",
      "في هذا المشوار ستتعلم أيضًا أسلوبين أو نموذجين مهمين للبرمجة: البرمجة كائنية التوجه (OOP) ، والبرمجة الوظيفية (FP)."
    ],
    "note": "ملاحظة: بعض ملحقات المتصفح, مثل Ad-blockers وإضافات الوضع الليلي قد تتصادم مع نتائج الاختبارات, إذا واجهت مشاكل, ننصحك بتعطيل الملحقات التي قد تؤثر أو تعدل على محتوى الصفحات, أثناء حضورك للدورة.",
    "blocks": {
      "basic-javascript": {
        "title": "أساسيات JavaScript",
        "intro": [
          "إن JavaScript لغة برمجة يمكنك استخدامها لجعل صفحات الويب تفاعلية. إنها إحدى التكنولوجيات الأساسية للويب، إلى جانب HTML و CSS، وهي مدعومة بجميع المتصفحات الحديثة.",
          "في هذه الدورة، ستتعلم مفاهيم البرمجة الأساسية في Javascript. ستبدأ بهياكل البيانات الأساسية مثل الأرقام والنصوص. ثم سوف تتعلم العمل مع الكائنات والقوائم والوظائف والحلقات والشروط وتعبيرات if/else وأكثر من ذلك."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript، أو ES هو نسخة موحدة من JavaScript. لأن جميع المتصفحات الرئيسية تتبع هذه المواصفات، مصطلحي ECMAScript و JavaScript قابلان للتبادل.",
          "معظم ما تعلمته في JavaScript حتى هذه النقطة كان ضمن المعيار ES5 (ECMAScript 5)، والذي تم الاستغناء عنه في عام 2009. بينما لا يزال بإمكانك كتابة البرامج في ES5، فإن JavaScript تتطور دائماً، وتصدر ميزات جديدة كل سنة.",
          "ES6، الصادر في عام 2015، أضاف العديد من الميزات الجديدة القوية إلى اللغة. في هذه الدورة، سوف تتعلم هذه الميزات الجديدة، بما في ذلك دالات السهم \"arrow functions ، التدمير destructuring ، الفئات classes، الوعود Promises، والوحدات Modules."
        ]
      },
      "regular-expressions": {
        "title": "العبارات العادية Regular Expressions",
        "intro": [
          "العبارات العادية Regular expressions، غالباً ما تسمي \"regex\" أو \"regexp\"، هي أنماط تساعد المبرمجين على المطابقة والبحث واستبدال النص. التعابير العادية قوية جداً، ولكن يمكن أن يكون من الصعب قراءتها لأنها تستخدم رموز خاصة لعمل مطابقات أكثر تعقيداً ومرونة.",
          "في هذه الدورة، ستتعلم كيفية استخدام الرموز الخاصة، التقاط المجموعات، النظرات الإيجابية والسلبية، وتقنيات أخرى لمطابقة أي نص تريده."
        ]
      },
      "debugging": {
        "title": "تصحيح الأخطاء",
        "intro": [
          "التصحيح هو عملية المرور عبر التعليمات البرمجية الخاصة بك، والبحث عن أي مشكلات، وإصلاحها.",
          "المشاكل في الكود البرمجي تأتي عموما في ثلاثة أشكال: أخطاء بناء الجملة syntax errors التي تمنع برنامجك من التشغيل، أخطاء في وقت التشغيل runtime errors حيث تحتوي تعليماتك البرمجية على سلوك غير متوقع، أو أخطاء منطقية logical errors حيث لا تفعل تعليماتك البرمجية ما قصدته.",
          "في هذه الدورة، ستتعلم كيفية استخدام وحدة تحكم Javascript لتصحيح البرامج ومنع المشكلات الشائعة قبل حدوثها."
        ]
      },
      "basic-data-structures": {
        "title": "هياكل البيانات الأساسية",
        "intro": [
          "يمكن تخزين البيانات والوصول إليها بعدة طرق. أنت تعرف بالفعل بعض هياكل بيانات javascript الشائعة - القوائم والكائنات.",
          "في هذه الدورة لهياكل البيانات الأساسية، ستتعلم المزيد عن الاختلافات بين القوائم والكائنات، وعن كيفية استخدامها في أوضاع مختلفة. سوف تتعلم أيضاً كيفية استخدام أساليب Javascript المفيدة مثل <code>splice()</code> و <code>Object.keys()</code> للوصول إلى البيانات والتلاعب بها."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "أساسيات الخوارزميات",
        "intro": [
          "الخوارزمية هي سلسلة من التعليمات خطوة بخطوة تصف كيفية القيام بشيء ما.",
          "يساعدك تفكيك المشكلة إلى أجزاء أصغر والتفكير بعناية حول كيفية حل كل جزء علي حدي بواسطة الكود البرمجي على كتابة خوارزميات اكثر فاعلية.",
          "في هذه الدورة، ستتعلم أساسيات التفكير الخوارزمي عن طريق كتابة خوارزميات تفعل كل شيء من تحويل درجات الحرارة إلى التعامل مع القوائم ثنائية الأبعاد 2D arrays المعقدة."
        ]
      },
      "object-oriented-programming": {
        "title": "البرمجة كائنية التوجه Object Oriented Programming",
        "intro": [
          "تعد البرمجة كائنية التوجه OOP أحد النُهج الرئيسية لعملية تطوير البرمجيات. في هذا النهج، تُستخدم الكائنات objects والفئات classes لتنظيم الكود البرمجي لوصف الأشياء وما يمكن أن تفعله.",
          "في هذه الدورة سوف تتعلم المبادئ الأساسية للبرمجة كائنية التوجه في JavaScript، بما في ذلك الكلمة المفتاحية <code>this</code> والسلاسل النموذجية prototype chains والـ constructors والوراثة inheritance."
        ]
      },
      "functional-programming": {
        "title": "البرمجة الوظيفية Functional Programming",
        "intro": [
          "إن البرمجة الوظيفية نهج شائع آخر لتطوير البرمجيات. في البرمجة الوظيفية، ينظم الكود في وظائف أصغر وأساسية يمكن الجمع بينها لبناء برامج معقدة.",
          "في هذه الدورة، ستتعلم المفاهيم الأساسية للبرمجة الوظيفية بما في تلك الوظيفة العادية، كيفية تجنب الطفرات وكيفية كتابة كود أنظف مع أساليب مثل <code>.map()</code> و <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "الخوارزميات - المستوى متوسط",
        "intro": [
          "الآن بعد أن عرفت أساسيات التفكير الخوارزمي، جنبا إلى جنب مع OOP والبرمجة الوظيفية، اختبر مهاراتك مع تحديات الخوارزميات في المستوي المتوسط."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "مشاريع خوارزميات وهياكل البيانات Javascript",
        "intro": [
          "حان الوقت لوضع مهاراتك الجديدة في Javascript قيد العمل. هذه المشاريع مشابهة لتحديات الخوارزميات التي قمت بها من قبل لكنها فقط أكثر صعوبة.",
          "أكمل مشاريع JavaScript الخمسة هذه للحصول على شهادة الخوارزميات وهياكل البيانات في JavasScript."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "JavaScript Algorithms and Data Structures (Beta)",
    "intro": [
      "Developers use HTML and CSS to control the content and styling of a page. And they use JavaScript to make that page interactive.",
      "In this JavaScript Algorithm and Data Structures Certification, you'll learn the JavaScript fundamentals like variables, arrays, objects, loops, functions, the DOM and more.",
      "You'll also learn about Object Oriented Programming (OOP), Functional Programming, algorithmic thinking, how to work with local storage, and how to fetch data using an API."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and script-blockers can interfere with the tests. If you face issues, we recommend disabling extensions that modify or block the content of pages while taking the course.",
    "blocks": {
      "build-a-pokemon-search-app-project": {
        "title": "Build a Pokémon Search App Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a Pokémon search app."
        ]
      },
      "build-a-cash-register-project": {
        "title": "Build a Cash Register Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you'll build a cash register web app."
        ]
      },
      "build-a-palindrome-checker-project": {
        "title": "Build a Palindrome Checker Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you'll build an application that checks whether a given word is a palindrome."
        ]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Build a Roman Numeral Converter Project",
        "intro": [
          "This is one of the required projects to claim your certification.",
          "For this project, you'll build an application that converts integers to Roman numerals."
        ]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Build a Telephone Number Validator Project",
        "intro": [
          "This is one of the required projects to claim your certification.",
          "For this project, you'll build an application that checks if a number is a valid United States phone number."
        ]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Learn Basic JavaScript by Building a Role Playing Game",
        "intro": [
          "JavaScript is a powerful scripting language that you can use to make web pages interactive. It's one of the core technologies of the web, along with HTML and CSS. All modern browsers support JavaScript.",
          "In this practice project, you'll learn fundamental programming concepts in JavaScript by coding your own Role Playing Game. You'll learn how to work with arrays, strings, objects, functions, loops, <code>if/else</code> statements, and more."
        ]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Learn Form Validation by Building a Calorie Counter",
        "intro": [
          "Sometimes when you're coding a web application, you'll need to be able to accept input from a user. In this calorie counter project, you'll learn how to validate user input, perform calculations based on that input, and dynamically update your interface to display the results.",
          "In this practice project, you'll learn basic regular expressions, template literals, the <code>addEventListener()</code> method, and more."
        ]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Learn Functional Programming by Building a Spreadsheet",
        "intro": [
          "Functional Programming is a popular approach to software development. In Functional Programming, developers organize code into smaller functions, then combine those functions to build complex programs.",
          "In this spreadsheet application project, you'll learn about parsing and evaluating mathematical expressions, implementing spreadsheet functions, handling cell references, and creating interactive web interfaces. You'll learn how to dynamically update the page based on user input.",
          "This project will cover concepts like the <code>map()</code>, <code>find()</code>, and <code>includes()</code> methods and the <code>parseInt()</code> function."
        ]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Learn Modern JavaScript Methods by Building Football Team Cards",
        "intro": [
          "One common aspect of building web applications: processing datasets, and then outputting information to the screen. In this sports team cards project, you'll learn how to work with DOM manipulation, object destructuring, event handling, and data filtering.",
          "This project will cover concepts like, default parameters, <code>Object.freeze()</code>, and reinforce your knowledge of the <code>switch</code> statement and <code>map()</code> method."
        ]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Learn Advanced Array Methods by Building a Statistics Calculator",
        "intro": [
          "As you expand your JavaScript skills, you'll want to get comfortable with array manipulation methods, such as <code>map()</code>, <code>reduce()</code>, and <code>filter()</code>.",
          "In this statistics calculator project, you'll gain experience with handling user input, DOM manipulation, and method chaining. You'll get practice by performing statistical calculations like mean, median, mode, variance, and standard deviation."
        ]
      },
      "learn-basic-oop-by-building-a-shopping-cart": {
        "title": "Learn Basic OOP by Building a Shopping Cart",
        "intro": [
          "OOP, or Object Oriented Programming, is one of the major approaches to the software development process. In OOP, developers use objects and classes to structure their code.",
          "In this shopping cart project, you'll learn how to define classes and use them. You'll create class instances and implement methods for data manipulation.",
          "This project will cover concepts like the ternary operator, the spread operator, the <code>this</code> keyword, and more."
        ]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Learn Fetch and Promises by Building an fCC Authors Page",
        "intro": [
          "One common aspect of web development is learning how to fetch data from an external API, then work with asynchronous JavaScript.",
          "This freeCodeCamp authors page project will show you how to use the fetch method, then dynamically update the DOM to display the fetched data.",
          "This project will also teach you how to paginate your data so you can load results in batches."
        ]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Learn Regular Expressions by Building a Spam Filter",
        "intro": [
          "Regular expressions, often shortened to \"regex\" or \"regexp\", are patterns that help programmers match, search, and replace text. Regular expressions are powerful, but can be difficult to understand because they use so many special characters.",
          "In this spam filter project, you'll learn about capture groups, positive lookaheads, negative lookaheads, and other techniques to match any text you want."
        ]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Learn Basic Algorithmic Thinking by Building a Number Sorter",
        "intro": [
          "In computer science, there are fundamental sorting algorithms that all developers should learn. In this number sorter project, you'll learn how to implement and visualize different sorting algorithms like bubble sort, selection sort, and insertion sort – all with JavaScript.",
          "This project will help you understand the fundamental concepts behind these algorithms, and how you can apply them to sort numerical data in web applications."
        ]
      },
      "review-algorithmic-thinking-by-building-a-dice-game": {
        "title": "Review Algorithmic Thinking by Building a Dice Game",
        "intro": [
          "Algorithmic thinking involves the ability to break down complex problems into a sequence of well-defined, step-by-step instructions.",
          "In this Dice game project, you’ll learn how to manage game state, implement game logic for rolling dice, keeping score, and applying rules for various combinations.",
          "This project covers concepts such as event handling, array manipulation, conditional logic, and updating the user interface dynamically based on game state."
        ]
      },
      "learn-intermediate-oop-by-building-a-platformer-game": {
        "title": "Learn Intermediate OOP by Building a Platformer Game",
        "intro": [
          "Coding a game is a great way to grasp fundamental programming principles, while also creating an interactive gaming experience.",
          "In this platformer game project, you'll continue to learn about classes, objects, inheritance, and encapsulation. You'll also learn how to design and organize game elements efficiently and gain insights into problem-solving and code reusability."
        ]
      },
      "learn-localstorage-by-building-a-todo-app": {
        "title": "Learn localStorage by Building a Todo App",
        "intro": [
          "Local storage is a web browser feature that lets web applications store key-value pairs persistently within a user's browser. This allows web apps to save data during one session, then retrieve it in a later page session.",
          "In this TODO application, you'll learn how to handle form inputs, manage local storage, perform CRUD (Create, Read, Update, Delete) operations on tasks, implement event listeners, and toggle UI elements."
        ]
      },
      "learn-the-date-object-by-building-a-date-formatter": {
        "title": "Learn the Date Object by Building a Date Formatter",
        "intro": [
          "Working with dates in JavaScript can be challenging. You have to navigate various methods, formats, and time zones. In this project, you'll learn how to work with the JavaScript Date object, including its methods and properties. You'll also learn how to correctly format dates.",
          "This project will cover concepts such as the <code>getDate()</code>, <code>getMonth()</code>, and <code>getFullYear()</code> methods."
        ]
      },
      "learn-asynchronous-programming-by-building-an-fcc-forum-leaderboard": {
        "title": "Learn Asynchronous Programming by Building an fCC Forum Leaderboard",
        "intro": [
          "JavaScript is an asynchronous programming language. And this project will help you gain proficiency in asynchronous concepts. You'll code your own freeCodeCamp forum leaderboard.",
          "This project will cover the Fetch API, promises, Async/Await, and the try..catch statement."
        ]
      },
      "learn-basic-string-and-array-methods-by-building-a-music-player": {
        "title": "Learn Basic String and Array Methods by Building a Music Player",
        "intro": [
          "Now let's learn some essential string and array methods like the <code>find()</code>, <code>forEach()</code>, <code>map()</code>, and <code>join()</code>. These methods are crucial for developing dynamic web applications.",
          "In this project, you'll code a basic MP3 player using HTML, CSS, and JavaScript. The project covers fundamental concepts such as handling audio playback, managing a playlist, implementing play, pause, next, previous, and shuffle functionalities. You'll even learn how to dynamically update your user interface based on the current song."
        ]
      },
      "learn-recursion-by-building-a-decimal-to-binary-converter": {
        "title": "Learn Recursion by Building a Decimal to Binary Converter",
        "intro": [
          "Recursion is a programming concept where a function calls itself. This can reduce a complex problem into simpler sub-problems, until they become straightforward to solve.",
          "In this project, you’ll build a decimal-to-binary converter using JavaScript. You’ll learn the fundamental concepts of recursion, explore the call stack, and build out a visual representation of the recursion process through an animation."
        ]
      },
      "learn-introductory-javascript-by-building-a-pyramid-generator": {
        "title": "Learn Introductory JavaScript by Building a Pyramid Generator",
        "intro": [
          "JavaScript is a powerful scripting language that you can use to make web pages interactive. It's one of the core technologies of the web, along with HTML and CSS. All modern browsers support JavaScript.",
          "In this practice project, you'll learn fundamental programming concepts in JavaScript by coding your own Pyramid Generator. You'll learn how to work with arrays, strings, functions, loops, <code>if/else</code> statements, and more."
        ]
      },
      "review-js-fundamentals-by-building-a-gradebook-app": {
        "title": "Review JavaScript Fundamentals by Building a Gradebook App",
        "intro": [
          "In this mini project, you will get to review JavaScript fundamentals like functions, variables, conditionals and more by building a gradebook app.",
          "This will give you an opportunity to solve small problems and get a better understanding of the basics."
        ]
      },
      "learn-basic-debugging-by-building-a-random-background-color-changer": {
        "title": "Learn Basic Debugging by Building a Random Background Color Changer",
        "intro": [
          "Debugging is the process of going through your code, finding any issues, and fixing them.",
          "In this project, you will help CamperBot build a random background color changer and help them find and fix errors."
        ]
      },
      "review-dom-manipulation-by-building-a-rock-paper-scissors-game": {
        "title": "Review DOM Manipulation by Building a Rock, Paper, Scissors Game",
        "intro": [
          "In the previous projects you learned how to work with basic DOM manipulation. Now it is time to review what you have learned by building a Rock, Paper, Scissors game.",
          "In this mini project, you will review conditionals, functions, <code>getElementById</code>, and more. This project will give you an opportunity to solve small problems and get a better understanding of the basics."
        ]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "مكتبات تطوير واجهة المستخدم",
    "intro": [
      "الآن بعد أن أصبحت على دراية بـ HTML و CSS و JavaScript، قم برفع مستوى مهاراتك من خلال تعلم بعض مكتبات واجهة المستخدم الأكثر شعبية في المجال.",
      "سوف تتعلم بواسطة شهادة مكتبات تطوير الواجهات الأمامية، كيفية تصميم موقعك بسرعة باستخدام Bootstrap. ستتعلم أيضا إضافة بعض المنطق إلى CSS وتوسيع نطاقه باستخدام Sass.",
      "سوف تبني لاحقا سلة تسوق و تطبيقات أخرى لتتعلم كيفية بناء تطبيقات ذات صفحة واحدة (Single Page Applications SPAs) باستخدام React و Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap هو إطار عمل للواجهة الأمامية يُستخدم لتصميم صفحات وتطبيقات متجاوبة. وهو يأخذ نهج الهاتف أولاً لتطوير الويب، ويشمل أنماط وفئات CSS المبنية مسبقاً، بالإضافة إلى بعض وظائف Javascript.",
          "في هذه الدورة ، ستتعلم كيفية بناء مواقع مستجيبة باستخدام Bootstrap، واستخدم فئاته المضمنة لتصميم الأزرار والصور والنماذج وعناصر التنقل والعناصر المشتركة الأخرى."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery هي واحدة من أكثر مكتبات JavaScript استخداما في العالم.",
          "عندما تم إصدارها في عام ٢٠٠٦ تعاملت جميع المتصفحات الكبيرة مع JavaScript بشكل مختلف قليلاً. قامت jQuery بتبسيط عملية كتابة JavaScript على المتصفح client-side، وأيضاً ضمان عمل الكود الخاص بك بنفس الطريقة في جميع المتصفحات.",
          "في هذه الدورة، ستتعلم كيفية استخدام jQuery لتحديد العناصر المختلفة في الصفحة وإزالتها واستنساخها وتعديلها."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass اختصارا ل (Syntactically Awesome StyleSheets) هو امتداد للغة CSS محسن يضيف ميزات غير متوفرة في CSS الأساسية، والتي تجعل من الأسهل لك تبسيط وحفظ style sheets لمشاريعك.",
          "في دورة Sass هذه، ستتعلم كيفية تخزين البيانات في المتغيرات. إنشاء أنماط متشعبة و انماط قابلة لإعادة الاستخدام مع المزج، إضافة المنطق والحلقات إلى الأنماط الخاصة بك، وأكثر من ذلك."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "إن React مكتبة شائعة من مكتبات JavaScript لبناء واجهة مستخدم قابلة لإعادة البناء اعتماداً على المكون لصفحات الويب أو التطبيقات.",
          "يجمع React بين الـ HTML ووظائف الـ JavaScript في لغة ترميز خاصة به تدعى JSX. كما أن React يجعل من السهل إدارة تدفق البيانات في التطبيق.",
          "في هذه الدورة ، ستتعلم كيفية إنشاء مكونات مختلفة من React وإدارة البيانات في شكل State و Props و استخدام أساليب دورة الحياة المختلفة مثل <code>componentDidMount</code>، وأكثر من ذلك بكثير."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "مع نمو التطبيقات في الحجم والنطاق ، تصبح إدارة البيانات المشتركة أكثر صعوبة. يتم تعريف Redux على أنه \"حاوية حالة يمكن التنبؤ بها لتطبيقات JavaScript\" تساعد على ضمان عمل تطبيقاتك بشكل متوقع ، كما يسهل اختبارها.",
          "بينما يمكنك استخدام Redux مع أي مكتبة أخرى، نحن نقدم Redux هنا قبل الجمع بينها هي و React في المجموعة التالية من الدورات.",
          "في هذه الدورة ، ستتعلم أساسيات Redux stores والـ actions والـ middleware والـ reducers لإدارة البيانات في تطبيقك."
        ]
      },
      "react-and-redux": {
        "title": "React and Redux",
        "intro": [
          "كثيرا ما يُشار إلى React و Redux معاً، ولسبب وجيه. المطور الذي أنشأ Redux كان مطور لـ React و اراد أن يسهل مشاركة البيانات عبر المكونات المختلفة.",
          "الآن بعد أن عرفت كيفية إدارة تدفق البيانات المشتركة مع Redux، حان الوقت للجمع بين تلك المعرفة و React. في دورات React و Redux، ستبني مكون React وتتعلم كيفية إدارة الحالة state محلياً على مستوى المكون. وعبر التطبيق برمته مع Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "مشاريع مكتبات تطوير واجهة المستخدم",
        "intro": [
          "حان الوقت لوضع مهاراتك في مكتبات تطوير واجهات المستخدم للاختبار. استخدم Bootstrap, و jQuery, و Sass, و React, و Redux لبناء 5 مشروعات لتختبر ما تعلمته حتى هذه النقطة.",
          "أكمل جميع المشاريع الخمسة، وستحصل على شهادة في مكتبات تطوير واجهة المستخدم."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "تصوّر البيانات",
    "intro": [
      "البيانات حولنا جميعاً، لكنها لا تعني الكثير بدون شكل أو سياق.",
      "في شهادة تصوّر البيانات، ستقوم بإنشاء مخططات ورسوم بيانية وخرائط لعرض أنواع مختلفة من البيانات مع مكتبة D3.js.",
      "سوف تتعلم أيضاً JSON وهو اختصار لـ (JavaScript Object Notation)، وكيفية العمل مع البيانات عبر الإنترنت باستخدام API (واجهة برمجة التطبيقات)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "تصور البيانات مع D3",
        "intro": [
          "D3 ، أو D3.js ، تعني المستندات المستندة إلى البيانات. إنها مكتبة JavaScript لإنشاء تصورات بيانات ديناميكية وتفاعلية في المتصفح.",
          "تم بناء D3 للعمل مع معايير الويب المشتركة - وتحديداً HTML و CSS و SVG.",
          "D3 يدعم العديد من الأنواع المختلفة لصيغ البيانات المُدخلة. ثم باستخدام أساليبه القوية المدمجة، يمكنك تحويل تلك البيانات إلى مخططات ورسوم بيانية وخرائط مختلفة.",
          "في تصوّر البيانات مع دورات D3، ستتعلم كيفية العمل مع البيانات لإنشاء مخططات مختلفة، رسوم بيانية، والعناصر المتحركة، والمكونات الأخرى لإنشاء تصوّرات بيانات دينامكية وجذابة."
        ]
      },
      "json-apis-and-ajax": {
        "title": "واجهات برمجة تطبيقات JSON و AJAX",
        "intro": [
          "على غرار كيفية مساعدة واجهات المستخدم للأشخاص في استخدام البرامج ، تساعد واجهات برمجة التطبيقات (APIs) البرامج على التفاعل مع البرامج الأخرى. واجهات برمجة التطبيقات هي أدوات تستخدمها أجهزة الكمبيوتر للتواصل مع بعضها البعض ، جزئيًا لإرسال البيانات واستلامها.",
          "غالبًا ما يستخدم المبرمجون AJAX (JavaScript غير متزامن و XML) عند العمل مع واجهات برمجة التطبيقات APIs. يشير AJAX إلى مجموعة من التقنيات التي تقدم طلبات غير متزامنة إلى خادم لنقل البيانات ، ثم تحميل أي بيانات يتم إرجاعها في الصفحة. وغالبًا ما تكون البيانات المنقولة بين المتصفح والخادم بتنسيق يسمى JSON (JavaScript Object Notation).",
          "هذه الدورة سوف تعلمك أساسيات العمل مع واجهة برمجة التطبيقات API وتقنيات AJAX المختلفة في المتصفح."
        ]
      },
      "data-visualization-projects": {
        "title": "مشاريع تصوير البيانات",
        "intro": [
          "الآن بعد أن تعلمت كيفية العمل مع تقنيات D3، API، و AJAX ، ضع مهاراتك للاختبار مع مشاريع تصوّر البيانات الخمسة هذه.",
          "في هذه المشاريع، ستحتاج إلى جلب البيانات وتحليل مجموعة من البيانات، ثم استخدام D3 لإنشاء تصوّر لبيانات مختلفة. قم بإنهائها جميعاً لتحصل علي شهادة تصور البيانات الخاصة بك."
        ]
      },
      "d3-dashboard": {
        "title": "لوحة تحكم D3",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Relational Database",
    "intro": [
      "في هذه الدورات، سوف تستخدم أدوات وبرامج المطورين الحقيقية، بما في ذلك VS Code، و PostgreSQL، و Command Line باستخدام Linux/Unix لإكمال الدروس التفاعلية وبناء المشروعات.",
      "تبدأ هذه الدورات بأوامر Bash الأساسية. باستخدام Terminal، ستتعلم كل شيء بدءًا من التنقل في نظام الملفات ومعالجته، والبرمجة في Bash, وصولاً إلى الاستخدام المتقدم.",
      "بعد ذلك، سوف تتعلم كيفية إنشاء relational database وكيفية استخدامها بواسطة PostgreSQL، نظام إدارة relational database، و لغة SQL لأستعمال مع relational database.",
      "أخيرا، سوف تتعلم Git، نظام تحكم الإصدار، أداة أساسية لكل مطور."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "قاعدة بيانات الأجرام السماوية",
        "intro": [
          "هذا أحد المشروعات المطلوبة للحصول على شهادتك.",
          "لهذا المشروع، سوف تنشئ قاعدة بيانات للأجرام السماوية باستخدام PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "لُعْبَة تخمين العدد",
        "intro": [
          "هذا أحد المشروعات المطلوبة للحصول على شهادتك.",
          "لهذا المشروع، سوف تستخدم برنامَج Bash، و PostgreSQL، و Git لإنشاء لُعْبَة تخمين عدد تعمل على تطبيق terminal وتحفظ معلومات المستخدم."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "قاعدة بيانات الجدول الدوري",
        "intro": [
          "هذا أحد المشروعات المطلوبة للحصول على شهادتك.",
          "For this project, you will create a Bash script to get information about chemical elements from a periodic table database."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "مجدول مواعيد الصالون",
        "intro": [
          "هذا أحد المشروعات المطلوبة للحصول على شهادتك.",
          "لهذا المشروع، ستنشئ برنامَج Bash التفاعلي الذي يستخدم PostgreSQL لتتبع العملاء والتوقيت لصالونك."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "قاعدة بيانات كأس العالم",
        "intro": [
          "هذا أحد المشروعات المطلوبة للحصول على شهادتك.",
          "لهذا المشروع، سوف تنشئ برنامج Bash الذي يدخل المعلومات من ألعاب كأس العالم إلى PostgreSQL، ثم تستفسر في database للحصول على إحصاءات مفيدة."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "تعلم معلومات Bash متقدمة عن طريق بناء Kitty Ipsum Translator",
        "intro": [
          "هناك أوامر Bash أكثر من مما قد تظن.",
          "في 140 درس، سوف تتعلم بعض الأوامر الأكثر تعقيدا، وتفاصيل كيفية عمل الأوامر."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "تعلم Bash و SQL بواسطة بناء Bike Rental Shop",
        "intro": [
          "في دورة المكونة من 210 درس, ستبني برنامَج Bash التفاعلي الذي يخزن معلومات الإيجار لمتجر بيع الدراجات باستخدام PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "تعلم Bash عن طريق بناء Boilerplate",
        "intro": [
          "تتيح لك terminal إرسال أوامر نصية إلى جهاز كمبيوترك الذي يمكنه التلاعب بنظام الملفات، وتشغيل البرامج، وتجعل المهام تلقائية، وأكثر من ذلك بكثير.",
          "في دورة من 170 درس, سوف تتعلم الأوامر terminal عن طريق إنشاء website boilerplate باستخدام command line فقط."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "تعلم برمجة Bash عن طريق بناء خمس برامج",
        "intro": [
          "البرامج Bash تجمع بين الأوامر terminal والمنطق في برامج يمكنها تنفيذ المهام أو أتمتها، وأكثر بكثير.",
          "في دورة من 220 الدرس، سوف تتعلم المزيد من الأوامر terminal وكيفية استخدامها ضمن برامج Bash عن طريق إنشاء خمس برامج صغيرة."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "تعلم Git عن طريق بناء كائن مرجعي SQL",
        "intro": [
          "يكون Git نظام تحكم الإصدار الذي يتابع جميع التغييرات التي أجرائها في كودك.",
          "في دورة من 240 درس، ستتعلم كيفية يتبع Git كودك عن طريق إنشاء كائن يحتوي على أوامر SQL شائعة الاستخدام."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "تعلم Nano عن طريق بناء قلعة",
        "intro": [
          "يكون Nano برنامَج يسمح لك بتعديل الملفات في المحطة الطرفية.",
          "في دورة من 40 درس، سوف تتعلم كيفية تعديل الملفات في terminal مع Nano خلال بناء القلعة."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "تعلم Relational Databases عن طريق بناء Mario Database",
        "intro": [
          "وتنظم بيانات relational database في جداول مترابطة معا بواسطة علاقات.",
          "في دورة من 165 الدرس سوف تتعلم أساسيات relational database عن طريق إنشاء قاعدة بيانات PostgreSQL مليئة برموز لُعْبَة الفيديو."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "تعلم SQL عن طريق بناء Student Database: الجزء 1",
        "intro": [
          "لغة الاستعلام SQL، أو لغة الاستعلام الهيكلية Structured Query Language، هي اللغة للتواصل مع relational database.",
          "في دورة من 140 درس, ستنشئ برنامَج Bash يستخدم SQL لإدخال معلومات عن طلاب علوم كمبيوترك في PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "تعلم SQL عن طريق بناء Student Database: الجزء 2",
        "intro": [
          "يتم استخدام أوامر الانضمام SQL للجمع بين المعلومات من جداول متعددة في قاعدة بيانات العلاقات",
          "في دورة من 140 درس، سوف تكمل قاعدة بيانات التلميذ بينما تغوص أعمق في أوامر SQL."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "تطوير الواجهات الخلفية للمواقع و واجهات برمجة التطبيقات - Back End Development and APIs",
    "intro": [
      "حتى هذه النقطة، لقد استخدمت JavaScript فقط في الواجهة الأمامية لإضافة تفاعل إلى صفحة، أو حل تحديات الخوارزميات، أو بناء SPA. ولكن يمكن أيضاً استخدام JavaScript في الواجهة الخلفية back end، أو السيرفر، لبناء تطبيقات ويب برمتها.",
      "واليوم، فإن إحدى الطرق الشائعة لبناء التطبيقات هي من خلال الخدمات المصّغرة microservices، وهي تطبيقات صغيرة ومحددة تعمل معاً لتشًكل وحدة اكبر.",
      "في شهادة تطوير واجهات الBack End و الAPIs، سوف تتعلم كيف تنشئ تطبيقات back end باستخدام Node.js و npm. سوف تقوم أيضا ببناء تطبيقات الويب باستخدام إطار العمل Express، و بناء microservice لإيجاد الأفراد باستخدام MongoDB ومكتبة Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "إدارة الحزم Packages باستخدام NPM",
        "intro": [
          "npm (node pack manager)، هو أداة في سطر الأوامر لتثبيت وإنشاء ومشاركة الحزم من كود Javascript المكتوب لـ Node.js. هناك العديد من الحزم مفتوحة المصدر متاحة على npm، لذلك قبل بدء المشروع، استغرق بعض الوقت للاستكشاف حتى لا ينتهي بك الأمر إلى إعادة إنشاء العجلة لأشياء مثل العمل مع التواريخ أو جلب البيانات من API.",
          "في هذه الدورة، ستتعلم أساسيات استخدام npm، بما في ذلك كيفية العمل مع الحزمة <code>package.json</code> وكيفية إدارة التبعيات المثبتة installed dependencies."
        ]
      },
      "basic-node-and-express": {
        "title": "أساسيات Node و Express",
        "intro": [
          "Node.js هي runtime للغة البرمجة Javascript تسمح للمطورين بكتابة البرامج الخلفية (Server-side) في JavaScript. وتأتي Node.js مع مجموعة من الوحدات المدمجة - برامج صغيرة ومستقلة - تساعد في ذلك. بعض الوحدات الأساسية تشمل HTTP ، الذي يعمل مثل الخادم، ونظام الملفات، ووحدة لقراءة وتعديل الملفات.",
          "في المجموعة الأخيرة من الدورات تعلّمت تثبيت وإدارة الحزم من npm، وهي مجموعات من الوحدات الأصغر. يمكن لهذه الحزم أن تساعدك على بناء تطبيقات أكبر وأكثر تعقيداً.",
          "Express هو إطار تطبيق ويب خفيف، وهو واحد من أكثر الحزم شعبية على npm. يسهل استخدام Express في إنشاء خادم والتعامل مع توجيه مسار تطبيقك، الذي يتعامل مع أشياء مثل توجيه الناس إلى الصفحة الصحيحة عندما يزورون endpoint معينة مثل <pre>/blog</pre>.",
          "في هذه الدورة، ستتعلم أساسيات Node و Express، بما في ذلك كيفية إنشاء خادم server، تقديم serve ملفات مختلفة، والتعامل مع طلبات requests مختلفة من المتصفح."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB و Mongoose",
        "intro": [
          "MongoDB هو تطبيق قاعدة بيانات يخزن مستندات (أو سجلات) JSON التي يمكنك استخدامها في تطبيقك. و علي عكس SQL، هو نوع آخر من قواعد البيانات، فإن MongoDB هي قاعدة بيانات غير علائقية أو \"NoSQL\". وهذا يعني أن MongoDB يخزن جميع البيانات المرتبطة داخل سجل واحد، بدلا من تخزينها عبر العديد من الجداول المسبقة كما هو الحال في قاعدة بيانات SQL.",
          "تكون Mongoose حُزْمَة npm شعبية لاستعمال MongoDB. مع Mongoose، يمكنك استخدام كائنات JavaScript عادية بدلاً من JSON، مما يسهل العمل مع MongoDB. وهو يسمح لك بإنشاء مخططات لمستنداتك المسماة schema، حتي لا تحفظ نوع خاطئ من البيانات عن طريق الخطأ وتسبب أخطاء لاحقاً.",
          "في دورات MongoDB و Mongoos، ستتعلم أساسيات العمل مع البيانات بما في ذلك كيفية إعداد نموذج model، وحفظ، وحذف، وإيجاد الوثائق في قاعدة البيانات."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "مشاريع تطوير الواجهات الخلفية للمواقع و واجهات برمجة التطبيقات APIs",
        "intro": [
          "لقد عملت مع واجهة برمجة التطبيقات APIs من قبل، ولكن الآن بعد أن عرفت npm، و Node, و Express، و MongoDB، و Mongoose، حان الوقت لبناء API بنفسك، بالاعتماد على ما تعلمته حتى هذه النقطة لإنشاء 5 خدمات مصغّرة microservices مختلفة، وهي تطبيقات أصغر محدودة النطاق.",
          "بعد إنشاء هذه البرمجيات، سيكون لديك 5 APIs رائعة للخدمات الصغرى يمكنك عرضها للأصدقاء والعائلة وأصحاب العمل المحتملين، وستحصل أيضًا على شهادة تطوير الواجهة الخلفية وواجهات برمجة التطبيقات."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "ضمان الجودة",
    "intro": [
      "كلما أصبحت برامجك أو تطبيقاتك أكثر تعقيداً، ستريد اختبارها للتأكد من أن التغييرات الجديدة لا تخالف وظائفها الأصلية.",
      "في شهادة ضمان الجودة، ستتعلم كيفية كتابة الاختبارات مع Chai للتأكد من أن تطبيقاتك تعمل بالطريقة التي تتوقع منها ذلك.",
      "ثم ستقوم ببناء تطبيق دردشة لتتعلّم مفهاهيم Node و Express المتقدمة. ستستخدم Pug أيضًا كمحرك قالب، Passport للمصادقة، و Socket.io للاتصال الفوري بين الخادم والعملاء المتصلين."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "ضمان الجودة والاختبار مع Chai",
        "intro": [
          "Chai هي مكتبة اختبارات للـ Javascript تساعدك على تأكيد أن برنامجك لا يزال يتصرف بالطريقة التي تتوقعها بعد إجراء تغييرات على الكود الخاص بك.",
          "باستخدام Chai، يمكنك كتابة الاختبارات التي تصف متطلبات برنامجك لمعرفة ما إذا كان برنامجك يفي بها.",
          "في هذه الدورة، ستتعرف على التأكيدات، المساواة العميقة، الصدق، اختبار API، وغيرها من أساسيات اختبار تطبيقات Javascript."
        ]
      },
      "advanced-node-and-express": {
        "title": "دروس Node و Express المتقدمة",
        "intro": [
          "الآن حان الوقت للغوص العميق في Node.js و Express.js من خلال بناء تطبيق دردشة مع نظام تسجيل الدخول.",
          "لتنفيذ نظام تسجيل الدخول بأمان، ستحتاج إلى معرفة عن المصادقة authentication. وهو التحقق من هوية الشخص أو العملية.",
          "في هذه الدورة ، ستتعلم كيفية استخدام Passport لإدارة المصادقة ، Pug لإنشاء قوالب قابلة لإعادة الاستخدام لبناء الواجهة الأمامية بسرعة. و sockets الويب للاتصال الفوري بين العملاء والخادم."
        ]
      },
      "quality-assurance-projects": {
        "title": "مشاريع ضمان الجودة",
        "intro": [
          "الآن بعد أن أصبحت على دراية جيدة في كل من تطوير الواجهة الأمامية و الخلفية. حان الوقت لتطبيق كل المهارات والمفاهيم التي تعلمتها حتى هذه النقطة. ستبني 5 تطبيقات مختلفة على الويب، وستكتب اختبارات لكل واحدة منها للتأكد من أنها تعمل ويمكنها التعامل مع حالات مختلفة.",
          "بعد الانتهاء من مشاريع ضمان الجودة هذه، سيكون لديك 5 مشاريع في حافظتك، وشهادة جديدة تظهر على حافظتك."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Scientific Computing with Python (Beta)",
    "intro": [
      "The Scientific Computing with Python (Beta) curriculum will equip you with the skills to analyze and manipulate data using Python, a powerful and versatile programming language. You'll learn key concepts like data structures, algorithm, Object Oriented Programming, and how to perform complex calculations using a variety of tools.",
      "This comprehensive course will guide you through the fundamentals of scientific computing, including data structures, and algorithms."
    ],
    "note": "",
    "blocks": {
      "learn-string-manipulation-by-building-a-cipher": {
        "title": "Learn String Manipulation by Building a Cipher",
        "intro": [
          "Python is a powerful and popular programming language widely used for data science, data visualization, web development, game development, machine learning and more.",
          "In this project, you'll learn fundamental programming concepts in Python, such as variables, functions, loops, and conditional statements. You'll use these to code your first programs."
        ]
      },
      "learn-how-to-work-with-numbers-and-strings-by-implementing-the-luhn-algorithm": {
        "title": "Learn How to Work with Numbers and Strings by Implementing the Luhn Algorithm",
        "intro": [
          "The Luhn Algorithm is widely used for error-checking in various applications, such as verifying credit card numbers.",
          "By building this project, you'll gain experience working with numerical computations and string manipulation."
        ]
      },
      "learn-list-comprehension-by-building-a-case-converter-program": {
        "title": "Learn Python List Comprehension by Building a Case Converter Program",
        "intro": [
          "List Comprehension is a way to construct a new Python list from an iterable types: lists, tuples, and strings. All without using a for loop or the `.append()` list method.",
          "In this project, you'll write a program that takes a string formatted in Camel Case or Pascal Case, then converts it into Snake Case.",
          "The project has two phases: first you'll use a for loop to implement the program. Then you'll learn how to use List Comprehension instead of a loop to achieve the same results."
        ]
      },
      "learn-regular-expressions-by-building-a-password-generator": {
        "title": "Learn Regular Expressions by Building a Password Generator",
        "intro": [
          "A Python module is a file that contains a set of statements and definitions that you can use in your code.",
          "In this project, you'll learn how to import modules from the Python standard library. You'll also learn how to use Regular Expressions by building your own password generator program."
        ]
      },
      "learn-algorithm-design-by-building-a-shortest-path-algorithm": {
        "title": "Learn Algorithm Design by Building a Shortest Path Algorithm",
        "intro": [
          "Algorithms are step-by-step procedures that developers use to perform calculations and solve computational problems.",
          "In this project, you'll learn how to use functions, loops, conditional statements, and dictionary comprehensions to implement a Shortest Path algorithm."
        ]
      },
      "learn-recursion-by-solving-the-tower-of-hanoi-puzzle": {
        "title": "Learn Recursion by Solving the Tower of Hanoi Puzzle",
        "intro": [
          "Recursion is a programming approach that allows you to solve complicated computational problems with just a little code.",
          "In this project, you'll start with a loop-based approach to solving the tower of Hanoi mathematical puzzle. Then you'll learn how to implement a recursive solution."
        ]
      },
      "learn-data-structures-by-building-the-merge-sort-algorithm": {
        "title": "Learn Data Structures by Building the Merge Sort Algorithm",
        "intro": [
          "The Merge Sort Algorithm is a sorting algorithm based on the divide and conquer principle.",
          "In this project, you'll learn how to interact with data structures by sorting a list of random numbers using the Merge Sort Algorithm."
        ]
      },
      "learn-classes-and-objects-by-building-a-sudoku-solver": {
        "title": "Learn Classes and Objects by Building a Sudoku Solver",
        "intro": [
          "Classes and objects are important programming concepts. These Object-Oriented Programming tools help developers to achieve code modularity, abstraction, and readability. And they promote reusability.",
          "In this Sudoku Solver project, you'll learn how to use classes and objects to build a Sudoku grid and to solve a Sudoku puzzle."
        ]
      },
      "learn-tree-traversal-by-building-a-binary-search-tree": {
        "title": "Learn Tree Traversal by Building a Binary Search Tree",
        "intro": [
          "A Binary Search Tree (BST) is an common data structure where data is sorted hierarchically.",
          "In this project, you'll learn how to construct your own BST and perform an in-order traversal. You'll also learn key operations like insertion, search, and deletion."
        ]
      },
      "learn-lambda-functions-by-building-an-expense-tracker": {
        "title": "Learn Lambda Functions by Building an Expense Tracker",
        "intro": [
          "Lambda functions give you a concise way to write small, throwaway functions in your code.",
          "In this project, you'll explore the power of Lambda Functions by creating an expense tracker. Your resulting app will demonstrate how you can use Lambda Functions for efficient, streamlined operations."
        ]
      },
      "build-an-arithmetic-formatter-project": {
        "title": "Build an Arithmetic Formatter Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-time-calculator-project": {
        "title": "Build a Time Calculator Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-budget-app-project": {
        "title": "Build a Budget App Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-polygon-area-calculator-project": {
        "title": "Build a Polygon Area Calculator Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-probability-calculator-project": {
        "title": "Build a Probability Calculator Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "learn-interfaces-by-building-an-equation-solver": {
        "title": "Learn Interfaces by Building an Equation Solver",
        "intro": [
          "Abstract classes enable you to define formal interfaces - objects acting as blueprints for classes.",
          "In this project, you'll discover how to implement an interface in Python while building a simple equation solver program."
        ]
      },
      "learn-special-methods-by-building-a-vector-space": {
        "title": "Learn Special Methods by Building a Vector Space",
        "intro": [
          "Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.",
          "In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space."
        ]
      },
      "learn-encapsulation-by-building-a-projectile-trajectory-calculator": {
        "title": "Learn Encapsulation by Building a Projectile Trajectory Calculator",
        "intro": [
          "Encapsulation is a core OOP principle based on writing code that limits direct access to data.",
          "In this project, you'll discover new concepts related to encapsulation, such as getters, setters, and name mangling, and you'll use them together with what you already learned to create a program that calculates a projectile trajectory."
        ]
      },
      "learn-the-bisection-method-by-finding-the-square-root-of-a-number": {
        "title": "Learn the Bisection Method by Finding the Square Root of a Number",
        "intro": [
          "Numerical methods are used to approximate solutions to mathematical problems that are difficult or impossible to solve analytically.",
          "In this project, you will explore the numerical method of bisection to find the square root of a number by iteratively narrowing down the possible range of values that contain the square root."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "تحليل البيانات باستخدام Python",
    "intro": [
      "كان تحليل البيانات موجوداً منذ وقت طويل. ولكن حتى قبل بضع سنوات، مارسه المطورون باستخدام أدوات مكلّفة ومغلقة المصدر مثل Tableau. لكن مؤخراً Python، SQL، والمكتبات المفتوحة الأخرى غيّرت تحليل البيانات للأبد.",
      "في شهادة تحليل البيانات مع Python، ستتعلم أساسيات تحليل البيانات باستخدام Python. بنهاية هذه الشهادة ، ستعرف كيف تقرأ البيانات من مصادر مثل CSVs و SQL، وكيفية استخدام المكتبات مثل Numpy، و Pandas، و Matplotlib، و Seaborn لمعالجة وتصوير البيانات."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "تحليل البيانات باستخدام Python",
        "intro": [
          "في مقاطع الفيديو الشاملة هذه، التي أنشأتها Santiago Basulto، سوف تتعلم عملية تحليل البيانات بأكملها. سوف تقوم بقراءة البيانات من مصادر متعددة (CSV, SQL, Excel)، ومعالجة تلك البيانات باستخدام NumPy و Pandas، وتصوّرها باستخدام Matplotlib و Seaborn,",
          "بالإضافة إلى ذلك، قمنا بتضمين دورة Jupyter Notebook، ومرجع Python السريع لتحديث مهاراتك البرمجية."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "تعلم أساسيات مكتبة NumPy في دورة الفيديو التالية التي أنشأها Keith Galli.",
          "في هذه الدورة، ستتعلم كيف يعمل NumPy وكيف يقارن بقوائم Python المُدمجة. سوف تتعلم أيضاً كيفية كتابة الكود البرمجي باستخدام NumPy، الفهرسه indexing ، وإعادة التشكيل reshaping والإحصاءات التطبيقية وأكثر من ذلك بكثير."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "مشاريع تحليل البيانات باستخدام Python",
        "intro": [
          "هناك العديد من الطرق لتحليل البيانات باستخدام Python. بإكمال هذه المشاريع، ستثبت أن لديك معرفة أساسية جيدة لتحليل البيانات مع Python.",
          "قم بإنهائها جميعاً للمطالبة بشهادة تحليل البيانات باستخدام Python."
        ]
      }
    }
  },
  "information-security": {
    "title": "أمن المعلومات",
    "intro": [
      "مع كل شيء نقوم به على الإنترنت، هناك كمية كبيرة من المعلومات الحساسة المعرضة للخطر: عناوين البريد الإلكتروني، كلمات المرور، أرقام الهواتف، وأكثر من ذلك بكثير.",
      "مع شهادة أمن المعلومات، ستبني تطبيق ويب آمن مع HelmetJS لتعلم أساسيات حماية معلومات الناس على الإنترنت.",
      "ستقوم أيضًا بإنشاء عميل TCP وماسح ضوئي Nmap ومنافذ port scanner في Python. سيساعدك هذا على تعلم أساسيات اختبار الاختراق penetration testing - وهو مكون مهم لأمن المعلومات الجيد."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "أمن المعلومات مع HelmetJS",
        "intro": [
          "تركز هذه الدورة البرمجية على HelmetJS، وهو نوع من البرامج الوسيطة middleware للتطبيقات القائمة على Express، التي تقوم تلقائياً بتعيين عناوين HTTP. وبهذه الطريقة يمكن أن تمنع المعلومات الحساسة من المرور عن غير قصد بين الخادم والعميل.",
          "سيساعدك إكمال الدورات أدناه على فهم كيفية حماية موقعك من السلوك الخبيث."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python لاختبار الاختراق",
        "intro": [
          "دورات الفيديو هذه تعلمكم اختبار الاختراق مع Python. مما ييعرف ايضا باسم pen test وهو هجوم محاكي ضد نظام للتحقق من مواطن الضعف.",
          "في هذه الدورة، سوف تتعلم عن sockets، إنشاء خادم TCP والعميل client، بناء ماسح ضوئي لخريطة Nmap، وأدوات وتقنيات أخرى يستخدمها مختبرو الاختراق يوميا."
        ]
      },
      "information-security-projects": {
        "title": "مشاريع أمن المعلومات",
        "intro": [
          "الآن حان الوقت لتشغيل مهاراتك الجديدة في أمن المعلومات. هذه المشاريع ستمنحك فرصة لتطبيق المهارات والمبادئ والمفاهيم التي تعلمتها.",
          "عندما تنتهي، سيكون لديك الكثير من مشاريع أمن المعلومات في حاففظتك، بالإضافة إلى الشهادة التي بإمكانك تقديمها للأصدقاء والعائلة ولأرباب العمل."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "تعلم الآلة باستخدام Python",
    "intro": [
      "يحتوي تعلم الآله علي العديد من التطبيقات العملية التي بإمكانك استخدامها في مشاريعك أو في مكان العمل.",
      "في شهادة تعلم الآلة باستخدام Python، ستستخدم إطار Tensorflow لبناء عدة شبكات عصبية واستكشاف تقنيات أكثر تقدماً مثل معالجة اللغات الطبيعية والتعلّم المعزز.",
      "ستغوص أيضًا في الشبكات العصبية ، وتتعلم المبادئ الكامنة وراء كيفية عمل الشبكات العصبية العميقة والمتكررة والتلافيفية."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "TensorFlow",
        "intro": [
          "TensorFlow هو إطار مفتوح المصدر يجعل تعلم الآلة والشبكات العصبية أسهل استخداماً.",
          "تم إنشاء دورة الفيديو التالية بواسطة Tim Ruscica ، المعروف أيضًا باسم \"Tech With Tim\". سوف يساعدك على فهم TensorFlow وبعض إمكانياته القوية."
        ]
      },
      "how-neural-networks-work": {
        "title": "كيف تعمل الشبكات العصبية",
        "intro": [
          "الشبكات العصبية هي في صميم ما نسميه الذكاء الاصطناعي اليوم. لكن تاريخياً كان من الصعب فهمها. خاصة للمبتدئين في مجال تعلم الآلة.",
          "حتى لو كنت جديداً تماماً على الشبكات العصبية، دورات الفيديو هذه من قبل Brandon Rohrer سوف تجعلك مرتاحاً مع المفاهيم و الرياضيات الكامنة وراءها."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "مشاريع تعلم الآله باستخدام Python",
        "intro": [
          "تعلم الآله لديه العديد من التطبيقات العملية. بإكمال هذه المشاريع البرمجية المجانية و الصعبة، ستثبت أن لديك معرفة أساسية جيدة في تعلم الآله، وأنك مؤهل لشهادة تعلم الآله باستخدام Python."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "College Algebra with Python",
    "intro": [
      "This course is designed as a one-semester college course. It consists of instructional videos, with Google Colaboratory notebooks to follow along interactively, assignments, and challenging projects.",
      "As you go through each part of this course in sequence, you will gain a full understanding of Algebra and how to write Python code to solve Algebra problems.",
      "Throughout this course, you will also build your own Algebra Colab notebook that you will be able to use as your custom calculator. This course (and the code you write here) will give you the foundation for a deeper math and data science understanding."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Learn Ratios and Proportions",
        "intro": [
          "Your journey begins here as you learn how to set up a Colab Notebook that can run Python code. Then, use the notebook to follow along with the videos to learn ratios and proportions using Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Learn How to Solve for X",
        "intro": [
          "This unit will focus on how to solve for an unknown number (often referred to as \"x\") using written Algebra and Python code."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Learn Fractions and Decimals",
        "intro": [
          "This unit will focus on converting decimals to fractions and percents."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Learn Functions and Graphing",
        "intro": ["This unit will teach you about math functions."]
      },
      "learn-linear-functions": {
        "title": "Learn Linear Functions",
        "intro": [
          "This unit will show you how to develop linear equations from two points."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Learn Common Factors and Square Roots",
        "intro": [
          "In this unit, you will learn how to find common factors and divide them out. This will be useful when simplifying fractions and factoring square roots."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Multi-Function Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a multi-function calculator."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Learn How to Graph Systems of Equations",
        "intro": [
          "This unit will focus on graphing two equations on the same coordinate plane, so that you can see where the lines intersect."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Learn How to Solve Systems of Equations",
        "intro": [
          "In this unit, you will learn how to solve a system of two equations (with two variables) without graphing. You will see how you can factor an equation and solve for a certain variable in Python. By the end of this unit, you will be able to solve and graph the system with one block of code."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Learn Applications of Linear Systems",
        "intro": [
          "In this unit, you will see how you can use the algebra you learned so far to solve real world problems."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Learn Quadratic Equations",
        "intro": [
          "This unit will go beyond linear equations, to work with exponents and graph parabolas. You will learn how to find key points in parabolas and how to solve quadratic equations."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Graphing Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a graphing calculator."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Learn Parent Graphs and Polynomials",
        "intro": [
          "This unit will show you many different types of \"parent\" graphs, the basic patterns that make up more complicated graphs. Polynomials are mathematical expressions with \"multiple things\" - the more complicated equations that are built with basic patterns. You will see what these graphs look like, how to modify them, and how to do this all with Python code."
        ]
      },
      "build-three-math-games-project": {
        "title": "Three Math Games",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build three math games."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Learn Business Applications of College Algebra",
        "intro": [
          "This unit will show you how to apply your solving and graphing skills to find cost, revenue, and profit. You will write code to develop a demand function from two points. You will see how price affects the profit graph and how all of these equations relate to each other."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Learn Simple and Compound Interest",
        "intro": [
          "This unit will show you how to calculate interest, loan payments, and the estimated value of investments. You will see the math formula and turn that into code. Because these formulas tend to get complicated, you will appreciate having the code where you can just modify a few values."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Learn Exponents and Logarithms",
        "intro": [
          "This unit will show you how exponents and logarithms are inverse functions, and how you can use these functions in various applications."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Financial Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a financial calculator."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "College Algebra with Python: Conclusion",
        "intro": [
          "This will be the last unit in this course. Let's look at how you can connect your Math and Python knowledge with external data."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Data Graph Explorer",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a data graph explorer."
        ]
      }
    }
  },
  "python-for-everybody": {
    "title": "Legacy Python for Everybody",
    "intro": [
      "Python is one of the most popular, flexible programming languages today. You can use it for everything from basic scripting to machine learning."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python for Everybody",
        "intro": [
          "Python for everybody is a free video course series that teaches the basics of using Python 3.",
          "The courses were created by Dr. Charles Severance (also known as Dr. Chuck). He is a Clinical Professor at the University of Michigan School of Information, where he teaches various technology-oriented courses including programming, database design, and web development."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "الإعداد لمقابلة عمل في البرمجة",
    "intro": [
      "إذا كنت تبحث عن تمارين برمجية مجانية للتحضير لمقابلة وظيفتك القادمة، فقد قمنا بتغطية بعض التمارين من أجلك.",
      "يحتوي هذا القسم على المئات من تحديات البرمجة التي تختبر معرفتك بالخوارزميات وهياكل البيانات والرياضيات. كما أنه يحتوي على عدد من المشاريع التي يمكن استخدامها لتعزيز مهاراتك أو إضافتها إلى محفظتك."
    ],
    "note": "The Project Euler Project and Rosetta Code have been moved to their own courses. Go back to the curriculum to see the list of courses we offer.",
    "blocks": {
      "algorithms": {
        "title": "الخوارزميات",
        "intro": [
          "هذه التمارين البرمجية المجانية سوف تعلمك عن بعض الخوارزميات الشائعة التي يحتمل أن تواجهها في الحياة الحقيقية. إنها فرصة عظيمة لتحسين منطقك ومهاراتك البرمجية.",
          "وكثيرا ما تستخدم هذه الخوارزميات في المقابلات المتعلقة بالعمل لاختبار مهارات المرشح. سنعطيك تفسيرات واضحة وموجزة لكيفية عمل هذه الخوارزميات المختلفة حتى تتمكن من تنفيذ حل لكل خوارزمية."
        ]
      },
      "data-structures": {
        "title": "هياكل البيانات",
        "intro": [
          "الغرض من دورات البرمجة المجانية هذه هو مساعدتك في التعامل مع هياكل البيانات الكبيرة والمعقدة التي قد لا تكون على معرفةً بها بعد.",
          "من خلال العمل من خلال الدورات أدناه ، ستتعرف على كل نوع من أنواع هياكل البيانات وتنفيذ الخوارزميات لتعزيز فهمك لها."
        ]
      },
      "take-home-projects": {
        "title": "مشاريع لتفيذها بالمنزل",
        "intro": [
          "لطالما كانت مقابلات العمل مرهقة. يُمنح المتقدمون للوظيفة أحيانًا مشروعًا يأخذونه إلى المنزل ليتم إكماله خارج المقابلة. عادةً ما تتطلب هذه الأنواع من المقابلات الكثير من العمل ، لكنها طريقة رائعة لأصحاب العمل لمعرفة كيفية أدائك في الوظيفة.",
          "قم يبناء مشاريع البرمجة الإضافية أدناه للحصول على تدريب إضافي. خذ وقتك، اجعلها عظيمة، وضعها على cv أو حافظتك للحصول على عرض من أرباب العمل المحتملين."
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "The Odin Project - freeCodeCamp Remix (Beta)",
    "intro": [
      "The Odin Project was created in 2013 by a lone developer, Erik Trautman. Over the years, an open source community has sprung up to maintain and expand the project.",
      "freeCodeCamp has expanded upon the open source curriculum to make it run interactively in the browser, with tests to evaluate your code and ensure you've understood key concepts.",
      "If you want the original experience of configuring all of The Odin Project to run on your local computer, you can check out the original Odin Project on <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>The Odin Project website</a>. A huge thanks to The Odin Project community for continuing to maintain this valuable learning resource for developers all around the world.",
      "This course is unofficial, and not endorsed by The Odin Project. Changes to The Odin Project curriculum content have been made, and all instructional material for this course is licenced under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; The Odin Project</a>",
      "This course includes content from <a href='javascript.info'>JavaScript.info</a>, which is licenced under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>"
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Learn HTML Foundations",
        "intro": [
          "Get a solid grasp of HTML essentials with this course. From structuring web pages to understanding semantic tags, you'll build a strong foundation for creating well-organized and accessible content on the web."
        ]
      },
      "top-working-with-text": {
        "title": "Working with Text",
        "intro": [
          "Explore the intricacies of working with text in web development. Learn about text formatting, manipulation, and presentation to enhance your skills in creating web content."
        ]
      },
      "top-links-and-images": {
        "title": "Links and Images",
        "intro": [
          "Learn how to incorporate links and images into your web projects. This course covers the fundamentals of creating links and embedding images to make your websites more interactive and visually appealing."
        ]
      },
      "top-build-a-recipe-project": {
        "title": "Learn HTML Foundations by Building a Recipe Page",
        "intro": [
          "Put your HTML skills into practice by building a recipe page. This hands-on project allows you to apply your knowledge and create a functional web page while reinforcing key concepts of HTML development."
        ]
      },
      "top-learn-css-foundations": {
        "title": "Learn CSS Foundations",
        "intro": [
          "Dive into the world of Cascading Style Sheets (CSS) and learn how to style your HTML elements. Explore styling properties, selectors, and layouts to bring your web pages to life."
        ]
      },
      "top-learn-css-foundations-projects": {
        "title": "Learn CSS Foundations Projects",
        "intro": [
          "Take your CSS skills to the next level by working on practical projects. This course provides hands-on experience in applying CSS to create responsive designs for real-world scenarios."
        ]
      },
      "top-learn-css-specificity": {
        "title": "Learn CSS Specificity",
        "intro": [
          "Learn CSS specificity and gain a better understanding of how styles are applied to HTML elements. This course explores the nuances of CSS rules and helps you write efficient and targeted styles for your web pages."
        ]
      },
      "top-the-box-model": {
        "title": "Learn the Box Model",
        "intro": [
          "Learn the CSS box model with this course. Understand how elements are rendered on the web, and learn to manipulate spacing, borders, and padding to achieve your desired layout and design."
        ]
      },
      "top-introduction-to-flexbox": {
        "title": "Introduction to Flexbox",
        "intro": [
          "Discover the power of Flexbox, a layout model that simplifies the design of flexible and responsive web layouts. Learn how to create dynamic and adaptive page structures with ease."
        ]
      },
      "top-learn-block-and-inline": {
        "title": "Learn the difference between Block and Inline",
        "intro": [
          "Explore the distinctions between block and inline elements in HTML and CSS. This course provides insights into how these display types affect layout and behavior, empowering you to make informed design decisions."
        ]
      },
      "top-learn-variables-and-operators": {
        "title": "Learn Variables and Operators",
        "intro": [
          "Get started with JavaScript by learning about variables and operators. This course covers the fundamentals of JavaScript programming, including data types, operators, and variable declarations."
        ]
      },
      "top-learn-data-types-and-conditionals": {
        "title": "Learn Data Types and Conditionals",
        "intro": ["Learn about data types and conditionals in JavaScript."]
      },
      "top-learn-function-basics": {
        "title": "Learn Function Basics",
        "intro": ["Learn about functions in JavaScript."]
      },
      "top-basic-function-projects": {
        "title": "Basic Function Projects",
        "intro": [
          "Put your JavaScript skills to the test by building basic functions."
        ]
      },
      "top-learn-arrays-and-loops": {
        "title": "Learn Arrays and Loops",
        "intro": ["Learn about arrays and loops in JavaScript."]
      },
      "top-learn-to-solve-problems-and-understand-errors": {
        "title": "Learn to Solve Problems and Understand Errors",
        "intro": [
          "Learn how to solve problems and understand errors in JavaScript."
        ]
      },
      "top-build-a-rock-paper-scissors-game": {
        "title": "Build a Rock Paper Scissor Game",
        "intro": [
          "Put your JavaScript skills to the test by building a Rock Paper Scissors game."
        ]
      }
    }
  },
  "project-euler": {
    "title": "Project Euler",
    "intro": [
      "Complete the programming challenges below, from the massive Project Euler archives. These will harden your algorithm and mathematics knowledge.",
      "These problems range in difficulty and, for many, the experience is inductive chain learning. That is, by solving one problem, it will expose you to a new concept that allows you to undertake a previously inaccessible problem. Can you finish them all?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Project Euler Problems 1 to 100",
        "intro": [
          "In this first set of challenges, you will use mathematical concepts like the Fibonacci sequence, prime number theory, and combinatorics to write efficient algorithms to solve these problems."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Project Euler Problems 101 to 200",
        "intro": [
          "In this set of challenges, you'll build upon the skills you learned in the first part of the course and use more advanced concepts like vector computation, Pascal's pyramid, and the RSA algorithm to solve these problems efficiently."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Project Euler Problems 201 to 300",
        "intro": [
          "In this set of challenges, you'll continue to build upon the skills you learned earlier and use concepts like the binomial theorem, Hamming numbers, and the Collatz sequence to further develop your math and problem solving skills."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Project Euler Problems 301 to 400",
        "intro": [
          "Here you will continue to flex your mathematical and algorithmic skills as you use concepts such as combinatorial game theory, bitwise operations, and Golomb's self-describing sequence to develop efficient solutions to these problems."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Project Euler Problems 401 to 480",
        "intro": [
          "In this final set of challenges, you will need draw upon everything you learned up to this point and use advanced concepts like unitary divisors, the Kaprekar routine, and much more to solve these complex problems."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "(New) Foundational C# with Microsoft",
    "intro": [
      "This course offers a comprehensive introduction to C# programming, covering its core concepts, syntax, and practical application in software development.",
      "Through hands-on exercises and projects, you will learn the fundamentals of C#, including variables, data types, control structures, and object-oriented programming principles.",
      "By the end of this course, you will have gained the practical skills and knowledge needed to confidently leverage C# for building applications."
    ],
    "note": "Each section below has a trophy associated with it that you must earn on the Microsoft Learn platform. After earning each trophy, you need to verify them on freeCodeCamp. Once you have done those, you can qualify for the certification exam.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Write Your First Code Using C#",
        "intro": [
          "Begin your journey by learning to write your first code using C#. Develop a strong foundation as you explore the fundamentals and syntax of the language, setting the stage for your programming adventures."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Create and Run Simple C# Console Applications",
        "intro": [
          "Master the art of creating and running simple C# console applications. Dive into the world of console-based programming, where you will gain hands-on experience executing your code and seeing it in action."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Add Logic to C# Console Applications",
        "intro": [
          "Unlock the power of logic in C# console applications. Learn how to add logic and decision-making capabilities to your code, enabling your applications to make dynamic choices and respond intelligently to different scenarios."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Work with Variable Data in C# Console Applications",
        "intro": [
          "Discover the versatility of variable data in C# console applications. Harness the ability to store and manipulate different types of data, such as numbers and text, as you delve into the essential concepts of variables and data handling."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Create Methods in C# Console Applications",
        "intro": [
          "Take your C# console applications to the next level by mastering the art of creating methods. Learn how to organize and modularize your code, making it more manageable, reusable, and efficient."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Debug C# Console Applications",
        "intro": [
          "Sharpen your troubleshooting skills as you dive into the world of debugging C# console applications. Gain the ability to identify and fix issues in your code, ensuring your applications run smoothly and deliver the desired results."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Foundational C# with Microsoft Certification Exam",
        "intro": [
          "Use what you've learned to pass the exam to earn your Foundational C# with Microsoft Certification"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Upcoming Python",
    "intro": ["placeholder"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Learn Python by Building a Blackjack Game",
        "intro": ["Learn Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Upcoming Python Project",
        "intro": ["placeholder"]
      }
    }
  },
  "a2-english-for-developers": {
    "title": "A2 English for Developers (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": [
      "In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the A2 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.",
      "The first half of the curriculum will help you get comfortable with English grammar and usage. It will give you tons of hands-on practice. You'll learn basics like introducing yourself, making small talk, and discussing your work.",
      "In the second half, you'll practice vocabulary specific to software development. You'll learn how to describe code, discuss tech trends, and participate in stand-up meetings.",
      "This entire A2-level curriculum includes 105 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting."
    ],
    "blocks": {
      "learn-greetings-in-your-first-day-at-the-office": {
        "title": "Learn Greetings in your First Day at the Office",
        "intro": [
          "In this first course, you'll learn common expressions for situations you may encounter on your first day at work. You'll learn about introductions, getting to know people, asking for lunch recommendations, and getting an access card from security."
        ]
      },
      "learn-introductions-in-an-online-team-meeting": {
        "title": "Learn Introductions in an Online Team Meeting",
        "intro": [
          "In this course, you'll learn how to give a personal introduction. You'll also learn how to state your profession, and share your goals in group meetings."
        ]
      },
      "learn-conversation-starters-in-the-break-room": {
        "title": "Learn Conversation Starters in the Break Room",
        "intro": [
          "In this course, you'll learn how to start a conversation in casual settings. You'll also learn how to talk about your hobbies and personality traits. You'll even learn how to ask about places around the town."
        ]
      },
      "learn-how-to-talk-about-a-typical-workday-and-tasks": {
        "title": "Learn How to Talk About a Typical Workday and Tasks",
        "intro": [
          "In this course, you'll learn how to talk about your workday and the tasks that you perform in the workplace and how to share them with others. It mainly focuses on the structures used for describing your activities and task-related vocabulary."
        ]
      },
      "learn-how-to-discuss-your-morning-or-evening-routine": {
        "title": "Learn How to Discuss Your Morning or Evening Routine",
        "intro": [
          "In this course, you'll learn how to talk about details of your routine and share them with someone else. It mainly focuses on the structures used for declaring routine actions and related vocabulary."
        ]
      },
      "learn-how-to-describe-your-current-project": {
        "title": "Learn How to Describe Your Current Project",
        "intro": [
          "In this course, you'll learn how to talk about the projects that you are involved in and how to inform others of what you are doing in these projects. It mainly focuses on the structures used for informing it and on the related vocabulary."
        ]
      },
      "learn-how-to-ask-and-share-about-educational-and-professional-background": {
        "title": "Learn How to Ask and Share About Educational and Professional Background",
        "intro": [
          "In this course, you'll learn how to ask about another person's educational and professional backgrounds and you'll learn how to share information about your background as well."
        ]
      },
      "learn-how-to-talk-about-hobbies-and-interests": {
        "title": "Learn How to Talk About Hobbies and Interests",
        "intro": [
          "In this course, you'll learn different ways to talk about hobbies and things that interest you. You'll also learn how to ask about other people's hobbies and how to invite them to join you in these activities."
        ]
      },
      "learn-how-to-discuss-roles-and-responsibilies": {
        "title": "Learn How to Discuss Roles and Responsibilities",
        "intro": [
          "In this course, you'll discuss people's roles and responsibilities in a company and out of it. You'll discover how to ask about these roles and responsibilities and how to share information about you related to the topic."
        ]
      },
      "learn-how-to-have-a-conversation-about-preferences-and-motivations": {
        "title": "Learn How to Have a Conversation About Preferences and Motivations",
        "intro": [
          "In this course, you'll learn how to ask about what motivates people in their personal and professional lives, answer questions related to your motivations, and discuss about people's preferences."
        ]
      },
      "learn-how-to-discuss-popular-trends-in-technology": {
        "title": "Learn How to Discuss Popular Trends in Technology",
        "intro": [
          "In this course, you'll learn how to discuss about things that everybody's talking about in technology these days."
        ]
      },
      "learn-how-to-clarify-information-in-different-interactions": {
        "title": "Learn How to Clarify Information in Different Interactions",
        "intro": [
          "In this course, you'll learn how to check to see if the information you had is correct and how to ask for clarification when something is not clear to you."
        ]
      },
      "learn-how-to-use-basic-programming-vocabulary-in-conversations": {
        "title": "Learn How to Use Basic Programming Vocabulary in Conversations",
        "intro": [
          "This course will present basic vocabulary related to programming. You'll learn how to ask questions related to basic programming concepts."
        ]
      },
      "learn-how-to-use-code-related-concepts-and-terms": {
        "title": "Learn How to Use Code-related Concepts and Terms",
        "intro": [
          "In this course, you will be introduced to terms related to coding and learn how to use them in conversation."
        ]
      },
      "learn-how-to-discuss-tech-trends-and-updates": {
        "title": "Learn How to Discuss Tech Trends and Updates",
        "intro": [
          "In this course, you will be introduced to some recent trends in the world of technology and learn how to discuss them in English."
        ]
      },
      "learn-how-to-help-a-coworker-troubleshoot-on-github": {
        "title": "Learn How to Help a Coworker Troubleshoot on GitHub",
        "intro": [
          "In this course, you will learn expression related to how to ask for help from a coworker as well as how to offer them some assistance."
        ]
      },
      "learn-how-to-share-your-progress-in-weekly-stand-up-meetings": {
        "title": "Learn How to Share Your Progress in Weekly Stand-up Meetings",
        "intro": [
          "This course will show you how to talk about your projects in terms of what you have already done and what you are currently doing in them."
        ]
      },
      "learn-how-to-ask-for-clarification-on-code-understanding": {
        "title": "Learn How to Ask for Clarification on Code Understanding",
        "intro": [
          "In this course, you will see how you can ask questions to clarify things which are not very clear to you in a code."
        ]
      },
      "learn-how-to-document-code-for-a-project": {
        "title": "Learn How to Document Code for a Project",
        "intro": [
          "This course will show you expressions related to what to do when documenting code."
        ]
      },
      "learn-how-to-read-and-understand-code-documentation": {
        "title": "Learn How to Read and Understand Code Documentation",
        "intro": [
          "This course will present more expressions related to code documentation and bring tips on how to understand it."
        ]
      },
      "learn-how-to-analyze-code-documentation": {
        "title": "Learn How to Analyze Code Documentation",
        "intro": [
          "In this course, you will see some ideas to help you to approach documentation and analyze it in simple terms."
        ]
      },
      "learn-how-to-share-progress-and-accomplishments": {
        "title": "Learn How to Share Progress and Accomplishments",
        "intro": [
          "In this course, you will learn how to share your progress with coworkers and tell about what successes you've had in your projects."
        ]
      },
      "learn-how-to-talk-about-updates-and-plans-for-tasks-and-projects": {
        "title": "Learn How to Talk about Updates and Plans for Tasks and Projects",
        "intro": [
          "This course will show you how to speak about the most recent advancements in your projects and about your plans."
        ]
      },
      "learn-how-to-express-agreement-or-disagreement": {
        "title": "Learn How to Express Agreement or Disagreement",
        "intro": [
          "This course will introduce how to say that you agree with what another person says and to tell them politely that you do not agree with them."
        ]
      },
      "learn-how-to-offer-technical-support-and-guidance": {
        "title": "Learn How to Offer Technical Support and Guidance",
        "intro": [
          "In this course, you will see ways of offering some help in terms of technical specifics to another person."
        ]
      },
      "learn-how-to-request-and-receive-guidance": {
        "title": "Learn How to Request and Receive Guidance",
        "intro": [
          "This course will show you how to ask for assistance from a coworker when you need it."
        ]
      },
      "learn-how-to-provide-explanations-when-helping-others": {
        "title": "Learn How to Provide Explanations When Helping Others",
        "intro": [
          "This course will provide you with ways to explain things to other people while assisting them."
        ]
      }
    }
  },
  "b1-english-for-developers": {
    "title": "B1 English for Developers (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"],
    "blocks": {
      "learn-how-to-describe-places-and-events": {
        "title": "Learn How to Describe Places and Events",
        "intro": [""]
      },
      "learn-how-to-talk-about-past-experiences": {
        "title": "Learn How to Talk About Past Experiences",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-past-activities": {
        "title": "Learn How to Talk About Past Activities",
        "intro": ["", ""]
      },
      "learn-present-perfect-while-talking-about-accessibility": {
        "title": "Learn Present Perfect while Talking About Accessibility",
        "intro": ["", ""]
      },
      "learn-how-to-plan-future-events": {
        "title": "Learn How to Plan Future Events",
        "intro": ["", ""]
      },
      "learn-future-continuous-while-describing-actions": {
        "title": "Learn Future Continuous while Describing Actions",
        "intro": ["", ""]
      },
      "learn-how-to-use-conditionals": {
        "title": "Learn How to Use Conditionals",
        "intro": ["", ""]
      },
      "learn-how-to-share-feedback": {
        "title": "Learn How to Share Feedback",
        "intro": ["", ""]
      },
      "learn-how-to-share-your-opinion": {
        "title": "Learn How to Share Your Opinion",
        "intro": ["", ""]
      },
      "learn-how-to-express-agreement": {
        "title": "Learn How to Express Agreement",
        "intro": ["", ""]
      },
      "learn-how-to-express-disagreement": {
        "title": "Learn How to Express Disagreement",
        "intro": ["", ""]
      },
      "learn-how-to-express-concerns": {
        "title": "Learn How to Express Concerns",
        "intro": ["", ""]
      },
      "learn-how-to-express-decisions-based-on-comparisons": {
        "title": "Learn How to Express Decisions Based on Comparisons",
        "intro": ["", ""]
      },
      "learn-how-to-use-modal-verbs": {
        "title": "Learn How to Use Modal Verbs",
        "intro": ["", ""]
      },
      "learn-how-to-manage-a-conversation": {
        "title": "Learn How to Manage a Conversation",
        "intro": ["", ""]
      },
      "learn-how-to-clarify-misunderstandings": {
        "title": "Learn How to Clarify Misunderstandings",
        "intro": ["", ""]
      },
      "learn-about-speculation-and-requests": {
        "title": "Learn About Speculation and Requests",
        "intro": ["", ""]
      },
      "learn-about-adverbial-phrases": {
        "title": "Learn About Adverbial Phrases",
        "intro": ["", ""]
      },
      "learn-how-to-use-adjectives-in-conversations": {
        "title": "Learn How to Use Adjectives in Conversations",
        "intro": ["", ""]
      },
      "learn-determiners-and-advanced-use-of-articles": {
        "title": "Learn Determiners and Advanced Use of Articles",
        "intro": ["", ""]
      },
      "learn-how-to-use-reported-speech": {
        "title": "Learn How to Use Reported Speech",
        "intro": ["", ""]
      },
      "learn-how-to-use-prepositions-according-to-context": {
        "title": "Learn How to Use Prepositions According to Context",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-numbers-with-a-coworker": {
        "title": "Learn How to Talk About Numbers with a Coworker",
        "intro": ["", ""]
      },
      "learn-common-phrasal-verbs-and-idioms": {
        "title": "Learn Common Phrasal Verbs and Idioms",
        "intro": ["", ""]
      }
    }
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Level up your creative problem solving skills with these free programming tasks from the classic Rosetta Code library.",
      "These challenges can prove to be difficult, but they will push your algorithm logic to new heights.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Attribute: Rosetta Code</a>"
    ],
    "blocks": {
      "rosetta-code-challenges": {
        "title": "Rosetta Code Challenges",
        "intro": ["These are the challenges for Rosetta Code."]
      }
    }
  },
  "front-end-development": {
    "title": "Front End Development",
    "intro": ["placeholder"],
    "blocks": {
      "efpl": {
        "title": "0",
        "intro": []
      },
      "xpmy": {
        "title": "1",
        "intro": []
      },
      "workshop-cat-photo-app": {
        "title": "Build a Cat Photo App",
        "intro": [
          "HTML stands for HyperText Markup Language and it represents the content and structure of a web page.",
          "In this workshop, you will learn how to work with basic HTML elements such as headings, paragraphs, images, links, and lists."
        ]
      },
      "lab-recipe-page": {
        "title": "Build a Recipe Page",
        "intro": [
          "For this lab, you will create a web page of your favorite recipe."
        ]
      },
      "gwyd": {
        "title": "4",
        "intro": []
      },
      "lab-travel-agency-page": {
        "title": "Build a Travel Agency Page",
        "intro": [
          "For this lab, you will create a web page of a travel agency."
        ]
      },
      "vipr": {
        "title": "6",
        "intro": []
      },
      "lab-video-compilation-page": {
        "title": "Build a Video Compilation Page",
        "intro": ["For this lab, you will create a video compilation web page."]
      },
      "bzfv": {
        "title": "8",
        "intro": []
      },
      "snuv": {
        "title": "9",
        "intro": []
      },
      "quiz-basic-html": {
        "title": "Basic HTML Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic HTML knowledge."
        ]
      },
      "evdc": {
        "title": "11",
        "intro": []
      },
      "workshop-blog-page": {
        "title": "Build a Cat Blog Page",
        "intro": [
          "In this workshop, you will learn how to build an HTML only blog page using semantic elements including the <code>main</code>, <code>nav</code>, <code>article</code> and <code>footer</code> elements."
        ]
      },
      "lab-event-hub": {
        "title": "Build an Event Hub",
        "intro": [
          "In this lab, you will build an event hub using semantic HTML."
        ]
      },
      "ijdq": {
        "title": "14",
        "intro": []
      },
      "quiz-semantic-html": {
        "title": "Semantic HTML Quiz",
        "intro": [
          "Test what you've learned in this quiz of semantic HTML knowledge."
        ]
      },
      "cfgp": {
        "title": "16",
        "intro": []
      },
      "workshop-hotel-feedback-form": {
        "title": "Build a Hotel Feedback Form",
        "intro": [
          "In this workshop, you will learn how to work with forms by building a Hotel Feedback Form.",
          "You will learn how to work with labels, inputs, fieldsets, legends, textareas and buttons."
        ]
      },
      "lab-survey-form": {
        "title": "Build a Survey Form",
        "intro": ["For this lab, you will create a survey form."]
      },
      "wgot": {
        "title": "19",
        "intro": []
      },
      "workshop-final-exams-table": {
        "title": "Build a Final Exams Table",
        "intro": [
          "In this workshop, you will learn how to work with HTML tables by building a table of final exams."
        ]
      },
      "lab-book-catalog-table": {
        "title": "Build a Book Catalog Table",
        "intro": [
          "In this lab, you will create table filled with book information."
        ]
      },
      "rsve": {
        "title": "22",
        "intro": []
      },
      "xzam": {
        "title": "23",
        "intro": []
      },
      "quiz-html-tables-and-forms": {
        "title": "HTML Tables and Forms Quiz",
        "intro": [
          "Test what you've learned in this quiz of HTML tables and forms."
        ]
      },
      "ghoc": {
        "title": "25",
        "intro": []
      },
      "lab-checkout-page": {
        "title": "Build a Checkout Page",
        "intro": ["In this lab, you will create an accessible checkout page."]
      },
      "fqai": {
        "title": "27",
        "intro": []
      },
      "quiz-html-accessibility": {
        "title": "HTML Accessibility Quiz",
        "intro": [
          "Test what you've learned in this quiz of HTML accessibility knowledge."
        ]
      },
      "pspj": {
        "title": "29",
        "intro": []
      },
      "qpra": {
        "title": "30",
        "intro": []
      },
      "joim": {
        "title": "31",
        "intro": []
      },
      "gvtb": {
        "title": "32",
        "intro": []
      },
      "cqhu": {
        "title": "33",
        "intro": []
      },
      "tmdc": {
        "title": "34",
        "intro": []
      },
      "quiz-computer-basics": {
        "title": "Computer Basics Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic computer knowledge."
        ]
      },
      "dxpc": {
        "title": "36",
        "intro": []
      },
      "workshop-cafe-menu": {
        "title": "Design a Cafe Menu",
        "intro": [
          "CSS tells the browser how to display your webpage. You can use CSS to set the color, font, size, and other aspects of HTML elements.",
          "In this workshop, you'll learn CSS by designing a menu page for a cafe webpage."
        ]
      },
      "lab-business-card": {
        "title": "Design a Business Card",
        "intro": [
          "In this lab, you'll create a business card and style it using CSS."
        ]
      },
      "gnuk": {
        "title": "39",
        "intro": []
      },
      "zlfj": {
        "title": "40",
        "intro": []
      },
      "quiz-basic-css": {
        "title": "Basic CSS Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic CSS knowledge."
        ]
      },
      "sdul": {
        "title": "42",
        "intro": []
      },
      "lab-stylized-to-do-list": {
        "title": "Build a Stylized To-Do List",
        "intro": [
          "In this lab, you'll build a To-Do list and apply different styles to the links"
        ]
      },
      "humj": {
        "title": "44",
        "intro": []
      },
      "pahx": {
        "title": "45",
        "intro": []
      },
      "rzdx": {
        "title": "46",
        "intro": []
      },
      "quiz-css-backgrounds-and-borders": {
        "title": "CSS Backgrounds and Borders Quiz",
        "intro": [
          "Test what you've learned in this quiz of backgrounds and borders in CSS."
        ]
      },
      "ljmt": {
        "title": "48",
        "intro": []
      },
      "lxpk": {
        "title": "49",
        "intro": []
      },
      "lzqy": {
        "title": "50",
        "intro": []
      },
      "gvel": {
        "title": "51",
        "intro": []
      },
      "quiz-design-fundamentals": {
        "title": "Design Fundamentals Quiz",
        "intro": [
          "Test what you've learned in this quiz of UI design fundamentals."
        ]
      },
      "bgrw": {
        "title": "53",
        "intro": []
      },
      "sbnz": {
        "title": "54",
        "intro": []
      },
      "lab-event-flyer-page": {
        "title": "Build an Event Flyer Page",
        "intro": [
          "In this lab, you will use absolute and relative CSS units to create an event flyer page."
        ]
      },
      "ywfm": {
        "title": "56",
        "intro": []
      },
      "quiz-css-relative-and-absolute-units": {
        "title": "CSS Relative and Absolute Units Quiz",
        "intro": [
          "Test what you've learned in this quiz of relative and absolute units in CSS."
        ]
      },
      "ohhu": {
        "title": "58",
        "intro": []
      },
      "syga": {
        "title": "59",
        "intro": []
      },
      "sdym": {
        "title": "60",
        "intro": []
      },
      "ivpx": {
        "title": "61",
        "intro": []
      },
      "quiz-css-pseudo-classes": {
        "title": "CSS Pseudo-classes Quiz",
        "intro": [
          "Test what you've learned in this quiz of pseudo-classes in CSS."
        ]
      },
      "fvcj": {
        "title": "63",
        "intro": []
      },
      "ogdb": {
        "title": "64",
        "intro": []
      },
      "zxiy": {
        "title": "65",
        "intro": []
      },
      "qpze": {
        "title": "66",
        "intro": []
      },
      "quiz-css-colors": {
        "title": "CSS Colors Quiz",
        "intro": [
          "Test what you've learned in this quiz of using colors in CSS."
        ]
      },
      "jnqt": {
        "title": "68",
        "intro": []
      },
      "vkei": {
        "title": "69",
        "intro": []
      },
      "lab-contact-form": {
        "title": "Design a Contact Form",
        "intro": [
          "In this lab, you will design a contact form in HTML and style it using CSS."
        ]
      },
      "ipmw": {
        "title": "71",
        "intro": []
      },
      "quiz-styling-forms": {
        "title": "Styling Forms Quiz",
        "intro": [
          "Test what you've learned in this quiz of how to style forms using CSS."
        ]
      },
      "qzcx": {
        "title": "73",
        "intro": []
      },
      "wozq": {
        "title": "74",
        "intro": []
      },
      "lab-confidential-email-page": {
        "title": "Build a Confidential Email Page",
        "intro": [
          "For this lab, you will create a web page of a confidential email using HTML and CSS."
        ]
      },
      "zter": {
        "title": "76",
        "intro": []
      },
      "quiz-css-layout-and-effects": {
        "title": "CSS Layout and Effects Quiz",
        "intro": [
          "Test what you've learned in this quiz of the box model, transforms, filters, and overflow in CSS."
        ]
      },
      "tcwi": {
        "title": "78",
        "intro": []
      },
      "uptf": {
        "title": "79",
        "intro": []
      },
      "lab-page-of-playing-cards": {
        "title": "Build a Page of Playing Cards",
        "intro": [
          "For this lab, you will use flexbox to create a webpage of playing cards."
        ]
      },
      "kqao": {
        "title": "81",
        "intro": []
      },
      "quiz-css-flexbox": {
        "title": "CSS Flexbox Quiz",
        "intro": [
          "Test what you've learned in this quiz of using flexbox in CSS."
        ]
      },
      "vqut": {
        "title": "83",
        "intro": []
      },
      "ujcf": {
        "title": "84",
        "intro": []
      },
      "lab-newspaper-article": {
        "title": "Build a Newspaper Article",
        "intro": [
          "In this lab, you will build a newspaper article page using HTML and CSS."
        ]
      },
      "hbme": {
        "title": "86",
        "intro": []
      },
      "quiz-css-typography": {
        "title": "CSS Typography Quiz",
        "intro": ["Test what you've learned in this quiz of typography in CSS."]
      },
      "dyvj": {
        "title": "88",
        "intro": []
      },
      "rjsv": {
        "title": "89",
        "intro": []
      },
      "lab-tribute-page": {
        "title": "Build a Tribute Page",
        "intro": [
          "For this lab, you will build a tribute page for a subject of your choosing, fictional or real."
        ]
      },
      "fnde": {
        "title": "91",
        "intro": []
      },
      "quiz-css-accessibility": {
        "title": "CSS Accessibility Quiz",
        "intro": [
          "Test what you've learned in this quiz of making your webpage accessible with CSS."
        ]
      },
      "swpl": {
        "title": "93",
        "intro": []
      },
      "hcje": {
        "title": "94",
        "intro": []
      },
      "lab-book-inventory-app": {
        "title": "Build a Book Inventory App",
        "intro": ["For this lab, you will create a book inventory app."]
      },
      "huyd": {
        "title": "96",
        "intro": []
      },
      "quiz-css-attribute-selectors": {
        "title": "CSS Attribute Selectors Quiz",
        "intro": [
          "Test what you've learned in this quiz of using attribute selectors in CSS."
        ]
      },
      "rxzk": {
        "title": "98",
        "intro": []
      },
      "xobh": {
        "title": "99",
        "intro": []
      },
      "lab-house-painting": {
        "title": "Build a House Painting",
        "intro": ["For this lab, you will build a house painting using CSS."]
      },
      "rrtt": {
        "title": "101",
        "intro": []
      },
      "quiz-css-positioning": {
        "title": "CSS Positioning Quiz",
        "intro": [
          "Test what you've learned in this quiz of how positioning works in CSS."
        ]
      },
      "xebj": {
        "title": "103",
        "intro": []
      },
      "jkdt": {
        "title": "104",
        "intro": []
      },
      "lab-technical-documentation-page": {
        "title": "Build a Technical Documentation Page",
        "intro": [
          "For this lab, you will build a technical documentation page to serve as instruction or reference for a topic."
        ]
      },
      "xcti": {
        "title": "106",
        "intro": []
      },
      "quiz-responsive-web-design": {
        "title": "Responsive Web Design Quiz",
        "intro": [
          "Test what you've learned in this quiz of making your webpage responsive."
        ]
      },
      "mtbl": {
        "title": "108",
        "intro": []
      },
      "vlov": {
        "title": "109",
        "intro": []
      },
      "lab-availability-table": {
        "title": "Build an Availability Table",
        "intro": ["For this lab, you will create an availability table."]
      },
      "sget": {
        "title": "111",
        "intro": []
      },
      "quiz-css-variables": {
        "title": "CSS Variables Quiz",
        "intro": [
          "Test what you've learned in this quiz of how using variables in CSS."
        ]
      },
      "agbl": {
        "title": "113",
        "intro": []
      },
      "ogko": {
        "title": "114",
        "intro": []
      },
      "harp": {
        "title": "115",
        "intro": []
      },
      "nsiq": {
        "title": "116",
        "intro": []
      },
      "lab-product-landing-page": {
        "title": "Build a Product Landing Page",
        "intro": [
          "For this project, you will build a product landing page to market a product of your choice."
        ]
      },
      "fdam": {
        "title": "118",
        "intro": []
      },
      "quiz-css-grid": {
        "title": "CSS Grid Quiz",
        "intro": ["Test what you've learned in this quiz of using grid in CSS."]
      },
      "dorc": {
        "title": "120",
        "intro": []
      },
      "adzu": {
        "title": "121",
        "intro": []
      },
      "lab-moon-orbit": {
        "title": "Build a Moon Orbit",
        "intro": [
          "For this lab, you will create an animation of the moon orbiting the earth."
        ]
      },
      "lugl": {
        "title": "123",
        "intro": []
      },
      "lab-personal-portfolio": {
        "title": "Build a Personal Portfolio",
        "intro": [
          "For this project, you will build your own personal portfolio page."
        ]
      },
      "lvqc": {
        "title": "125",
        "intro": []
      },
      "quiz-css-animations": {
        "title": "CSS Animations Quiz",
        "intro": [
          "Test what you've learned in this quiz of using animations in CSS."
        ]
      },
      "wvjx": {
        "title": "127",
        "intro": []
      },
      "uquz": {
        "title": "128",
        "intro": []
      },
      "kdgd": {
        "title": "129",
        "intro": []
      },
      "wryp": {
        "title": "130",
        "intro": []
      },
      "workshop-greeting-bot": {
        "title": "Build a Greeting Bot",
        "intro": [
          "For this workshop, you will learn how to work with JavaScript fundamentals by building a greeting bot.",
          "You will learn about variables, <code>let</code>, <code>const</code>, <code>console.log</code> and basic string usage."
        ]
      },
      "lab-javascript-trivia-bot": {
        "title": "Build a JavaScript Trivia Bot",
        "intro": [
          "In this lab, you will practice working with JavaScript variables and strings by building a trivia bot."
        ]
      },
      "dthi": {
        "title": "133",
        "intro": []
      },
      "yskn": {
        "title": "134",
        "intro": []
      },
      "quiz-javascript-variables-and-data-types": {
        "title": "JavaScript Variables and Data Types Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Variables and Data Types."
        ]
      },
      "hoec": {
        "title": "136",
        "intro": []
      },
      "workshop-teacher-chatbot": {
        "title": "Build a Teacher Chatbot",
        "intro": [
          "In this workshop, you will continue to learn more about JavaScript strings by building a chatbot.",
          "You will learn how to work with template literals, and the <code>indexOf</code> method."
        ]
      },
      "axgb": {
        "title": "138",
        "intro": []
      },
      "rwac": {
        "title": "139",
        "intro": []
      },
      "quiz-javascript-strings": {
        "title": "JavaScript Strings Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Strings."
        ]
      },
      "hxwa": {
        "title": "141",
        "intro": []
      },
      "workshop-mathbot": {
        "title": "Build a Mathbot",
        "intro": [
          "In this workshop, you will review how to work with the different Math object methods by building a Mathbot."
        ]
      },
      "lab-fortune-teller": {
        "title": "Build a Fortune Teller",
        "intro": [
          "In this lab, you will build a fortune teller by randomly selecting a fortune from the avaialble fortunes."
        ]
      },
      "wfyg": {
        "title": "144",
        "intro": []
      },
      "guqy": {
        "title": "145",
        "intro": []
      },
      "quiz-javascript-math": {
        "title": "JavaScript Math Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Math."]
      },
      "hafd": {
        "title": "147",
        "intro": []
      },
      "phko": {
        "title": "148",
        "intro": []
      },
      "quiz-javascript-comparisons-and-conditionals": {
        "title": "JavaScript Comparisons and Conditionals Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Comparisons and Conditionals."
        ]
      },
      "tsdq": {
        "title": "150",
        "intro": []
      },
      "workshop-calculator": {
        "title": "Build a Calculator",
        "intro": [
          "In this workshop, you will review working with functions by building a calculator."
        ]
      },
      "lab-email-masker": {
        "title": "Build an Email Masker",
        "intro": [
          "In this lab, you'll build an email masker that will take an email address and obscure it."
        ]
      },
      "lab-sentence-maker": {
        "title": "Build a Sentence Maker",
        "intro": [
          "In this lab, you will create different stories by assigning different words to different variables."
        ]
      },
      "workshop-loan-qualification-checker": {
        "title": "Build a Loan Qualification Checker",
        "intro": [
          "In this workshop, you will continue to learn how to work with conditionals by building a loan qualification checker app.",
          "You will learn more about <code>if</code> statements, and how to use comparison operators and multiple conditions in an <code>if</code> statement."
        ]
      },
      "lab-leap-year-calculator": {
        "title": "Build a Leap Year Calculator ",
        "intro": [
          "In this lab you will use conditional statements and loops to determine if a year is a leap year."
        ]
      },
      "pljo": {
        "title": "156",
        "intro": []
      },
      "quiz-javascript-functions": {
        "title": "JavaScript Functions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Functions."
        ]
      },
      "mexq": {
        "title": "158",
        "intro": []
      },
      "ifgn": {
        "title": "159",
        "intro": []
      },
      "workshop-shopping-list": {
        "title": "Build a Shopping List",
        "intro": [
          "In this workshop, you will practice working with arrays by building a shopping list.",
          "You will review how to add and remove elements from an array using methods like <code>push</code>, <code>pop</code>, <code>shift</code>, and <code>unshift</code>."
        ]
      },
      "lab-lunch-picker-program": {
        "title": "Build a Lunch Picker Program",
        "intro": [
          "In this lab, you will review working with arrays and random numbers by building a lunch picker program."
        ]
      },
      "mokm": {
        "title": "161",
        "intro": []
      },
      "froz": {
        "title": "162",
        "intro": []
      },
      "quiz-javascript-arrays": {
        "title": "JavaScript Arrays Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Arrays."]
      },
      "dvnt": {
        "title": "164",
        "intro": []
      },
      "ekdb": {
        "title": "165",
        "intro": []
      },
      "lab-quiz-game": {
        "title": "Build a Quiz Game",
        "intro": ["For this lab, you will build a quiz game."]
      },
      "lab-factorial-calculator": {
        "title": "Build a Factorial Calculator ",
        "intro": ["In this lab, you will build a factorial calculator."]
      },
      "quiz-javascript-objects": {
        "title": "JavaScript Objects Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Objects."
        ]
      },
      "kgtw": {
        "title": "169",
        "intro": []
      },
      "workshop-sentence-analyzer": {
        "title": "Build a Sentence Analyzer",
        "intro": [
          "In this workshop, you'll review working with JavaScript loops by building a sentence analyzer app."
        ]
      },
      "kcci": {
        "title": "171",
        "intro": []
      },
      "puhe": {
        "title": "172",
        "intro": []
      },
      "quiz-javascript-loops": {
        "title": "JavaScript Loops Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Loops."]
      },
      "hjtr": {
        "title": "174",
        "intro": []
      },
      "lab-pyramid-generator": {
        "title": "Build a Pyramid Generator",
        "intro": ["In this lab you will build a pyramid generator."]
      },
      "lab-gradebook-app": {
        "title": "Build a Gradebook App",
        "intro": ["For this lab, you will create a gradebook app."]
      },
      "epfc": {
        "title": "177",
        "intro": []
      },
      "lab-inventory-management-program": {
        "title": "Build an Inventory Management Program",
        "intro": [
          "For this lab, you will build an inventory management program using JavaScript."
        ]
      },
      "fbbn": {
        "title": "179",
        "intro": []
      },
      "lnmg": {
        "title": "180",
        "intro": []
      },
      "wead": {
        "title": "181",
        "intro": []
      },
      "quiz-javascript-fundamentals": {
        "title": "JavaScript Fundamentals Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Fundamentals Quiz."
        ]
      },
      "plic": {
        "title": "183",
        "intro": []
      },
      "vjmm": {
        "title": "184",
        "intro": []
      },
      "bxtv": {
        "title": "185",
        "intro": []
      },
      "xiqk": {
        "title": "186",
        "intro": []
      },
      "quiz-javascript-higher-order-functions": {
        "title": "JavaScript Higher Order Functions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Higher Order Functions."
        ]
      },
      "esfh": {
        "title": "188",
        "intro": []
      },
      "gibb": {
        "title": "189",
        "intro": []
      },
      "lab-favorite-icon-toggler": {
        "title": "Build a Favorite Icon Toggler",
        "intro": [
          "In this lab, you will build a favorite icon toggler by utilizing JavaScript click events."
        ]
      },
      "fhxc": {
        "title": "191",
        "intro": []
      },
      "quiz-dom-manipulation-and-click-event-with-javascript": {
        "title": "DOM Manipulation and Click Events with JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on DOM Manipulation and Click Events with JavaScript Quiz."
        ]
      },
      "ubpx": {
        "title": "193",
        "intro": []
      },
      "lbyi": {
        "title": "194",
        "intro": []
      },
      "lab-real-time-counter": {
        "title": "Build a Real Time Counter",
        "intro": ["In this lab, you will build a real-time character counter"]
      },
      "fmbk": {
        "title": "196",
        "intro": []
      },
      "lab-lightbox-viewer": {
        "title": "Build a Lightbox Viewer",
        "intro": [
          "In this lab, you will build a lighbox viewer for viewing images in a focused mode."
        ]
      },
      "workshop-rps-game": {
        "title": "Build a Rock, Paper, Scissors Game",
        "intro": [
          "In this workshop, you will review DOM manipulation and events by building a Rock, Paper, Scissors Game."
        ]
      },
      "lab-palindrome-checker": {
        "title": "Build a Palindrome Checker",
        "intro": [
          "For this lab, you'll build an application that checks whether a given word is a palindrome."
        ]
      },
      "lab-football-team-cards": {
        "title": "Build a Set of Football Team Cards",
        "intro": [
          "One common aspect of building web applications is processing datasets and outputting information to the screen. In this project, you will use DOM manipulation, object destructuring, event handling, and data filtering to build a set of football team cards."
        ]
      },
      "iejn": {
        "title": "201",
        "intro": []
      },
      "quiz-javascript-events": {
        "title": "JavaScript Events Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Events."]
      },
      "kaqq": {
        "title": "203",
        "intro": []
      },
      "lab-random-background-color-changer": {
        "title": "Debug a Random Background Color Changer",
        "intro": [
          "For this lab, you will debug a random background color changer and fix the errors to make it work properly."
        ]
      },
      "ksfc": {
        "title": "205",
        "intro": []
      },
      "quiz-debugging-javascript": {
        "title": "Debugging JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Debugging JavaScript."
        ]
      },
      "dqth": {
        "title": "207",
        "intro": []
      },
      "ilop": {
        "title": "208",
        "intro": []
      },
      "qrer": {
        "title": "209",
        "intro": []
      },
      "lab-regex-sandbox": {
        "title": "Build a RegEx Sandbox",
        "intro": ["In this lab you will build a regex sandbox."]
      },
      "svsl": {
        "title": "211",
        "intro": []
      },
      "quiz-javascript-regular-expressions": {
        "title": "JavaScript Regular Expressions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Regular Expressions."
        ]
      },
      "zalp": {
        "title": "213",
        "intro": []
      },
      "hhvp": {
        "title": "214",
        "intro": []
      },
      "egkv": {
        "title": "215",
        "intro": []
      },
      "qlvw": {
        "title": "216",
        "intro": []
      },
      "quiz-form-validation-with-javascript": {
        "title": "Form Validation with JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Form Validation with JavaScript."
        ]
      },
      "lupt": {
        "title": "218",
        "intro": []
      },
      "lab-date-conversion": {
        "title": "Build a Date Conversion Program",
        "intro": [
          "In this lab, you will build a program to convert a date from one format to another."
        ]
      },
      "xtfk": {
        "title": "220",
        "intro": []
      },
      "quiz-javascript-dates": {
        "title": "JavaScript Dates Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Dates."]
      },
      "lvts": {
        "title": "222",
        "intro": []
      },
      "foal": {
        "title": "223",
        "intro": []
      },
      "crzf": {
        "title": "224",
        "intro": []
      },
      "xofr": {
        "title": "225",
        "intro": []
      },
      "quiz-javascript-audio-and-video": {
        "title": "JavaScript Audio and Video Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Audio and Video."
        ]
      },
      "pehm": {
        "title": "227",
        "intro": []
      },
      "cvsw": {
        "title": "228",
        "intro": []
      },
      "lab-bookmark-manager-app": {
        "title": "Build a Bookmark Manager App",
        "intro": ["For this lab, you will build a bookmark manager app."]
      },
      "fgbp": {
        "title": "230",
        "intro": []
      },
      "quiz-local-storage-and-crud": {
        "title": "Local Storage and CRUD Quiz",
        "intro": [
          "Test what you've learned in this quiz on Local Storage and CRUD."
        ]
      },
      "jbst": {
        "title": "232",
        "intro": []
      },
      "peyf": {
        "title": "233",
        "intro": []
      },
      "bdqj": {
        "title": "234",
        "intro": []
      },
      "ndlf": {
        "title": "235",
        "intro": []
      },
      "quiz-recursion": {
        "title": "Recursion Quiz",
        "intro": ["Test what you've learned in this quiz on Recursion."]
      },
      "yshh": {
        "title": "237",
        "intro": []
      },
      "wyxz": {
        "title": "238",
        "intro": []
      },
      "lab-quicksort-algorithm": {
        "title": "Build the Quicksort Algorithm",
        "intro": [
          "For this lab, you will implement the Quicksort algorithm using JavaScript."
        ]
      },
      "dtfv": {
        "title": "240",
        "intro": []
      },
      "quiz-searching-and-sorting-algorithms": {
        "title": "Searching and Sorting Algorithms Quiz",
        "intro": [
          "Test what you've learned in this quiz on Searching and Sorting Algorithms."
        ]
      },
      "bnvw": {
        "title": "242",
        "intro": []
      },
      "xkhk": {
        "title": "243",
        "intro": []
      },
      "lab-roman-numeral-converter": {
        "title": "Build a Roman Numeral Converter",
        "intro": [
          "For this lab, you'll build an application that converts integers to Roman numerals."
        ]
      },
      "yaxm": {
        "title": "245",
        "intro": []
      },
      "lab-telephone-number-validator": {
        "title": "Build a Telephone Number Validator",
        "intro": [
          "For this lab, you'll build an application that checks if a number is a valid United States phone number."
        ]
      },
      "lab-cash-register": {
        "title": "Build a Cash Register",
        "intro": ["For this lab, you will build a cash register."]
      },
      "udia": {
        "title": "248",
        "intro": []
      },
      "quiz-javascript-problem-solving-and-algorithmic-thinking": {
        "title": "JavaScript Problem Solving and Algorithmic Thinking Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Problem Solving and Algorithmic Thinking."
        ]
      },
      "xayi": {
        "title": "250",
        "intro": []
      },
      "mjbe": {
        "title": "251",
        "intro": []
      },
      "byqx": {
        "title": "252",
        "intro": []
      },
      "alda": {
        "title": "253",
        "intro": []
      },
      "quiz-javascript-functional-programming": {
        "title": "JavaScript Functional Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Functional Programming."
        ]
      },
      "cvaf": {
        "title": "255",
        "intro": []
      },
      "tdgy": {
        "title": "256",
        "intro": []
      },
      "saxu": {
        "title": "257",
        "intro": []
      },
      "kagw": {
        "title": "258",
        "intro": []
      },
      "mbib": {
        "title": "259",
        "intro": []
      },
      "oxiv": {
        "title": "260",
        "intro": []
      },
      "quiz-javascript-object-oriented-programming": {
        "title": "JavaScript Object Oriented Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Object Oriented Programming."
        ]
      },
      "nixz": {
        "title": "262",
        "intro": []
      },
      "lab-stack-class": {
        "title": "Build a Stack Class",
        "intro": [
          "For this lab, you will build a stack class using JavaScript."
        ]
      },
      "lab-linked-list-class": {
        "title": "Build a Linked List Class",
        "intro": [
          "For this lab, you will build a linked list class using JavaScript."
        ]
      },
      "lab-hash-table-class": {
        "title": "Build a Hash Table Class",
        "intro": ["For this lab, you will build a hash table using JavaScript."]
      },
      "muyw": {
        "title": "266",
        "intro": []
      },
      "quiz-javascript-data-structures": {
        "title": "JavaScript Data Structures Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Data Structures."
        ]
      },
      "rmpy": {
        "title": "268",
        "intro": []
      },
      "lab-depth-first-search": {
        "title": "Implement the Depth-First Search Algorithm",
        "intro": [
          "For this lab, you will use JavaScript to implement the Depth-First Search algorithm."
        ]
      },
      "xdyh": {
        "title": "270",
        "intro": []
      },
      "quiz-graphs-and-trees": {
        "title": "Graphs and Trees Quiz",
        "intro": ["Test what you've learned in this quiz on Graphs and Trees."]
      },
      "vjgg": {
        "title": "272",
        "intro": []
      },
      "lab-nth-fibonacci-number-generator": {
        "title": "Build the nth Fibonacci number generator",
        "intro": [
          "For this lab, you will implement the nth Fibonacci number generator."
        ]
      },
      "kaui": {
        "title": "274",
        "intro": []
      },
      "quiz-dynamic-programming": {
        "title": "Dynamic Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on Dynamic Programming."
        ]
      },
      "sgau": {
        "title": "276",
        "intro": []
      },
      "clak": {
        "title": "277",
        "intro": []
      },
      "fcom": {
        "title": "278",
        "intro": []
      },
      "ffpt": {
        "title": "279",
        "intro": []
      },
      "lab-pokemon-search-app": {
        "title": "Build a Pokémon Search App",
        "intro": ["For this project, you will build a Pokémon search app."]
      },
      "vyzp": {
        "title": "281",
        "intro": []
      },
      "quiz-asynchronous-javascript": {
        "title": "Asynchronous JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Asynchronous JavaScript."
        ]
      },
      "icdr": {
        "title": "283",
        "intro": []
      },
      "zdsj": {
        "title": "284",
        "intro": []
      },
      "mzae": {
        "title": "285",
        "intro": []
      },
      "gjbf": {
        "title": "286",
        "intro": []
      },
      "mbpv": {
        "title": "287",
        "intro": []
      },
      "eeez": {
        "title": "288",
        "intro": []
      },
      "quiz-web-standards": {
        "title": "Web Standards Quiz",
        "intro": ["Test what you've learned in this quiz on Web Standards."]
      },
      "khuu": {
        "title": "290",
        "intro": []
      },
      "xdly": {
        "title": "291",
        "intro": []
      },
      "rhhl": {
        "title": "292",
        "intro": []
      },
      "trvf": {
        "title": "293",
        "intro": []
      },
      "kwmg": {
        "title": "294",
        "intro": []
      },
      "nodx": {
        "title": "295",
        "intro": []
      },
      "erfj": {
        "title": "296",
        "intro": []
      },
      "quiz-react-basics": {
        "title": "React Basics Quiz",
        "intro": ["Test what you've learned in this quiz on React Basics."]
      },
      "hfwi": {
        "title": "298",
        "intro": []
      },
      "rnwr": {
        "title": "299",
        "intro": []
      },
      "oeqv": {
        "title": "300",
        "intro": []
      },
      "rdzk": {
        "title": "301",
        "intro": []
      },
      "vtpz": {
        "title": "302",
        "intro": []
      },
      "dfwl": {
        "title": "303",
        "intro": []
      },
      "adzm": {
        "title": "304",
        "intro": []
      },
      "quiz-react-state-and-hooks": {
        "title": "React State and Hooks Quiz",
        "intro": [
          "Test what you've learned in this quiz on React State and Hooks."
        ]
      },
      "voks": {
        "title": "306",
        "intro": []
      },
      "uwum": {
        "title": "307",
        "intro": []
      },
      "ukem": {
        "title": "308",
        "intro": []
      },
      "sdjg": {
        "title": "309",
        "intro": []
      },
      "buzx": {
        "title": "310",
        "intro": []
      },
      "pexz": {
        "title": "311",
        "intro": []
      },
      "prlo": {
        "title": "312",
        "intro": []
      },
      "jsnd": {
        "title": "313",
        "intro": []
      },
      "quiz-advanced-react": {
        "title": "Advanced React Quiz",
        "intro": ["Test what you've learned in this quiz on Advanced React."]
      },
      "tkgg": {
        "title": "315",
        "intro": []
      },
      "coip": {
        "title": "316",
        "intro": []
      },
      "quiz-web-performance": {
        "title": "Web Performance Quiz",
        "intro": ["Test what you've learned in this quiz on Web Performance."]
      },
      "hzab": {
        "title": "318",
        "intro": []
      },
      "ggea": {
        "title": "319",
        "intro": []
      },
      "vgvz": {
        "title": "320",
        "intro": []
      },
      "jkfc": {
        "title": "321",
        "intro": []
      },
      "quiz-typescript": {
        "title": "TypeScript Quiz",
        "intro": ["Test what you've learned in this quiz on TypeScript."]
      },
      "zhhp": {
        "title": "323",
        "intro": []
      },
      "nwwd": {
        "title": "324",
        "intro": []
      },
      "quiz-css-libraries-and-frameworks": {
        "title": "CSS Libraries and Frameworks Quiz",
        "intro": [
          "Test what you've learned in this quiz on CSS Libraries and Frameworks."
        ]
      },
      "gora": {
        "title": "326",
        "intro": []
      },
      "vpkl": {
        "title": "327",
        "intro": []
      },
      "quiz-testing": {
        "title": "Testing Quiz",
        "intro": ["Test what you've learned in this quiz on Testing."]
      },
      "lzvx": {
        "title": "329",
        "intro": []
      },
      "mfwu": {
        "title": "330",
        "intro": []
      },
      "dfcd": {
        "title": "331",
        "intro": []
      },
      "workshop-bash-boilerplate": {
        "title": "Build a Boilerplate",
        "intro": [
          "The terminal allows you to send text commands to your computer that can manipulate the file system, run programs, automate tasks, and much more.",
          "In this 170-lesson workshop, you will learn terminal commands by creating a website boilerplate using only the command line."
        ]
      },
      "vfje": {
        "title": "333",
        "intro": []
      },
      "quiz-bash-commands": {
        "title": "Bash Commands Quiz",
        "intro": ["Test what you've learned in this quiz on Bash Commands."]
      },
      "thsj": {
        "title": "335",
        "intro": []
      },
      "workshop-mario-database": {
        "title": "Build a Mario Database",
        "intro": [
          "A relational database organizes data into tables that are linked together through relationships.",
          "In this 165-lesson workshop, you will learn the basics of a relational database by creating a PostgreSQL database filled with video game characters."
        ]
      },
      "lab-celestial-bodies-database": {
        "title": "Build a Celestial Bodies Database",
        "intro": [
          "For this project, you will build a database of celestial bodies using PostgreSQL."
        ]
      },
      "cvvu": {
        "title": "338",
        "intro": []
      },
      "quiz-relational-database": {
        "title": "Relational Database Quiz",
        "intro": [
          "Test what you've learned in this quiz on Relational Databases."
        ]
      },
      "ynqt": {
        "title": "340",
        "intro": []
      },
      "workshop-bash-five-programs": {
        "title": "Build Five Programs",
        "intro": [
          "Bash scripts combine terminal commands and logic into programs that can execute or automate tasks, and much more.",
          "In this 220-lesson workshop, you will learn more terminal commands and how to use them within Bash scripts by creating five small programs."
        ]
      },
      "hnta": {
        "title": "342",
        "intro": []
      },
      "quiz-bash-scripting": {
        "title": "Bash Scripting Quiz",
        "intro": ["Test what you've learned in this quiz on Bash Scripting."]
      },
      "pegc": {
        "title": "344",
        "intro": []
      },
      "workshop-sql-student-database-part-1": {
        "title": "Build a Student Database: Part 1",
        "intro": [
          "SQL, or Structured Query Language, is the language for communicating with a relational database.",
          "In this 140-lesson workshop, you will create a Bash script that uses SQL to enter information about your computer science students into PostgreSQL."
        ]
      },
      "workshop-sql-student-database-part-2": {
        "title": "Build a Student Database: Part 2",
        "intro": [
          "SQL join commands are used to combine information from multiple tables in a relational database",
          "In this 140-lesson workshop, you will complete your student database while diving deeper into SQL commands."
        ]
      },
      "lab-world-cup-database": {
        "title": "Build a World Cup Database",
        "intro": [
          "For this project, you will create a Bash script that enters information from World Cup games into PostgreSQL, then query the database for useful statistics."
        ]
      },
      "workshop-kitty-ipsum-translator": {
        "title": "Build a Kitty Ipsum Translator",
        "intro": [
          "There's more to Bash commands than you might think.",
          "In this 140-lesson workshop, you will learn some more complex commands, and the details of how commands work."
        ]
      },
      "workshop-bike-rental-shop": {
        "title": "Build a Bike Rental Shop",
        "intro": [
          "In this 210-lesson workshop, you will build an interactive Bash program that stores rental information for your bike rental shop using PostgreSQL."
        ]
      },
      "lab-salon-appointment-scheduler": {
        "title": "Build a Salon Appointment Scheduler",
        "intro": [
          "For this lab, you will create an interactive Bash program that uses PostgreSQL to track the customers and appointments for your salon."
        ]
      },
      "udfh": {
        "title": "351",
        "intro": []
      },
      "quiz-bash-and-sql": {
        "title": "Bash and SQL Quiz",
        "intro": ["Test what you've learned in this quiz on Bash and SQL."]
      },
      "movb": {
        "title": "353",
        "intro": []
      },
      "workshop-castle": {
        "title": "Build a Castle",
        "intro": [
          "Nano is a program that allows you to edit files right in the terminal.",
          "In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle."
        ]
      },
      "dzsr": {
        "title": "355",
        "intro": []
      },
      "quiz-nano": {
        "title": "Nano Quiz",
        "intro": ["Test what you've learned in this quiz on Nano."]
      },
      "pzmc": {
        "title": "357",
        "intro": []
      },
      "workshop-sql-reference-object": {
        "title": "Build an SQL Reference Object",
        "intro": [
          "Git is a version control system that keeps track of all the changes you make to your codebase.",
          "In this 240-lesson workshop, you will learn how Git keeps track of your code by creating an object containing commonly used SQL commands."
        ]
      },
      "lab-periodic-table-database": {
        "title": "Build a Periodic Table Database",
        "intro": [
          "For this lab, you will create a Bash script to get information about chemical elements from a periodic table database."
        ]
      },
      "lab-number-guessing-game": {
        "title": "Build a Number Guessing Game",
        "intro": [
          "For this lab, you will use Bash scripting, PostgreSQL, and Git to create a number guessing game that runs in the terminal and saves user information."
        ]
      },
      "nfoc": {
        "title": "361",
        "intro": []
      },
      "quiz-git": {
        "title": "Git Quiz",
        "intro": ["Test what you've learned in this quiz on Git."]
      },
      "ibmn": {
        "title": "363",
        "intro": []
      },
      "zpjj": {
        "title": "364",
        "intro": []
      },
      "ghfk": {
        "title": "365",
        "intro": []
      },
      "ugfq": {
        "title": "366",
        "intro": []
      },
      "quiz-security-and-privacy": {
        "title": "Security and Privacy Quiz",
        "intro": [
          "Test what you've learned in this quiz on Security and Privacy."
        ]
      },
      "qjov": {
        "title": "368",
        "intro": []
      },
      "workshop-npm-packages": {
        "title": "Managing Packages with npm",
        "intro": [
          "npm (Node Package Manager), is a command line tool to install, create, and share packages of JavaScript code written for Node.js. There are many open source packages available on npm, so before starting a project, take some time to explore so you don't end up recreating the wheel for things like working with dates or fetching data from an API.",
          "In this workshop, you'll learn the basics of using npm, including how to work with the <code>package.json</code> file and how to manage your installed dependencies."
        ]
      },
      "hjku": {
        "title": "370",
        "intro": []
      },
      "workshop-node-and-express": {
        "title": "Basic Node and Express",
        "intro": [
          "Node.js is a JavaScript runtime that allows developers to write backend (server-side) programs in JavaScript. Node.js comes with a handful of built-in modules — small, independent programs — that help with this. Some of the core modules include HTTP, which acts like a server, and File System, a module to read and modify files.",
          "In the last set of courses you learned to install and manage packages from npm, which are collections of smaller modules. These packages can help you build larger, more complex applications.",
          "Express is a lightweight web application framework, and is one of the most popular packages on npm. Express makes it much easier to create a server and handle routing for your application, which handles things like directing people to the correct page when they visit a certain endpoint like <pre>/blog</pre>.",
          "In this course, you'll learn the basics of Node and Express including how to create a server, serve different files, and handle different requests from the browser."
        ]
      },
      "lab-timestamp-microservice": {
        "title": "Build a Timestamp Microservice",
        "intro": ["In this lab you will build a timestamp microservice"]
      },
      "lab-request-header-parser-microservice": {
        "title": "Build a Request Header Parser Microservice",
        "intro": [
          "In this lab, you will build a request header parser microservice"
        ]
      },
      "lab-url-shortener-microservice": {
        "title": "Build a URL Shortener Microservice",
        "intro": ["In this lab, you will build a URL Shortener Microservice"]
      },
      "lab-exercise-tracker": {
        "title": "Build an Exercise Tracker",
        "intro": ["In this lab, you will build an exercise tracker"]
      },
      "lab-file-metadata-microservice": {
        "title": "Build a File Metadata Microservice",
        "intro": ["For this lab you will build a file metadata microservice"]
      },
      "kegi": {
        "title": "377",
        "intro": []
      },
      "quiz-backend-javascript": {
        "title": "Backend JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Backend JavaScript."
        ]
      },
      "vnfu": {
        "title": "379",
        "intro": []
      },
      "rlli": {
        "title": "380",
        "intro": []
      },
      "rjpv": {
        "title": "381",
        "intro": []
      },
      "xbri": {
        "title": "382",
        "intro": []
      },
      "quiz-tooling-and-deployment": {
        "title": "Tooling and Deployment Quiz",
        "intro": [
          "Test what you've learned in this quiz of tooling and deployment"
        ]
      },
      "nkjt": {
        "title": "384",
        "intro": []
      },
      "pgjj": {
        "title": "385",
        "intro": []
      },
      "exom": {
        "title": "386",
        "intro": []
      },
      "bvqc": {
        "title": "387",
        "intro": []
      },
      "xish": {
        "title": "388",
        "intro": []
      },
      "front-end-development-certification-exam": {
        "title": "Front End Development Certification Exam",
        "intro": ["", ""]
      }
    }
  },
  "misc-text": {
    "certification": "شهادة {{cert}}",
    "browse-other": "تصفح الشهادات المجانية الأخرى\n(نوصي بالقيام بها بالترتيب)",
    "courses": "الدورات",
    "steps": "الخطوات",
    "expand": "توسيع الدورة",
    "collapse": "أغلاق الدورة",
    "legacy-header": "الدورات القديمة",
    "legacy-desc": "لم تعد هذه الدورات التدريبية جزءًا من مسار الشهادة ، ولكنها لا تزال متاحة لك لتعزيز تعلمك.",
    "legacy-go-back": "الذَّهاب إلى النسخة الحالية من المنهج الدراسي.",
    "course-maintenance": "These courses are undergoing maintenance. If they are not working, you can learn how to run them locally at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "course-disabling-soon": "The browser version of these courses will be temporarily disabled soon and your virtual machines will be deleted. Any progress in your virtual machines will be lost. If you have any files you want from them, you should save them to your computer. We apologize for any inconvenience. We hope to have an improved browser version of these courses available again in the next few weeks.",
    "course-disabled": "These courses are temporarily unavailable to run in the browser. We apologize for any inconvenience. You can learn how to run them locally at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. We hope to have an improved browser version available again soon.",
    "run-locally": "For now, we recommend running the courses locally on your computer. You can learn how at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "Your progress will not be saved to your freeCodeCamp account when running them locally.",
    "go-back-to-learn": "العودة إلى النسخة المستقرة من المنهج الدراسي.",
    "read-database-cert-article": "الرجاء قراءة هذا الموضوع قبل المتابعة.",
    "enable-cookies": "يجب عليك السماح باستخدام third-party cookies قبل البَدْء.",
    "english-only": "الدورات الدراسية في هذا القسم متاحة باللغة الإنكليزية فقط. ونحن قادرون فقط على تَرْجَمَة العناوين والمقدمات في الوقت الحاضر، وليس الدروس ذاتها.",
    "exam-english-only": "Please note that the certification exam is currently available only in English. The rest of the courses are available in some languages."
  }
}
