{
  "responsive-web-design": {
    "title": "تراث تصميم مواقع الويب المتجاوبة",
    "intro": [
      "في شهادة تصميم الويب المستجيب هذه، ستتعلم اللغات التي يستخدمها المطورين لبناء صفحات الويب: HTML (Hypertext Markup Language) للمحتوى، و CSS (Cascading Style Sheets) للتصميم.",
      "أولاً، سوف تبني تطبيق صورة قطة لتتعلم أساسيات HTML و CSS. لاحقاً، سوف تتعلم التقنيات الحديثة مثل متغيرات CSS عن طريق بناء بِطْرِيق، وأفضل الممارسات في إتاحة الوصول (accessibility) عن طريق بناء نموذج ويب.",
      "أخيراً، سوف تتعلم كيف تنشئ صفحات ويب تستجيب لأحجام الشاشات المختلفة عندما تبني بطاقة تويتر باستخدام Flexbox، وتخطيط معقد لمدونة باستخدام CSS Grid."
    ],
    "note": "ملاحظة: بعض إضافات المتصفح, مثل Ad-blockers وإضافات الوضع الليلي قد تتصادم مع نتائج الاختبارات, إذا واجهت مشكلات, ننصحك بتعطيل الإضافات التي قد تؤثر أو تعدل على مخطط الصفحات في أثناء حضورك للدورة.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "أساسيات HTML و HTML5",
        "intro": [
          "HTML هي لغة ترميز تستخدم سياق خاص أو رموز لوصف الهيكل الخاص بصفحة الويب للمتصفح، عناصر HTML عادة لديها علامة فتح وإغلاق تحيط المحتوى وتضيف معنى له. على سبيل المثال، عناصر مختلفة بإمكانها وصف النص كعنوان أو فَقَرة أو عنصر من قائمة.",
          "في هذه الدورة، ستبني تطبيق صورة القطة لتتعلم بعض من أكثر عناصر لغة HTML شيوعاً، وهي كتل البناء لأي صفحة على الويب."
        ]
      },
      "basic-css": {
        "title": "أساسيات CSS",
        "intro": [
          "CSS أو Cascading Style Sheets تخبر المتصفح كيف يعرض النص والعناصر الأخرى الذي قمت بكتابتها في مِلَفّ HTML. و بواسطة CSS تستطيع التحكم باللون والخط والحجم والمسافة والكثير من الأوجه المختلفة لعناصر HTML.",
          "الآن بعد أن وصفت بنية تطبيق صورة القطة الخاصة بك، أضف له بعض التصاميم باستخدام CSS."
        ]
      },
      "applied-visual-design": {
        "title": "التصميم المرئي المطبق",
        "intro": [
          "التصميم المرئي هو مزيج من الطباعة Typography، ونظرية الألوان، والرسوم، والرسوم المتحركة، وتخطيط الصفحات، وأكثر من ذلك للمساعدة في إيصال رسالتك الفريدة.",
          "في هذه الدورة، ستتعلم كيفية تطبيق هذه العناصر المختلفة للتصميم المرئي على صفحات الويب الخاصة بك."
        ]
      },
      "applied-accessibility": {
        "title": "امكانية الوصول المطبقة",
        "intro": [
          "في تطوير المواقع، إماكنية الوصول تشير إلى محتوى ويب وواجهة مستخدم (UI - User Interface) يمكن فهمها والتنقل بها والتفاعل معها من قبل جَمهور عريض. هذا يتضمن أشخاص مصابين بإعاقات بصرية أو سمعية أو حركية أو إدراكية.",
          "في هذه الدورة، ستتعلم أفضل الممارسات لبناء صفحات الويب التي يمكن للجميع الوصول إليها وفهمها."
        ]
      },
      "responsive-web-design-principles": {
        "title": "مبادئ تصميم الويب المتجاوب Responsive",
        "intro": [
          "هناك العديد من الاجهزة التي يمكنها الوصول إلى الويب، وتأتي هذه الأجهزة بمختلف الأشكال والمقاسات. التصميم المتجاوب هو الممارسة في تصميم مواقع مرنة ومتجاوبة تستجيب لمختلف احجام الشاشات والاتجاهات ودقة الشاشات.",
          "في هذه الدورة، ستتعلم كيفية استخدام CSS لجعل صفحات الويب الخاصة بك تبدو جيدة، بغض النظر عن الجهاز الذي يتم مشاهدة الموقع منه."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox هو طريقة تخطيط قوية مدعومة جيدا تم تقديمها مع أحدث إصدار من CSS, CSS3. مع Flexbox، من السهل تركيز العناصر على الصفحة وإنشاء واجهات ديناميكية للمستخدم تتقلص وتتوسع تلقائيا.",
          "في هذه الدورة ، ستتعلم أساسيات flexbox والتخطيطات الديناميكية من خلال بناء بطاقة تويتر."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "تُعد CSS Grid معياراً جديداً تجعل من السهل إنشاء تخطيطات معقدة ومتجاوبة. إنها تعمل عن طريق تحويل عنصر HTML إلى Grid ، وتسمح لك بوضع العناصر الفرعية في أي مكان بداخلها.",
          "في هذه الدورة أنت سوف تتعلّم أساسيات CSS grid من خلال بناء تخطيطات معقّدة مختلفة بما في ذلك بناء مدونة."
        ]
      },
      "responsive-web-design-projects": {
        "title": "مشاريع تصميم الويب المتجاوبة",
        "intro": [
          "حان الوقت لصقل مهاراتك الحديثة للتعلم. بالعمل على هذه المشاريع، ستحصل على فرصة لتطبيق جميع المهارات، المبادئ، والمفاهيم التي تعلمتها حتى الآن: HTML، CSS، التصميم المرئي، إمكانية الوصول، وأكثر من ذلك.",
          "أكمل مشاريع برمجة الويب الخمسة أدناه للحصول على شهادة تصميم مواقع الويب المتجاوبة."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "تصميم مواقع الويب المتجاوبة (جديد)",
    "intro": [
      "في شهادة تصميم الويب المستجيب هذه، ستتعلم اللغات التي يستخدمها المطورين لبناء صفحات الويب: HTML (Hypertext Markup Language) للمحتوى، و CSS (Cascading Style Sheets) للتصميم.",
      "أولاً، سوف تبني تطبيق صور لقطط لتتعلم أساسيات HTML وCSS. لاحقاً، سوف تتعلم التقنيات الحديثة مثل متغيرات CSS عن طريق بناء بِطْرِيق، وأفضل الممارسات في أمكانية الوصول عن طريق بناء اختبار فس موقع.",
      "وأخيرا، ستتعلم كيفية إنشاء صفحات الويب التي تستجيب لأحجام الشاشة المختلفة عن طريق بناء معرض للصور باستخدام Flexbox، وتصميم لمقال في مجلة باستخدام CSS Grid."
    ],
    "note": "ملاحظة: بعض إضافات المتصفح, مثل Ad-blockers وإضافات الوضع الليلي قد تتصادم مع نتائج الاختبارات, إذا واجهت مشاكل, ننصحك بتعطيل الإضافات التي قد تؤثر أو تعدل على مخطط الصفحات, أثناء حضورك للدورة.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "صفحة الثناء",
        "intro": [
          "هذا هو أحد المشاريع المطلوبة للحصول على شهادتك.",
          "في هذا المشروع، سوف تنشئ صفحة إثناء لموضوع من اختيارك سواء كان الموضوع من وحي خيالك أو حقيقي."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "معرضا لأعمالك الخاصة",
        "intro": [
          "هذا هو أحد المشروعات المطلوبة للحصول على شهادتك.",
          "في هذا المشروع، سوف تتشئ صفحة ويب معرضا لأعمالك الخاصة."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "صفحة لعرض المنتج",
        "intro": [
          "هذا هو أحد المشروعات المطلوبة للحصول على شهادتك.",
          "في هذا المشروع، ستنشئ صفحة لعرض المنتج من اختيارك للتسويق له."
        ]
      },
      "build-a-survey-form-project": {
        "title": "نموذج استطلاع رأي",
        "intro": [
          "هذا هو أحد المشروعات المطلوبة للحصول على شهادتك.",
          "في هذا المشروع، سوف تنشئ نموذج استطلاع رأي لجمع بيانات من مستخدميك."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "صفحة التوثيق التقنية",
        "intro": [
          "هذا هو أحد المشروعات المطلوبة للحصول على شهادتك.",
          "في هذا المشروع، ستنشئ صفحة نموذج استطلاع رأي لتقوم مقام التعليمات أو المرجع لموضوع ما."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "تعلم HTML عن طريق بناء تطبيق صورة القطة",
        "intro": [
          "تعطي وسوم HTML صفحة الويب هيكلها. يمكنك استخدام وسوم HTML لإضافة الصور والأزرار والعناصر الأخرى إلى صفحة الويب الخاصة بك.",
          "في هذه الدورة، ستتعلم وسوم HTML الأكثر شيوعاً عن طريق بناء تطبيقك صورة القطة."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "تعلم اساسيات CSS عن طريق بناء قائمة مقهى",
        "intro": [
          "يخبر CSS المتصفح كيف تعرض صفحتك الويب. يمكنك استخدام CSS لتعيين اللون والخطوط والحجم والجوانب الأخرى لعناصر HTML.",
          "في هذه الدورة، سوف تتعلم CSS عن طريق تصميم صفحة قائمة لصفحة ويب لمقهى."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "تعلم CSS Box Model عن طريق بناء رسم لـRothko",
        "intro": [
          "كل عنصر من عناصر HTML هو صندوقه - مع مساحته الخاصة وحدوده. وهذا يسمى نموذج الصندوق Box Model.",
          "في هذه الدورة، ستستخدم CSS و Box Model لإنشاء قطع فنية مستطيلة على تصممك لوحة روثكو."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "تعلم متغيرات CSS عن طريق أنشئ ناطحة السحاب بالمدينة",
        "intro": [
          "تساعدك متغيرات CSS على تنظيم تصميماتك وإعادة استخدامها.",
          "في هذه الدورة، ستبني ناطحة سحب بالمدينة. ستتعلم كيفية إعداد متغيرات CSS حتى تتمكن من إعادة استخدامها كلما أردت."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "تعلم نموذجات HTML عن طريق بناء نموذج تسجيل",
        "intro": [
          "يمكنك استخدام نموذجات HTML لجمع المعلومات من الأشخاص الذين يزورون صفحتك الويب.",
          "في هذه الدورة، ستتعلم نماذج HTML عن طريق بناء صفحة التسجيل. ستتعلم كيفية التحكم في أنواع البيانات التي يمكن للناس كتابتها في النموذج، وبعض أدوات CSS الجديدة لتصميم صفحتك."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "تعلم تسهيل المنال Accessibility عن طريق بناء اختبار",
        "intro": [
          "الاهتمام بتسهيل المنال إلى صفحتك الويب سهلة الاستخدام لجميع الناس - حتى الأشخاص ذوي الإعاقة.",
          "في هذه الدورة، ستبني صفحة ويب لاختبار. ستتعلم أدوات تسهل المنال مثل اختصارات لوحة المفاتيح، سمات ARIA وأفضل الممارسات في التصميم."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "تعلم المستوي المتوسط من CSS عن طريق بناء لوحة لبيكاسو",
        "intro": [
          "في هذه الدورة، سوف تتعلم بعض تقنيات المستوي المتوسط من CSS عن طريق برمجة صفحتك الويب لرسوم بيكاسو. ستتعلم أيقونات SVG، أيضاً CSS positioning لتنسيق العناصر، ومراجعة مهارات CSS الأخرى التي تعلمتها."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "تعلم تصميم الويب المستجيب Responsive Web Design عن طريق بناء بيانو",
        "intro": [
          "يخبر التصميم المستجيب صفحتك الويب كيف ينبغي أن تبدو على شاشات مختلفة الحجم.",
          "في هذه الدورة، ستستخدم CSS والتصميم المستجيب لبرمجة وبناء بيانو. كما ستتعلم المزيد عن media queries و pseudo selectors."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "تعلم CSS Flexbox من خلال بناء معرض للصور",
        "intro": [
          "يساعدك Flexbox في تصميم صفحتك الويب بحيث تبدو جيدة على أي حجم شاشة.",
          "في هذه الدورة، ستستخدم Flexbox لإنشاء موقع ويب مستجيب Responsive لمعرض صور."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "تعلم CSS Grid عن طريق بناء مجلة",
        "intro": [
          "تمنحك CSS Grid التحكم في صفوف وأعمدة تصميم صفحتك الويب.",
          "في هذه الدورة، ستقوم ببناء مقال في مجلة. ستتعلم كيفية استخدام CSS Grid، بما في ذلك مفاهيم مثل صفوف الشبكة Grid rows وأعمدة الشبكة Grid columns."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "تعلم الطباعة Typography عن طريق بناء علامة التغذية",
        "intro": [
          "إن تشكيل الخط فن لتصميم نصك ليسهل قراءة ويلائم غرضه.",
          "في هذه الدورة، ستستخدم typography لإنشاء صفحة ويب لتسمية التغذية. ستتعلم كيفية تغيير تشكيل النص، وتعديل ارتفاع الخط line-height، و تغيير وضع position نصك باستخدام CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "تعلم تحويلات CSS Transforms عن طريق بناء بطريق",
        "intro": [
          "يمكنك تحويل عناصر HTML لإنشاء تصاميم جذابة. يمكنك استخدام التحولات transforms لتدوير العناصر، وتغيير حجمها، والمزيد.",
          "في هذه الدورة ، ستبني بطريق. ستستخدم تحولات CSS transforms لوضع أجزاء البطريق وتغيير حجمها، وإنشاء خلفية، وتحريك عملك."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "تعلم التحريك CSS Animation عن طريق بناء عجلة Ferris",
        "intro": [
          "يمكنك استخدام CSS animation لتوجيه الانتباه إلى أقسام محددة من صفحة الويب الخاصة بك وجعلها أكثر تفاعلية.",
          "في هذه الدورة، ستبني عجلة Ferris. ستتعلم كيفية استخدام CSS لتحريك العناصر، وتحويلها وتعديل سرعتها."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "تعلم المزيد عن Selectors Pseudo في CSS عن طريق بناء كشف ميزانية",
        "intro": [
          "يمكنك استخدام CSS pseudo selectors لتغيير عناصر HTML محددة.",
          "في هذه الدورة، ستبني ميزانية عامة باستخدام المنتقات الزائفة pseudo selectors. سوف تتعلم كيفية تغيير تصميم عنصر ما عندما تحوم فوقه بماوسك، وتفعيل أحداث أخرى على صفحتك الويب."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "تعلم ألوان CSS عن طريق إنشاء مجموعة من العلامات الملونة",
        "intro": [
          "يمكن أن يؤدي تحديد الألوان الصحيحة لصفحة الويب الخاصة بك إلى تحسين المظهر الجمالي لقرائك بشكل كبير.",
          "في هذه الدورة، ستبني مجموعة من العلامات الملونة. سوف تتعلم طرق مختلفة لتعيين قيم الألوان وكيفية إقران الألوان مع بعضها البعض."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "الخوارزميات وهياكل البيانات في JavaScript",
    "intro": [
      "في حين أن HTML و CSS يتحكمان في محتوى الصفحة وتصميم الصفحة، يستخدم Javascript لجعلها تفاعلية. في شهادة الخوارزميات وهياكل البيانات في JavaScript، ستتعلم أساسيات JavaScript بما في ذلك المتغيرات variables, والقوائم arrays, والكائنات objects والحلقات loops, والوظائف functions.",
      "بمجرد أن يكون لديك الأساسيات، ستطبق تلك المعرفة عن طريق إنشاء خوارزميات للتلاعب بالسلاسل strings، تحديد الأعداد، بل وحساب مدار محطة الفضاء الدولية.",
      "في هذا المشوار ستتعلم أيضًا أسلوبين أو نموذجين مهمين للبرمجة: البرمجة كائنية التوجه (OOP) ، والبرمجة الوظيفية (FP)."
    ],
    "note": "ملاحظة: بعض ملحقات المتصفح, مثل Ad-blockers وإضافات الوضع الليلي قد تتصادم مع نتائج الاختبارات, إذا واجهت مشاكل, ننصحك بتعطيل الملحقات التي قد تؤثر أو تعدل على محتوى الصفحات, أثناء حضورك للدورة.",
    "blocks": {
      "basic-javascript": {
        "title": "أساسيات JavaScript",
        "intro": [
          "إن JavaScript لغة برمجة يمكنك استخدامها لجعل صفحات الويب تفاعلية. إنها إحدى التكنولوجيات الأساسية للويب، إلى جانب HTML و CSS، وهي مدعومة بجميع المتصفحات الحديثة.",
          "في هذه الدورة، ستتعلم مفاهيم البرمجة الأساسية في Javascript. ستبدأ بهياكل البيانات الأساسية مثل الأرقام والنصوص. ثم سوف تتعلم العمل مع الكائنات والقوائم والوظائف والحلقات والشروط وتعبيرات if/else وأكثر من ذلك."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript، أو ES هو نسخة موحدة من JavaScript. لأن جميع المتصفحات الرئيسية تتبع هذه المواصفات، مصطلحي ECMAScript و JavaScript قابلان للتبادل.",
          "معظم ما تعلمته في JavaScript حتى هذه النقطة كان ضمن المعيار ES5 (ECMAScript 5)، والذي تم الاستغناء عنه في عام 2009. بينما لا يزال بإمكانك كتابة البرامج في ES5، فإن JavaScript تتطور دائماً، وتصدر ميزات جديدة كل سنة.",
          "ES6، الصادر في عام 2015، أضاف العديد من الميزات الجديدة القوية إلى اللغة. في هذه الدورة، سوف تتعلم هذه الميزات الجديدة، بما في ذلك دالات السهم \"arrow functions ، التدمير destructuring ، الفئات classes، الوعود Promises، والوحدات Modules."
        ]
      },
      "regular-expressions": {
        "title": "العبارات العادية Regular Expressions",
        "intro": [
          "العبارات العادية Regular expressions، غالباً ما تسمي \"regex\" أو \"regexp\"، هي أنماط تساعد المبرمجين على المطابقة والبحث واستبدال النص. التعابير العادية قوية جداً، ولكن يمكن أن يكون من الصعب قراءتها لأنها تستخدم رموز خاصة لعمل مطابقات أكثر تعقيداً ومرونة.",
          "في هذه الدورة، ستتعلم كيفية استخدام الرموز الخاصة، التقاط المجموعات، النظرات الإيجابية والسلبية، وتقنيات أخرى لمطابقة أي نص تريده."
        ]
      },
      "debugging": {
        "title": "تصحيح الأخطاء",
        "intro": [
          "التصحيح هو عملية المرور عبر التعليمات البرمجية الخاصة بك، والبحث عن أي مشكلات، وإصلاحها.",
          "المشاكل في الكود البرمجي تأتي عموما في ثلاثة أشكال: أخطاء بناء الجملة syntax errors التي تمنع برنامجك من التشغيل، أخطاء في وقت التشغيل runtime errors حيث تحتوي تعليماتك البرمجية على سلوك غير متوقع، أو أخطاء منطقية logical errors حيث لا تفعل تعليماتك البرمجية ما قصدته.",
          "في هذه الدورة، ستتعلم كيفية استخدام وحدة تحكم Javascript لتصحيح البرامج ومنع المشكلات الشائعة قبل حدوثها."
        ]
      },
      "basic-data-structures": {
        "title": "هياكل البيانات الأساسية",
        "intro": [
          "يمكن تخزين البيانات والوصول إليها بعدة طرق. أنت تعرف بالفعل بعض هياكل بيانات javascript الشائعة - القوائم والكائنات.",
          "في هذه الدورة لهياكل البيانات الأساسية، ستتعلم المزيد عن الاختلافات بين القوائم والكائنات، وعن كيفية استخدامها في أوضاع مختلفة. سوف تتعلم أيضاً كيفية استخدام أساليب Javascript المفيدة مثل <code>splice()</code> و <code>Object.keys()</code> للوصول إلى البيانات والتلاعب بها."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "أساسيات الخوارزميات",
        "intro": [
          "الخوارزمية هي سلسلة من التعليمات خطوة بخطوة تصف كيفية القيام بشيء ما.",
          "يساعدك تفكيك المشكلة إلى أجزاء أصغر والتفكير بعناية حول كيفية حل كل جزء علي حدي بواسطة الكود البرمجي على كتابة خوارزميات اكثر فاعلية.",
          "في هذه الدورة، ستتعلم أساسيات التفكير الخوارزمي عن طريق كتابة خوارزميات تفعل كل شيء من تحويل درجات الحرارة إلى التعامل مع القوائم ثنائية الأبعاد 2D arrays المعقدة."
        ]
      },
      "object-oriented-programming": {
        "title": "البرمجة كائنية التوجه Object Oriented Programming",
        "intro": [
          "تعد البرمجة كائنية التوجه OOP أحد النُهج الرئيسية لعملية تطوير البرمجيات. في هذا النهج، تُستخدم الكائنات objects والفئات classes لتنظيم الكود البرمجي لوصف الأشياء وما يمكن أن تفعله.",
          "في هذه الدورة سوف تتعلم المبادئ الأساسية للبرمجة كائنية التوجه في JavaScript، بما في ذلك الكلمة المفتاحية <code>this</code> والسلاسل النموذجية prototype chains والـ constructors والوراثة inheritance."
        ]
      },
      "functional-programming": {
        "title": "البرمجة الوظيفية Functional Programming",
        "intro": [
          "إن البرمجة الوظيفية نهج شائع آخر لتطوير البرمجيات. في البرمجة الوظيفية، ينظم الكود في وظائف أصغر وأساسية يمكن الجمع بينها لبناء برامج معقدة.",
          "في هذه الدورة، ستتعلم المفاهيم الأساسية للبرمجة الوظيفية بما في تلك الوظيفة العادية، كيفية تجنب الطفرات وكيفية كتابة كود أنظف مع أساليب مثل <code>.map()</code> و <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "الخوارزميات - المستوى متوسط",
        "intro": [
          "الآن بعد أن عرفت أساسيات التفكير الخوارزمي، جنبا إلى جنب مع OOP والبرمجة الوظيفية، اختبر مهاراتك مع تحديات الخوارزميات في المستوي المتوسط."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "مشاريع خوارزميات وهياكل البيانات Javascript",
        "intro": [
          "حان الوقت لوضع مهاراتك الجديدة في Javascript قيد العمل. هذه المشاريع مشابهة لتحديات الخوارزميات التي قمت بها من قبل لكنها فقط أكثر صعوبة.",
          "أكمل مشاريع JavaScript الخمسة هذه للحصول على شهادة الخوارزميات وهياكل البيانات في JavasScript."
        ]
      }
    }
  },
  "2022/javascript-algorithms-and-data-structures": {
    "title": "مشروعات Javascript لخوارزميات ولهياكل البيانات (قيد الأنشاء)",
    "intro": ["عنصر نائب", "عنصر نائب"],
    "note": "",
    "blocks": {
      "build-a-caesars-cipher-project": {
        "title": "بناء مشروع شفرة قيصر",
        "intro": ["", ""]
      },
      "build-a-cash-register-project": {
        "title": "بناء مشروع مكنة لتسجيل النقود",
        "intro": ["", ""]
      },
      "build-a-palindrome-checker-project": {
        "title": "أنشئ مشروع مدقق لمعاكس المقطع النصي",
        "intro": ["", ""]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "أنشئ مشروع محول للأرقام الرومانية",
        "intro": ["", ""]
      },
      "build-a-telephone-number-validator-project": {
        "title": "بناء مشروع مدقق الأرقام الهواتف",
        "intro": ["", ""]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "تعلم أساسيات JavaScript عن طريق بناء لُعْبَة نوعها Role Playing",
        "intro": ["", ""]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "تعلم التحقق من صحة النموذج عن طريق بناء Calorie Counter",
        "intro": ["", ""]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "تعلم البرمجة الوظيفية عن طريق بناء Spreadsheet",
        "intro": ["", ""]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Learn Advanced Array Methods by Building a Statistics Calculator",
        "intro": ["", ""]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "مكتبات تطوير واجهة المستخدم",
    "intro": [
      "الآن بعد أن أصبحت على دراية بـ HTML و CSS و JavaScript، قم برفع مستوى مهاراتك من خلال تعلم بعض مكتبات واجهة المستخدم الأكثر شعبية في المجال.",
      "سوف تتعلم بواسطة شهادة مكتبات تطوير الواجهات الأمامية، كيفية تصميم موقعك بسرعة باستخدام Bootstrap. ستتعلم أيضا إضافة بعض المنطق إلى CSS وتوسيع نطاقه باستخدام Sass.",
      "سوف تبني لاحقا سلة تسوق و تطبيقات أخرى لتتعلم كيفية بناء تطبيقات ذات صفحة واحدة (Single Page Applications SPAs) باستخدام React و Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap هو إطار عمل للواجهة الأمامية يُستخدم لتصميم صفحات وتطبيقات متجاوبة. وهو يأخذ نهج الهاتف أولاً لتطوير الويب، ويشمل أنماط وفئات CSS المبنية مسبقاً، بالإضافة إلى بعض وظائف Javascript.",
          "في هذه الدورة ، ستتعلم كيفية بناء مواقع مستجيبة باستخدام Bootstrap، واستخدم فئاته المضمنة لتصميم الأزرار والصور والنماذج وعناصر التنقل والعناصر المشتركة الأخرى."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery هي واحدة من أكثر مكتبات JavaScript استخداما في العالم.",
          "عندما تم إصدارها في عام ٢٠٠٦ تعاملت جميع المتصفحات الكبيرة مع JavaScript بشكل مختلف قليلاً. قامت jQuery بتبسيط عملية كتابة JavaScript على المتصفح client-side، وأيضاً ضمان عمل الكود الخاص بك بنفس الطريقة في جميع المتصفحات.",
          "في هذه الدورة، ستتعلم كيفية استخدام jQuery لتحديد العناصر المختلفة في الصفحة وإزالتها واستنساخها وتعديلها."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass اختصارا ل (Syntactically Awesome StyleSheets) هو امتداد للغة CSS محسن يضيف ميزات غير متوفرة في CSS الأساسية، والتي تجعل من الأسهل لك تبسيط وحفظ style sheets لمشاريعك.",
          "في دورة Sass هذه، ستتعلم كيفية تخزين البيانات في المتغيرات. إنشاء أنماط متشعبة و انماط قابلة لإعادة الاستخدام مع المزج، إضافة المنطق والحلقات إلى الأنماط الخاصة بك، وأكثر من ذلك."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "إن React مكتبة شائعة من مكتبات JavaScript لبناء واجهة مستخدم قابلة لإعادة البناء اعتماداً على المكون لصفحات الويب أو التطبيقات.",
          "يجمع React بين الـ HTML ووظائف الـ JavaScript في لغة ترميز خاصة به تدعى JSX. كما أن React يجعل من السهل إدارة تدفق البيانات في التطبيق.",
          "في هذه الدورة ، ستتعلم كيفية إنشاء مكونات مختلفة من React وإدارة البيانات في شكل State و Props و استخدام أساليب دورة الحياة المختلفة مثل <code>componentDidMount</code>، وأكثر من ذلك بكثير."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "مع نمو التطبيقات في الحجم والنطاق ، تصبح إدارة البيانات المشتركة أكثر صعوبة. يتم تعريف Redux على أنه \"حاوية حالة يمكن التنبؤ بها لتطبيقات JavaScript\" تساعد على ضمان عمل تطبيقاتك بشكل متوقع ، كما يسهل اختبارها.",
          "بينما يمكنك استخدام Redux مع أي مكتبة أخرى، نحن نقدم Redux هنا قبل الجمع بينها هي و React في المجموعة التالية من الدورات.",
          "في هذه الدورة ، ستتعلم أساسيات Redux stores والـ actions والـ middleware والـ reducers لإدارة البيانات في تطبيقك."
        ]
      },
      "react-and-redux": {
        "title": "React and Redux",
        "intro": [
          "كثيرا ما يُشار إلى React و Redux معاً، ولسبب وجيه. المطور الذي أنشأ Redux كان مطور لـ React و اراد أن يسهل مشاركة البيانات عبر المكونات المختلفة.",
          "الآن بعد أن عرفت كيفية إدارة تدفق البيانات المشتركة مع Redux، حان الوقت للجمع بين تلك المعرفة و React. في دورات React و Redux، ستبني مكون React وتتعلم كيفية إدارة الحالة state محلياً على مستوى المكون. وعبر التطبيق برمته مع Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "مشاريع مكتبات تطوير واجهة المستخدم",
        "intro": [
          "حان الوقت لوضع مهاراتك في مكتبات تطوير واجهات المستخدم للاختبار. استخدم Bootstrap, و jQuery, و Sass, و React, و Redux لبناء 5 مشروعات لتختبر ما تعلمته حتى هذه النقطة.",
          "أكمل جميع المشاريع الخمسة، وستحصل على شهادة في مكتبات تطوير واجهة المستخدم."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "تصوّر البيانات",
    "intro": [
      "البيانات حولنا جميعاً، لكنها لا تعني الكثير بدون شكل أو سياق.",
      "في شهادة تصوّر البيانات، ستقوم بإنشاء مخططات ورسوم بيانية وخرائط لعرض أنواع مختلفة من البيانات مع مكتبة D3.js.",
      "سوف تتعلم أيضاً JSON وهو اختصار لـ (JavaScript Object Notation)، وكيفية العمل مع البيانات عبر الإنترنت باستخدام API (واجهة برمجة التطبيقات)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "تصور البيانات مع D3",
        "intro": [
          "D3 ، أو D3.js ، تعني المستندات المستندة إلى البيانات. إنها مكتبة JavaScript لإنشاء تصورات بيانات ديناميكية وتفاعلية في المتصفح.",
          "تم بناء D3 للعمل مع معايير الويب المشتركة - وتحديداً HTML و CSS و SVG.",
          "D3 يدعم العديد من الأنواع المختلفة لصيغ البيانات المُدخلة. ثم باستخدام أساليبه القوية المدمجة، يمكنك تحويل تلك البيانات إلى مخططات ورسوم بيانية وخرائط مختلفة.",
          "في تصوّر البيانات مع دورات D3، ستتعلم كيفية العمل مع البيانات لإنشاء مخططات مختلفة، رسوم بيانية، والعناصر المتحركة، والمكونات الأخرى لإنشاء تصوّرات بيانات دينامكية وجذابة."
        ]
      },
      "json-apis-and-ajax": {
        "title": "واجهات برمجة تطبيقات JSON و AJAX",
        "intro": [
          "على غرار كيفية مساعدة واجهات المستخدم للأشخاص في استخدام البرامج ، تساعد واجهات برمجة التطبيقات (APIs) البرامج على التفاعل مع البرامج الأخرى. واجهات برمجة التطبيقات هي أدوات تستخدمها أجهزة الكمبيوتر للتواصل مع بعضها البعض ، جزئيًا لإرسال البيانات واستلامها.",
          "غالبًا ما يستخدم المبرمجون AJAX (JavaScript غير متزامن و XML) عند العمل مع واجهات برمجة التطبيقات APIs. يشير AJAX إلى مجموعة من التقنيات التي تقدم طلبات غير متزامنة إلى خادم لنقل البيانات ، ثم تحميل أي بيانات يتم إرجاعها في الصفحة. وغالبًا ما تكون البيانات المنقولة بين المتصفح والخادم بتنسيق يسمى JSON (JavaScript Object Notation).",
          "هذه الدورة سوف تعلمك أساسيات العمل مع واجهة برمجة التطبيقات API وتقنيات AJAX المختلفة في المتصفح."
        ]
      },
      "data-visualization-projects": {
        "title": "مشاريع تصوير البيانات",
        "intro": [
          "الآن بعد أن تعلمت كيفية العمل مع تقنيات D3، API، و AJAX ، ضع مهاراتك للاختبار مع مشاريع تصوّر البيانات الخمسة هذه.",
          "في هذه المشاريع، ستحتاج إلى جلب البيانات وتحليل مجموعة من البيانات، ثم استخدام D3 لإنشاء تصوّر لبيانات مختلفة. قم بإنهائها جميعاً لتحصل علي شهادة تصور البيانات الخاصة بك."
        ]
      },
      "d3-dashboard": {
        "title": "لوحة تحكم D3",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Relational Database (قيد الأنشاء)",
    "intro": [
      "في هذه الدورات، سوف تستخدم أدوات وبرامج المطورين الحقيقية، بما في ذلك VS Code، و PostgreSQL، و Command Line باستخدام Linux/Unix لإكمال الدروس التفاعلية وبناء المشروعات.",
      "تبدأ هذه الدورات بأوامر Bash الأساسية. باستخدام Terminal، ستتعلم كل شيء بدءًا من التنقل في نظام الملفات ومعالجته، والبرمجة في Bash, وصولاً إلى الاستخدام المتقدم.",
      "بعد ذلك، سوف تتعلم كيفية إنشاء relational database وكيفية استخدامها بواسطة PostgreSQL، نظام إدارة relational database، و لغة SQL لأستعمال مع relational database.",
      "أخيرا، سوف تتعلم Git، نظام تحكم الإصدار، أداة أساسية لكل مطور."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "قاعدة بيانات الأجرام السماوية",
        "intro": [
          "هذا أحد المشروعات المطلوبة للحصول على شهادتك.",
          "لهذا المشروع، سوف تنشئ قاعدة بيانات للأجرام السماوية باستخدام PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "لُعْبَة تخمين العدد",
        "intro": [
          "هذا أحد المشروعات المطلوبة للحصول على شهادتك.",
          "لهذا المشروع، سوف تستخدم برنامَج Bash، و PostgreSQL، و Git لإنشاء لُعْبَة تخمين عدد تعمل على تطبيق terminal وتحفظ معلومات المستخدم."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "قاعدة بيانات الجدول الدوري",
        "intro": [
          "هذا أحد المشروعات المطلوبة للحصول على شهادتك.",
          "لهذا المشروع، ستنشئ برنامَج نصي Bash للحصول على معلومات عن العناصر الكيميائية من قاعدة بيانات الجدول الدوري."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "مجدول مواعيد الصالون",
        "intro": [
          "هذا أحد المشروعات المطلوبة للحصول على شهادتك.",
          "لهذا المشروع، ستنشئ برنامَج Bash التفاعلي الذي يستخدم PostgreSQL لتتبع العملاء والتوقيت لصالونك."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "قاعدة بيانات كأس العالم",
        "intro": [
          "هذا أحد المشروعات المطلوبة للحصول على شهادتك.",
          "لهذا المشروع، سوف تنشئ برنامج Bash الذي يدخل المعلومات من ألعاب كأس العالم إلى PostgreSQL، ثم تستفسر في database للحصول على إحصاءات مفيدة."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "تعلم معلومات Bash متقدمة عن طريق بناء Kitty Ipsum Translator",
        "intro": [
          "هناك أوامر Bash أكثر من مما قد تظن.",
          "في 140 درس، سوف تتعلم بعض الأوامر الأكثر تعقيدا، وتفاصيل كيفية عمل الأوامر."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "تعلم Bash و SQL بواسطة بناء Bike Rental Shop",
        "intro": [
          "في دورة المكونة من 210 درس, ستبني برنامَج Bash التفاعلي الذي يخزن معلومات الإيجار لمتجر بيع الدراجات باستخدام PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "تعلم Bash عن طريق بناء Boilerplate",
        "intro": [
          "تتيح لك terminal إرسال أوامر نصية إلى جهاز كمبيوترك الذي يمكنه التلاعب بنظام الملفات، وتشغيل البرامج، وتجعل المهام تلقائية، وأكثر من ذلك بكثير.",
          "في دورة من 170 درس, سوف تتعلم الأوامر terminal عن طريق إنشاء website boilerplate باستخدام command line فقط."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "تعلم برمجة Bash عن طريق بناء خمس برامج",
        "intro": [
          "البرامج Bash تجمع بين الأوامر terminal والمنطق في برامج يمكنها تنفيذ المهام أو أتمتها، وأكثر بكثير.",
          "في دورة من 220 الدرس، سوف تتعلم المزيد من الأوامر terminal وكيفية استخدامها ضمن برامج Bash عن طريق إنشاء خمس برامج صغيرة."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "تعلم Git عن طريق بناء كائن مرجعي SQL",
        "intro": [
          "يكون Git نظام تحكم الإصدار الذي يتابع جميع التغييرات التي أجرائها في كودك.",
          "في دورة من 240 درس، ستتعلم كيفية يتبع Git كودك عن طريق إنشاء كائن يحتوي على أوامر SQL شائعة الاستخدام."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "تعلم Nano عن طريق بناء قلعة",
        "intro": [
          "يكون Nano برنامَج يسمح لك بتعديل الملفات في المحطة الطرفية.",
          "في دورة من 40 درس، سوف تتعلم كيفية تعديل الملفات في terminal مع Nano خلال بناء القلعة."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "تعلم Relational Databases عن طريق بناء Mario Database",
        "intro": [
          "وتنظم بيانات relational database في جداول مترابطة معا بواسطة علاقات.",
          "في دورة من 165 الدرس سوف تتعلم أساسيات relational database عن طريق إنشاء قاعدة بيانات PostgreSQL مليئة برموز لُعْبَة الفيديو."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "تعلم SQL عن طريق بناء Student Database: الجزء 1",
        "intro": [
          "لغة الاستعلام SQL، أو لغة الاستعلام الهيكلية Structured Query Language، هي اللغة للتواصل مع relational database.",
          "في دورة من 140 درس, ستنشئ برنامَج Bash يستخدم SQL لإدخال معلومات عن طلاب علوم كمبيوترك في PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "تعلم SQL عن طريق بناء Student Database: الجزء 2",
        "intro": [
          "يتم استخدام أوامر الانضمام SQL للجمع بين المعلومات من جداول متعددة في قاعدة بيانات العلاقات",
          "في دورة من 140 درس، سوف تكمل قاعدة بيانات التلميذ بينما تغوص أعمق في أوامر SQL."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "تطوير الواجهات الخلفية للمواقع و واجهات برمجة التطبيقات - Back End Development and APIs",
    "intro": [
      "حتى هذه النقطة، لقد استخدمت JavaScript فقط في الواجهة الأمامية لإضافة تفاعل إلى صفحة، أو حل تحديات الخوارزميات، أو بناء SPA. ولكن يمكن أيضاً استخدام JavaScript في الواجهة الخلفية back end، أو السيرفر، لبناء تطبيقات ويب برمتها.",
      "واليوم، فإن إحدى الطرق الشائعة لبناء التطبيقات هي من خلال الخدمات المصّغرة microservices، وهي تطبيقات صغيرة ومحددة تعمل معاً لتشًكل وحدة اكبر.",
      "في شهادة تطوير واجهات الBack End و الAPIs، سوف تتعلم كيف تنشئ تطبيقات back end باستخدام Node.js و npm. سوف تقوم أيضا ببناء تطبيقات الويب باستخدام إطار العمل Express، و بناء microservice لإيجاد الأفراد باستخدام MongoDB ومكتبة Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "إدارة الحزم Packages باستخدام NPM",
        "intro": [
          "npm (node pack manager)، هو أداة في سطر الأوامر لتثبيت وإنشاء ومشاركة الحزم من كود Javascript المكتوب لـ Node.js. هناك العديد من الحزم مفتوحة المصدر متاحة على npm، لذلك قبل بدء المشروع، استغرق بعض الوقت للاستكشاف حتى لا ينتهي بك الأمر إلى إعادة إنشاء العجلة لأشياء مثل العمل مع التواريخ أو جلب البيانات من API.",
          "في هذه الدورة، ستتعلم أساسيات استخدام npm، بما في ذلك كيفية العمل مع الحزمة <code>package.json</code> وكيفية إدارة التبعيات المثبتة installed dependencies."
        ]
      },
      "basic-node-and-express": {
        "title": "أساسيات Node و Express",
        "intro": [
          "Node.js هي runtime للغة البرمجة Javascript تسمح للمطورين بكتابة البرامج الخلفية (Server-side) في JavaScript. وتأتي Node.js مع مجموعة من الوحدات المدمجة - برامج صغيرة ومستقلة - تساعد في ذلك. بعض الوحدات الأساسية تشمل HTTP ، الذي يعمل مثل الخادم، ونظام الملفات، ووحدة لقراءة وتعديل الملفات.",
          "في المجموعة الأخيرة من الدورات تعلّمت تثبيت وإدارة الحزم من npm، وهي مجموعات من الوحدات الأصغر. يمكن لهذه الحزم أن تساعدك على بناء تطبيقات أكبر وأكثر تعقيداً.",
          "Express هو إطار تطبيق ويب خفيف، وهو واحد من أكثر الحزم شعبية على npm. يسهل استخدام Express في إنشاء خادم والتعامل مع توجيه مسار تطبيقك، الذي يتعامل مع أشياء مثل توجيه الناس إلى الصفحة الصحيحة عندما يزورون endpoint معينة مثل <pre>/blog</pre>.",
          "في هذه الدورة، ستتعلم أساسيات Node و Express، بما في ذلك كيفية إنشاء خادم server، تقديم serve ملفات مختلفة، والتعامل مع طلبات requests مختلفة من المتصفح."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB و Mongoose",
        "intro": [
          "MongoDB هو تطبيق قاعدة بيانات يخزن مستندات (أو سجلات) JSON التي يمكنك استخدامها في تطبيقك. و علي عكس SQL، هو نوع آخر من قواعد البيانات، فإن MongoDB هي قاعدة بيانات غير علائقية أو \"NoSQL\". وهذا يعني أن MongoDB يخزن جميع البيانات المرتبطة داخل سجل واحد، بدلا من تخزينها عبر العديد من الجداول المسبقة كما هو الحال في قاعدة بيانات SQL.",
          "تكون Mongoose حُزْمَة npm شعبية لاستعمال MongoDB. مع Mongoose، يمكنك استخدام كائنات JavaScript عادية بدلاً من JSON، مما يسهل العمل مع MongoDB. وهو يسمح لك بإنشاء مخططات لمستنداتك المسماة schema، حتي لا تحفظ نوع خاطئ من البيانات عن طريق الخطأ وتسبب أخطاء لاحقاً.",
          "في دورات MongoDB و Mongoos، ستتعلم أساسيات العمل مع البيانات بما في ذلك كيفية إعداد نموذج model، وحفظ، وحذف، وإيجاد الوثائق في قاعدة البيانات."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "مشاريع تطوير الواجهات الخلفية للمواقع و واجهات برمجة التطبيقات APIs",
        "intro": [
          "لقد عملت مع واجهة برمجة التطبيقات APIs من قبل، ولكن الآن بعد أن عرفت npm، و Node, و Express، و MongoDB، و Mongoose، حان الوقت لبناء API بنفسك، بالاعتماد على ما تعلمته حتى هذه النقطة لإنشاء 5 خدمات مصغّرة microservices مختلفة، وهي تطبيقات أصغر محدودة النطاق.",
          "بعد إنشاء هذه البرمجيات، سيكون لديك 5 APIs رائعة للخدمات الصغرى يمكنك عرضها للأصدقاء والعائلة وأصحاب العمل المحتملين، وستحصل أيضًا على شهادة تطوير الواجهة الخلفية وواجهات برمجة التطبيقات."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "ضمان الجودة",
    "intro": [
      "كلما أصبحت برامجك أو تطبيقاتك أكثر تعقيداً، ستريد اختبارها للتأكد من أن التغييرات الجديدة لا تخالف وظائفها الأصلية.",
      "في شهادة ضمان الجودة، ستتعلم كيفية كتابة الاختبارات مع Chai للتأكد من أن تطبيقاتك تعمل بالطريقة التي تتوقع منها ذلك.",
      "ثم ستقوم ببناء تطبيق دردشة لتتعلّم مفهاهيم Node و Express المتقدمة. ستستخدم Pug أيضًا كمحرك قالب، Passport للمصادقة، و Socket.io للاتصال الفوري بين الخادم والعملاء المتصلين."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "ضمان الجودة والاختبار مع Chai",
        "intro": [
          "Chai هي مكتبة اختبارات للـ Javascript تساعدك على تأكيد أن برنامجك لا يزال يتصرف بالطريقة التي تتوقعها بعد إجراء تغييرات على الكود الخاص بك.",
          "باستخدام Chai، يمكنك كتابة الاختبارات التي تصف متطلبات برنامجك لمعرفة ما إذا كان برنامجك يفي بها.",
          "في هذه الدورة، ستتعرف على التأكيدات، المساواة العميقة، الصدق، اختبار API، وغيرها من أساسيات اختبار تطبيقات Javascript."
        ]
      },
      "advanced-node-and-express": {
        "title": "دروس Node و Express المتقدمة",
        "intro": [
          "الآن حان الوقت للغوص العميق في Node.js و Express.js من خلال بناء تطبيق دردشة مع نظام تسجيل الدخول.",
          "لتنفيذ نظام تسجيل الدخول بأمان، ستحتاج إلى معرفة عن المصادقة authentication. وهو التحقق من هوية الشخص أو العملية.",
          "في هذه الدورة ، ستتعلم كيفية استخدام Passport لإدارة المصادقة ، Pug لإنشاء قوالب قابلة لإعادة الاستخدام لبناء الواجهة الأمامية بسرعة. و sockets الويب للاتصال الفوري بين العملاء والخادم."
        ]
      },
      "quality-assurance-projects": {
        "title": "مشاريع ضمان الجودة",
        "intro": [
          "الآن بعد أن أصبحت على دراية جيدة في كل من تطوير الواجهة الأمامية و الخلفية. حان الوقت لتطبيق كل المهارات والمفاهيم التي تعلمتها حتى هذه النقطة. ستبني 5 تطبيقات مختلفة على الويب، وستكتب اختبارات لكل واحدة منها للتأكد من أنها تعمل ويمكنها التعامل مع حالات مختلفة.",
          "بعد الانتهاء من مشاريع ضمان الجودة هذه، سيكون لديك 5 مشاريع في حافظتك، وشهادة جديدة تظهر على حافظتك."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "الحوسبة العلمية باستخدام Python",
    "intro": [
      "Python هي واحدة من لغات البرمجة الأكثر شعبية ومرونة اليوم. يمكنك استخدامها لكل شيء من البرمجة النصية الأساسية إلى تعلم الآلة.",
      "في شهادة الحوسبة العلمية باستخدام Python، ستتعلم أساسيات Python مثل المتغيرات والحلقات والشروط والوظيفة. ثم ستصل بسرعة إلى هياكل البيانات المعقدة، والربط الشبكي Networking، وقواعد البيانات العلائقية، وتصوّر البيانات."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python للجميع",
        "intro": [
          "Python للجميع سلسلة فيديوهات مجانية لتعلّم أساسيات استخدام Python 3.",
          "وقد أنشأ هذه الدورات الدكتور Charles Severance (المعروف أيضاً بالدكتور Chuck). وهو أستاذ بروفيسور في كلية العلوم بجامعة ميشيغان، حيث يُدرّس دورات مختلفة موجهة نحو التكنولوجيا، بما في ذلك البرمجة وتصميم قواعد البيانات وتطوير الويب."
        ]
      },
      "scientific-computing-with-python-projects": {
        "title": "مشاريع الحوسبة العلمية باستخدام Python",
        "intro": [
          "حان الوقت لوضع مهاراتك في Python على الاختبار. بإكمال هذه المشاريع، سوف تثبت أن لديك معرفة أساسية جيدة عن Python ومؤّهل للحصول على شهادة الحوسبة العلمية باستخدام Python."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "تحليل البيانات باستخدام Python",
    "intro": [
      "كان تحليل البيانات موجوداً منذ وقت طويل. ولكن حتى قبل بضع سنوات، مارسه المطورون باستخدام أدوات مكلّفة ومغلقة المصدر مثل Tableau. لكن مؤخراً Python، SQL، والمكتبات المفتوحة الأخرى غيّرت تحليل البيانات للأبد.",
      "في شهادة تحليل البيانات مع Python، ستتعلم أساسيات تحليل البيانات باستخدام Python. بنهاية هذه الشهادة ، ستعرف كيف تقرأ البيانات من مصادر مثل CSVs و SQL، وكيفية استخدام المكتبات مثل Numpy، و Pandas، و Matplotlib، و Seaborn لمعالجة وتصوير البيانات."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "تحليل البيانات باستخدام Python",
        "intro": [
          "في مقاطع الفيديو الشاملة هذه، التي أنشأتها Santiago Basulto، سوف تتعلم عملية تحليل البيانات بأكملها. سوف تقوم بقراءة البيانات من مصادر متعددة (CSV, SQL, Excel)، ومعالجة تلك البيانات باستخدام NumPy و Pandas، وتصوّرها باستخدام Matplotlib و Seaborn,",
          "بالإضافة إلى ذلك، قمنا بتضمين دورة Jupyter Notebook، ومرجع Python السريع لتحديث مهاراتك البرمجية."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "تعلم أساسيات مكتبة NumPy في دورة الفيديو التالية التي أنشأها Keith Galli.",
          "في هذه الدورة، ستتعلم كيف يعمل NumPy وكيف يقارن بقوائم Python المُدمجة. سوف تتعلم أيضاً كيفية كتابة الكود البرمجي باستخدام NumPy، الفهرسه indexing ، وإعادة التشكيل reshaping والإحصاءات التطبيقية وأكثر من ذلك بكثير."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "مشاريع تحليل البيانات باستخدام Python",
        "intro": [
          "هناك العديد من الطرق لتحليل البيانات باستخدام Python. بإكمال هذه المشاريع، ستثبت أن لديك معرفة أساسية جيدة لتحليل البيانات مع Python.",
          "قم بإنهائها جميعاً للمطالبة بشهادة تحليل البيانات باستخدام Python."
        ]
      }
    }
  },
  "information-security": {
    "title": "أمن المعلومات",
    "intro": [
      "مع كل شيء نقوم به على الإنترنت، هناك كمية كبيرة من المعلومات الحساسة المعرضة للخطر: عناوين البريد الإلكتروني، كلمات المرور، أرقام الهواتف، وأكثر من ذلك بكثير.",
      "مع شهادة أمن المعلومات، ستبني تطبيق ويب آمن مع HelmetJS لتعلم أساسيات حماية معلومات الناس على الإنترنت.",
      "ستقوم أيضًا بإنشاء عميل TCP وماسح ضوئي Nmap ومنافذ port scanner في Python. سيساعدك هذا على تعلم أساسيات اختبار الاختراق penetration testing - وهو مكون مهم لأمن المعلومات الجيد."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "أمن المعلومات مع HelmetJS",
        "intro": [
          "تركز هذه الدورة البرمجية على HelmetJS، وهو نوع من البرامج الوسيطة middleware للتطبيقات القائمة على Express، التي تقوم تلقائياً بتعيين عناوين HTTP. وبهذه الطريقة يمكن أن تمنع المعلومات الحساسة من المرور عن غير قصد بين الخادم والعميل.",
          "سيساعدك إكمال الدورات أدناه على فهم كيفية حماية موقعك من السلوك الخبيث."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python لاختبار الاختراق",
        "intro": [
          "دورات الفيديو هذه تعلمكم اختبار الاختراق مع Python. مما ييعرف ايضا باسم pen test وهو هجوم محاكي ضد نظام للتحقق من مواطن الضعف.",
          "في هذه الدورة، سوف تتعلم عن sockets، إنشاء خادم TCP والعميل client، بناء ماسح ضوئي لخريطة Nmap، وأدوات وتقنيات أخرى يستخدمها مختبرو الاختراق يوميا."
        ]
      },
      "information-security-projects": {
        "title": "مشاريع أمن المعلومات",
        "intro": [
          "الآن حان الوقت لتشغيل مهاراتك الجديدة في أمن المعلومات. هذه المشاريع ستمنحك فرصة لتطبيق المهارات والمبادئ والمفاهيم التي تعلمتها.",
          "عندما تنتهي، سيكون لديك الكثير من مشاريع أمن المعلومات في حاففظتك، بالإضافة إلى الشهادة التي بإمكانك تقديمها للأصدقاء والعائلة ولأرباب العمل."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "تعلم الآلة باستخدام Python",
    "intro": [
      "يحتوي تعلم الآله علي العديد من التطبيقات العملية التي بإمكانك استخدامها في مشاريعك أو في مكان العمل.",
      "في شهادة تعلم الآلة باستخدام Python، ستستخدم إطار Tensorflow لبناء عدة شبكات عصبية واستكشاف تقنيات أكثر تقدماً مثل معالجة اللغات الطبيعية والتعلّم المعزز.",
      "ستغوص أيضًا في الشبكات العصبية ، وتتعلم المبادئ الكامنة وراء كيفية عمل الشبكات العصبية العميقة والمتكررة والتلافيفية."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "TensorFlow هو إطار مفتوح المصدر يجعل تعلم الآلة والشبكات العصبية أسهل استخداماً.",
          "تم إنشاء دورة الفيديو التالية بواسطة Tim Ruscica ، المعروف أيضًا باسم \"Tech With Tim\". سوف يساعدك على فهم TensorFlow وبعض إمكانياته القوية."
        ]
      },
      "how-neural-networks-work": {
        "title": "كيف تعمل الشبكات العصبية",
        "intro": [
          "الشبكات العصبية هي في صميم ما نسميه الذكاء الاصطناعي اليوم. لكن تاريخياً كان من الصعب فهمها. خاصة للمبتدئين في مجال تعلم الآلة.",
          "حتى لو كنت جديداً تماماً على الشبكات العصبية، دورات الفيديو هذه من قبل Brandon Rohrer سوف تجعلك مرتاحاً مع المفاهيم و الرياضيات الكامنة وراءها."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "مشاريع تعلم الآله باستخدام Python",
        "intro": [
          "تعلم الآله لديه العديد من التطبيقات العملية. بإكمال هذه المشاريع البرمجية المجانية و الصعبة، ستثبت أن لديك معرفة أساسية جيدة في تعلم الآله، وأنك مؤهل لشهادة تعلم الآله باستخدام Python."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "College Algebra with Python",
    "intro": [
      "This course is designed as a one-semester college course. It consists of instructional videos, with Google Colaboratory notebooks to follow along interactively, assignments, and challenging projects.",
      "As you go through each part of this course in sequence, you will gain a full understanding of Algebra and how to write Python code to solve Algebra problems.",
      "Throughout this course, you will also build your own Algebra Colab notebook that you will be able to use as your custom calculator. This course (and the code you write here) will give you the foundation for a deeper math and data science understanding."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Learn Ratios and Proportions",
        "intro": [
          "Your journey begins here as you learn how to set up a Colab Notebook that can run Python code. Then, use the notebook to follow along with the videos to learn ratios and proportions using Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Learn How to Solve for X",
        "intro": [
          "This unit will focus on how to solve for an unknown number (often referred to as \"x\") using written Algebra and Python code."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Learn Fractions and Decimals",
        "intro": [
          "This unit will focus on converting decimals to fractions and percents."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Learn Functions and Graphing",
        "intro": ["This unit will teach you about math functions."]
      },
      "learn-linear-functions": {
        "title": "Learn Linear Functions",
        "intro": [
          "This unit will show you how to develop linear equations from two points."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Learn Common Factors and Square Roots",
        "intro": [
          "In this unit, you will learn how to find common factors and divide them out. This will be useful when simplifying fractions and factoring square roots."
        ]
      },
      "build-a-multi-function-calculator": {
        "title": "Build a Multi-Function Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a multi-function calculator."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Learn How to Graph Systems of Equations",
        "intro": [
          "This unit will focus on graphing two equations on the same coordinate plane, so that you can see where the lines intersect."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Learn How to Solve Systems of Equations",
        "intro": [
          "In this unit, you will learn how to solve a system of two equations (with two variables) without graphing. You will see how you can factor an equation and solve for a certain variable in Python. By the end of this unit, you will be able to solve and graph the system with one block of code."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Learn Applications of Linear Systems",
        "intro": [
          "In this unit, you will see how you can use the algebra you learned so far to solve real world problems."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Learn Quadratic Equations",
        "intro": [
          "This unit will go beyond linear equations, to work with exponents and graph parabolas. You will learn how to find key points in parabolas and how to solve quadratic equations."
        ]
      },
      "build-a-graphing-calculator": {
        "title": "Build a Graphing Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a graphing calculator."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Learn Parent Graphs and Polynomials",
        "intro": [
          "This unit will show you many different types of \"parent\" graphs, the basic patterns that make up more complicated graphs. Polynomials are mathematical expressions with \"multiple things\" - the more complicated equations that are built with basic patterns. You will see what these graphs look like, how to modify them, and how to do this all with Python code."
        ]
      },
      "build-three-math-games": {
        "title": "Build Three Math Games",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build three math games."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Learn Business Applications of College Algebra",
        "intro": [
          "This unit will show you how to apply your solving and graphing skills to find cost, revenue, and profit. You will write code to develop a demand function from two points. You will see how price affects the profit graph and how all of these equations relate to each other."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Learn Simple and Compound Interest",
        "intro": [
          "This unit will show you how to calculate interest, loan payments, and the estimated value of investments. You will see the math formula and turn that into code. Because these formulas tend to get complicated, you will appreciate having the code where you can just modify a few values."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Learn Exponents and Logarithms",
        "intro": [
          "This unit will show you how exponents and logarithms are inverse functions, and how you can use these functions in various applications."
        ]
      },
      "build-a-financial-calculator": {
        "title": "Build a Financial Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a financial calculator."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "College Algebra with Python: Conclusion",
        "intro": [
          "This will be the last unit in this course. Let's look at how you can connect your Math and Python knowledge with external data."
        ]
      },
      "build-a-data-graph-explorer": {
        "title": "Build a Data Graph Explorer",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a data graph explorer."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "الإعداد لمقابلة عمل في البرمجة",
    "intro": [
      "إذا كنت تبحث عن تمارين برمجية مجانية للتحضير لمقابلة وظيفتك القادمة، فقد قمنا بتغطية بعض التمارين من أجلك.",
      "يحتوي هذا القسم على المئات من تحديات البرمجة التي تختبر معرفتك بالخوارزميات وهياكل البيانات والرياضيات. كما أنه يحتوي على عدد من المشاريع التي يمكن استخدامها لتعزيز مهاراتك أو إضافتها إلى محفظتك."
    ],
    "note": "",
    "blocks": {
      "algorithms": {
        "title": "الخوارزميات",
        "intro": [
          "هذه التمارين البرمجية المجانية سوف تعلمك عن بعض الخوارزميات الشائعة التي يحتمل أن تواجهها في الحياة الحقيقية. إنها فرصة عظيمة لتحسين منطقك ومهاراتك البرمجية.",
          "وكثيرا ما تستخدم هذه الخوارزميات في المقابلات المتعلقة بالعمل لاختبار مهارات المرشح. سنعطيك تفسيرات واضحة وموجزة لكيفية عمل هذه الخوارزميات المختلفة حتى تتمكن من تنفيذ حل لكل خوارزمية."
        ]
      },
      "data-structures": {
        "title": "هياكل البيانات",
        "intro": [
          "الغرض من دورات البرمجة المجانية هذه هو مساعدتك في التعامل مع هياكل البيانات الكبيرة والمعقدة التي قد لا تكون على معرفةً بها بعد.",
          "من خلال العمل من خلال الدورات أدناه ، ستتعرف على كل نوع من أنواع هياكل البيانات وتنفيذ الخوارزميات لتعزيز فهمك لها."
        ]
      },
      "take-home-projects": {
        "title": "مشاريع لتفيذها بالمنزل",
        "intro": [
          "لطالما كانت مقابلات العمل مرهقة. يُمنح المتقدمون للوظيفة أحيانًا مشروعًا يأخذونه إلى المنزل ليتم إكماله خارج المقابلة. عادةً ما تتطلب هذه الأنواع من المقابلات الكثير من العمل ، لكنها طريقة رائعة لأصحاب العمل لمعرفة كيفية أدائك في الوظيفة.",
          "قم يبناء مشاريع البرمجة الإضافية أدناه للحصول على تدريب إضافي. خذ وقتك، اجعلها عظيمة، وضعها على cv أو حافظتك للحصول على عرض من أرباب العمل المحتملين."
        ]
      },
      "rosetta-code": {
        "title": "Rosetta Code",
        "intro": [
          "قم برفع مستوى مهاراتك الإبداعية في حل المشاكل مع مهام البرمجة المجانية هذه من مكتبة \"Rosetta\" الكلاسيكية.",
          "يمكن أن تكون هذه التحديات صعبة، ولكنها ستدفع منطق الخوارزميات لديك إلى ارتفاعات جديدة.",
          "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>أسناد: Rosetta Code</a>"
        ]
      },
      "project-euler": {
        "title": "مشروع Euler",
        "intro": [
          "أكمل تحديات البرمجة أدناه، من أرشيف مشروع Euler الضخم. هذه سوف تزيد من معرفتك بالخوارزميات والرياضيات.",
          "وتتراوح هذه المشاكل بين الصعوبة، والتجربة وبالنسبة للكثيرين فهي الحافز لتعلّم هذه السلسلة. هذا يعني أنه بحل مشكلة واحدة فإنك ستكتسب مفهوم جديد يسمح لك بالتعامل مع مشكلة لم يكن من الممكن الوصول إليها من قبل. هل يمكنك إنهائها كلها؟"
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "مشروع أودين",
    "intro": [
      "The Odin Project is one of those \"What I wish I had when I was learning\" resources. ",
      "Not everyone has access to a computer science education or the funds to attend an intensive coding school and neither of those is right for everyone anyway.",
      "This project is designed to fill in the gap for people who are trying to hack it on their own but still want a high quality education."
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Learn HTML Foundations",
        "intro": ["A description is to be determined"]
      },
      "top-build-a-recipe-project": {
        "title": "Learn HTML Foundations by Building a Recipe Page",
        "intro": ["A description is to be determined"]
      }
    }
  },
  "misc-text": {
    "certification": "شهادة {{cert}}",
    "browse-other": "تصفح الشهادات المجانية الأخرى\n(نوصي بالقيام بها بالترتيب)",
    "courses": "الدورات",
    "steps": "الخطوات",
    "expand": "توسيع الدورة",
    "collapse": "أغلاق الدورة",
    "legacy-header": "الدورات القديمة",
    "legacy-desc": "لم تعد هذه الدورات التدريبية جزءًا من مسار الشهادة ، ولكنها لا تزال متاحة لك لتعزيز تعلمك.",
    "legacy-go-back": "الذَّهاب إلى النسخة الحالية من المنهج الدراسي.",
    "new-rwd-desc": "لقد حدثنا منهج Responsive Web Design. أذا كنت تعمل على منهج RWD السابق, يذل ما فعلته محفوظ! يمكنك العثور عليه في قسم تسميم الويب المتجاوب التراثي.",
    "new-rwd-article": "ونحن نشجعكم على قراءة التغييرات التي أجريناها والنظر في استكشاف المنهج المستكملة.",
    "viewing-upcoming-change": "أنت تنظر إلى صفحة تجريبية. ",
    "go-back-to-learn": "العودة إلى النسخة المستقرة من المنهج الدراسي.",
    "read-database-cert-article": "الرجاء قراءة هذا الموضوع قبل المتابعة.",
    "enable-cookies": "يجب عليك السماح باستخدام third-party cookies قبل البَدْء.",
    "english-only": "الدورات الدراسية في هذا القسم متاحة باللغة الإنكليزية فقط. ونحن قادرون فقط على تَرْجَمَة العناوين والمقدمات في الوقت الحاضر، وليس الدروس ذاتها."
  }
}
