{
  "name": "Basic Front End Development Projects",
  "order": 5.5,
  "time": "50 hours",
  "helpRoom": "HelpFrontEnd",
  "challenges": [
    {
      "id": "bd7158d8c442eddfbeb5bd1f",
      "title": "Get Set for our Front End Development Projects",
      "description": [
        [
          "//i.imgur.com/OAD6SJz.png",
          "An image of a Simon game, one our front end projects.",
          "Our front end development projects will give you a chance to apply the front end skills you've developed up to this point. We'll use a popular browser-based code editor called CodePen.",
          ""
        ],
        [
          "//i.imgur.com/WBetuBa.jpg",
          "A programmer punching through his laptop screen in frustration.",
          "These projects are hard. It takes most campers several days to build each project. You will get frustrated. But don't quit. This gets easier with practice.",
          ""
        ],
        [
          "//i.imgur.com/p2TpOQd.jpg",
          "A cute dog jumping over a hurdle and winking and pointing his paw at you.",
          "When you get stuck, just use the Read-Search-Ask methodology. Don't worry - you've got this.",
          ""
        ],
        [
          "//i.imgur.com/G1saeDt.gif",
          "A gif showing how to create a Codepen account.",
          "For our front end project challenges, we'll use a popular browser-based code editor called CodePen. Click the \"Open link in new tab\" button below to open CodePen's signup page. Fill out the form and click \"Sign up\". <br><div class=\"small\">Note: If you already have a CodePen account, you can skip this step by clicking \"Open link in new tab\", closing the new tab that opens, then clicking \"go to my next step\". We removed our \"skip step\" button because many people would just click it repeatedly without doing these important steps.</div>",
          "https://codepen.io/signup/free"
        ],
        [
          "//i.imgur.com/U4y9RJ1.gif",
          "A gif showing that you can type \"hello world\" will output \"hello world\" in the preview window. You can also drag windows to resize them, and change their orientation.",
          "In the HTML box, create an <code>h1</code> element with the text \"Hello World\". You can drag the frames around to resize them. You can also click the \"Change View\" button and change the orientation of the frames.",
          ""
        ],
        [
          "//i.imgur.com/G9KFQDL.gif",
          "A gif showing the process of adding Bootstrap to your pen.",
          "Click the gear in the upper left hand corner of the CSS box, then scroll down to \"Quick add\" and choose Bootstrap. Now give your <code>h1</code> element the class of <code>text-primary</code> to change its color and prove that Bootstrap is now available.",
          ""
        ],
        [
          "//i.imgur.com/m0pWik2.gif",
          "A gif showing the process of turning off auto update preview",
          "When using CodePen and Ajax, it is a good idea to turn off automatic preview updating so API calls are not made too often. Too many API calls can sometimes lead to temporary blockages, and may require waiting periods before they can be used again. <br> <div class=\"small\"> To disable automatic preview updating click the \"Settings\" button at the top of the page, then click the \"Behavior\" tab. At the bottom of the page, un-check \"AUTO UPDATE PREVIEW\". Now press \"Run\" at the top of the page to update the preview, and click \"Save\".</div>",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "isRequired": false,
      "challengeType": 7,
      "translations": {
        "es": {
          "title": "Prepárate para los Proyectos de Desarrollo de Interfaces",
          "description": [
            [
              "//i.imgur.com/OAD6SJz.png",
              "Una imagen del juego Simón, uno de nuestros proyectos de interfaz.",
              "Nuestros proyectos de desarrollo de interfaces te darán oportunidad de aplicar las habilidades con interfaces que has desarrollado hasta este momento.  Usaremos un editor de código basado en el navegador llamado CodePen.",
              ""
            ],
            [
              "//i.imgur.com/WBetuBa.jpg",
              "Un programador frustado golpeando la pantalla de su computador.",
              "Nuestros desafíos sobre algoritmos son difíciles.  Algunos pueden requerir muchas horas para resolverse.  Podrás frustarte, pero no te rindas. Se vuelve fácil con práctica.",
              ""
            ],
            [
              "//i.imgur.com/p2TpOQd.jpg",
              "Un tierno perro que salta sobre un obstáculo, pica el ojo y te apunta con su pata.",
              "Cuando te atasques, usa la metodología Leer-Buscar-Preguntar. No te preocupes -  lo tienes resuelto.",
              ""
            ],
            [
              "//i.imgur.com/G1saeDt.gif",
              "Un gif que muestra cómo crear una cuenta en Codepen.",
              "Para nuestros desafíos de interfaces, usaremos un editor de código basado en el navegador que es muy famoso llamado Codepen. Pulsa en el botón de abajo \"Open link in new tab\" para abrir la página de registro de CodePen. Rellena el formulario y pulsa \"Sign up\". <br><div class=\"small\">Nota: Si ya tienes una cuenta de CodePen, puedes omitir este paso pulsando \"Open link in new tab\", cierra la nueva pestaña que se abre, entonces pulsa \"go to my next step\". Eliminamos nuestro botón \"skip step\" porque mucha gente solamente pulsa el botón sin realizar estos importantes pasos.</div>",
              "https://codepen.io/signup/free"
            ],
            [
              "//i.imgur.com/U4y9RJ1.gif",
              "Un gif que muestra que puedes escribir \"hello world\" en el editor, lo cual escribirá \"hello world\" en la ventana de vista previa. También puedes mover las ventanas para cambiar su tamaño, y cambiar su orientación.",
              "En la ventana de HTML, crea un elemento h1 con el texto \"Hola mundo\". Puedes arrastrar los bordes de las ventanas para cambiar su tamaño. También puedes pulsar el botón de \"Change View\" para cambiar la orientación de las ventanas.",
              ""
            ],
            [
              "//i.imgur.com/G9KFQDL.gif",
              "Un gif que muestra el proceso de agregar Bootstrap a tu proyecto.",
              "Pulsa el engrane en la esquina superior izquierda de la ventana de CSS, luego ve hacia abajo hasta donde dice \"Quick add\" y elige Bootstrap. Ahora dale a tu elemento h1 la clase \"text-primary\" para cambiar su color y verificar que Bootstrap está activado.",
              ""
            ]
          ]
        },
        "pt-br": {
          "title": "Prepare-se para nossos Projetos de Desenvolvimento Front End",
          "description": [
            [
              "//i.imgur.com/OAD6SJz.png",
              "A imagem de um jogo Simon, um de nossos projetos front end.",
              "Nossos projetos de Desenvolvimento front end vão dar a você a chance de aplicar as habilidades front end que você desenvolveu até esse ponto. Nós vamos usar um editor popular chamado CodePen que funciona direto no navegador.",
              ""
            ],
            [
              "//i.imgur.com/WBetuBa.jpg",
              "Um programador atravessando a tela de seu laptop com um soco em frustração.",
              "Esses projetos são difíceis. A maioria dos campistas leva alguns dias para contruir cada projeto. Você vai ficar frustrado. Mas não desista. Isso fica mais fácil com a prática.",
              ""
            ],
            [
              "//i.imgur.com/p2TpOQd.jpg",
              "Um cachorro fofo pulando sobre um obstáculo, piscando e apontando sua pata a você.",
              "Quando ficar travado, use a metodologia Ler-Buscar-Perguntar. Não se preocupe - você consegue.",
              ""
            ],
            [
              "//i.imgur.com/G1saeDt.gif",
              "Um gif mostrando com criar uma conta CodePen.",
              "Para nossos projetos front end, usaremos um popular editor de código baseado em navegador chamado CodePen. Clique no botão \"Open link in new tab\" abaixo para abrir a página de resgistro do CodePen. Preencha o formulário e clique em \"Sign up\". <br><div class=\"small\">Nota: Se você já tem uma conta CodePen, você pode pular esse passo clicando em \"Open link in new tab\", fechando a nova aba que abrir, e clicando em \"go to my next step\". Nós removemos nosso botão \"skip step\" pois muitas pessoas iam simplesmente clicar nele repetidamente sem passar por esses passos importantes.</div>",
              "https://codepen.io/signup/free"
            ],
            [
              "//i.imgur.com/U4y9RJ1.gif",
              "Um gif mostrando que você pode digitar \"hello world\" e será mostrado \"hello world\" na janela de visualização. Você também pode arrastar janelas para redimensioná-las e mudar a orientação das mesmas.",
              "Na caixa do HTML, crie um elemento <code>h1</code> com o texto \"Hello World\". Você pode arrastar as bordas para redimensioná-las. Você pode também clicar no botão \"Change View\" e mudar a orientação das janelas.",
              ""
            ],
            [
              "//i.imgur.com/G9KFQDL.gif",
              "Um gif mostrando como adicionar o Bootstrap à sua pen.",
              "Clique na engrenagem no canto superior esquerdo da caixa do CSS, então role para baixo até \"Quick add\" e escolha Bootstrap. Agora adicione ao seu elemento <code>h1</code> a classe <code>text-primary</code> para mudar sua cor e provar que o Bootstrap agora está disponível.",
              ""
            ],
            [
              "//i.imgur.com/m0pWik2.gif",
              "Um gif mostrando o processo de desativar o update automático da janela de visualização",
              "Ao usar CodePen e Ajax, é uma boa idea desativar o update automático da janela de visualização para que as chamadas para as APIs não sejam feitas a todo momento. Muitas chamadas para API pode levar à bloqueios temporários e podem requerer períodos de esperar para que possam ser usadas novamente. <br> <div class=\"small\"> Para desativar o update automático da janela de visualização clique no botão \"Settings\" no topo da página, então clique na aba \"Behavior\". No final da página, desmarque \"AUTO UPDATE PREVIEW\". Agora clique em \"Run\" no topo da página para atualizar a janela de visualização e clique \"Save\".</div>",
              ""
            ]
          ]
        },
        "ru": {
          "title": "Приготовьтесь к разработке фронтенд проектов",
          "description": [
            [
              "//i.imgur.com/OAD6SJz.png",
              "Игра Саймона - один из фронтенд проектов.",
              "Наши фронтенд проекты дадут вам шанс применить полученные к этому моменту знания по фронтенд разработке. Мы будем использовать популярный браузерный редактор кода - CodePen.",
              ""
            ],
            [
              "//i.imgur.com/WBetuBa.jpg",
              "Программист от отчаяния кулаком пробивает экран своего ноутбука.",
              "Это трудные проекты. Разработка каждого занимает у большинства кэмперов несколько дней. У вас может возникнуть чувство отчаяния. Несмотря на это не сдавайтесь. С практикой этот процесс станет проще.",
              ""
            ],
            [
              "//i.imgur.com/p2TpOQd.jpg",
              "Милый пес, прыгающий через препятствие, указывает на вас лапой и подмигивает.",
              "Если что-то не получается, воспользуйтесь Read-Search-Ask. Не волнуйтесь - вы сможете это сделать.",
              ""
            ],
            [
              "//i.imgur.com/G1saeDt.gif",
              "Гифка показывающая как зарегистрироваться на CodePen.",
              "Для заданий по фронтенд разработке, мы будем использовать популярный браузерный редактор кода под названием CodePen. Откройте страницу регистрации на сайте CodePen, нажав на расположенную чуть ниже кнопку \"Open link in new tab\". Заполните форму и нажмите \"Sign up\". <br><div class=\"small\">Замечание: Если у вас уже есть аккаунт CodePen, то этот шаг можно пропустить: нажмите на кнопку \"Open link in new tab\", закройте появившуюся вкладку и затем кликните \"go to my next step\". Мы убрали кнопку \"skip step\", ввиду того что большинство людей просто нажимали бы ее несколько раз подряд и пропускали бы эти важные инструкции.</div>",
              "https://codepen.io/signup/free"
            ],
            [
              "//i.imgur.com/U4y9RJ1.gif",
              "Гифка показывающая набор в редакторе заголовка с текстом \"hello world\", который затем отображается в окошке предпросмотра. А также указывающая как изменить размер окон редактора или поменять их расположение.",
              "В окошке HTML создайте элемент h1 с текстом \"Hello World\". Ухватив края окон можно изменить их размер. А нажав на кнопку \"Change View\" поменять их расположение.",
              ""
            ],
            [
              "//i.imgur.com/G9KFQDL.gif",
              "Гифка показывающая как в CodePen добавить к проекту Bootstrap.",
              "Нажмите на звездочку в левом верхнем углу окошка CSS, найдите внизу поле \"Quick add\" и выберите в нем Bootstrap. Добавьте к элементу h1 класс \"text-primary\", чтобы изменить его цвет и удостовериться, что Bootstrap подключен.",
              ""
            ]
          ]
        }
      }
    },
    {
      "id": "bd7158d8c442eddfaeb5bd18",
      "title": "Build a Tribute Page",
      "description": [
        "<strong>Objective:</strong> Build a <a href='https://codepen.io' target='_blank'>CodePen.io</a> app that is functionally similar to this: <a href='https://codepen.io/freeCodeCamp/full/NNvBQW/' target='_blank'>https://codepen.io/freeCodeCamp/full/NNvBQW/</a>.",
        "Fulfill the following <a href='https://en.wikipedia.org/wiki/User_story' target='_blank'>user stories</a>. Use whichever libraries you need. Give it your own personal style.",
        "<strong>User Story:</strong> I can view a tribute page with an image and text.",
        "<strong>User Story:</strong> I can click on a link that will take me to an external website with further information on the topic.",
        "Remember to use <a href='http://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> if you get stuck.",
        "When you are finished, click the \"I've completed this challenge\" button and include a link to your CodePen.",
        "You can get feedback on your project by sharing it with your friends on Facebook."
      ],
      "releasedOn": "January 1, 2016",
      "challengeSeed": [
        "qqrnzmqCGDw"
      ],
      "tests": [],
      "type": "zipline",
      "isRequired": true,
      "challengeType": 3,
      "translations": {
        "es": {
          "title": "Construye una página Tributo",
          "description": [
            "<strong>Objetivo:</strong> Crea una aplicación con <a href='https://codepen.io' target='_blank'>CodePen.io</a> que funcionalmente sea similar a esta: <a href='https://codepen.io/freeCodeCamp/full/NNvBQW/' target='_blank'>https://codepen.io/freeCodeCamp/full/NNvBQW/</a>",
            "<strong>Regla #1:</strong> No veas el código del proyecto de ejemplo. Encuentra la forma de hacerlo por tu cuenta.",
            "<strong>Regla #2:</strong> Satisface las siguientes <a href='https://en.wikipedia.org/wiki/User_story' target='_blank'>historias de usuario</a>. Usa cualquier librería que necesites. Dale tu estilo personal.",
            "<strong>Historia de usuario:</strong> Puedo ver una página tributo con una imagen y texto.",
            "<strong>Historia de usuario:</strong> Puedo pulsar en un enlace que me llevará a un sitio web externo con mayor información sobre el tema.",
            "Recuerda utilizar <a href='http://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Leer-Buscar-Preguntar</a> si te sientes atascado.",
            "Cuando hayas terminado, pulsa el botón \"I've completed this challenge\" e incluye un link a tu CodePen. ",
            "Puedes obtener retroalimentación sobre tu proyecto por parte de otros campistas, compartiéndolo en nuestra <a href='//gitter.im/freecodecamp/codereview' target='_blank'>Sala de chat para revisión de código</a>. También puedes compartirlo en Twitter y en el campamento de tu ciudad (en Facebook)."
          ]
        },
        "pt-br": {
          "title": "Construa uma Página Tributo",
          "description": [
            "<strong>Objetivo:</strong> Construa uma aplicação em <a href='https://codepen.io' target='_blank'>CodePen.io</a> cuja funcionalidade seja similar a esta: <a href='https://codepen.io/freeCodeCamp/full/NNvBQW/' target='_blank'>https://codepen.io/freeCodeCamp/full/NNvBQW/</a>.",
            "Satisfaça as seguintes <a href='https://pt.wikipedia.org/wiki/Hist%C3%B3ria_de_usu%C3%A1rio' target='_blank'>histórias de usuário</a>. Utilize qualquer biblioteca ou API que você precisar. Dê o seu próprio estilo pessoal.",
            "<strong>História de usuário:</strong> Eu posso ver uma página tributo com uma imagem e um texto.",
            "<strong>História de usuário:</strong> Eu posso clicar em um link que vai me levar a um site externo com mais informações sobre o tópico.",
            "Lembre-se de utilizar <a href='http://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Ler-Buscar-Perguntar</a> se você tiver dificuldades.",
            "Quando tiver terminado, clique no botão \"Eu concluí este desafio\" e inclua um link para o seu projeto no CodePen. ",
            "Você pode obter feedback sobre o seu projeto compartilhando-o com os seus amigos no Facebook."
          ]
        },
        "ru": {
          "title": "Создайте страницу посвященную тому что вас вдохновляет",
          "description": [
            "<strong>Задание:</strong> Создайте приложение <a href='https://codepen.io' target='_blank'>CodePen.io</a> которое функционально соответствует вот этому: <a href='https://codepen.io/freeCodeCamp/full/NNvBQW/' target='_blank'>https://codepen.io/freeCodeCamp/full/NNvBQW/</a>.",
            "<strong>Правило #1:</strong> Не подсматривайте код приведенного на CodePen примера. Напишите его самостоятельно.",
            "<strong>Правило #2:</strong> Реализуйте следующие <a href='https://ru.wikipedia.org/wiki/User_story' target='_blank'>пользовательские истории</a>. Используйте любые библиотеки, которые потребуются. Оформите приложение в вашем собственном стиле.",
            "<strong>Пользовательская история:</strong> Я могу видеть на странице изображение и текст.",
            "<strong>Пользовательская история:</strong> Я могу нажать на ссылку, которая ведет на внешнюю страницу с дополнительной информацией по теме.",
            "Если что-то не получается, воспользуйтесь <a href='http://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a>.",
            "Когда выполните задание кликните кнопку \"I've completed this challenge\" и добавьте ссылку на ваш CodePen.",
            "Вы можете получить отзыв о вашем проекте от коллег, поделившись ссылкой на него в нашем <a href='//gitter.im/freecodecamp/codereview' target='_blank'>чате для рассмотрения кода</a>. Также вы можете поделиться ею через Twitter и на странице Free Code Camp вашего города на Facebook."
          ]
        }
      }
    },
    {
      "id": "bd7158d8c242eddfaeb5bd13",
      "title": "Build a Personal Portfolio Webpage",
      "description": [
        "<strong>Objective:</strong> Build a <a href='https://codepen.io' target='_blank'>CodePen.io</a> app that is functionally similar to this: <a href='https://codepen.io/freeCodeCamp/full/YqLyXB/' target='_blank'>https://codepen.io/freeCodeCamp/full/YqLyXB/</a>.",
        "Fulfill the following <a href='https://en.wikipedia.org/wiki/User_story' target='_blank'>user stories</a>. Use whichever libraries you need. Give it your own personal style.",
        "<strong>User Story:</strong> I can access all of the portfolio webpage's content just by scrolling.",
        "<strong>User Story:</strong> I can click different buttons that will take me to the portfolio creator's different social media pages.",
        "<strong>User Story:</strong> I can see thumbnail images of different projects the portfolio creator has built (if you haven't built any websites before, use placeholders.)",
        "<strong>User Story:</strong> I can navigate to different sections of the webpage by clicking buttons in the navigation.",
        "Don't worry if you don't have anything to showcase on your portfolio yet - you will build several apps on the next few CodePen challenges, and can come back and update your portfolio later.",
        "There are many great portfolio templates out there already. However, you should consider building your portfolio page as much as you can from the ground up. Using Bootstrap can help make this process much easier for you.",
        "Remember to use <a href='http://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a> if you get stuck.",
        "When you are finished, click the \"I've completed this challenge\" button and include a link to your CodePen. ",
        "You can get feedback on your project by sharing it with your friends on Facebook."
      ],
      "challengeSeed": [
        "V72o34gY4Lw"
      ],
      "tests": [],
      "type": "zipline",
      "isRequired": true,
      "challengeType": 3,
      "translations": {
        "es": {
          "title": "Construye una página web para tu portafolio",
          "description": [
            "<strong>Objetivo:</strong> Crea una aplicación con <a href='https://codepen.io' target='_blank'>CodePen.io</a> cuya funcionalidad sea similar a la de esta: <a href='https://codepen.io/freeCodeCamp/full/QNmvEL/' target='_blank'>https://codepen.io/freeCodeCamp/full/QNmvEL/</a>.",
            "<strong>Regla #1:</strong> No veas el código del proyecto de ejemplo. Encuentra la forma de hacerlo por tu cuenta.",
            "<strong>Regla #2:</strong> Satisface las siguientes <a href='https://en.wikipedia.org/wiki/User_story' target='_blank'>historias de usuario</a>. Usa cualquier librería que necesites. Dale tu estilo personal.",
            "<strong>Historia de usuario:</strong> Puedo acceder a todo el contenido de la página del portafolio con sólo desplazarme en la ventana.",
            "<strong>Historia de usuario:</strong> Puedo pulsar diferentes botones que me llevarán a las páginas de las diferentes cuentas de redes sociales del creador del portafolio.",
            "<strong>Historia de usuario:</strong> Puedo ver una imagenes en miniatura de los diferentes proyectos que el creador del portafolio ha construido (si no has construido ningún sitio web antes, usa marcadores de posición.)",
            "<strong>Historia de usuario:</strong> Puedo navegar a las diferentes secciones de la página web pulsando botones de navegación.",
            "No te preocupes si no tienes nada que mostrar en tu portafolio todavía - en los siguientes desafíos crearás varias aplicaciones en CodePen, así que puedes regresar luego para actualizar tu portafolio.",
            "Hay varias plantillas buenas, pero para este desafío, tendrás que construir la página web de tu portafolio completamente por tu cuenta. Usar Bootstrap hará el trabajo mucho más fácil para ti.",
            "Recuerda utilizar <a href='http://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Leer-Buscar-Preguntar</a> si te sientes atascado.",
            "Cuando hayas terminado, pulsa el botón \"I've completed this challenge\" e incluye un link a tu CodePen. ",
            "Puedes obtener retroalimentación sobre tu proyecto por parte de otros campistas, compartiéndolo en nuestra <a href='//gitter.im/freecodecamp/codereview' target='_blank'>Sala de chat para revisión de código</a>. También puedes compartirlo en Twitter y en el campamento de tu ciudad (en Facebook)."
          ]
        },
        "pt-br": {
          "title": "Construa uma Página de Portfólio Pessoal",
          "description": [
            "<strong>Objetivo:</strong> Construa uma aplicação em <a href='https://codepen.io' target='_blank'>CodePen.io</a> cuja funcionalidade seja similar a esta: <a href='https://codepen.io/freeCodeCamp/full/YqLyXB/' target='_blank'>https://codepen.io/freeCodeCamp/full/YqLyXB/</a>.",
            "Satisfaça as seguintes <a href='https://pt.wikipedia.org/wiki/Hist%C3%B3ria_de_usu%C3%A1rio' target='_blank'>histórias de usuário</a>. Utilize qualquer biblioteca ou API que você precisar. Dê o seu próprio estilo pessoal.",
            "<strong>História de usuário:</strong> Eu posso acessar todo o conteúdo da página somente rolando o scroll do mouse.",
            "<strong>História de usuário:</strong> Eu posso clicar em diferentes botões que vão me levar a diferentes páginas de mídias sociais do criador do portfólio.",
            "<strong>História de usuário:</strong> Eu posso ver pequenas imagens de diferentes projetos que o criador do portfólio construiu (se você não construiu nenhum site antes, use imagens genéricas.)",
            "<strong>História de usuário:</strong> Eu navego para diferentes seções do site clicando em botões na seção de navegação.",
            "Não se preocupe se você não tem nada para mostrar em seu portfólio ainda - você vai construir várias aplicações nos próximos desafios e depois é só voltar e atualizar seu portfólio.",
            "Existem excelentes portfólios pela web. No entando, voce deve considerar construir sua página de portfólio do zero o máximo que você conseguir. Usar o Bootstrap pode tornar esse processo mais simples para você.",
            "Lembre-se de utilizar <a href='http://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Ler-Buscar-Perguntar</a> se você tiver dificuldades.",
            "Quando tiver terminado, clique no botão \"Eu concluí este desafio\" e inclua um link para o seu projeto no CodePen. ",
            "Você pode obter feedback sobre o seu projeto compartilhando-o com os seus amigos no Facebook."
          ]
        },
        "ru": {
          "title": "Создайте сайт-портфолио",
          "description": [
            "<strong>Задание:</strong> Создайте приложение <a href='https://codepen.io' target='_blank'>CodePen.io</a> которое функционально соответствует вот этому: <a href='https://codepen.io/freeCodeCamp/full/QNmvEL/' target='_blank'>https://codepen.io/freeCodeCamp/full/QNmvEL/</a>.",
            "<strong>Правило #1:</strong> Не подсматривайте код приведенного на CodePen примера. Напишите его самостоятельно.",
            "<strong>Правило #2:</strong> Реализуйте следующие <a href='https://ru.wikipedia.org/wiki/User_story' target='_blank'>пользовательские истории</a>. Используйте любые библиотеки, которые потребуются. Оформите приложение в вашем собственном стиле.",
            "<strong>Пользовательская история:</strong> Я могу получить доступ ко всей информации на странице просто прокрутив ее сверху вниз.",
            "<strong>Пользовательская история:</strong> Я могу нажать на различные кнопки и перейти к социальным страницам владельца портфолио.",
            "<strong>Пользовательская история:</strong> Я могу увидеть эскизы проектов созданных владельцем портфолио (используйте временную картинку если у вас пока нет собственных веб-страниц).",
            "<strong>Пользовательская история:</strong> Я могу перемещаться к различным частям страницы нажимая на соответствующие навигационные кнопки.",
            "Не переживайте если вам пока нечего показать в портфолио - вы создадите несколько веб приложений в следующих заданиях, а затем вернетесь и обновите портфолио.",
            "В сети существует много шаблонов для портфолио, но в этом задании вам необходимо создать собственную уникальную страницу. Используя Bootstrap, сделать это будет намного проще.",
            "Если что-то не получается, воспользуйтесь <a href='http://forum.freecodecamp.com/t/how-to-get-help-when-you-are-stuck/19514' target='_blank'>Read-Search-Ask</a>.",
            "Когда выполните задание кликните кнопку \"I've completed this challenge\" и добавьте ссылку на ваш CodePen.",
            "Вы можете получить отзыв о вашем проекте от коллег, поделившись ссылкой на него в нашем <a href='//gitter.im/freecodecamp/codereview' target='_blank'>чате для рассмотрения кода</a>. Также вы можете поделиться ею через Twitter и на странице Free Code Camp вашего города на Facebook."
          ]
        }
      }
    }
  ]
}
