{
  "title": "Get Set for Free Code Camp",
  "order": 0.001,
  "challenges": [
    {
      "id": "bd7124d8c441eddfaeb5bdef",
      "title": "Waypoint: Learn how Free Code Camp Works",
      "difficulty": 0.01,
      "challengeSeed": ["125407438"],
      "description": [
        "Watch this 1-minute video, or simply read this summary:",
        "Welcome to Free Code Camp. We're an open source community of busy people who learn to code, then practice by building projects for nonprofits.",
        "Learning to code is hard. It takes a lot of practice.",
        "So we've focused on making Free Code Camp as convenient and accessible as possible.",
        "Free Code Camp is self-paced, browser-based, and free.",
        "During the first 800 hours of Free Code Camp, you'll learn technologies like HTML5, Node.js and databases.",
        "During the last 800 hours, you'll build several real-life projects for nonprofits.",
        "By the time you finish, you'll be a job-ready coder who has a portfolio of apps with happy users to prove it.",
        "We'll even help you meet other coders in your city and find a coding job.",
        "We'll provide you with the most rigorous curriculum and the most supportive community on earth. All you need to do sit down, day after day, and put in the hard work.",
        "Now it's time to join our chat room. Click the \"I've completed this challenge\" button to move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Aprende sobre como funciona Free Code Camp",
      "descriptionEs": [
        "Mira el video de 1 minuto o simplemente lee este resumen:",
        "Bienvenido a Free Code Camp. Somos una comunidad de personas ocupadas tratando de aprender a programar construyendo proyectos para empresas sin fines de lucro.",
        "Hemos construido esta comunidad porque aprender a programar es dificil; pero cualquiera que se pueda mantener motivado puede aprender a programar. Para mantenerte motivado, solo necesitas: <ol><li>hacerte amigo o amiga de personas que sepan programar</li><li>programar un poco cada día</li></ol>",
        "Todos nuestros desafíos son <ol><li>gratuitos</li><li>manejados a tu propio ritmo</li><li>basados en tu navegador</li></ol>",
        "Estaremos trabajando <ol><li>200 horas aprendiendo a utilizar herramientas como HTML, CSS, JavaScript, Node.js y bases de datos</li><li>600 horas construyendo proyectos prácticos</li><li>800 horas construyendo soluciones full stack para empresas sin fines de lucro</li></ol>",
        "Al finalizar <ol><li>seremos buenos en programación</li><li>tendremos un portafolio con apps con usuarios contentos que puedan abogar por nuestro trabajo</li></ol>",
        "Una vez que completes el Free Code Camp, serás capaz de obtener un trabajo como desarrollador. Hay muchas posiciones de trabajo que están en búsqueda de programadores calificados.",
        "Ahora es el momento de ingresar a nuestra sala de chat. Dale click al botón de \"I've completed this challenge\" para continuar con el siguiente desafío."
      ],
      "namePt": "",
      "descriptionPt": [],
      "nameDe": "Waypoint: Lerne wie Free Code Camp funktioniert",
      "descriptionDe": [
        "Sieh dir das kurze Video an oder lies einfach diese Übersicht:",
        "Willkommen im Free Code Camp. Wir sind eine Community aus eifrigen Personen, die Programmieren lernen, indem sie Projekte für gemeinnützige Organisationen umsetzen.",
        "Programmieren zu lernen ist hart, weshalb wir diese Community ins Leben gerufen haben. Jeder, der motiviert bleiben kann, ist auch in der Lage Programmieren zu lernen. Und um motiviert zu bleiben, musst du nur: <ol><li>Freunde finden, die programmieren</li><li>jeden Tag ein wenig programmieren</li></ol>",
        "All unsere Challenges sind <ol><li>kostenlos</li><li>selbstbestimmt</li><li>Browser-basiert</li></ol>",
        "Wir werden <ol><li>200 Stunden mit Werkzeugen wie HTML, CSS, JavaScript, Node.js und Datenbanken arbeiten</li><li>600 Stunden Projekte umsetzen</li><li>800 Stunden komplette Lösungen für gemeinnützige Organisationen erstellen</li></ol>",
        "Am Ende werden wir <ol><li>gut im Programmieren sein</li><li>ein Portfolio aus Anwendungen mit zufriedenen Nutzern vorweisen können</li></ol>",
        "Wenn du das Free Code Camp abgeschlossen hast, wirst du in der Lage sein einen Job in der Branche zu bekommen. Es gibt sehr viel mehr offene Stellen als fähige Programmierer, um sie zu besetzen.",
        "Jetzt wird es Zeit unserem Chat beizutreten. Klicke auf \"I've completed this challenge\" um zur nächsten Challenge fortzufahren."
      ]
    },
    {
      "id": "bd7125d8c441eddfaeb5bd0f",
      "title": "Waypoint: Join Our Chat Room",
      "difficulty": 0.02,
      "challengeSeed": ["131574135"],
      "description": [
        "Now we're going to join the Free Code Camp chat room. You can come here any time of day to hang out, ask questions, or find another camper to pair program with.",
        "Create an account with GitHub here: <a href='https://github.com/join' target='_blank'>https://github.com/join</a>.",
        "Click the pixel art in the upper right hand corner of GitHub, then choose settings. Upload a picture of yourself. A picture of your face works best. This is how people will see you in our chat rooms, so put your best foot forward. You can add your city and your personal website if you have one.",
        "Go to Free Code Camp's open-source repository: <a href='//github.com/freecodecamp/freecodecamp' target='_blank'>https://github.com/freecodecamp/freecodecamp</a>.",
        "You can \"star\" this repository by clicking the star button in the upper right hand corner.",
        "Later, you'll be able to fork this repository if you'd like to contribute to our open source codebase.",
        "Join our main chat room: <a href='https://gitter.im/FreeCodeCamp/FreeCodeCamp' target='_blank'>https://gitter.im/FreeCodeCamp/FreeCodeCamp</a>.",
        "Once you're in our chat room, introduce yourself by saying : \"Hello world!\".",
        "Tell your fellow campers how you found Free Code Camp. Also tell us why you want to learn to code.",
        "We have a busy chat room, so be sure to configure your notification settings in the top right corner.",
        "Please note that all of our chat rooms are visible to the public, so if you need to share  sensative information like an email address or phone number, do it in a private message.",
        "Also Join our help chat room: <a href='https://gitter.im/FreeCodeCamp/help' target='_blank'>https://gitter.im/FreeCodeCamp/help</a>, where you can get help with our challenges in real time.",
        "Keep our chat room open while you work through our other challenges. That way, you ask for help if you get stuck on a challenge. You can also socialize when you feel like taking a break.",
        "You can also download a desktop or mobile chat application here: <a href='https://gitter.im/apps' target='_blank'>https://gitter.im/apps</a>",
        "You can also access this chat room by clicking the \"Chat\" button in the upper right hand corner.",
        "In order to keep our community a friendly and positive place to learn to code, please read and follow our Code of Conduct: <a href='https://github.com/FreeCodeCamp/freecodecamp/wiki/Code-of-Conduct' target='_blank'>https://github.com/FreeCodeCamp/freecodecamp/wiki/Code-of-Conduct</a>",
        "Now you're ready to move on. Click the \"I've completed this challenge\" button to move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Únete a Nuestra Sala de Chat",
      "descriptionEs": [
        "Ahora vamos a unirnos a la sala de chat de Free Code Camp. Puedes ingresar en cualquier momento para pasar el rato, hacer preguntas o para encontrar algún otro camper para programar en pares.",
        "Asegurate de que tu cuenta de Free Code Camp incluya tu dirección de correo electrónico. Vale recalcar que si bien tu dirección de correo electrónico será invisible para el público, Slack lo hará visible para otros campers en las salas de chat. Puedes ingresar por aquí: <a href='/account' target='_blank'>http://freecodecamp.com/account</a>.",
        "Dale click a este link, el cual te enviará una invitación a las salas de chat de Free Code Camp: <a href='/api/slack' target='_blank'>http://freecodecamp.com/api/slack</a>.",
        "Ahora revisa tu buzón de correo y dale click al link del correo electrónico que has recibido de Slack.",
        "Completa el proceso de registro, actualiza tu información biográfica y sube una imagen. Una foto de tu cara funciona mejor. Esta es la manera como las personas te verán en las salas de chat, asegurate de mostrar tu mejor sonrisa.",
        "Ahora ingresa al chat #General (Inglés) o #Espanol (Español) e introdúcete escribiendo: \"Hola mundo!\".",
        "Comentale a otros campers como es que encontraste Free Code Camp. También hablanos sobre las razones por las cuales decidiste aprender a programar.",
        "Mantén la sala de chat abierta mientras estás trabajando otros desafíos. De esa manera podrás pedir ayuda en caso te quedes atascado en algún de ellos. También puedes socializar cuando sientas que necesitas un descanso.",
        "Puedes acceder a la sala de chat dándole click al botón de \"Chat\" en la parte superior derecha de la página.",
        "Para mantener a nuestra comunidad como un lugar de aprendizaje positivo y amigable, por favor lee y sigue nuestro Código de Conducta: <a href='/https://github.com/FreeCodeCamp/freecodecamp/wiki/Code-of-Conduct' target='_blank'>https://github.com/FreeCodeCamp/freecodecamp/wiki/Code-of-Conduct</a>"
      ],
      "namePt": "",
      "descriptionPt": [],
      "nameDe": "Waypoint: Trete unserem Chat-Raum bei",
      "descriptionDe": [
        "Nun werden wir dem Chat-Raum von Free Code Camp beitreten. Du kannst jederzeit vorbei kommen um abzuhängen, Fragen zu stellen oder andere Camper für Paarprogrammierung zu finden.",
        "Stelle sicher, dass deine Email Adresse in deinem Free Code Camp Account hinterlegt ist. Bitte beachte, dass deine Email Adresse für die Öffentlichkeit nicht einsehbar ist, aber für andere Camper in Slack wird sie sichtbar sein. Du kannst sie hier eintragen: <a href='/account' target='_blank'>http://freecodecamp.com/account</a>.",
        "Klicke auf diesen Link, um von Slack eine Einladung zu den Chat-Räumen von Free Code Camp zu erhalten: <a href='/api/slack' target='_blank'>http://freecodecamp.com/api/slack</a>.",
        "Kontrolliere jetzt dein Email Postfach und klicke in der Email von Slack auf den Link.",
        "Beende die Registrierung und vervollständige dein Profil. Vergiss nicht, dein Profil-Bild hochzuladen. Ein Bild von deinem Gesicht ist am besten. So werden dich andere Personen im Chat sehen, also zeige dich von deiner Schokoladenseite.",
        "Jetzt betrete den General Chat-Raum und stelle dich den anderen vor, indem du folgendes schreibst: \"Hello world!\".",
        "Teile den anderen Campern mit, wie du auf Free Code Camp gestoßen bist. Wir interessieren uns auch dafür, warum du Programmieren lernen willst – aber auf englisch bitte, sonst versteht dich kaum einer.",
        "Behalte den Chat geöffnet, während du an den Challenges arbeitest. Auf diesem Weg kannst du schnell nach Hilfe fragen, wenn du nicht weiter kommst. Du kannst auch jederzeit mit uns chatten, wenn du eine Pause einlegen möchtest.",
        "Du kannst den Chat auch über die Schaltfläche \"Chat\" oben rechts auf dieser Seite erreichen.",
        "Damit diese Community ein freundlicher und positiver Ort zum Lernen bleibt, lies und folge bitte unseren Verhaltensregeln: <a href='//github.com/FreeCodeCamp/freecodecamp/wiki/Code-of-Conduct' target='_blank'>https://github.com/FreeCodeCamp/freecodecamp/wiki/Code-of-Conduct</a>"
      ]
    },
    {
      "id": "bd7125d8c441eddfaeb5bdff",
      "title": "Waypoint: Preview our Challenge Map",
      "difficulty": 0.03,
      "challengeSeed": ["125407437"],
      "description": [
        "Before you start learning how to code, we'd like to introduce you to a few things.",
        "Let's look at our Challenge Map. Click on the \"Map\" button in the upper right hand corner. This map shows all the challenges that will teach you how to code.",
        "You should complete all of these challenges in order.",
        "In addition to our Waypoint challenges, like the one you're doing now, we have algorithm practice challenges (Bonfires), front end development challenges (Ziplines) and full stack development challenges (Basejumps). After you finish all of these, you'll start building projects for nonprofits.",
        "Please note that our open-source curriculum is a work in progress. Our volunteer community is constantly improving it. If you think you've encountered a bug, typo, or something that seems confusing, be sure to click the \"bug\" button to create a GitHub issue."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Revisa nuestro Mapa de Desafíos",
      "descriptionEs": [
        "Antes de comenzar a aprender a programar, nos gustaría mostrarte algunas cosas.",
        "Revisemos el Mapa de Desafíos. Dale click al botón de \"Map\" en la parte superior derecha. Este mapa muestra todos los desafíos que te enseñarán a programar.",
        "Deberías completar todos estos desafíos en orden.",
        "Una vez que termines con los Waypoints, seguiremos con los Bonfires (práctica de algoritmos), luego Ziplines (práctica de desarrollo front end) y para terminar los Basejumps (práctica de desarrollo full stack). Después de eso, empezarás a desarrollar proyectos para empresas sin fines de lúcro.",
        "El mapa de desafíos es solamente de referencia. Puedes también presionar el botón de \"Learn\", el cual te llevará directamente al siguiente desafío.",
        "Para terminar, ten en cuenta que nuestra currícula open-source es un trabajo en progreso. Nuestra comunidad de voluntarios está mejorandola constantemente. Si crees que te has topado con algún bug, error ortográfico o algo que parezca confuso, haznos el favor de abrir un ticket a través de Github: <a href='https://github.com/FreeCodeCamp/freecodecamp/issues'>https://github.com/FreeCodeCamp/freecodecamp/issues</a>."
      ],
      "namePt": "",
      "descriptionPt": [],
      "nameDe": "Waypoint: Besuche die Challenge Map",
      "descriptionDe": [
        "Bevor du startest, wollen wir dir ein paar Dinge zeigen.",
        "Betrachte die Challenge Map. Klicke auf \"Map\" oben rechts auf dieser Seite. Diese Übersicht zeigt dir alle Challenges.",
        "Du solltest alle Challenges in der gezeigten Reihenfolge abschließen.",
        "Hast du alle Waypoint-Challenges beendet, folgen die Bonfires (Algorithmen), darauf Ziplines (Frontend Development) und zum Schluss Basejumps (Full Stack Development). Danach wirst du anfangen, Projekte für gemeinnützige Organisationen umzusetzen.",
        "Diese Challenge Map dient dir als Orientierung. Du kannst einfach auf \"Learn\" klicken und direkt zur nächsten Challenge fortfahren.",
        "Bitte beachte, dass unser Open Source Lehrplan nicht fertig ist. Unsere freiwillige Community verbessert diesen stetig. Wenn du einen Bug, Rechtschreib-Fehler oder etwas gefunden hast, das dir komisch vorkommt, öffne bitte ein GitHub Issue: <a href='https://github.com/FreeCodeCamp/freecodecamp/issues'>https://github.com/FreeCodeCamp/freecodecamp/issues</a>. Wie gehabt bitte in englischer Sprache."
      ]
    },
    {
      "id": "bd7125d8c441eddfaeb5bd1f",
      "title": "Waypoint: Browse our Wiki",
      "difficulty": 0.04,
      "challengeSeed": ["125407435"],
      "description": [
        "Free Code Camp has an up-to-date wiki that will answer your many questions.",
        "Click the \"Wiki\" button in the upper right hand corner.",
        "You can browse our wiki at your convenience. Most of its articles take less than 1 minute to read.",
        "All of our Wiki articles are contributed by our community. You can update our wiki articles, and even create wiki articles of your own.",
        "Now you can move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Revisa nuestro Field Guide",
      "descriptionEs": [
        "Free Code Camp tiene un field guide actualizado que respondera tus preguntas.",
        "Dale click al botón \"Field Guide\" en la parte superior derecha.",
        "Puedes navegar el Field Guide cuando veas conveniente. La mayoría de los artículos los puedes leer en menos de 1 minuto .",
        "Cuando le des click al botón de Field Guide, siempre te regresará al último artículo que estuviste leyendo.",
        "Lee algunos de nuestros artículos, luego continúa con tu siguiente desafío."
      ],
      "namePt": "",
      "descriptionPt": [],
      "nameDe": "Waypoint: Stöbere in unserem Field Guide",
      "descriptionDe": [
        "Free Code Camp hat einen aktuellen Field Guide, welcher viele deiner Fragen beantworten wird.",
        "Klicke oben rechts auf \"Field Guide\".",
        "Du kannst im Field Guide nach Lust und Laune stöbern. Die meisten der Artikel sind in weniger als einer Minute gelesen.",
        "Wenn du auf den besagten Field Guide in der Navigation klickst, wirst du direkt zu dem Artikel geleitet, den du als letztes gelesen hast.",
        "Lies ein paar der Artikel, dann schreite zu deiner nächsten Challenge voran."
      ]
    },
    {
      "id": "bd7125d8c441eddfaeb5bd2f",
      "title": "Waypoint: Customize your Portfolio Page",
      "difficulty": 0.05,
      "challengeSeed": ["125407433"],
      "description": [
        "You and all your fellow campers have portfolio pages.",
        "Click your picture in the upper right hand corner to go to your account page.",
        "Before you can see your portfolio page, you'll need to link your GitHub account with Free Code Camp.",
        "You can also fill out a short biography, and add links to your social media profiles.",
        "Your portfolio page shows how many Brownie Points you have. You can get Brownie Points by completing challenges and by helping other campers in our chat rooms.",
        "Your portfolio page also shows off your progress through Free Code Camp. If you get Brownie Points on several days in a row, you'll get streak.",
        "Once you're happy with your portfolio page, you can move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Personaliza tu página de Portafolio",
      "descriptionEs": [
        "Tú y tus otros amigos campers tienen sus propias páginas de portafolio.",
        "Para visualizar tu página de portafolio, dale click a tu foto en la parte superior derecha.",
        "Tu página de portafolio mostrará automaticamente tu progreso en Free Code Camp",
        "Dale click al botón de \"Update my portfolio page or manage my account\"",
        "Puedes enlazarte con tus cuentas de Github, Twitter y LinkedIn. Si ya has creado alguna página web, puedes enlazarla aquí también.",
        "Asegurate de darle click al botón de \"Update my Bio\" o \"Update my Social Links\" para agregar esta nueva información a tu portafolio.",
        "Una vez que estés satisfecho con tu página de portafolio, puedes seguir con el siguiente desafío."
      ],
      "namePt": "",
      "descriptionPt": [],
      "nameDe": "Waypoint: Personalisiere deine Portfolio-Seite",
      "descriptionDe": [
        "Du und die anderen Camper habt Portfolio-Seiten.",
        "Um zu deinem Portfolio zu gelangen, klicke oben rechts auf dein Bild.",
        "Dein Portfolio wird deinen Fortschritt im Free Code Camp automatisch anzeigen.",
        "Klicke auf \"Update my portfolio page or manage my account\"",
        "Du kannst deine GitHub, Twitter und LinkedIn Accounts verlinken. Wenn du bereits ein paar Websites gebaut hast, kannst du sie ebenfalls präsentieren.",
        "Stelle sicher, dass du auf \"Update my Bio\" oder \"Update my Social Links\" klickst, um diese neuen Informationen zu speichern.",
        "Sobald du zufrieden mit deinem Portfolio bist, kannst du zur nächsten Challenge fortfahren."
      ]
    },
    {
      "id": "bd7126d8c441eddfaeb5bd3f",
      "title": "Waypoint: Try Camper News",
      "difficulty": 0.06,
      "challengeSeed": ["124553410"],
      "description": [
        "Camper News is the best place for our campers to share and discuss helpful links.",
        "Click \"News\" in the upper right hand corner.",
        "You'll see a variety of links that have been submitted. Their rank is determined by how recently they were submitted and how many upvotes they have.",
        "If you enjoy a link, you should upvote it.",
        "You can also submit links that you think will be interesting to other campers.",
        "You can view the portfolio pages of any camper who has posted links on Camper News. Just click on their photo.",
        "When you submit a link, you'll get a Brownie Point. You'll also get a Brownie Point each time someone upvotes your link.",
        "Now that you've learned how to use Camper News, let's move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Prueba las Noticias de Campers",
      "descriptionEs": [
        "Noticias de Campers es el mejor lugar para que nuestros campers puedan discutir y compartir links útiles.",
        "Dale click a \"News\" en la parte superior derecha.",
        "Verás una gran variedad de links que han sido enviados. Dale click al botón de \"Discuss\" debajo de uno de ellos.",
        "Puedes votar por links que te gusten. Esto hará que el ranking de tu link suba.",
        "Puedes también dejar un comentario a un link. Si alguien responde a tu comentario recibirás un correo electrónico de notificación para que puedas regresar y responderlo.",
        "También puedes enviar tus propios links. Puedes escoger el título del link, asi como también dejar un comentario inicial sobre él.",
        "Puedes ver las páginas de portafolio de cualquier camper que ha enviado links o comentarios en las Noticias de Campers. Solo tienes que darle click a su fotografía.",
        "Cuando envies un link, recibirás un punto. También obtendrás un punto cada vez que otra persona vote por tu link.",
        "Ahora que has aprendido a utilizar las Noticias de Campers, continuaremos con el siguiente desafío."
      ],
      "namePt": "",
      "descriptionPt": [],
      "nameDe": "Waypoint: Verpasse nicht die Camper News",
      "descriptionDe": [
        "Camper News ist der beste Ort für unsere Camper, nützliche Links zu teilen und zu diskutieren.",
        "Klicke oben rechts auf \"News\".",
        "Du wirst eine Vielzahl an Links sehen, die bereits geteilt wurden. Klicke auf \"Discuss\" unter einem von ihnen.",
        "Du kannst Links bewerten. Das wird den Link in der Platzierung weiter nach oben befördern.",
        "Du kannst einen Link auch kommentieren. Wenn jemand auf deinen Kommentar antwortet, wirst du per Email benachrichtigt, sodass du zurück kommen und reagieren kannst.",
        "Du kannst ebenfalls Links teilen. Bearbeite den Titel des Links und hinterlasse einen ersten Kommentar, um die Diskussion zu starten.",
        "Du kannst dir das Portfolio jedes Campers anschauen, der einen Link geteilt hat. Klicke dazu einfach auf ihr Bild.",
        "Sobald du einen Link teilst, erhältst du einen Punkt. Jedes Mal, wenn jemand deinen Link bewertet, erhältst du zusätzlich einen Punkt.",
        "Jetzt da du gelernt hast, was Camper News ist, kanns du zur nächsten Challenge gehen."
      ]
    },
    {
      "id": "bd7126d8c441eddfaeb5bd3e",
      "title": "Waypoint: Meet Other Campers in your City",
      "difficulty": 0.07,
      "challengeSeed": ["127358841"],
      "description": [
        "One of the best ways to stay motivated when learning to code is to hang out with other campers in-person.",
        "The easiest way to meet other campers in your city is to join your city's Campsite. Each of these has its own Facebook group and Gitter chat room. Click <a href='https://github.com/FreeCodeCamp/freecodecamp/wiki/List-of-Free-Code-Camp-city-based-Campsites' target='_blank'>here</a> to view our growing list of Campsites. ",
        "Click the link to your city's Facebook group. Then, once Facebook loads, click \"Join group\".",
        "If you don't see your city on this list, you should follow <a href='https://github.com/FreeCodeCamp/freecodecamp/wiki/How-to-create-a-Campsite-for-your-city' target='_blank'>these directions</a> to create a Facebook group for your city.",
        "If you don't have a Facebook account, we strongly recommend you create one, even if it's just for the purpose of coordinating with campers in your city through your Campsite.",
        "Our Campsites allow you to create events, coordinate those events, and share photos from the events afterward.",
        "Whether you're hosting a study group, pair programming at your local library, or going to a weekend hackathon, your city's Campsite will help you make it happen."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Encuentrate con otros Campers en tu Ciudad",
      "descriptionEs": [
        "Una de las mejores maneras de mantenerte motivado cuando estás aprendiendo a programar es pasar el rato con otros campers.",
        "Gitter y Noticias de Campers son una muy buena forma de comunicarte con otros campers, pero no hay ningún substituto para conocerlos en persona.",
        "La forma más fácil de encontrarte con otros campers en tu ciudad es unirte al grupo de Facebook de tu ciudad o país. Dale click a <a href='https://github.com/FreeCodeCamp/freecodecamp/wiki/List-of-Free-Code-Camp-city-based-Campsites' target='_blank'>here</a> para ver la lista de grupos locales.",
        "Dale click al link de tu ciudad o país y una vez que Facebook cargue, dale click a \"Join group\".",
        "Nuestros grupos locales son pocos, asi que en caso no veas tu ciudad o país en la lista, solamente sigue las instrucciones para crear un grupo de Facebook para ello.",
        "Si no tienes una cuenta de Facebook, te recomendamos que crees una, asi sea solamente con el proposito de coordinar con otros campers en tu ciudad a través del grupo",
        "Nuestros grupos te dan la potestad de crear eventos y coordinarlos, solamente asegurate de compartir las fotos del evento una vez terminado.",
        "En caso seas el anfitrión de un grupo de estudio, estes programando en pares en una biblioteca local o piensen en ir a un hackathon de fin de semana, tu grupo local te ayudará a hacerlo."
      ],
      "namePt": "",
      "descriptionPt": [],
      "nameDe": "Waypoint: Treffe andere Camper in deiner Stadt",
      "descriptionDe": [
        "Der beste Weg, motiviert am Ball zu bleiben, ist mit anderen Campern abzuhängen.",
        "Slack und Camper News sind super Wege zur Kommunikation mit anderen Campern. Es gibt aber nichts vergleichbares, Personen im echten Leben zu treffen.",
        "Um leicht andere Camper in deiner Stadt zu treffen, solltest du der Facebook Gruppe deiner Stadt beitreten. Klicke <a href='https://github.com/FreeCodeCamp/freecodecamp/wiki/List-of-Free-Code-Camp-city-based-Campsites' target='_blank'>hier</a> um unsere wachsende Liste der lokalen Gruppen zu sehen.",
        "Klicke auf den Link zu deiner Stadt. Sobald Facebook geladen ist, klicke auf \"Gruppe beitreten\".",
        "Unsere lokalen Gruppen sind neu. Solltest du deine Stadt also nicht in der Liste sehen, erstelle doch bitte eine Facebook Gruppe deiner Stadt indem du den Anweisungen dazu folgst.",
        "Wenn du keinen Facebook Account hast, empfehlen wir dir einen zu erstellen. Auch wenn dieser nur dazu dient, sich mit anderen Campern in deiner Stadt zu koordinieren.",
        "Unsere Gruppen erlauben dir, Events zu planen und Fotos davon zu teilen.",
        "Egal ob du eine Studenten-Gruppe, Paarprogrammierung an deiner lokalen Bibliothek oder einen Hackathon am Wochenende anbieten willst. Die Gruppe deiner Stadt macht das alles möglich."
      ]
    },
    {
      "id": "bd7126d8c431eddfaeb5bd3e",
      "title": "Waypoint: Add Free Code Camp to your LinkedIn Profile",
      "difficulty": 0.08,
      "challengeSeed": ["131574134"],
      "description": [
        "LinkedIn is a critical tool for your job search later on.",
        "Add Free Code Camp to your LinkedIn profile by going to <a href='https://www.linkedin.com/profile/edit-education?school=Free+Code+Camp' target='_blank'>https://www.linkedin.com/profile/edit-education?school=Free+Code+Camp</a>.",
        "Estimate your dates. Keep in mind that Free Code Camp is a rigorous 1,600 hour program, and will probably take at least a year to complete.",
        "In the \"Degree\" section, type \"Full Stack Web Development\".",
        "In the \"Field of study\" section, type \"Computer Software Engineering\".",
        "Click the \"Save Changes\" button.",
        "Be sure to add your key word skills to LinkedIn's skills section as you learn them, such as HTML, jQuery, Linux and Node.js.",
        "You can expand your LinkedIn network by inviting friends you meet through Free Code Camp to connect with you on LinkedIn.",
        "Make your LinkedIn profile as complete as possible. Unlike other social networks, with LinkedIn, it's perfectly fine if you don't want to add a photo.",
        "Let's keep moving. We're almost ready to start coding!"
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "",
      "descriptionEs": [],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "bd7137d8c441eddfaeb5bdef",
      "title": "Waypoint: Get Help the Hacker Way with RSAP",
      "difficulty": 0.09,
      "challengeSeed": ["125407432"],
      "description": [
        "Let's cover one last thing before you start working through our lessons: how to get help.",
        "Any time you get stuck or don't know what to do next, follow this simple algorithm (procedure): RSAP (Read, Search, Ask, Post).",
        "First, R - Read the documentation or error message. A key skill that good coders have is the ability to interpret and then follow instructions.",
        "Next, S - Search Google. Good Google queries take a lot of practice. When you search Google, you usually want to include the language or framework you're using. You also want to limit the results to a recent period.",
        "Then, if you still haven't found an answer to your question, A - Ask your friends. If you have trouble, you can ask your fellow campers. We have a special chat room specifically for getting help with tools you learn through these Free Code Camp Challenges. Go to <a href='https://gitter.im/FreeCodeCamp/Help' target='_blank'>https://gitter.im/FreeCodeCamp/Help</a>. Keep this chat open while you work on the remaining challenges.",
        "Finally, P - Post on Stack Overflow. Before you attempt to do this, read Stack Overflow's guide to asking good questions: <a href='http://stackoverflow.com/help/how-to-ask'>http://stackoverflow.com/help/how-to-ask</a>.",
        "Here's our detailed wiki article on getting help: <a href='//github.com/FreeCodeCamp/freecodecamp/wiki/How-to-get-help-when-you-get-stuck' target='_blank'>http://freecodecamp.com//github.com/FreeCodeCamp/freecodecamp/wiki/How-to-get-help-when-you-get-stuck</a>.",
        "Now you have a clear algorithm to follow when you need help! Let's start coding! Move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Obtén ayuda del modo Hacker con RSAP",
      "descriptionEs": [
        "Cubramos un último punto antes que empieces a trabajar en los cursos: como obtener ayuda.",
        "Cualquier momento en el que te atasques o no sepas que hacer, sigue este simple algoritmo (procedimiento): RSAP (Read, Search, Ask, Post). Que en español vendría a ser Lee, Busca, Pregunta, Publica.",
        "Primero, Lee - Lee la documentación o el mensaje de error. El punto fuerte de un buen programador es la habilidad de interpretar y seguir instrucciones.",
        "Luego, Busca - Busca en Google. Buenas búsquedas o queries requieren bastante práctica. Cuando búsques en Google, idealmente tienes que incluir el lenguaje o framework que estés usando. También tendrás que limitar los resultados de búsqueda a un periodo reciente.",
        "Ahora, en caso no hayas encontrado la respuesta a tu pregunta, Pregunta - Pregunta a tus amigos. En caso estes en problemas, puedes preguntar a otros campers. Tenemos una sala de chat especificamente para obtener ayuda sobre las herramientas que utilizamos en los desafíos de Free Code Camp. Ingresa a <a href='https://gitter.im/FreeCodeCamp/Help' target='_blank'>https://gitter.im/FreeCodeCamp/Help</a>. Mantén este chat abierto mientras trabajas en los desafíos subsiguientes.",
        "Finalmente, Publica - Publica tu pregunta en Stack Overflow. Antes de hacer esto lee la guía de Stack Overflow para publicar buenas preguntas: <a href='http://stackoverflow.com/help/how-to-ask'>http://stackoverflow.com/help/how-to-ask</a>. Tendrás que hacerlo en inglés, en caso no sepas como, pide que te ayuden a traducir tu pregunta en el canal #espanol de Slack.",
        "Aquí está nuestra guia detallada en como obtener ayuda: <a href='//github.com/FreeCodeCamp/freecodecamp/wiki/How-to-get-help-when-you-get-stuck' target='_blank'>http://freecodecamp.com//github.com/FreeCodeCamp/freecodecamp/wiki/How-to-get-help-when-you-get-stuck</a>.",
        "Ahora que tienes en claro el procedimiento a seguir cuando necesites ayuda. ¡Empecémos a programar! Continua con el siguiente desafío."
      ],
      "namePt": "",
      "descriptionPt": [],
      "nameDe": "Waypoint: Der Weg des Hackers – Hilfe erhalten mit RSAP",
      "descriptionDe": [
        "Lass uns eine letzte Sache behandeln, bevor du mit den Lektionen beginnst: Wie du Hilfe bekommst.",
        "Immer wenn du nicht weiter kommst oder du nicht weißt, was als nächstes zu Tun ist, kannst du diesem einfachen Algorithmus (Prozedur) folgen: RSAP (Read, Search, Ask, Post – Lesen, Suchen, Fragen, Posten).",
        "Erstens, R – Lies die Dokumentation oder die Fehler-Meldung. Eine wichtige Eigenschaft aller Coder ist es, Anweisungen zu interpretieren und zu folgen.",
        "Danach, S – Suche bei Google. Es bedarf viel Übung, gute Such-Anfragen zu stellen. Wenn du bei Google suchst, solltest du die Sprache oder das Framework angeben, welches du benutzt. Außerdem wirst du die aktuellsten Ergebnisse haben wollen.",
        "Wenn du keine Antwort auf deine Frage erhalten hast, folge A – Frage deine Freunde. Wenn du Probleme hast, kannst du andere Camper fragen. Wir haben einen speziellen Chat-Raum zur Unterstützung beim Lernen eingerichtet. Gehe zu <a href='https://freecode.slack.com/messages/help/' target='_blank'>https://freecode.slack.com/messages/help/</a>. Behalte diesen Chat offen, solange du an den Challenges arbeitest.",
        "Und zum Schluss, P – Poste auf Stack Overflow. Bevor du das tust, lies bitte den Leitfaden für gute Fragen auf Stack Overflow: <a href='http://stackoverflow.com/help/how-to-ask'>http://stackoverflow.com/help/how-to-ask</a>.",
        "Hier ist unser detaillierter Field Guide um Hilfe zu erhalten: <a href='//github.com/FreeCodeCamp/freecodecamp/wiki/How-to-get-help-when-you-get-stuck' target='_blank'>http://freecodecamp.com//github.com/FreeCodeCamp/freecodecamp/wiki/How-to-get-help-when-you-get-stuck</a>.",
        "Jetzt hast du einen klaren Algorithmus, dem du folgen kannst wenn du Hilfe benötigst. Fangen wir an zu programmieren! Gehe zur nächsten Challenge."
      ]
    }
  ]
}
