{
  "name": "Get Set for Free Code Camp",
  "order": 0.001,
  "challenges": [
    {
      "id": "bd7124d8c441eddfaeb5bdef",
      "name": "Waypoint: Learn how Free Code Camp Works",
      "dashedName": "waypoint-learn-how-free-code-camp-works",
      "difficulty": 0.001,
      "challengeSeed": ["125407438"],
      "description": [
        "Watch this 1-minute video, or simply read this summary:",
        "Welcome to Free Code Camp. We're a community of busy people learning to code by building projects for nonprofits.",
        "We built this community because learning to code is hard. But anyone who can stay motivated can learn to code. And to stay motivated, you just need to: <ol><li>make friends with people who code</li><li>code a little every day</li></ol>",
        "All our challenges are <ol><li>free</li><li>self-paced</li><li>browser-based</li></ol>",
        "We'll spend <ol><li>200 hours learning tools like HTML, CSS, JavaScript, Node.js and databases</li><li>600 hours building practice projects</li><li>800 hours building full stack solutions for nonprofits</li></ol>",
        "By the end, we'll <ol><li>be good at coding</li><li>have the portfolio of apps with happy users to prove it</li></ol>",
        "Once you make it through Free Code Camp, you will be able to get a coding job. There are far more job openings out there than there are qualified coders to fill them.",
        "Now it's time to join our chat room. Click the \"I've completed this challenge\" button to move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Aprende sobre como funciona Free Code Camp",
      "descriptionEs": [
        "Mira el video de 1 minuto o simplemente lee este resumen:",
        "Bienvenido a Free Code Camp. Somos una comunidad de personas ocupadas tratando de aprender a programar construyendo proyectos para empresas sin fines de lucro.",
        "Hemos construido esta comunidad porque aprender a programar es dificil; pero cualquiera que se pueda mantener motivado puede aprender a programar. Para mantenerte motivado, solo necesitas: <ol><li>hacerte amigo o amiga de personas que sepan programar</li><li>programar un poco cada día</li></ol>",
        "Todos nuestros desafíos son <ol><li>gratuitos</li><li>manejados a tu propio ritmo</li><li>basados en tu navegador</li></ol>",
        "Estaremos trabajando <ol><li>200 horas aprendiendo a utilizar herramientas como HTML, CSS, JavaScript, Node.js y bases de datos</li><li>600 horas construyendo proyectos prácticos</li><li>800 horas construyendo soluciones full stack para empresas sin fines de lucro</li></ol>",
        "Al finalizar <ol><li>seremos buenos en programación</li><li>tendremos un portafolio con apps con usuarios contentos que puedan abogar por nuestro trabajo</li></ol>",
        "Una vez que completes el Free Code Camp, serás capaz de obtener un trabajo como desarrollador. Hay muchas posiciones de trabajo que están en búsqueda de programadores calificados.",
        "Ahora es el momento de ingresar a nuestra sala de chat. Dale click al botón de \"I've completed this challenge\" para continuar con el siguiente desafío."
      ],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "bd7125d8c441eddfaeb5bd0f",
      "name": "Waypoint: Join Our Chat Room",
      "dashedName": "waypoint-join-our-chat-room",
      "difficulty": 0.002,
      "challengeSeed": ["131574135"],
      "description": [
        "Now we're going to join the Free Code Camp chat room. You can come here any time of day to hang out, ask questions, or find another camper to pair program with.",
        "Create an account with GitHub here: <a href='https://github.com/join' target='_blank'>https://github.com/join</a>.",
        "Click the pixel art in the upper right hand corner of GitHub, then choose settings. Upload a picture of yourself. A picture of your face works best. This is how people will see you in our chat rooms, so put your best foot forward. You can add your city and your personal website if you have one.",
        "Go to Free Code Camp's open-source repository: <a href='//github.com/freecodecamp/freecodecamp' target='_blank'>https://github.com/freecodecamp/freecodecamp</a>.",
        "You can \"star\" this repository by clicking the star button in the upper right hand corner.",
        "Later, you'll be able to fork this repository if you'd like to contribute to our open source codebase.",
        "Join our main chat room: <a href='https://gitter.im/FreeCodeCamp/FreeCodeCamp' target='_blank'>https://gitter.im/FreeCodeCamp/FreeCodeCamp</a>.",
        "Once you're in our chat room, introduce yourself by saying : \"Hello world!\".",
        "Tell your fellow campers how you found Free Code Camp. Also tell us why you want to learn to code.",
        "We have a busy chat room, so be sure to configure your notification settings in the top right corner.",
        "Keep the chat room open while you work through the other challenges. That way you ask for help if you get stuck on a challenge. You can also socialize when you feel like taking a break.",
        "You can also download a desktop or mobile chat application here: <a href='https://gitter.im/apps' target='_blank'>https://gitter.im/apps</a>",
        "You can also access this chat room by clicking the \"Chat\" button in the upper right hand corner.",
        "In order to keep our community a friendly and positive place to learn to code, please read and follow our Code of Conduct: <a href='/field-guide/what-is-the-free-code-camp-code-of-conduct?' target='_blank'>http://freecodecamp.com/field-guide/what-is-the-free-code-camp-code-of-conduct?</a>",
        "Now you're ready to move on. Click the \"I've completed this challenge\" button to move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Únete a Nuestra Sala de Chat",
      "descriptionEs": [
        "Ahora vamos a unirnos a la sala de chat de Free Code Camp. Puedes ingresar en cualquier momento para pasar el rato, hacer preguntas o para encontrar algún otro camper para programar en pares.",
        "Asegurate de que tu cuenta de Free Code Camp incluya tu dirección de correo electrónico. Vale recalcar que si bien tu dirección de correo electrónico será invisible para el público, Slack lo hará visible para otros campers en las salas de chat. Puedes ingresar por aquí: <a href='/account' target='_blank'>http://freecodecamp.com/account</a>.",
        "Dale click a este link, el cual te enviará una invitación a las salas de chat de Free Code Camp: <a href='/api/slack' target='_blank'>http://freecodecamp.com/api/slack</a>.",
        "Ahora revisa tu buzón de correo y dale click al link del correo electrónico que has recibido de Slack.",
        "Completa el proceso de registro, actualiza tu información biográfica y sube una imagen. Una foto de tu cara funciona mejor. Esta es la manera como las personas te verán en las salas de chat, asegurate de mostrar tu mejor sonrisa.",
        "Ahora ingresa al chat #General (Inglés) o #Espanol (Español) e introdúcete escribiendo: \"Hola mundo!\".",
        "Comentale a otros campers como es que encontraste Free Code Camp. También hablanos sobre las razones por las cuales decidiste aprender a programar.",
        "Mantén la sala de chat abierta mientras estás trabajando otros desafíos. De esa manera podrás pedir ayuda en caso te quedes atascado en algún de ellos. También puedes socializar cuando sientas que necesitas un descanso.",
        "Puedes acceder a la sala de chat dándole click al botón de \"Chat\" en la parte superior derecha de la página.",
        "Para mantener a nuestra comunidad como un lugar de aprendizaje positivo y amigable, por favor lee y sigue nuestro Código de Conducta: <a href='/field-guide/what-is-the-free-code-camp-code-of-conduct?' target='_blank'>http://freecodecamp.com/field-guide/what-is-the-free-code-camp-code-of-conduct?</a>"
      ],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "bd7125d8c441eddfaeb5bdff",
      "name": "Waypoint: Preview our Challenge Map",
      "dashedName": "waypoint-preview-our-challenge-map",
      "difficulty": 0.003,
      "challengeSeed": ["125407437"],
      "description": [
        "Before you start learning how to code, we'd like to introduce you to a few things.",
        "Let's look at our Challenge Map. Click on the \"Map\" button in the upper right hand corner. This map shows all the challenges that will teach you how to code.",
        "You should complete all these challenges in order.",
        "Once you finish these Waypoint challenges, you'll move on to Bonfires (algorithm practice), then Ziplines (front end development practice) and finally Basejumps (full stack development practice). After that, you'll start building projects for nonprofits.",
        "This challenge map is just for your reference. You can always just press the \"Learn\" button, and it will take you to your next challenge.",
        "Finally, please note that our open-source curriculum is a work in progress. Our volunteer community is constantly improving it. If you think you've encountered a bug, typo, or something that seems confusing, please open a GitHub issue: <a href='https://github.com/FreeCodeCamp/freecodecamp/issues'>https://github.com/FreeCodeCamp/freecodecamp/issues</a>."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Revisa nuestro Mapa de Desafíos",
      "descriptionEs": [
        "Antes de comenzar a aprender a programar, nos gustaría mostrarte algunas cosas.",
        "Revisemos el Mapa de Desafíos. Dale click al botón de \"Map\" en la parte superior derecha. Este mapa muestra todos los desafíos que te enseñarán a programar.",
        "Deberías completar todos estos desafíos en orden.",
        "Una vez que termines con los Waypoints, seguiremos con los Bonfires (práctica de algoritmos), luego Ziplines (práctica de desarrollo front end) y para terminar los Basejumps (práctica de desarrollo full stack). Después de eso, empezarás a desarrollar proyectos para empresas sin fines de lúcro.",
        "El mapa de desafíos es solamente de referencia. Puedes también presionar el botón de \"Learn\", el cual te llevará directamente al siguiente desafío.",
        "Para terminar, ten en cuenta que nuestra currícula open-source es un trabajo en progreso. Nuestra comunidad de voluntarios está mejorandola constantemente. Si crees que te has topado con algún bug, error ortográfico o algo que parezca confuso, haznos el favor de abrir un ticket a través de Github: <a href='https://github.com/FreeCodeCamp/freecodecamp/issues'>https://github.com/FreeCodeCamp/freecodecamp/issues</a>."
      ],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "bd7125d8c441eddfaeb5bd1f",
      "name": "Waypoint: Browse our Field Guide",
      "dashedName": "waypoint-browse-our-field-guide",
      "difficulty": 0.004,
      "challengeSeed": ["125407435"],
      "description": [
        "Free Code Camp has an up-to-date field guide that will answer your many questions.",
        "Click the \"Guide\" button in the upper right hand corner.",
        "You can browse the field guide at your convenience. Most of its articles take less than 1 minute to read.",
        "When you click the \"Guide\" button, it will always take you back to whichever article you were last reading.",
        "Read a few field guide articles, then move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Revisa nuestro Field Guide",
      "descriptionEs": [
        "Free Code Camp tiene un field guide actualizado que respondera tus preguntas.",
        "Dale click al botón \"Field Guide\" en la parte superior derecha.",
        "Puedes navegar el Field Guide cuando veas conveniente. La mayoría de los artículos los puedes leer en menos de 1 minuto .",
        "Cuando le des click al botón de Field Guide, siempre te regresará al último artículo que estuviste leyendo.",
        "Lee algunos de nuestros artículos, luego continúa con tu siguiente desafío."
      ],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "bd7125d8c441eddfaeb5bd2f",
      "name": "Waypoint: Customize your Portfolio Page",
      "dashedName": "waypoint-customize-your-portfolio-page",
      "difficulty": 0.005,
      "challengeSeed": ["125407433"],
      "description": [
        "You and all your fellow campers have portfolio pages.",
        "To see your portfolio page, click your picture in the upper right hand corner.",
        "Your portfolio page will automatically show off your progress through Free Code Camp.",
        "Click the \"Update my portfolio page or manage my account\" button",
        "You can link to your GitHub, Twitter and LinkedIn accounts. If you've already built some websites, you can link to them here as well.",
        "Be sure to click the \"Update my Bio\" or \"Update my Social Links\" button to save this new information to your portfolio page.",
        "Once you're happy with your portfolio page, you can move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Personaliza tu página de Portafolio",
      "descriptionEs": [
        "Tú y tus otros amigos campers tienen sus propias páginas de portafolio.",
        "Para visualizar tu página de portafolio, dale click a tu foto en la parte superior derecha.",
        "Tu página de portafolio mostrará automaticamente tu progreso en Free Code Camp",
        "Dale click al botón de \"Update my portfolio page or manage my account\"",
        "Puedes enlazarte con tus cuentas de Github, Twitter y LinkedIn. Si ya has creado alguna página web, puedes enlazarla aquí también.",
        "Asegurate de darle click al botón de \"Update my Bio\" o \"Update my Social Links\" para agregar esta nueva información a tu portafolio.",
        "Una vez que estés satisfecho con tu página de portafolio, puedes seguir con el siguiente desafío."
      ],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "bd7126d8c441eddfaeb5bd3f",
      "name": "Waypoint: Try Camper News",
      "dashedName": "waypoint-try-camper-news",
      "difficulty": 0.006,
      "challengeSeed": ["124553410"],
      "description": [
        "Camper News is the best place for our campers to share and discuss helpful links.",
        "Click \"News\" in the upper right hand corner.",
        "You'll see a variety of links that have been submitted. Click on the \"Discuss\" button under one of them.",
        "You can upvote links. This will push the link up the rankings of hot links.",
        "You can also comment on a link. If someone responds to your comment, you'll get an email notification so you can come back and respond to them.",
        "You can also submit links. You can modify the link's headline and also leave an initial comment about the link.",
        "You can view the portfolio pages of any camper who has posted links or comments on Camper News. Just click on their photo.",
        "When you submit a link, you'll get a point. You will also get a point each time someone upvotes your link.",
        "Now that you've learned how to use Camper News, let's move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Prueba las Noticias de Campers",
      "descriptionEs": [
        "Noticias de Campers es el mejor lugar para que nuestros campers puedan discutir y compartir links útiles.",
        "Dale click a \"News\" en la parte superior derecha.",
        "Verás una gran variedad de links que han sido enviados. Dale click al botón de \"Discuss\" debajo de uno de ellos.",
        "Puedes votar por links que te gusten. Esto hará que el ranking de tu link suba.",
        "Puedes también dejar un comentario a un link. Si alguien responde a tu comentario recibirás un correo electrónico de notificación para que puedas regresar y responderlo.",
        "También puedes enviar tus propios links. Puedes escoger el título del link, asi como también dejar un comentario inicial sobre él.",
        "Puedes ver las páginas de portafolio de cualquier camper que ha enviado links o comentarios en las Noticias de Campers. Solo tienes que darle click a su fotografía.",
        "Cuando envies un link, recibirás un punto. También obtendrás un punto cada vez que otra persona vote por tu link.",
        "Ahora que has aprendido a utilizar las Noticias de Campers, continuaremos con el siguiente desafío."
      ],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "bd7126d8c441eddfaeb5bd3e",
      "name": "Waypoint: Meet Other Campers in your City",
      "dashedName": "waypoint-meet-other-campers-in-your-city",
      "difficulty": 0.007,
      "challengeSeed": ["127358841"],
      "description": [
        "One of the best ways to stay motivated when learning to code is to hang out with other campers.",
        "Gitter and Camper News are great ways to communicate with other campers, but there's no substitute for meeting people in-person.",
        "The easiest way to meet other campers in your city is to join your city's Facebook Group. Click <a href='/field-guide/how-can-i-find-other-free-code-camp-campers-in-my-city' target='_blank'>here</a> to view our growing list of local groups.",
        "Click the link to your city, then, once Facebook loads, click \"Join group\".",
        "Our local groups are new, so if you don't see your city on this list, you should follow the directions to create a Facebook group for your city.",
        "If you don't have a Facebook account, we strongly recommend you create one, even if it's just for the purpose of coordinating with campers in your city through this group.",
        "Our groups allow you to create events, coordinate those events, and share photos from the events afterward.",
        "Whether you're hosting a study group, pair programming at your local library, or going to a weekend hackathon, your city's group will help you make it happen."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Encuentrate con otros Campers en tu Ciudad",
      "descriptionEs": [
        "Una de las mejores maneras de mantenerte motivado cuando estás aprendiendo a programar es pasar el rato con otros campers.",
        "Gitter y Noticias de Campers son una muy buena forma de comunicarte con otros campers, pero no hay ningún substituto para conocerlos en persona.",
        "La forma más fácil de encontrarte con otros campers en tu ciudad es unirte al grupo de Facebook de tu ciudad o país. Dale click a <a href='/field-guide/how-can-i-find-other-free-code-camp-campers-in-my-city' target='_blank'>here</a> para ver la lista de grupos locales.",
        "Dale click al link de tu ciudad o país y una vez que Facebook cargue, dale click a \"Join group\".",
        "Nuestros grupos locales son pocos, asi que en caso no veas tu ciudad o país en la lista, solamente sigue las instrucciones para crear un grupo de Facebook para ello.",
        "Si no tienes una cuenta de Facebook, te recomendamos que crees una, asi sea solamente con el proposito de coordinar con otros campers en tu ciudad a través del grupo",
        "Nuestros grupos te dan la potestad de crear eventos y coordinarlos, solamente asegurate de compartir las fotos del evento una vez terminado.",
        "En caso seas el anfitrión de un grupo de estudio, estes programando en pares en una biblioteca local o piensen en ir a un hackathon de fin de semana, tu grupo local te ayudará a hacerlo."
      ],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "_id": "bd7126d8c431eddfaeb5bd3e",
      "name": "Waypoint: Add Free Code Camp to your LinkedIn Profile",
      "difficulty": 0.008,
      "challengeSeed": ["131574134"],
      "description": [
        "LinkedIn is a critical tool for your job search later on.",
        "Add Free Code Camp to your LinkedIn profile by going to <a href='https://www.linkedin.com/profile/edit-education?school=Free+Code+Camp' target='_blank'>https://www.linkedin.com/profile/edit-education?school=Free+Code+Camp</a>.",
        "Estimate your dates. Keep in mind that Free Code Camp is a rigorous 1,600 hour program, and will probably take at least a year to complete.",
        "In the \"Degree\" section, type \"Full Stack Web Development\".",
        "In the \"Field of study\" section, type \"Computer Software Engineering\".",
        "Click the \"Save Changes\" button.",
        "Be sure to add your key word skills to LinkedIn's skills section as you learn them, such as HTML, jQuery, Linux and Node.js.",
        "You can expand your LinkedIn network by inviting friends you meet through Free Code Camp to connect with you on LinkedIn.",
        "Make your LinkedIn profile as complete as possible. Unlike other social networks, with LinkedIn, it's perfectly fine if you don't want to add a photo.",
        "Let's keep moving. We're almost ready to start coding!"
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "",
      "descriptionEs": [],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "_id": "bd7137d8c441eddfaeb5bdef",
      "id": "bd7137d8c441eddfaeb5bdef",
      "name": "Waypoint: Get Help the Hacker Way with RSAP",
      "dashedName": "waypoint-get-help-the-hacker-way-with-rsap",
      "difficulty": 0.009,
      "challengeSeed": ["125407432"],
      "description": [
        "Let's cover one last thing before you start working through our lessons: how to get help.",
        "Any time you get stuck or don't know what to do next, follow this simple algorithm (procedure): RSAP (Read, Search, Ask, Post).",
        "First, R - Read the documentation or error message. A key skill that good coders have is the ability to interpret and then follow instructions.",
        "Next, S - Search Google. Good Google queries take a lot of practice. When you search Google, you usually want to include the language or framework you're using. You also want to limit the results to a recent period.",
        "Then, if you still haven't found an answer to your question, A - Ask your friends. If you have trouble, you can ask your fellow campers. We have a special chat room specifically for getting help with tools you learn through these Free Code Camp Challenges. Go to <a href='https://gitter.im/FreeCodeCamp/Help' target='_blank'>https://gitter.im/FreeCodeCamp/Help</a>. Keep this chat open while you work on the remaining challenges.",
        "Finally, P - Post on Stack Overflow. Before you attempt to do this, read Stack Overflow's guide to asking good questions: <a href='http://stackoverflow.com/help/how-to-ask'>http://stackoverflow.com/help/how-to-ask</a>.",
        "Here's our detailed field guide on getting help: <a href='/field-guide/how-do-i-get-help-when-i-get-stuck' target='_blank'>http://freecodecamp.com/field-guide/how-do-i-get-help-when-i-get-stuck</a>.",
        "Now you have a clear algorithm to follow when you need help! Let's start coding! Move on to your next challenge."
      ],
      "challengeType": 2,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "Waypoint: Obtén ayuda del modo Hacker con RSAP",
      "descriptionEs": [
        "Cubramos un último punto antes que empieces a trabajar en los cursos: como obtener ayuda.",
        "Cualquier momento en el que te atasques o no sepas que hacer, sigue este simple algoritmo (procedimiento): RSAP (Read, Search, Ask, Post). Que en español vendría a ser Lee, Busca, Pregunta, Publica.",
        "Primero, Lee - Lee la documentación o el mensaje de error. El punto fuerte de un buen programador es la habilidad de interpretar y seguir instrucciones.",
        "Luego, Busca - Busca en Google. Buenas búsquedas o queries requieren bastante práctica. Cuando búsques en Google, idealmente tienes que incluir el lenguaje o framework que estés usando. También tendrás que limitar los resultados de búsqueda a un periodo reciente.",
        "Ahora, en caso no hayas encontrado la respuesta a tu pregunta, Pregunta - Pregunta a tus amigos. En caso estes en problemas, puedes preguntar a otros campers. Tenemos una sala de chat especificamente para obtener ayuda sobre las herramientas que utilizamos en los desafíos de Free Code Camp. Ingresa a <a href='https://gitter.im/FreeCodeCamp/Help' target='_blank'>https://gitter.im/FreeCodeCamp/Help</a>. Mantén este chat abierto mientras trabajas en los desafíos subsiguientes.",
        "Finalmente, Publica - Publica tu pregunta en Stack Overflow. Antes de hacer esto lee la guía de Stack Overflow para publicar buenas preguntas: <a href='http://stackoverflow.com/help/how-to-ask'>http://stackoverflow.com/help/how-to-ask</a>. Tendrás que hacerlo en inglés, en caso no sepas como, pide que te ayuden a traducir tu pregunta en el canal #espanol de Slack.",
        "Aquí está nuestra guia detallada en como obtener ayuda: <a href='/field-guide/how-do-i-get-help-when-i-get-stuck' target='_blank'>http://freecodecamp.com/field-guide/how-do-i-get-help-when-i-get-stuck</a>.",
        "Ahora que tienes en claro el procedimiento a seguir cuando necesites ayuda. ¡Empecémos a programar! Continua con el siguiente desafío."
      ],
      "namePt": "",
      "descriptionPt": []
    }
  ]
}
