{
  "name": "Get Started with Free Code Camp",
  "order": 1,
  "challenges": [
    {
      "id": "560add10cb82ac38a17513be",
      "title": "Learn how Free Code Camp Works",
      "challengeSeed": [],
      "description": [
        [
          "http://i.imgur.com/RlEk2IF.jpg",
          "A picture of Free Code Camp's 4 benefits: Get connected, Learn JavaScript, Build your Portfolio, Help nonprofits",
          "Welcome to Free Code Camp. We're an open source community of busy people who learn to code and help nonprofits.",
          ""
        ],
        [
          "http://i.imgur.com/pYsTbjI.jpg",
          "A screenshot of our curriculum alongside a screenshot of our chat room.",
          "Learning to code is hard. To succeed, you'll need lots of practice and support. That's why we've created a rigorous curriculum and supportive community.",
          ""
        ],
        [
          "http://i.imgur.com/D7Y5luw.jpg",
          "A graph of the rate of job growth against growth in computer science degree graduates. There are 1.4 million jobs and only 400 million people to fill them.",
          "There are thousands of coding jobs currently going unfilled, and the demand for coders grows every year. If you want a coding job, we can help prepare you to get one.",
          ""
        ],
        [
          "http://i.imgur.com/dLx8nrg.jpg",
          "An illustration showing that you will learn HTML5, CSS3, JavaScript, Databases, Git, Node.js, Angular.js and Agile.",
          "First you'll work through our rigorous 800-hour curriculum learn technologies like HTML5, Node.js and databases. It's self-paced and 100% free.",
          ""
        ],
        [
          "http://i.imgur.com/sKYQhdG.jpg",
          "A screenshot of our Front End Development Certificate",
          "About half way through our curriculum, you'll earn a verified Front End Development Certificate. If you can finish our entire curriculum, you'll earn a verified Full Stack Development Certificate.",
          ""
        ],
        [
          "http://i.imgur.com/yXyxbDd.jpg",
          "A screen shot of our nonprofit project directory.",
          "Then you'll build several real-life projects for nonprofits. By the time you finish, you'll have a portfolio of real apps that people use every day.",
          ""
        ]
      ],
      "type": "Waypoint",
      "challengeType": 7,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "",
      "descriptionEs": [],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "560add37cb82ac38a17513bf",
      "title": "Create a GitHub Account and Join our Chat Rooms",
      "challengeSeed": [],
      "description": [
        [
          "http://i.imgur.com/EAR7Lvh.jpg",
          "A screenshot of our one of our Gitter chat rooms.",
          "Now let's join Free Code Camp's chat rooms. You can come here any time of day to hang out, ask questions, or find another camper to pair program with. First you'll need a GitHub account.",
          ""
        ],
        [
          "http://i.imgur.com/FEImaEN.gif",
          "A gif showing you to click the link below to go to GitHub. Fill in the necessary fields and click submit.",
          "Create an account with GitHub. Be sure to use your real email address - GitHub will keep this private.",
          "https://github.com/join"
        ],
        [
          "http://i.imgur.com/ALN6zPK.gif",
          "A gif showing you how to click the profile image in the upper right hand corner of GitHub. Upload a photo of yourself or you will continue to use the automatically generated pixel art. Then fill in the remaining form fields and click submit.",
          "Click the pixel art in the upper right hand corner of GitHub, then choose settings. Upload a picture of yourself. A picture of your face works best. This is how your fellow campers will see you in our chat rooms, so put your best foot forward. You can add your city and your name if you want.",
          "https://github.com/settings/profile"
        ],
        [
          "http://i.imgur.com/pYk0wOk.gif",
          "A gif showing how you can star a GitHub repo.",
          "Go to Free Code Camp's open-source repository and \"star\" it. \"Starring\" is the GitHub equivalent of \"liking\" something.",
          "https://github.com/freecodecamp/freecodecamp"
        ],
        [
          "http://i.imgur.com/zwYPeQT.gif",
          "A gif showing you how to click the link below to go to our chat room and click the \"sign in with GitHub\" button. Then you can click into the text input field and type a message to your fellow campers.",
          "Now that you have a GitHub account, you can join our main chat room by logging in with GitHub. Introduce yourself by saying \"Hello world!\". Tell your fellow campers how you found Free Code Camp. Also tell us why you want to learn to code.",
          "https://gitter.im/FreeCodeCamp/FreeCodeCamp"
        ],
        [
          "http://i.imgur.com/Ecs5XAd.gif",
          "A gif showing you how you can click the settings button in the upper right hand corner and modify your notification settings.",
          "Our chat rooms are extremely active. You should change your settings so you're only notified if someone mentions you.",
          ""
        ],
        [
          "http://i.imgur.com/T0bGJPe.gif",
          "A gif showing how you can click on a user profile image to initiate a private message with that user.",
          "Please note that all of our chat rooms are visible to the public. If you need to share sensitive information, such as an email address or phone number, do it in a private message.",
          ""
        ],
        [
          "http://i.imgur.com/vDTMJSh.gif",
          "A gif showing that you can tab back and forth between challenges and our chat rooms.",
          "Keep our chat room open while you work through our challenges. That way, you can ask for help if you get stuck. You can also socialize with other campers when you feel like taking a break.",
          ""
        ],
        [
          "http://i.imgur.com/WvQvNGN.gif",
          "A gif showing how you can click the link below to download a native chat room app for your computer.",
          "You can also download the chat room app to your computer or phone.",
          "https://gitter.im/apps"
        ]
      ],
      "type": "Waypoint",
      "challengeType": 7,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "",
      "descriptionEs": [],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "560add56cb82ac38a17513c0",
      "title": "Configure your Code Portfolio",
      "challengeSeed": [],
      "description": [
        [
          "http://i.imgur.com/tP2ccTE.gif",
          "A gif showing how you can click your profile image in your upper right hand corner to your code portfolio and connect GitHub.",
          "Check out your code portfolio. Click your picture in your upper right hand corner. To activate your code portfolio, you'll need to link your GitHub account with Free Code Camp. Your code portfolio shows your progress and how many Brownie Points you have. You can get Brownie Points by completing challenges and by helping other campers in our chat rooms. If you get Brownie Points on several days in a row, you'll get a streak.",
          ""
        ]
      ],
      "type": "Waypoint",
      "challengeType": 7,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "",
      "descriptionEs": [],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "560add71cb82ac38a17513c2",
      "title": "Join a Campsite in Your City",
      "challengeSeed": [],
      "description": [
        [
          "http://i.imgur.com/Elb3dfj.jpg",
          "A picture of some of our campers meeting in a local cafe. 3 men and 3 women are sitting around a table with laptops out, and are smiling and coding.",
          "Our Campsites help you code with campers in your city. You can coordinate study groups or attend local coding events together.",
          ""
        ],
        [
          "http://i.imgur.com/fTFMjwf.gif",
          "A gif showing how you can click the link below, find your city on the list of Campsites, then click on the Facebook link for your city and join your city's Facebook group.",
          "Find your city on this list and click it. This will take you to your city's Campsite's Facebook group. Click the \"Join group\" button to apply to join your city's Facebook group. Someone from the campsite should approve you shortly. If your city isn't on this list, scroll to the bottom of the wiki article for instructions for how you can create your city's Campsite.",
          "https://github.com/FreeCodeCamp/freecodecamp/wiki/List-of-Free-Code-Camp-city-based-Campsites"
        ]
      ],
      "type": "Waypoint",
      "challengeType": 7,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "",
      "descriptionEs": [],
      "namePt": "",
      "descriptionPt": []
    },
    {
      "id": "560add8ccb82ac38a17513c4",
      "title": "Learn What to Do If You Get Stuck",
      "challengeSeed": [],
      "description": [
        [
          "http://i.imgur.com/EWWZBag.jpg",
          "An image with the text \"1. Read the error 2. Search Google 3. Ask for help.",
          "Let's cover one last thing before you start working through our challenges: how to get help. Any time you get stuck or don't know what to do next: Read-Search-Ask.",
          ""
        ],
        [
          "http://i.imgur.com/99BfAcK.jpg",
          "An image showing jQuery documentation",
          "First, read the documentation or error message. A key skill that good coders have is the ability to interpret and then follow instructions.",
          ""
        ],
        [
          "http://i.imgur.com/GxvrsFb.gif",
          "A gif showing you how to do an advanced Google search. First, we enter the query \"jquery doesn't run when my page loads\". Then we click search tools button and change the \"Any time\" select box to \"within the last year\". Then we click on a result and read through the article and find our answer.",
          "If that didn't help, search Google. Good Google queries take a lot of practice. When you search Google, you usually want to include the language or framework you're using. You also want to limit the results to a recent period.",
          ""
        ],
        [
          "http://i.imgur.com/LZYU7p2.gif",
          "A gif showing us following the link below to go to the help chat room and ask \"jquery doesn't run when my page loads\".",
          "If that didn't help, ask your friends. If you have trouble, you can ask your fellow campers in our help chat room.",
          "https://gitter.im/FreeCodeCamp/Help"
        ],
        [
          "http://i.imgur.com/ZRgXraT.gif",
          "A gif showing us scrolling through our challenge map.",
          "Now you're ready to start coding! The \"Map\" button in your upper right hand corner will show you our challenge map. This map shows all our coding challenges. We recommend that you complete these from top to bottom, at a sustainable pace. You can also return to your next challenge by clicking the \"Learn\" button.",
          ""
        ]
      ],
      "type": "Waypoint",
      "challengeType": 7,
      "tests": [],
      "nameCn": "",
      "descriptionCn": [],
      "nameFr": "",
      "descriptionFr": [],
      "nameRu": "",
      "descriptionRu": [],
      "nameEs": "",
      "descriptionEs": [],
      "namePt": "",
      "descriptionPt": []
    }
  ]
}
