{
  "responsive-web-design": {
    "title": "Changamoto za Ubunifu wa Wavuti Sikivu",
    "intro": [
      "Katika Uthibitishaji huu wa Muundo Wa Wavuti Sikivu, utajifunza lugha ambazo watengenezaji wa tovuti hutumia kutengeneza kurasa za wavuti: HTML(Hypertext Markup Language) kwa ajili ya maudhui, na CSS (Cascading Style Sheets) kwa ajili ya muundo.",
      "Kwanza, utaunda programu ya picha ya paka ili kujifunza misingi ya HTML na CSS. Baadaye, utajifunza mbinu za kisasa kama vile vihifadhi vya CSS kwa kujenga pengwini, na mbinu bora za ufikivu kwa kuunda fomu ya wavuti.",
      "Hatimaye, utajifunza jinsi ya kutengeneza kurasa za tovuti zinazojibu ukubwa tofauti wa skrini kwa kutengeneza kadi ya Twitter na Flexbox, na mpangilio changamano wa blogu ukitumia Gridi ya CSS."
    ],
    "note": "Kumbuka: Baadhi ya viendelezi vya kivinjari, kama vile vizuizi vya matangazo na viendelezi vya hali ya giza vinaweza kutatiza majaribio. Ukikumbana na matatizo, tunapendekeza kuzima viendelezi vinavyorekebisha maudhui au mpangilio wa kurasa, wakati unachukua kozi.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "Msingi wa HTML na HTML5",
        "intro": [
          "HTML ni lugha ya markup inayotumia sintaksia maalum au nukuu kuelezea muundo wa ukurasa wa wavuti kwa kivinjari. Vipengele vya HTML kawaida huwa na tagi za kufungua na kufunga ambazo huzunguka na kutoa maana kwa yaliyomo. Kwa mfano, vipengele tofauti vinaweza kuelezea maandishi kama kichwa, aya au kipengee cha orodha.",
          "Katika kozi hii, utaunda programu ya picha ya paka ili kujifunza baadhi ya vipengele vya kawaida vya HTML - vizuizi vya ujenzi wa ukurasa wowote wa tovuti."
        ]
      },
      "basic-css": {
        "title": "Msingi wa CSS",
        "intro": [
          "CSS, au Cascading Style Sheets, huaamba kivinjari jinsi ya kuonyesha maandishi na maudhui mengine unayoandika katika HTML. Ukiwa na CSS, unaweza kudhibiti rangi, fonti, saizi, nafasi, na vipengele vingine vingi vya vipengele vya HTML.",
          "Kwa kuwa sasa umeelezea muundo wa programu yako ya picha ya paka, ipe mtindo fulani ukitumia CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Usanifu wa Kuonekana Uliotumika",
        "intro": [
          "Muundo unaoonekana ni mchanganyiko wa uchapaji, nadharia ya rangi, michoro, uhuishaji, mpangilio wa ukurasa, na zaidi ili kusaidia kuwasilisha ujumbe wako wa kipekee.",
          "Katika kozi hii, utajifunza jinsi ya kutumia vipengele hivi tofauti vya muundo wa kuona kwenye kurasa zako za wavuti."
        ]
      },
      "applied-accessibility": {
        "title": "Ufikivu Uliotumika",
        "intro": [
          "Katika utengenezaji wa wavuti, ufikivu unarejelea maudhui ya wavuti na UI (user interface) ambacho kinaweza kueleweka, kuangaziwa, na kuingiliana nacho na hadhira pana. Hii inajumuisha watu wenye ulemavu wa kuona, kusikia, uhamaji au utambuzi.",
          "Katika kozi hii, utajifunza mbinu bora za kuunda kurasa za wavuti zinazoweza kufikiwa na kila mtu."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Kanuni za Responsive Web Design",
        "intro": [
          "Kuna vifaa vingi vinavyoweza kufikia wavuti, na vinakuja kwa maumbo na saizi zote. Muundo wa wavuti unaoitikia ni mazoea ya kubuni tovuti zinazonyumbulika ambazo zinaweza kujibu ukubwa tofauti wa skrini, mielekeo na maazimio.",
          "Katika kozi hii, utajifunza jinsi ya kutumia CSS ili kufanya kurasa zako za wavuti zionekane vizuri, bila kujali ni kifaa gani zinatazamwa."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox ni mbinu ya mpangilio yenye nguvu, inayoauniwa vyema ambayo ilianzishwa kwa toleo jipya zaidi la CSS, CSS3. Ukiwa na flexbox, ni rahisi kuweka vipengee katikati kwenye ukurasa na kuunda miingiliano madhubuti ya watumiaji ambayo husinyaa na kupanuka kiotomatiki.",
          "Katika kozi hii, utajifunza misingi ya flexbox na mipangilio inayobadilika kwa kuunda kadi ya Twitter."
        ]
      },
      "css-grid": {
        "title": "Gridi ya CSS",
        "intro": [
          "Gridi ya CSS ni kiwango kipya zaidi kinachorahisisha kuunda miundo changamano inayoitikia. Inafanya kazi kwa kugeuza kipengee cha HTML kuwa gridi, na hukuruhusu kuweka vipengele vya watoto popote ndani.",
          "Katika kozi hii, utajifunza misingi ya gridi ya CSS kwa kuunda miundo changamano tofauti, ikiwa ni pamoja na blogu."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Muundo Wa Wavuti Sikivu",
    "intro": [
      "Katika Uthibitishaji huu wa Muundo Wa Wavuti Sikivu, utajifunza lugha ambazo watengenezaji wa tovuti hutumia kutengeneza kurasa za wavuti: HTML(Hypertext Markup Language) kwa ajili ya maudhui, na CSS (Cascading Style Sheets) kwa ajili ya muundo.",
      "Kwanza, utaunda programu ya picha ya paka ili kujifunza misingi ya HTML na CSS. Baadaye, utajifunza mbinu za kisasa kama vile vihifadhi vya CSS kwa kujenga pengwini, na mbinu bora za ufikivu kwa kuunda tovuti ya maswali.",
      "Hatimaye, utajifunza jinsi ya kutengeneza kurasa za tovuti zinazojibu ukubwa tofauti wa skrini kwa kuunda matunzio ya picha kwa kutumia Flexbox, na mpangilio wa makala ya jarida kwa kutumia Gridi ya CSS."
    ],
    "note": "Kumbuka: Baadhi ya viendelezi vya kivinjari, kama vile vizuizi vya matangazo na viendelezi vya hali ya giza vinaweza kutatiza majaribio. Ukikumbana na matatizo, tunapendekeza kuzima viendelezi vinavyorekebisha maudhui au mpangilio wa kurasa, wakati unachukua kozi.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Ukurasa wa Kushukuru",
        "intro": [
          "Huu ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda ukurasa wa kushukuru kwa somo ulilochagua, la kubuni au halisi."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Ukurasa wa Wavuti wa Kibinafsi",
        "intro": [
          "Huu ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda tovuti yako ya kibinafsi."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Ukurasa wa Kutua kwa Bidhaa (Product Landing Page)",
        "intro": [
          "Huu ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda ukurasa wa kutua wa bidhaa ili kuuza bidhaa unayopenda."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Fomu ya Utafiti",
        "intro": [
          "Huu ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda fomu ya utafiti ili kukusanya data kutoka kwa watumiaji wako."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Ukurasa wa Hati za Kiufundi",
        "intro": [
          "Huu ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda ukurasa wa hati za kiufundi ili kutumika kama maagizo au marejeleo ya mada."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Jifunze HTML kwa Kuunda Programu ya Picha ya Paka",
        "intro": [
          "Tagi za HTML hupa ukurasa wa tovuti muundo wake. Unaweza kutumia tagi za HTML kuongeza picha, vitufe na vipengele vingine kwenye ukurasa wako wa tovuti.",
          "Katika kozi hii, utajifunza tagi za kawaida za HTML kwa kuunda programu yako ya picha ya paka."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Jifunze Msingi wa CSS kwa Kuunda Menyu ya Mkahawa",
        "intro": [
          "CSS huambia kivinjari jinsi ya kuonyesha ukurasa wako wa wavuti. Unaweza kutumia CSS kuweka rangi, fonti, saizi na vipengele vingine vya vipengele vya HTML.",
          "Katika kozi hii, utajifunza CSS kwa kubuni ukurasa wa menyu kwa ukurasa wa wavuti wa mkahawa."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Jifunze CSS Box Model kwa Kutengeneza Mchoro wa Rothko",
        "intro": [
          "Kila kipengele cha HTML ni kisanduku chake - chenye nafasi zake na mpaka. Hii inaitwa Box Model.",
          "Katika kozi hii, utatumia CSS na Box Model kuunda vipande vyako vya sanaa vya mstatili vya mtindo wa Rothko."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Jifunze Vihifadhi vya CSS kwa Kujenga City Skyline",
        "intro": [
          "Vihifadhi vya CSS hukusaidia kupanga mitindo yako na kuitumia tena.",
          "Katika kozi hii, utaunda city skyline. Utajifunza jinsi ya kusanidi vihifadhi vya CSS ili uweze kuvitumia tena wakati wowote unapotaka."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Jifunze Fomu za HTML kwa Kuunda Fomu ya Usajili",
        "intro": [
          "Unaweza kutumia fomu za HTML kukusanya taarifa kutoka kwa watu wanaotembelea ukurasa wako wa tovuti.",
          "Katika kozi hii, utajifunza fomu za HTML kwa kuunda ukurasa wa kujisajili. Utajifunza jinsi ya kudhibiti ni aina gani za data ambazo watu wanaweza kuandika kwenye fomu yako, na baadhi ya zana mpya za CSS za kutengeneza ukurasa wako."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Jifunze Accessibility kwa Kuunda Maswali",
        "intro": [
          "Accessibility ni kufanya ukurasa wako wa wavuti kuwa rahisi kwa watu wote kutumia – hata watu wenye ulemavu.",
          "Katika kozi hii, utaunda ukurasa wa wavuti wa maswali. Utajifunza zana za ufikivu kama vile mikato ya kibodi, sifa za ARIA na mbinu bora za kubuni."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Jifunze Intermediate CSS kwa Kuunda Mchoro wa Picasso",
        "intro": [
          "Katika kozi hii, utajifunza jinsi ya kutumia baadhi ya mbinu za intermediate CSS kwa kuunda ukurasa wako wa tovuti wa mchoro wa Picasso. Utajifunza kuhusu aikoni za SVG, CSS positioning, na uhakiki ujuzi mwingine wa CSS ambao umejifunza."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Jifunze Responsive Web Design kwa Kutengeneza Piano",
        "intro": [
          "Responsive Design huambia ukurasa wako wa tovuti jinsi unavyopaswa kuonekana kwenye skrini za ukubwa tofauti.",
          "Katika kozi hii, utatumia CSS na Muundo Msikivu kutengenza piano. Pia utajifunza zaidi kuhusu media quries na pseudo selectors."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Jifunze CSS Flexbox kwa Kuunda Photo Gallery",
        "intro": [
          "Flexbox hukusaidia kuunda ukurasa wako wa tovuti ili uonekane mzuri kwenye saizi yoyote ya skrini.",
          "Katika kozi hii, utatumia Flexbox kuunda ukurasa wa tovuti wa matunzio ya picha (photo gallery)."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Jifunze CSS Grid kwa Kuunda Jarida",
        "intro": [
          "CSS Grid hukupa udhibiti wa safu mlalo na safu wima za muundo wa ukurasa wako wa tovuti.",
          "Katika kozi hii, utaunda nakala ya gazeti. Utajifunza jinsi ya kutumia CSS Grid, ikijumuisha dhana kama safu mlalo na safu wima za gridi."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Jifunze Typography kwa Kuunda Lebo ya Lishe",
        "intro": [
          "Typography ni sanaa ya kupanga maandishi yako ili yasomeke kwa urahisi na kuendana na madhumuni yake.",
          "Katika kozi hii, utatumia uchapaji kuunda ukurasa wa wavuti wa lebo ya lishe. Utajifunza jinsi ya kutengeneza maandishi, kurekebisha urefu wa mstari, na kuweka maandishi yako kwa kutumia CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Jifunze CSS Transforms kwa Kuunda Pengwini",
        "intro": [
          "Unaweza kubadilisha vipengele vya HTML ili kuunda miundo ya kuvutia inayovutia macho ya msomaji wako. Unaweza kutumia vibadilishaji kuzungusha vipengele, kuvipima, na zaidi.",
          "Katika kozi hii, utaunda pengwini. Utatumia CSS transform ili kuweka na kurekebisha ukubwa wa sehemu za pengwini yako, kuunda mandharinyuma, na kuhuisha kazi yako."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Jifunze Uhuishaji wa CSS kwa Kuunda Gurudumu la Ferris",
        "intro": [
          "Unaweza kutumia CSS animation kuvutia sehemu mahususi za ukurasa wako wa tovuti na kuufanya uvutie zaidi.",
          "Katika kozi hii, utaunda gurudumu la Ferris. Utajifunza jinsi ya kutumia CSS kuhuisha vipengele, kuvibadilisha, na kurekebisha kasi yake."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Pata Maelezo Zaidi Kuhusu CSS Pseudo Selectors Kwa Kuunda Balance Sheet",
        "intro": [
          "Unaweza kutumia CSS pseudo selectors kubadilisha vipengee mahususi vya HTML.",
          "Katika kozi hii, utaunda laha kwa kutumia pseudo selectors. Utajifunza jinsi ya kubadilisha mtindo wa kipengele unapoelea juu yake kwa kutumia kipanya chako, na kuanzisha matukio mengine kwenye ukurasa wako wa tovuti."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Jifunze Rangi za CSS kwa Kuunda Seti ya Alama za Rangi",
        "intro": [
          "Kuchagua rangi zinazofaa kwa ukurasa wako wa tovuti kunaweza kuboresha pakubwa mvuto wa kupendeza kwa wasomaji wako.",
          "Katika kozi hii, utaunda seti ya alama za rangi. Utajifunza njia tofauti za kuweka thamani za rangi na jinsi ya kuunganisha rangi."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Learn Intermediate CSS by Building a Cat Painting",
        "intro": ["", ""]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Algorithms za JavaScript na Data Structures",
    "intro": [
      "Ingawa HTML na CSS hudhibiti maudhui na mtindo wa ukurasa, JavaScript inatumika kuifanya ishirikiane. Katika Uthibitishaji wa Algorithm ya JavaScript na Miundo ya Data, utajifunza misingi ya JavaScript ikijumuisha variables, arrays, objects, loops, na functions.",
      "Baada ya kuelewa misingi yake, utatumia maarifa hayo kwa kuunda algoriti ili kudhibiti strings, kurekebisha nambari, na hata kukokotoa mzingo wa Kituo cha Kimataifa cha Anga cha Juu.",
      "Njiani, pia utajifunza mitindo miwili muhimu ya upangaji au dhana: Object Oriented Programming (OOP) na Functional Programming (FP)."
    ],
    "note": "Kumbuka: Baadhi ya viendelezi vya kivinjari, kama vile ad-blockers na script-blockers vinaweza kuingilia majaribio. Ukikumbana na matatizo, tunapendekeza kuzima viendelezi vinavyorekebisha au kuzuia maudhui ya kurasa wakati wa mafunzo.",
    "blocks": {
      "basic-javascript": {
        "title": "Msingi wa JavaScript",
        "intro": [
          "JavaScript ni lugha ya uandishi unayoweza kutumia kufanya kurasa za wavuti kuingiliana. Ni moja ya teknolojia kuu za wavuti, pamoja na HTML na CSS, na inasaidiwa na vivinjari vyote vya kisasa.",
          "Katika kozi hii, utajifunza dhana za msingi za programu katika JavaScript. Utaanza na miundo msingi ya data kama vile nambari na strings. Kisha utajifunza kufanya kazi na arrays, objects, functions, loops, if/else statements, na zaidi."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, au ES, ni toleo sanifu la JavaScript. Kwa sababu vivinjari vyote vikuu vinafuata vipimo hivi, maneno ECMAScript na JavaScript yanaweza kubadilishana.",
          "Zaidi ya JavaScript uliyojifunza hadi wakati huu ilikuwa katika ES5 (ECMAScript 5), ambayo ilikamilishwa mwaka wa 2009. Ingawa bado unaweza kuandika programu katika ES5, JavaScript inabadilika mara kwa mara, na vipengele vipya vinatolewa kila mwaka.",
          "ES6, iliyotolewa mwaka wa 2015, iliongeza vipengele vingi vipya vyenye nguvu kwenye lugha. Katika kozi hii, utajifunza vipengele hivi vipya, ikiwa ni pamoja na arrow functions, destructuring, classes, promises, na modules."
        ]
      },
      "regular-expressions": {
        "title": "Regular Expressions",
        "intro": [
          "Regular expressions, mara nyingi hufupishwa kuwa \"regex\" au \"regexp\", ni ruwaza zinazosaidia watayarishaji programu kuendana, kutafuta, na kubadilisha maandishi. Regular expressions ina nguvu sana, lakini inaweza kuwa ngumu kusoma kwa sababu hutumia herufi maalum kutengeneza ulinganifu changamano zaidi na unaonyumbulika.",
          "Katika kozi hii, utajifunza jinsi ya kutumia herufi maalum, vikundi vya kunasa, mitazamo chanya na hasi, na mbinu zingine ili kulinganisha maandishi yoyote unayotaka."
        ]
      },
      "debugging": {
        "title": "Utatuzi (Debugging)",
        "intro": [
          "Utatuzi ni mchakato wa kupitia msimbo wako, kutafuta maswala yoyote, na kuyarekebisha.",
          "Masuala katika msimbo kwa ujumla huja katika aina tatu: syntax errors zinazozuia programu yako kufanya kazi, runtime errors ambapo msimbo wako una tabia isiyotarajiwa, au logical errors ambapo msimbo wako haufanyi ulichokusudia.",
          "Katika kozi hii, utajifunza jinsi ya kutumia JavaScript console kutatua programu na kuzuia masuala ya kawaida kabla hayajatokea."
        ]
      },
      "basic-data-structures": {
        "title": "Msingi wa Data Structures",
        "intro": [
          "Data inaweza kuhifadhiwa na kupatikana kwa njia nyingi. Tayari unajua baadhi ya miundo ya kawaida ya data ya JavaScript - arrays na objects.",
          "Katika kozi hii ya Msingi wa Data Structures, utajifunza zaidi kuhusu tofauti kati ya arrays na objects, na ambayo unaweza kutumia katika hali tofauti. Pia utajifunza jinsi ya kutumia mbinu muhimu za JS kama vile <code>splice()</code> na <code>Object.keys()</code> ili kufikia na kuendesha data."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Msingi wa Algorithm Scripting",
        "intro": [
          "Algorithm ni mfululizo wa maagizo ya hatua kwa hatua ambayo yanaelezea jinsi ya kufanya kitu.",
          "Kuandika algoriti yenye ufanisi husaidia kuvunja tatizo katika sehemu ndogo na kufikiria kwa makini jinsi ya kutatua kila sehemu kwa kutumia msimbo.",
          "Katika kozi hii, utajifunza misingi ya mawazo ya algoriti kwa kuandika kanuni ambazo hufanya kila kitu kutoka kwa kubadilisha halijoto hadi kushughulikia array changamano za 2D."
        ]
      },
      "object-oriented-programming": {
        "title": "Object Oriented Programming",
        "intro": [
          "OOP, au Object Oriented Programming, ni mojawapo ya mbinu kuu za mchakato wa ukuzaji wa programu. Katika OOP, objects na classes hupanga msimbo kuelezea mambo na kile wanachoweza kufanya.",
          "Katika kozi hii, utajifunza kanuni za msingi za OOP katika JavaScript, ikijumuisha neno kuu la <code>this</code>, prototype chains, constructors, na inheritance."
        ]
      },
      "functional-programming": {
        "title": "Functional Programming",
        "intro": [
          "Functional Programming ni njia nyingine maarufu ya ukuzaji wa programu. Katika Upangaji Utendaji, msimbo umepangwa katika vitendakazi vidogo vidogo ambavyo vinaweza kuunganishwa ili kuunda programu ngumu.",
          "Katika kozi hii, utajifunza dhana za msingi za Functional Programming ikijumuisha utendakazi safi, jinsi ya kuepuka mabadiliko, na jinsi ya kuandika msimbo safi kwa kutumia mbinu kama vile <code>.map()</code> na <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Intermediate Algorithm Scripting",
        "intro": [
          "Kwa kuwa sasa unajua misingi ya kufikiri kwa kufuata kanuni za algoriti, pamoja na OOP na Functional Programming, jaribu ujuzi wako kwa changamoto za Uandikaji wa Algorithm ya Kati."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "Miradi ya JavaScript Algorithms na Data Structures",
        "intro": [
          "Huu ndio wakati wa kuweka ujuzi wako mpya wa JavaScript kufanya kazi. Miradi hii ni sawa na changamoto za uandishi wa algorithm ambazo umefanya hapo awali – ila ni ngumu zaidi.",
          "Kamilisha miradi hii 5 ya JavaScript ili upate cheti cha JavaScript Algorithms and Data Structures."
        ]
      }
    }
  },
  "2022/javascript-algorithms-and-data-structures": {
    "title": "JavaScript Algorithms and Data Structures (Beta)",
    "intro": ["placeholder", "placeholder"],
    "note": "",
    "blocks": {
      "build-a-caesars-cipher-project": {
        "title": "Unda Mradi wa Cipher wa Kaisari",
        "intro": ["", ""]
      },
      "build-a-cash-register-project": {
        "title": "Unda Mradi wa Cash Register",
        "intro": ["", ""]
      },
      "build-a-palindrome-checker-project": {
        "title": "Unda Mradi wa Palindrome Checker",
        "intro": ["", ""]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Unda Mradi wa Kubadilisha Nambari za Kirumi",
        "intro": ["", ""]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Unda Mradi wa Kuthibitisha Nambari ya Simu",
        "intro": ["", ""]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Jifunze Misingi ya JavaScript kwa Kuunda Mchezo wa Role Playing",
        "intro": ["", ""]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Jifunze Uthibitishaji wa Fomu kwa Kuunda Calorie Counter",
        "intro": ["", ""]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Jifunze Functional Programming kwa Kuunda Spreadsheet",
        "intro": ["", ""]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Jifunze Mbinu za Kisasa za JavaScript Kwa Kuunda Kadi za Timu ya Soka",
        "intro": ["", ""]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Jifunze Mbinu za Kina za Array kwa Kuunda Kikokotoo cha Takwimu",
        "intro": ["", ""]
      },
      "learn-data-structures-by-building-a-shopping-cart": {
        "title": "Jifunze Data Structures Kwa Kuunda Shopping Cart",
        "intro": ["", ""]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Jifunze Fetch na Promises Kwa Kuunda Ukurasa wa Waandishi wa fCC",
        "intro": ["", ""]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Jifunze Regular Expressions kwa Kuunda Spam Filter",
        "intro": ["", ""]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Jifunze Msingi wa Algorithmic Thinking kwa Kuunda Kipanga Nambari",
        "intro": ["", ""]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Front End Development Libraries",
    "intro": [
      "Kwa kuwa sasa unafahamu HTML, CSS na JavaScript, ongeza ujuzi wako kwa kujifunza baadhi ya maktaba maarufu za front end kwenye sekta hiyo.",
      "Katika cheti cha Front End Development Libraries, utajifunza jinsi ya kutengeneza tovuti yako haraka na Bootstrap. Pia utajifunza jinsi ya kuongeza mantiki kwenye mitindo yako ya CSS na kuiendeleza kwa Sass.",
      "Baadaye, utaunda shopping cart na programu zingine ili kujifunza jinsi ya kuunda Single Page Applications (SPAs) kwa kutumia React na Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap ni mfumo wa front end unaotumiwa kuunda kurasa za wavuti na programu zinazoitikia. Inahitaji mbinu ya kwanza ya rununu kwa ukuzaji wa wavuti, na inajumuisha mitindo na madarasa ya CSS yaliyoundwa mapema, pamoja na utendaji wa JavaScript.",
          "Katika kozi hii, utajifunza jinsi ya kuunda tovuti responsive kwa kutumia Bootstrap, na kutumia madarasa yake yaliyojumuishwa ili kuunda vitufe, picha, fomu, urambazaji na vipengele vingine vya kawaida."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery ni mojawapo ya maktaba za JavaScript zinazotumiwa sana ulimwenguni.",
          "Mnamo 2006 ilipotolewa, vivinjari vyote vikuu vilishughulikia JavaScript kwa njia tofauti kidogo. jQuery imerahisisha mchakato wa kuandika JavaScript ya upande wa mteja na pia ilihakikisha kuwa msimbo wako inafanya kazi kwa njia ile ile katika vivinjari vyote.",
          "Katika kozi hii, utajifunza jinsi ya kutumia jQuery kuchagua, kuondoa, kuiga, na kurekebisha vipengele tofauti kwenye ukurasa."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, au \"Syntactically Awesome StyleSheets\", ni kiendelezi cha lugha cha CSS. Inaongeza vipengele ambavyo havipatikani katika CSS msingi, ambayo hukurahisishia kurahisisha na kudumisha laha za mtindo kwa ajili ya miradi yako.",
          "Katika kozi hii ya Sass, utajifunza jinsi ya kuhifadhi data katika variables, nest CSS, kuunda mitindo inayoweza kutumika tena na michanganyiko, kuongeza mantiki na mizunguko kwenye mitindo yako, na zaidi."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React ni maktaba maarufu ya JavaScript kwa ajili ya kujenga violesura vinavyoweza kutumika tena, vinavyoendeshwa na vipengele vya kurasa za wavuti au programu.",
          "React inachanganya HTML na utendaji wa JavaScript katika lugha yake ya ghafi iitwayo JSX. React pia hurahisisha kudhibiti mtiririko wa data katika programu tumizi.",
          "Katika kozi hii, utajifunza jinsi ya kuunda vipengee tofauti vya React, kudhibiti data katika mfumo wa state props, kutumia mbinu tofauti za mzunguko kama vile <code>componentDidMount</code>, na mengi zaidi."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "Kadiri programu zinavyokua kwa ukubwa na upeo, kudhibiti data iliyoshirikiwa inakuwa vigumu zaidi. Redux inafafanuliwa kama \"predictable state container for JavaScript apps\" ambayo husaidia kuhakikisha programu zako zinafanya kazi kwa kutabirika, na ni rahisi kuzifanyia majaribio.",
          "Ingawa unaweza kutumia Redux na maktaba yoyote ya kutazama, tunatanguliza Redux hapa kabla ya kuichanganya na React katika seti inayofuata ya kozi.",
          "Katika kozi hii, utajifunza misingi ya Redux stores, actions, reducers na middleware ili kudhibiti data katika programu yako yote."
        ]
      },
      "react-and-redux": {
        "title": "React na Redux",
        "intro": [
          "React na Redux mara nyingi hutajwa pamoja, na kwa sababu nzuri. Msanidi programu aliyeunda Redux alikuwa msanidi programu wa React ambaye alitaka kurahisisha kushiriki data kwenye vipengele tofauti.",
          "Kwa kuwa sasa unajua jinsi ya kudhibiti mtiririko wa data iliyoshirikiwa na Redux, ni wakati wa kuchanganya maarifa hayo na React. Katika kozi za React na Redux, utaunda kipengele cha React na kujifunza jinsi ya kudhibiti state katika kiwango cha component, na katika programu nzima ya Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Miradi ya Front End Development Libraries",
        "intro": [
          "Ni wakati wa kujaribu ujuzi wako wa ukuzaji wa front end libraries. Tumia Bootstrap, jQuery, Sass, React, na Redux kuunda miradi 5 ambayo itajaribu kila kitu ambacho umejifunza hadi sasa.",
          "Kamilisha miradi yote 5, na utapata cheti cha Front End Development Libraries."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Data Visualization",
    "intro": [
      "Data iko pande zote, lakini haimaanishi mengi bila umbo au muktadha.",
      "Katika Cheti cha Data Visualization, utaunda chati, grafu na ramani ili kuwasilisha aina tofauti za data kwenye maktaba ya D3.js.",
      "Pia utajifunza kuhusu JSON (JavaScript Object Notation), na jinsi ya kufanya kazi na data mtandaoni kwa kutumia API (Application Programming Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Data Visualization na D3",
        "intro": [
          "D3, au D3.js, inasimamia Data Driven Documents. Ni maktaba ya JavaScript ya kuunda taswira za data wasilianifu katika kivinjari.",
          "D3 imeundwa kufanya kazi na viwango vya kawaida vya wavuti – yaani HTML, CSS, na Scalable Vector Graphics (SVG).",
          "D3 inasaidia aina nyingi tofauti za umbizo la data ya ingizo. Kisha, kwa kutumia mbinu zake zenye nguvu zilizojengewa ndani, unaweza kubadilisha data hizo kuwa chati, grafu na ramani tofauti.",
          "Katika kozi hii ya Data Visualization na D3, utajifunza jinsi ya kufanya kazi na data ili kuunda chati tofauti, grafu, vipengele vya kuelea na viungo vingine ili kuunda taswira ya data inayobadilika na ya kuvutia."
        ]
      },
      "json-apis-and-ajax": {
        "title": "JSON APIs na AJAX",
        "intro": [
          "Sawa na jinsi UI husaidia watu kutumia programu, API (Application Programming Interfaces) husaidia programu kuingiliana na programu zingine. API ni zana ambazo kompyuta hutumia kuwasiliana na nyingine, kwa sehemu kutuma na kupokea data.",
          "Watengenezaji wa programu mara nyingi hutumia AJAX (Asynchronous JavaScript and XML) wakati wa kufanya kazi na API. AJAX inarejelea kundi la teknolojia zinazofanya maombi yasiyolingana kwa seva ili kuhamisha data, kisha kupakia data yoyote iliyorejeshwa kwenye ukurasa. Na data inayohamishwa kati ya kivinjari na seva mara nyingi huwa katika umbizo linaloitwa JSON (JavaScript Object Notation).",
          "Kozi hii itakufundisha misingi ya kufanya kazi na API na teknolojia tofauti za AJAX kwenye kivinjari."
        ]
      },
      "data-visualization-projects": {
        "title": "Miradi ya Data Visualization",
        "intro": [
          "Kwa kuwa sasa umejifunza jinsi ya kufanya kazi na teknolojia za D3, API na AJAX, jaribu ujuzi wako ukitumia miradi hii 5 ya Kuonyesha Data.",
          "Katika miradi hii, utahitaji kuleta data na kuchanganua mkusanyiko wa data, kisha utumie D3 kuunda taswira tofauti za data. Maliza yote ili upate cheti chako cha Data Visualization."
        ]
      },
      "d3-dashboard": {
        "title": "Dashibodi ya D3",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Relational Database",
    "intro": [
      "Kwa kozi hizi, utatumia zana na programu halisi za wasanidi programu ikijumuisha VS Code, PostgreSQL, na mstari wa amri wa Linux / Unix ili kukamilisha mafunzo shirikishi na kujenga miradi.",
      "Kozi hizi huanza na amri za kimsingi za Bash. Kwa kutumia terminal, utajifunza kila kitu kutoka kwa kusogeza na kudhibiti mfumo wa faili, na uandishi katika Bash, hadi utumiaji wa hali ya juu.",
      "Kisha, utajifunza jinsi ya kuunda na kutumia relational database na PostgreSQL, mfumo wa usimamizi wa hifadhidata, na SQL, lugha ya hifadhidata hizi.",
      "Mwishowe, utajifunza Git, mfumo wa udhibiti wa toleo, zana muhimu ya kila msanidi programu."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "Hifadhidata ya Celestial Bodies",
        "intro": [
          "Hii ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda hifadhidata ya celestial bodies kwa kutumia PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Mchezo wa Kukisia Nambari",
        "intro": [
          "Hii ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utatumia uandishi wa Bash, PostgreSQL, na Git kuunda mchezo wa kubahatisha nambari unaoendeshwa kwenye terminal na kuhifadhi maelezo ya mtumiaji."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "Hifadhidata ya Periodic Table",
        "intro": [
          "Hii ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda hati ya Bash ili kupata maelezo kuhusu vipengele vya kemikali kutoka kwa hifadhidata ya periodic table."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Mratibu wa Uteuzi wa Saluni",
        "intro": [
          "Hii ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda programu shirikishi ya Bash inayotumia PostgreSQL kufuatilia wateja na miadi ya saluni yako."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "Hifadhidata ya Kombe la Dunia",
        "intro": [
          "Hii ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda hati ya Bash inayoingiza taarifa kutoka kwa michezo ya Kombe la Dunia katika PostgreSQL, kisha uulize hifadhidata kwa takwimu muhimu."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Jifunze Advanced Bash kwa Kuunda Kitafsiri cha Kitty Ipsum",
        "intro": [
          "Kuna zaidi kwa amri za Bash kuliko unavyoweza kufikiria.",
          "Katika kozi hii ya masomo 140, utajifunza amri changamano zaidi na maelezo ya jinsi amri zinavyofanya kazi."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Jifunze Bash na SQL kwa Kujenga Duka la Kukodisha Baiskeli",
        "intro": [
          "Katika kozi hii ya masomo 210, utaunda programu shirikishi ya Bash ambayo huhifadhi maelezo ya kukodisha kwa duka lako la kukodisha baiskeli kwa kutumia PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Jifunze Bash kwa Kuunda Boilerplate",
        "intro": [
          "Terminal inakuwezesha kutuma amri za maandishi kwa kompyuta yako ambayo inaweza kuendesha mfumo wa faili, kuendesha programu, kazi za otomatiki, na mengi zaidi.",
          "Katika kozi hii ya masomo 170, utajifunza amri za terminal kwa kuunda boilerplate ya tovuti kwa kutumia tu mstari wa amri."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Jifunze Bash Scripts kwa Kuunda Programu Tano",
        "intro": [
          "Bash scripts huunganizha amri za terminal na mantiki katika programu zinazoweza kutekeleza au kufanya kazi otomatiki, na mengi zaidi.",
          "Katika kozi hii ya masomo 220, utajifunza amri zaidi za terminal na jinsi ya kuzitumia ndani ya hati za Bash kwa kuunda programu tano ndogo."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Jifunze Git kwa Kuunda SQL Reference Object",
        "intro": [
          "Git ni mfumo wa udhibiti wa toleo ambao hufuatilia mabadiliko yote unayofanya kwenye msimbo wako.",
          "Katika kozi hii ya masomo 240, utajifunza jinsi Git hufuatilia msimbo wako kwa kuunda kitu kilicho na amri za SQL zinazotumiwa sana."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Jifunze Nano kwa Kuunda Ngome",
        "intro": [
          "Nano ni programu ambayo hukuruhusu kuhariri faili moja kwa moja kwenye terminal.",
          "Katika kozi hii ya masomo 40, utajifunza jinsi ya kuhariri faili katika terminal na Nano wakati wa kujenga ngome."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Jifunze Relational Databases kwa Kuunda Mario Database",
        "intro": [
          "Relational database hupanga data katika majedwali ambayo yameunganishwa pamoja kupitia uhusiano.",
          "Katika kozi hii ya masomo 165, utajifunza misingi ya relational database kwa kuunda PostgreSQL database iliyojaa wahusika wa mchezo wa video."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Jifunze SQL kwa Kuunda Hifadhidata ya Wanafunzi: Sehemu ya 1",
        "intro": [
          "SQL, au Structured Query Language, ni lugha ya kuwasiliana na relational database.",
          "Katika kozi hii ya masomo 140, utaunda hati ya Bash inayotumia SQL kuingiza taarifa kuhusu wanafunzi wako wa sayansi ya kompyuta katika PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Jifunze SQL kwa Kuunda Hifadhidata ya Wanafunzi: Sehemu ya 2",
        "intro": [
          "Amri za SQL join hutumiwa kuunganisha taarifa kutoka kwa jedwali nyingi katika relational database",
          "Katika kozi hii ya masomo 140, utakamilisha hifadhidata yako ya wanafunzi huku ukizama zaidi katika amri za SQL."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Back End Development and APIs",
    "intro": [
      "Hadi kufikia hatua hii, umetumia JavaScript iliyo upande wa mbele pekee ili kuongeza mwingiliano kwenye ukurasa, kutatua changamoto za kanuni au kuunda SPA. Lakini JavaScript pia inaweza kutumika upande wa nyuma, au seva, kuunda programu nzima za wavuti.",
      "Leo, mojawapo ya njia maarufu za kuunda programu ni kupitia huduma ndogo, ambazo ni ndogo, programu ambazo kwa kawaida hufanya kazi pamoja ili kuunda nzima zaidi.",
      "Katika cheti cha Back End Development and APIs, utajifunza jinsi ya kuandika upya programu ukitumia Node.js na npm. Pia utaunda programu za wavuti kwa mfumo wa Express, na utaunda programu ndogo ya People Finder na MongoDB na maktaba ya Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Kusimamia Vifurushi na NPM",
        "intro": [
          "npm (Node Package Manager), ni zana ya mstari wa amri ya kusakinisha, kuunda, na kushiriki vifurushi vya msimbo wa JavaScript ulioandikwa kwa Node.js. Kuna vifurushi vingi vya programu huria vinavyopatikana kwenye npm, kwa hivyo kabla ya kuanza mradi, chukua muda kuchunguza ili usiishie kutengeneza gurudumu la vitu kama kufanya kazi na tarehe au kupata data kutoka kwa API.",
          "Katika kozi hii, utajifunza misingi ya kutumia npm, ikijumuisha jinsi ya kufanya kazi na <code>package.json</code> na jinsi ya kudhibiti utegemezi wako uliosakinishwa."
        ]
      },
      "basic-node-and-express": {
        "title": "Msingi wa Node na Express",
        "intro": [
          "Node.js ni muda wa utekelezaji wa JavaScript ambao huruhusu wasanidi programu kuandika programu za nyuma (upande wa seva) katika JavaScript. Node.js huja na moduli chache zilizojengewa ndani - programu ndogo zinazojitegemea - ambazo husaidia na hili. Baadhi ya moduli za msingi ni pamoja na HTTP, ambayo hufanya kazi kama seva, na Mfumo wa Faili, moduli ya kusoma na kurekebisha faili.",
          "Katika seti ya mwisho ya kozi, ulijifunza kusakinisha na kudhibiti vifurushi kutoka npm, ambavyo ni makusanyo ya moduli ndogo. Vifurushi hivi vinaweza kukusaidia kuunda programu kubwa na ngumu zaidi.",
          "Express ni mfumo mwepesi wa maombi ya wavuti na ni mojawapo ya vifurushi maarufu kwenye npm. Express hurahisisha zaidi kuunda seva na kushughulikia uelekezaji wa programu yako, ambayo hushughulikia mambo kama vile kuelekeza watu kwenye ukurasa sahihi wanapotembelea sehemu fulani ya mwisho kama vile <pre>/blog</pre>.",
          "Katika kozi hii, utajifunza misingi ya Node na Express ikijumuisha jinsi ya kuunda seva, kuhudumia faili tofauti, na kushughulikia maombi tofauti kutoka kwa kivinjari."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB na Mongoose",
        "intro": [
          "MongoDB ni programu ya hifadhidata ambayo huhifadhi hati za JSON (au rekodi) ambazo unaweza kutumia katika programu yako. Tofauti na SQL, aina nyingine ya hifadhidata, MongoDB ni hifadhidata isiyo ya uhusiano au \"NoSQL\". Hii inamaanisha kuwa MongoDB huhifadhi data zote zinazohusiana ndani ya rekodi moja, badala ya kuihifadhi kwenye jedwali nyingi zilizowekwa kama kwenye hifadhidata ya SQL.",
          "Mongoose ni kifurushi maarufu cha npm cha kuingiliana na MongoDB. Ukiwa na Mongoose, unaweza kutumia JavaScript wazi badala ya JSON, ambayo hurahisisha kufanya kazi na MongoDB. Pia, hukuruhusu kuunda michoro ya hati zako zinazoitwa schemas, ili usihifadhi kwa bahati mbaya aina mbaya ya data na kusababisha hitilafu baadaye.",
          "Katika kozi za MongoDB na Mongoose, utajifunza misingi ya kufanya kazi na data inayoendelea ikiwa ni pamoja na jinsi ya kuweka muundo, na kuhifadhi, kufuta na kupata hati katika hifadhidata."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Miradi ya Back End Development na APIs",
        "intro": [
          "Umefanya kazi na API hapo awali, lakini kwa kuwa sasa unajua npm, Node, Express, MongoDB, na Mongoose, ni wakati wa kuunda yako mwenyewe. Chora kwenye kila kitu ambacho umejifunza hadi kufikia hatua hii ili kuunda huduma ndogo 5 tofauti, ambazo ni programu ndogo ambazo zina upeo mdogo.",
          "Baada ya kuunda hizi, utakuwa na API 5 nzuri za huduma ndogo unazoweza kuwaonyesha marafiki, familia na waajiri watarajiwa. Lo, na utakuwa na cheti kipya cha Back End Development na APIs, pia."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Ubora (Quality Assurance)",
    "intro": [
      "Kadiri programu au programu zako za wavuti zinavyozidi kuwa ngumu, utataka kuzijaribu ili kuhakikisha kuwa mabadiliko mapya hayavunji utendakazi wao asili.",
      "Katika cheti cha Quality Assurance, utajifunza jinsi ya kuandika majaribio na Chai ili kuhakikisha kuwa programu zako hufanya kazi jinsi unavyotarajia.",
      "Kisha utaunda programu ya gumzo ili kujifunza dhana za hali ya juu za Node na Express. Pia utatumia Pug kama injini ya kiolezo, Pasipoti ya uthibitishaji, na Socket.io kwa mawasiliano ya wakati halisi kati ya seva na wateja waliounganishwa."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Quality Assurance and Testing kutumia Chai",
        "intro": [
          "Chai ni maktaba ya majaribio ya JavaScript ambayo hukusaidia kuthibitisha kuwa programu yako bado inafanya kazi jinsi unavyotarajia baada ya kufanya mabadiliko kwenye msimbo wako.",
          "Kwa kutumia Chai, unaweza kuandika majaribio ambayo yanaelezea mahitaji ya programu yako na kuona kama programu yako inayatimiza.",
          "Katika kozi hii, utajifunza kuhusu madai, usawa wa kina, ukweli, API za majaribio, na mambo mengine msingi ya kujaribu programu za JavaScript."
        ]
      },
      "advanced-node-and-express": {
        "title": "Advanced Node na Express",
        "intro": [
          "Sasa ni wakati wa kuzama ndani ya Node.js na Express.js kwa kuunda programu ya gumzo na mfumo wa kuingia.",
          "Ili kutekeleza mfumo wa kuingia katika akaunti kwa usalama, utahitaji kujifunza kuhusu uthibitishaji. Hiki ni kitendo cha kuthibitisha utambulisho wa mtu au mchakato.",
          "Katika kozi hii, utajifunza jinsi ya kutumia Pasipoti kudhibiti uthibitishaji, Pug kuunda violezo vinavyoweza kutumika tena kwa ajili ya kujenga sehemu ya mbele haraka, na soketi za wavuti kwa mawasiliano ya wakati halisi kati ya wateja na seva."
        ]
      },
      "quality-assurance-projects": {
        "title": "Miradi ya Quality Assurance",
        "intro": [
          "Sasa kwa kuwa umefahamu vyema sehemu ya mbele na ya nyuma, ni wakati wa kutumia ujuzi na dhana zote ambazo umejifunza hadi kufikia hatua hii. Utaunda programu 5 tofauti za wavuti, na uandike majaribio kwa kila moja ili kuhakikisha kuwa zinafanya kazi na zinaweza kushughulikia kesi tofauti tofauti.",
          "Baada ya kukamilisha miradi hii ya Quality Assurance, utakuwa na miradi 5 zaidi chini ya ukanda wako, na uthibitisho mpya wa kujionyesha kwenye wasifu yako."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Scientific Computing na Python",
    "intro": [
      "Python ni mojawapo ya lugha maarufu zaidi za programu leo. Unaweza kuitumia kwa kila kitu kuanzia uandishi wa kimsingi hadi ujifunzaji wa mashine.",
      "Katika cheti hiki cha Scientific Computing na Python, utajifunza misingi ya Python kama vile variables, loops, conditionals, na functions. Kisha utaongeza haraka miundo changamano ya data, mitandao, hifadhidata za uhusiano, na taswira ya data."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python kwa kila Mtu",
        "intro": [
          "Python kwa kila Mtu ni mfululizo wa kozi za video za bure zinazofundisha misingi ya kutumia Python 3.",
          "Kozi hizo ziliundwa na Dk. Charles Severance (pia anajulikana kama Dk. Chuck). Yeye ni Profesa wa Kliniki katika Shule ya Habari ya Chuo Kikuu cha Michigan, ambapo anafundisha kozi mbalimbali zinazozingatia teknolojia ikiwa ni pamoja na programu, muundo wa hifadhidata, na ukuzaji wa wavuti."
        ]
      },
      "scientific-computing-with-python-projects": {
        "title": "Miradi ya Scientific Computing with Python",
        "intro": [
          "Ni wakati wa kujaribu ujuzi wako wa Python. Kwa kukamilisha miradi hii, utaonyesha kuwa una ujuzi mzuri wa msingi wa Python na unahitimu kwa Cheti cha Scientific Computing with Python."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Data Analysis na Python",
    "intro": [
      "Uchambuzi wa Data umekuwepo kwa muda mrefu. Lakini hadi miaka michache iliyopita, watengenezaji waliifanyia mazoezi kwa kutumia zana ghali, zisizo na chanzo kama vile Tableau. Lakini hivi majuzi, Python, SQL, na maktaba zingine zilizo wazi zimebadilisha Uchambuzi wa Data milele.",
      "Katika Cheti cha Data Analysis na Python, utajifunza misingi ya uchanganuzi wa data na Python. Kufikia mwisho wa uthibitishaji huu, utajua jinsi ya kusoma data kutoka vyanzo kama vile CSVs na SQL, na jinsi ya kutumia maktaba kama vile Numpy, Pandas, Matplotlib na Seaborn kuchakata na kuona data."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Data Analysis na Python",
        "intro": [
          "Katika kozi hizi za kina za video, iliyoundwa na Santiago Basulto, utajifunza mchakato mzima wa uchambuzi wa data. Utakuwa unasoma data kutoka kwa vyanzo vingi (CSV, SQL, Excel), kuchakata data hiyo kwa kutumia NumPy na Pandas, na kuibua kwa kutumia Matplotlib na Seaborn,",
          "Zaidi ya hayo, tumejumuisha kozi kamili ya Jupyter Notebook, na rejeleo la haraka la Python ili kukukumbusha ujuzi wako wa kuandika programu."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Jifunze misingi ya maktaba ya NumPy katika kozi ifuatayo ya video iliyoundwa na Keith Galli.",
          "Katika kozi hii, utajifunza jinsi NumPy inavyofanya kazi na jinsi inavyolinganishwa na orodha zilizojengwa za Python. Pia utajifunza jinsi ya kuandika msimbo na NumPy, kuorodhesha, kuunda upya, takwimu zilizotumika, na mengi zaidi."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Miradi ya Data Analysis na Python",
        "intro": [
          "Kuna njia nyingi za kuchambua data na Python. Kwa kukamilisha miradi hii, utaonyesha kuwa una ujuzi mzuri wa msingi wa uchambuzi wa data na Python.",
          "Maliza zote ili kupata Cheti cha Data Analysis na Python."
        ]
      }
    }
  },
  "information-security": {
    "title": "Information Security",
    "intro": [
      "Pamoja na kila kitu tunachofanya mtandaoni, kuna kiasi kikubwa cha taarifa nyeti hatarini: anwani za barua pepe, nenosiri, nambari za simu na mengine mengi.",
      "Ukiwa na Cheti cha Information Security, utaunda programu salama ya wavuti ukitumia HelmetJS ili kujifunza mambo msingi ya kulinda taarifa za watu mtandaoni.",
      "Pia utaunda TCP client, na Nmap na port scanner kwenye Python. Hii itakusaidia kujifunza misingi ya penetration testing — sehemu muhimu ya usalama mzuri wa habari."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Information Security na HelmetJS",
        "intro": [
          "Kozi hii ya upangaji inaangazia HelmetJS, aina ya vifaa vya kati vya programu zinazotumia Express ambavyo huweka vichwa vya HTTP kiotomatiki. Kwa njia hii inaweza kuzuia taarifa nyeti kupitishwa bila kukusudia kati ya seva na mteja.",
          "Kukamilisha kozi zilizo hapa chini kutakusaidia kuelewa jinsi ya kulinda tovuti yako dhidi ya uovu."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python kwa Penetration Testing",
        "intro": [
          "Kozi hizi za video hukufundisha penetration testing na Python. Pia hujulikana kama pen test, penetration testing ni shambulio la kuigwa dhidi ya mfumo ili kuangalia udhaifu.",
          "Katika kozi hii, utajifunza kuhusu sockets, kuunda client na server TCP, kuunda Nmap scanner, na zana na mbinu zingine ambazo wajaribu kalamu hutumia kila siku."
        ]
      },
      "information-security-projects": {
        "title": "Miradi ya Information Security",
        "intro": [
          "Sasa ni wakati wa kuweka ujuzi wako mpya wa usalama wa habari kufanya kazi. Miradi hii itakupa nafasi ya kutumia ujuzi, kanuni na dhana za infosec ambazo umejifunza.",
          "Ukimaliza, utakuwa na miradi mingi ya usalama wa taarifa chini ya ukanda wako, pamoja na cheti ambacho unaweza kuonyesha kwa marafiki, familia na waajiri."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Machine Learning na Python",
    "intro": [
      "Kujifunza kwa mashine kuna matumizi mengi ya vitendo ambayo unaweza kutumia katika miradi yako au kazini.",
      "Katika Cheti cha Machine Learning na Python, utatumia mfumo wa TensorFlow kujenga neural networks kadhaa na kuchunguza mbinu za juu zaidi kama vile kuchakata lugha asilia na ujifunzaji wa uimarishaji.",
      "Pia utaingia kwenye neural networks, na kujifunza kanuni za neural networks na inavyofanya kazi."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "TensorFlow ni mfumo wa chanzo huria ambao hurahisisha utumiaji wa ujifunzaji wa mashine na mtandao wa neva.",
          "Kozi ifuatayo ya video iliundwa na Tim Ruscica, pia inajulikana kama “Tech With Tim”. Itakusaidia kuelewa TensorFlow na baadhi ya uwezo wake wenye nguvu."
        ]
      },
      "how-neural-networks-work": {
        "title": "Jinsi Neural Networks inavyofanya kazi",
        "intro": [
          "Neural networks ndio msingi wa kile tunachoita artificial intelligence leo. Lakini kihistoria imekuwa ngumu kuelewa. Hasa kwa wanaoanza katika uwanja machine learning.",
          "Hata kama wewe ni mgeni kabisa kwa neural networks, kozi hizi za video za Brandon Rohrer zitakufanya uelewe dhana na hesabu nyuma yao."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Miradi ya Machine Learning with Python",
        "intro": [
          "Machine learning ina matumizi mengi ya vitendo. Kwa kukamilisha miradi hii ya usimbaji isiyolipishwa na yenye changamoto, utaonyesha kuwa una ujuzi mzuri wa msingi wa kujifunza kwa mashine, na kufuzu kwa Cheti cha Machine Learning with Python."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "College Algebra with Python",
    "intro": [
      "Kozi hii imeundwa kama kozi ya chuo cha muhula mmoja. Inajumuisha video za mafundisho, na madaftari ya Ushirikiano ya Google ili kufuata kwa maingiliano, kazi, na miradi yenye changamoto.",
      "Unapopitia kila sehemu ya kozi hii katika mlolongo, utapata ufahamu kamili wa Algebra na jinsi ya kuandika msimbo wa Python kutatua matatizo ya Algebra.",
      "Katika kozi hii yote, pia utaunda daftari lako la Algebra Colab ambalo utaweza kutumia kama kikokotoo chako maalum. Kozi hii (na msimbo unaoandika hapa) itakupa msingi wa uelewa wa kina wa sayansi ya hesabu na data."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Jifunze Ratios na Proportions",
        "intro": [
          "Safari yako inaanzia hapa unapojifunza jinsi ya kusanidi Daftari la Colab ambalo linaweza kutumia msimbo wa Python. Kisha, tumia daftari kufuata pamoja na video ili kujifunza ratios na proportions kwa kutumia Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Jifunze Jinsi ya Kutatua kwa X",
        "intro": [
          "Kitengo hiki kitazingatia jinsi ya kutatua nambari isiyojulikana (mara nyingi hujulikana kama \"x\") kwa kutumia msimbo wa Algebra na Python iliyoandikwa."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Jifunze Fractions na Decimals",
        "intro": [
          "Kitengo hiki kitalenga kubadilisha desimali hadi sehemu na asilimia."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Jifunze Functions na Graphing",
        "intro": ["Kitengo hiki kitakufundisha kuhusu vitendakazi za hesabu."]
      },
      "learn-linear-functions": {
        "title": "Jifunze Linear Functions",
        "intro": [
          "Kitengo hiki kitakuonyesha jinsi ya kutengeneza milinganyo ya mstari (linear equations) kutoka kwa pointi mbili."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Jifunze Common Factors na Square Roots",
        "intro": [
          "Katika kitengo hiki, utajifunza jinsi ya kupata sababu za kawaida na kuzigawanya. Hii itakuwa muhimu wakati wa kurahisisha sehemu na kuweka mizizi ya mraba."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Kikokotoo cha kazi nyingi",
        "intro": [
          "Hii ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda kikokotoo cha kazi nyingi."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Jifunze Jinsi ya Kuchora Mifumo ya Milingano",
        "intro": [
          "Kitengo hiki kitazingatia kuchora milinganyo miwili kwenye ukurasa moja wa kuratibu ili uweze kuona mahali mistari inapoingiliana."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Jifunze Jinsi ya Kutatua Mifumo ya Milingano",
        "intro": [
          "Katika kitengo hiki, utajifunza jinsi ya kutatua mfumo wa equations mbili (na vigezo viwili) bila graphing. Utaona jinsi unavyoweza kuzingatia equation na kutatua kwa kutofautisha fulani katika Python. Kufikia mwisho wa kitengo hiki, utaweza kutatua na kuchora mfumo kwa block moja ya msimbo."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Jifunze Utumiaji wa Mifumo ya Linear",
        "intro": [
          "Katika kitengo hiki, utaona jinsi unavyoweza kutumia aljebra uliyojifunza kufikia sasa kutatua matatizo ya ulimwengu halisi."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Jifunze Quadratic Equations",
        "intro": [
          "Kitengo hiki kitaenda zaidi ya linear equations, ili kufanya kazi na vielelezo na vielelezo vya grafu. Utajifunza jinsi ya kupata pointi muhimu katika parabolas na jinsi ya kutatua quadratic equations."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Kikokotoo cha Graphing",
        "intro": [
          "Hii ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda kikokotoo cha graphing."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Jifunze Parent Graphs na Polynomials",
        "intro": [
          "Kitengo hiki kitakuonyesha aina nyingi tofauti za \"parent\" graphs, miundo msingi inayounda grafu ngumu zaidi. Polynomials ni maneno ya hisabati yenye \"vitu vingi\" - milinganyo changamano zaidi ambayo hujengwa kwa ruwaza msingi. Utaona jinsi grafu hizi zinavyoonekana, jinsi ya kuzirekebisha, na jinsi ya kufanya haya yote na msimbo wa Python."
        ]
      },
      "build-three-math-games-project": {
        "title": "Michezo mitatu ya Hisabati",
        "intro": [
          "Hii ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda michezo mitatu ya hesabu."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Jifunze Matumizi ya Biashara ya Chuo cha Algebra",
        "intro": [
          "Kitengo hiki kitakuonyesha jinsi ya kutumia ujuzi wako wa kutatua na kuchora ili kupata gharama, mapato na faida. Utaandika msimbo ili kukuza utendaji wa mahitaji kutoka kwa alama mbili. Utaona jinsi bei inavyoathiri grafu ya faida na jinsi milinganyo hii yote inavyohusiana."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Jifunze Simple na Compound Interest",
        "intro": [
          "Kitengo hiki kitakuonyesha jinsi ya kukokotoa riba, malipo ya mkopo na makadirio ya thamani ya uwekezaji. Utaona fomula ya hesabu na kuibadilisha kuwa nambari. Kwa sababu fomula hizi zinaelekea kuwa ngumu, utafurahi kuwa na nambari ambapo unaweza kurekebisha tu maadili machache."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Jifunze Exponents na Logarithms",
        "intro": [
          "Kitengo hiki kitakuonyesha jinsi exponents na logarithms zinavyotenda kazi kinyume, na jinsi unavyoweza kutumia vitendaji hivi katika programu mbalimbali."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Kikokotoo cha fedha",
        "intro": [
          "Hii ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda kikokotoo cha kifedha."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "College Algebra with Python: Hitimisho",
        "intro": [
          "Hiki kitakuwa kitengo cha mwisho katika kozi hii. Wacha tuangalie jinsi unavyoweza kuunganisha maarifa yako ya Hisabati na Python na data ya nje."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Data Graph Explorer",
        "intro": [
          "Hii ni mojawapo ya miradi inayohitajika ili kupata cheti chako.",
          "Kwa mradi huu, utaunda data graph explorer."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Matayarisho ya Mahojiano ya Coding",
    "intro": [
      "Ikiwa unatafuta mazoezi ya coding bila malipo ili kujiandaa kwa mahojiano yako ya kazini, tumekushughulikia.",
      "Sehemu hii ina mamia ya changamoto za usimbaji ambazo hujaribu ujuzi wako wa kanuni, miundo ya data na hisabati. Pia ina idadi ya miradi ya kwenda nyumbani unayoweza kutumia kuimarisha ujuzi wako, au kuongeza kwenye wasifu yako."
    ],
    "note": "Mradi wa Euler Project umehamishwa hadi kwenye mkondo wake. Rudi kwenye mtaala ili kuona orodha ya kozi tunazotoa.",
    "blocks": {
      "algorithms": {
        "title": "Algorithms",
        "intro": [
          "Mazoezi haya ya programu bila malipo yatakufundisha kuhusu algoriti za kawaida ambazo unaweza kukutana nazo katika maisha halisi. Hii ni fursa nzuri ya kuboresha ujuzi wako wa mantiki na programu.",
          "Algoriti hizi hutumiwa mara kwa mara katika usaili wa kazi ili kupima ujuzi wa mtahiniwa. Tutakupa maelezo wazi na mafupi ya jinsi algoriti hizi tofauti hufanya kazi ili uweze kutekeleza suluhisho kwa kila moja."
        ]
      },
      "data-structures": {
        "title": "Data Structures",
        "intro": [
          "Kozi hizi za upangaji bila malipo zinakusudiwa kukusaidia kukabiliana na miundo mikubwa na changamano ya data ambayo huenda bado huifahamu.",
          "Ukipitia kozi zilizo hapa chini, utajifunza kuhusu kila aina ya muundo wa data, na utekeleze algoriti za kuimarisha uelewa wako kuzihusu."
        ]
      },
      "take-home-projects": {
        "title": "Miradi ya kuchukua Nyumbani",
        "intro": [
          "Mahojiano ya kuprogramu yamekuwa ya kusisitiza kila wakati. Waombaji kazi wakati mwingine hupewa mradi wa kurudi nyumbani ili kukamilishwa nje ya usaili. Aina hizi za mahojiano kawaida huhitaji kazi nyingi, lakini ni njia nzuri kwa waajiri kuona jinsi unavyoweza kufanya kazi.",
          "Unda miradi ya usimbaji ya bonasi hapa chini kwa mazoezi ya ziada. Chukua muda wako, uzifanye vizuri, na uziweke kwenye wasifu wako ili kuonyesha waajiri watarajiwa."
        ]
      },
      "rosetta-code": {
        "title": "Rosetta Code",
        "intro": [
          "Ongeza ujuzi wako wa kibunifu wa kutatua matatizo kwa kazi hizi zisizolipishwa za kupanga kutoka maktaba ya Kanuni ya Rosetta ya kawaida.",
          "Changamoto hizi zinaweza kuwa ngumu, lakini zitasukuma mantiki yako ya algorithm kufikia kiwango kipya.",
          "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Sifa: Rosetta Code</a>"
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "Mradi wa Odin",
    "intro": [
      "Mradi wa Odin ni mojawapo ya nyenzo za \"Ninatamani ningekuwa nazo nilipokuwa najifunza\". ",
      "Sio kila mtu anayeweza kupata elimu ya sayansi ya kompyuta au pesa za kuhudhuria shule ya usimbaji ya kina na hakuna kati ya hizo zinazofaa kwa kila mtu.",
      "Mradi huu umeundwa ili kujaza pengo la watu wanaojaribu kuudukua wao wenyewe lakini bado wanataka elimu ya hali ya juu."
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Jifunze Misingi ya HTML",
        "intro": ["Maelezo yanapaswa kuamuliwa"]
      },
      "top-working-with-text": {
        "title": "Kufanya kazi na maandishi",
        "intro": ["Maelezo yanapaswa kuamuliwa"]
      },
      "top-links-and-images": {
        "title": "Viungo na Picha",
        "intro": ["Maelezo yanapaswa kuamuliwa"]
      },
      "top-build-a-recipe-project": {
        "title": "Jifunze Misingi ya HTML kwa Kuunda Ukurasa wa Mapishi",
        "intro": ["Maelezo yanapaswa kuamuliwa"]
      },
      "top-learn-css-foundations": {
        "title": "Jifunze Misingi ya CSS",
        "intro": ["Maelezo yanapaswa kuamuliwa"]
      },
      "top-learn-css-foundations-projects": {
        "title": "Jifunze Miradi ya Msingi wa CSS",
        "intro": ["Maelezo yanapaswa kuamuliwa"]
      },
      "top-learn-css-specificity": {
        "title": "Jifunze Umaalumu wa CSS",
        "intro": ["Maelezo yanapaswa kuamuliwa"]
      },
      "top-the-box-model": {
        "title": "Jifunze Box Model",
        "intro": ["Maelezo yanapaswa kuamuliwa"]
      }
    }
  },
  "project-euler": {
    "title": "Mradi wa Euler",
    "intro": [
      "Kamilisha changamoto za upangaji hapa chini, kutoka kwa kumbukumbu kubwa za Mradi wa Euler. Hizi zitaimarisha maarifa yako ya algorithm na hisabati.",
      "Matatizo haya hutofautiana katika ugumu na, kwa wengi, uzoefu ni kujifunza kwa mnyororo kwa kufata neno. Hiyo ni, kwa kutatua tatizo moja, itakuonyesha kwa dhana mpya ambayo inakuwezesha kufanya tatizo ambalo halikuweza kufikiwa hapo awali. Je, unaweza kumaliza yote?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Mradi wa Euler Matatizo 1 hadi 100",
        "intro": [
          "Katika seti hii ya kwanza ya changamoto, utatumia dhana za hisabati kama vile mfuatano wa Fibonacci, nadharia ya nambari kuu, na viunganishi kuandika algoriti bora za kutatua matatizo haya."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Mradi wa Euler Matatizo 101 hadi 200",
        "intro": [
          "Katika seti hii ya changamoto, utaendeleza ujuzi uliojifunza katika sehemu ya kwanza ya kozi na kutumia dhana za hali ya juu zaidi kama vile ukokotoaji wa vekta, piramidi ya Pascal, na algoriti ya RSA ili kutatua matatizo haya kwa ufanisi."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Mradi wa Euler Matatizo 201 hadi 300",
        "intro": [
          "Katika kundi hili la changamoto, utaendelea kukuza ujuzi uliojifunza hapo awali na kutumia dhana kama vile nadharia ya binomial, nambari za Hamming, na mfuatano wa Collatz ili kukuza zaidi ujuzi wako wa hesabu na utatuzi wa matatizo."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Mradi wa Euler Matatizo 301 hadi 400",
        "intro": [
          "Hapa utaendelea kubadilisha ujuzi wako wa hisabati na algoriti unapotumia dhana kama vile nadharia ya mchezo mseto, utendakazi wa busara kidogo, na mfuatano wa kujieleza wa Golomb ili kutengeneza suluhu bora kwa matatizo haya."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Mradi wa Euler Matatizo 401 hadi 480",
        "intro": [
          "Katika seti hii ya mwisho ya changamoto, utahitaji kutumia kila kitu ulichojifunza hadi kufikia hatua hii na kutumia dhana za hali ya juu kama vile vigawanyiko vya umoja, utaratibu wa Kaprekar, na mengi zaidi kutatua matatizo haya changamano."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "Msingi C# na Microsoft",
    "intro": [
      "Kozi hii inatoa utangulizi wa kina wa utayarishaji wa C#, unaojumuisha dhana zake za msingi, sintaksia, na matumizi ya vitendo katika ukuzaji programu.",
      "Kupitia mazoezi na miradi ya vitendo, utajifunza misingi ya C#, ikijumuisha variables, data types, control structures, na kanuni za object-oriented programming.",
      "Kufikia mwisho wa kozi hii, utakuwa umepata ujuzi wa vitendo na ujuzi unaohitajika ili kutumia C# kwa ujasiri kwa ajili ya kujenga matumizi thabiti na yenye hatari"
    ],
    "note": "Kumbuka: Ni lazima ukamilishe changamoto ya kombe katika kila sehemu iliyo hapa chini ili ufuzu kwa mtihani wa uidhinishaji.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Andika Msimbo wako wa Kwanza kwa kutumia C#",
        "intro": [
          "Anza safari yako kwa kujifunza kuandika msimbo wako wa kwanza kwa kutumia C#. Jenga msingi thabiti unapochunguza misingi na sintaksia ya lugha, ukiweka msingi wa matukio yako ya upangaji programu."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Unda na Utekeleze Programu Rahisi ya C# Console",
        "intro": [
          "Boresha sanaa ya kuunda na kuendesha programu rahisi za C# console. Ingia katika ulimwengu wa upangaji programu unaotegemea console, ambapo utapata uzoefu wa utekelezaji wa msimbo wako na kuiona ikitekelezwa."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Ongeza Mantiki kwa Programu za C# Console",
        "intro": [
          "Fungua nguvu ya mantiki katika programu za C# console. Jifunze jinsi ya kuongeza uwezo wa mantiki na wa kufanya maamuzi kwenye msimbo wako, kuwezesha programu zako kufanya chaguo zinazobadilika na kujibu hali tofauti kwa akili."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Fanya kazi na Data Inayoweza Kubadilika katika Programu za C# Console",
        "intro": [
          "Gundua utofauti wa data tofauti katika programu za C# console. Tumia uwezo wa kuhifadhi na kuendesha aina tofauti za data, kama vile nambari na maandishi, unapoingia kwenye dhana muhimu za vigeuzo na utunzaji wa data."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Unda Mbinu katika Programu za C# Console",
        "intro": [
          "Peleka programu zako za C# console kwa kiwango kinachofuata kwa ujuzi wa kuunda mbinu. Jifunze jinsi ya kupanga na kurekebisha msimbo wako, na kuifanya iweze kudhibitiwa zaidi, iweze kutumika tena na kwa ufanisi zaidi."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Tatua Programu za C# Console",
        "intro": [
          "Imarisha ujuzi wako wa utatuzi unapoingia katika ulimwengu wa utatuzi wa programu za C# console. Pata uwezo wa kutambua na kurekebisha matatizo katika msimbo wako, ukihakikisha kwamba programu zako zinaendeshwa kwa urahisi na kutoa matokeo unayotaka."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Msingi C# na Mtihani wa Uthibitishaji wa Microsoft",
        "intro": [
          "Tumia ulichojifunza ili kufaulu mtihani ili kupata cheti cha Msingi cha Microsoft cha C#"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Inayokuja Python",
    "intro": ["kishika nafasi"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Jifunze Python kwa Kuunda Mchezo wa Blackjack",
        "intro": ["Jifunze Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Mradi ujao wa Python",
        "intro": ["kishika nafasi"]
      }
    }
  },
  "example-certification": {
    "title": "Mfano wa Uthibitisho",
    "intro": ["placeholder"],
    "blocks": {
      "example-certification-exam": {
        "title": "Mfano wa Mtihani wa Cheti",
        "intro": ["placeholder"]
      }
    }
  },
  "misc-text": {
    "certification": "Uthibitishaji wa {{cert}}",
    "browse-other": "Vinjari vyeti vyetu vingine vya bila malipo\n(tunapendekeza kufanya haya kwa utaratibu)",
    "courses": "Kozi",
    "steps": "Hatua",
    "expand": "Panua kozi",
    "collapse": "Kunja kozi",
    "legacy-header": "Kozi za Legacy",
    "legacy-desc": "Kozi hizi si sehemu tena ya njia ya uthibitishaji, lakini bado zinapatikana kwako ili kuendeleza masomo yako.",
    "legacy-go-back": "Nenda kwenye toleo la sasa la mtaala.",
    "course-maintenance": "Kozi hizi zinaendelea na matengenezo. Ikiwa hazifanyi kazi, unaweza kujifunza jinsi ya kuziendesha ndani ya mashine kwenye <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode- na-coderoad</0>.",
    "progress-wont-save": "Maendeleo yako hayatahifadhiwa kwenye akaunti yako ya freeCodeCamp unapoyaendesha ndani ya mashine yako.",
    "go-back-to-learn": "Rudi kwenye toleo thabiti la mtaala.",
    "read-database-cert-article": "Tafadhali soma chapisho hili la jukwaa kabla ya kuendelea.",
    "enable-cookies": "Lazima uwashe third-party cookies kabla ya kuanza.",
    "english-only": "Kozi katika sehemu hii zinapatikana kwa Kiingereza pekee. Tuna uwezo wa kutafsiri mada na utangulizi pekee kwa sasa, si masomo yenyewe."
  }
}
