{
  "name": "Join the Free Code Camp Community",
  "order": 1,
  "time": "15 minutes",
  "helpRoom": "Help",
  "challenges": [
    {
      "id": "560add10cb82ac38a17513be",
      "title": "Learn how Free Code Camp Works",
      "description": [
        [
          "//i.imgur.com/6ibIavQ.jpg",
          "A picture of Free Code Camp's 4 benefits: Get connected, Learn JavaScript, Build your Portfolio, Help nonprofits",
          "Welcome to Free Code Camp. We're an open source community that helps you learn to code, then practice by building projects for nonprofits.",
          ""
        ],
        [
          "//i.imgur.com/Elb3dfj.jpg",
          "A screenshot of some of our campers coding together in Toronto.",
          "<bold>Learning to code is hard.</bold> To succeed, you'll need lots of practice and support. That's why we've created a rigorous curriculum and supportive community.",
          ""
        ],
        [
          "//i.imgur.com/WD3STY6.jpg",
          "Photos of three campers who got jobs after learning to code at Free Code Camp.",
          "Free Code Camp is a proven path to your first software developer job. Companies have hired thousands of people like you who have learned to code through Free Code Camp.",
          ""
        ],
        [
          "//i.imgur.com/D7Y5luw.jpg",
          "A graph of the rate of job growth against growth in computer science degree graduates. There are 1.4 million jobs and only 400 thousand people to fill them.",
          "There are thousands of software developer jobs currently going unfilled, and the demand for coders grows every year.",
          ""
        ],
        [
          "//i.imgur.com/vLNso6h.jpg",
          "An illustration showing that you will learn HTML5, CSS3, JavaScript, Databases, Git, Node.js, React and D3.",
          "We have hundreds of optional coding challenges that will teach you fundamental web development technologies like HTML5, Node.js and databases.",
          ""
        ],
        [
          "//i.imgur.com/UVB9hxp.jpg",
          "An image of a camper at a cafe building projects on Free Code Camp.",
          "We believe humans learn best by doing. So you'll spend most of your time actually building projects. We'll give you a list of specifications (agile user stories), and you'll figure out how to build apps that fulfill those specifications.",
          ""
        ],
        [
          "//i.imgur.com/pbW7K5S.jpg",
          "An image of showing our front end, back end, and data visualization certifications (400 hours each), our nonprofit projects (800 hours), and interview prep (80 hours) for a total of 2,080 hours of coding experience.",
          "Our curriculum is divided into 4 certifications. These certifications are standardized, and instantly verifiable by your freelance clients and future employers. Like everything else at Free Code Camp, these certifications are free. We recommend doing them in order, but you are free to jump around. The first three certifications take 400 hours each, and the final certification takes 800 hours, and involves building real-life projects for nonprofits.",
          ""
        ],
        [
          "//i.imgur.com/akGfLoa.jpg",
          "A screenshot of our Front End Development Certificate",
          "To earn our verified Front End Development Certification, you'll build 10 projects using HTML, CSS, jQuery, and JavaScript.",
          ""
        ],
        [
          "//i.imgur.com/ocEL0D3.jpg",
          "A screenshot of our Data Visualization Certificate",
          "To earn our Data Visualization Certification, you'll build 10 projects using React, Sass and D3.js.",
          ""
        ],
        [
          "//i.imgur.com/8HCk1Od.jpg",
          "A screenshot of our Back End Development Certificate",
          "To earn our Back End Development Certification, you'll build 10 projects using Node.js, Express, and MongoDB. You'll use Git and Heroku to deploy them to the cloud.",
          ""
        ],
        [
          "//i.imgur.com/yXyxbDd.jpg",
          "A screen shot of our nonprofit project directory.",
          "After you complete all three of these certificates, you'll team up with another camper and use agile software development methodologies to build two real-life projects for nonprofits. You'll also add functionality to two legacy code nonprofit projects. By the time you finish, you'll have a portfolio of real apps that people use every day.",
          ""
        ],
        [
          "//i.imgur.com/PDGQ9ZM.jpg",
          "An image of campers building projects together in a cafe in Seoul.",
          "If you complete all 2,080 hours worth of challenges and projects, you'll earn our Full Stack Development Certification. We'll offer you free coding interview practice. We even offer a job board where employers specifically hire campers who've earned Free Code Camp certifications.",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "translations": {
        "de": {
          "title": "Lerne wie Free Code Camp funktioniert",
          "description": [
            [
              "//i.imgur.com/6ibIavQ.jpg",
              "Ein Bild von den 4 Vorteilen von Free Code Camp: Vernetz Dich, Lerne Javascript, Bau ein Portfolio auf, Hilf Non-Profit-Organisationen",
              "Willkommen bei Free Code Camp. Wir sind eine Open Source Gemeinschaft von motivierten Leuten, die programmieren lernen und Non-Profit-Organisationen helfen",
              ""
            ],
            [
              "//i.imgur.com/Elb3dfj.jpg",
              "Ein Screenshot von einigen unserer Camper beim gemeinsamen Programmieren in Toronto.",
              "<bold>Programmieren zu lernen ist hart.</bold> Um erfolgreich zu sein brauchst du viel Übung und Unterstützung. Deswegen haben wir ein umfangreiches Curriculum und eine unterstützende Gemeinschaft geschaffen.",
              ""
            ],
            [
              "//i.imgur.com/D7Y5luw.jpg",
              "Ein Graph vom Verhältnis der Wachstumsrate von Jobs gegenüber der Abschlüsse von Informatik Studien. Es gibts 1,4 Millionen Jobs aber nur 400.000 Leute um diese zu füllen.",
              "Es gibt tausende von unbesetzen Programmierjobs und die Nachfrage wächst jedes Jahr",
              ""
            ],
            [
              "//i.imgur.com/WD3STY6.jpg",
              "Foto von drei Campern die einen Job bekommen haben nachdem sie bei Free Code Camp programmieren gelernt haben",
              "Free Code Camp ist ein sicherer Weg zu deinem ersten Programmierjob. Tatsächlich hat noch niemand unser komplettes Programm beendet, weil Campers bereits davor Jobs finden.",
              ""
            ],
            [
              "//i.imgur.com/vLNso6h.jpg",
              "Eine Illustration die zeigt dass du HTML5, CSS3, JavaScript, Datenbanken, Git, Node.js, React und D3 lernen wirst",
              "Wir haben hunderte von optionalen Programmieraufgaben die dir die fundamentalen Webentwicklungstechnologien wie HTML5, Node.js und Datanbanken beibringen werden.",
              ""
            ],
            [
              "//i.imgur.com/UVB9hxp.jpg",
              "Ein Foto von einem Camper in einem Cafe der an Free Code Camp Projekten arbeitet.",
              "Wir glauben dass Menschen am Besten beim Tun lernen. Deswegen wirst du die meiste Zeit damit beschäftigt sein an tatsächlichen Projekten zu arbeiten. Wir werden dir eine Liste an Anforderungen (agile User Stories) geben und du wirst dich damit auseinander setzen diese zu erfüllen.",
              ""
            ],
            [
              "//i.imgur.com/pbW7K5S.jpg",
              "Ein Bild auf dem man unsere Frontend-, Backend- und Daten Visualisierungzertifikate (je 400 Stunden), unsere Non-Profit-Projekte (800 Stunden) und Bewerbungsgesprächsvorbereitung (80 Stunden) sieht mit einer Summe von 2080 Stunden Programmiererfahrung.",
              "Unser Curriculum ist in 4 Zertifikate aufgeteilt. Diese Zertifikate sind standardisiert und jederzeit von deinen Kunden oder zukünftigen Arbeitgeber überprüfbar. Wie alles andere auch bei Free Code Camp sind die Zertifikate gratis. Wir empfehlen sie in der vorgesehenen Reihenfolge zu machen, aber es steht dir offen frei zu wählen. Die ersten drei Zertifikate dauern jeweils 400 Stunden. Das letzte Zertifikat dauert 800 Stunden und beinhaltet die Umsetzung eines echten Projektes für eine Non-Profit-Organisation.",
              ""
            ],
            [
              "//i.imgur.com/akGfLoa.jpg",
              "Ein Screenshot von unserem Frontendzertifikat",
              "Um sich unser geprüftes Frontend-Entwicklungszertifikat zu verdienen, wirst du 10 Projekte mit HTML, CSS, jQuery und Javascript umsetzen.",
              ""
            ],
            [
              "//i.imgur.com/ocEL0D3.jpg",
              "Ein Screenshot von unserem Datenvisualisierungszertifikat",
              "Für unser Datenvisualisierungszertifikat, wirst du 10 Projekte mit React, Sass und D3.js umsetzen.",
              ""
            ],
            [
              "//i.imgur.com/8HCk1Od.jpg",
              "Ein Screenshot von unserem Backend-Entwicklungszertifikat",
              "Um unser Backend-Entwicklungszertifikat zu erhalten, wirst du 10 Projekte mit Node.js, Express und MongoDB umsetzen. Du wirst Git und Heroku verwenden um sie in der Cloud zu veröffentlichen.",
              ""
            ],
            [
              "//i.imgur.com/yXyxbDd.jpg",
              "Ein Screenshot von unserem Non-Profit-Verzeichnis",
              "Nachdem du alle drei von diesen Zertifikaten abgeschlossen hast, wirst du mit einem anderen Camper zusammen Methoden der agilen Softwareentwicklung verwenden und zwei echte Projekte für Non-Profit-Organisationen umsetzen. Außerdem wirst du zwei bereits existierende Non-Profit-Projekte um neue Funktionalität erweitern. Wenn du fertig bist, wirst du ein Portfolio mit zwei echten Apps besitzen, die täglich von Leuten genutzt werden.",
              ""
            ],
            [
              "//i.imgur.com/PDGQ9ZM.jpg",
              "Ein Foto von Campern die zusammen in einem Cafe in Seoul an einem Projekt arbeiten.",
              "Wenn du alle 2080 Stunden an Aufgaben und Projekten absolviert hast, hast du dir unser Full Stack Development Zertifikat verdient. Wir bieten dir dann ein gratis Bewerbungstraining an. Außerdem haben wir eine Jobbörse, wo Arbeitsgeber Camper einstellen die Free Code Camp Zertifikate erhalten haben.",
              ""
            ]
          ]
        },
        "es": {
          "title": "Aprende como funciona Free Code Camp",
          "description": [
            [
              "//i.imgur.com/6ibIavQ.jpg",
              "Una imagen de los 4 beneficios de Free Code Camp: Conéctate, Aprende JavaScript, Construye tu  Portafolio, Ayuda organizaciones sin ánimo de lucro",
              "Bienvenido a Free Code Camp. Somos una comunidad de código abierto formada por personas ocupadas quienes aprenden a programar y ayudan a organizaciones sin ánimo de lucro.",
              ""
            ],
            [
              "//i.imgur.com/Elb3dfj.jpg",
              "Una imagen de algunos de nuestros campistas programando juntos en Toronto.",
              "<bold>Aprender a programar es difícil.</bold> Para tener éxito, necesitarás mucha práctica y apoyo. Por eso es que hemos creado un riguroso currículo y una comunidad de apoyo.",
              ""
            ],
            [
              "//i.imgur.com/D7Y5luw.jpg",
              "Una gráfica del crecimiento de trabajos en comparación con los graduados en un pregrado de ciencias de la computación. Hay 1.4 millones de empleos y solo 400 mil personas para ocuparlos.",
              "Actualmente, hay miles de trabajos de programación sin ocupar, y la demanda de programadores crece cada año.",
              ""
            ],
            [
              "//i.imgur.com/WD3STY6.jpg",
              "Fotos de tres campistas quienes obtuvieron trabajos después de aprender a programar en Free Code Camp.",
              "Free Code Camp es un camino probado para que obtengas tu primer trabajo de programación. De hecho, nadie actualmente ha completado nuestro programa entero, porque los campistas obtienen trabajos antes de poder hacerlo.",
              ""
            ],
            [
              "//i.imgur.com/vLNso6h.jpg",
              "Una ilustración mostrando que aprenderás HTML5, CSS3, JavaScript, Bases de Datos, Git, Node.js, react y D3.",
              "Tenemos cientos de desafíos de programación opcionales que te enseñarán las tecnologías fundamentales para el desarrollo web como HTML5, Node.js y bases de datos.",
              ""
            ],
            [
              "//i.imgur.com/UVB9hxp.jpg",
              "Una foto de un campista en un café construyendo proyectos con Free Code Camp.",
              "Creemos que los humanos aprender mejor haciendo.  Así que en realidad emplearás la mayoría de tu tiempo construyendo proyectos.  Te daremos una lista de especificaciones (historias de usuario ágiles), y te las ingeniarás para construir aplicaciones que cumplan esas especificaciones.",
              ""
            ],
            [
              "//i.imgur.com/pbW7K5S.jpgk",
              "Una imagen de los tiempos de nuestras certificaciones para desarrollo de interfaces, desarrollo al lado del servidor y visualización de datos (400 horas cada uno), para nuestros proyectos sin ánimo de lucro (800 horas) y preparación para entrevistas (80 horas) que dan un total de 2,080 horas e experiencia programando.",
              "Nuestro currículo se divide en 4 certificaciones.  Estas certificaciones están estandarizadas, y son verificables al instante por sus clientes como trabajador independiente y por sus futuros empleadores.  Tal como todo lo demás en Free Code Camp, estas certificaciones son gratuitas.  Recomendamos hacerlas en orden, pero usted es libre de saltar de una a otra.  Las primeras tres certificaciones requieren 400 horas cada una, y la certificación final requiere 800 horas, e involucra construir proyectos de la vida real para organizaciones sin ánimo de lucro.",
              ""
            ],
            [
              "//i.imgur.com/akGfLoa.jpg",
              "Una imagen de nuestro Certificado de Desarrollo de Interfaces",
              "Para obtener nuestra certificación verificada de Desarrollo de Interfaces, construirás 10 proyectos usando HTML, CSS, jQuery y JavaScript.",
              ""
            ],
            [
              "//i.imgur.com/ocEL0D3.jpg",
              "Una imagen de nuestro Certificado de Visualización de Datos",
              "Para obtener nuestra certificación en Visualización de Datos, construirás 10 proyectos usando React, Sass y D3.js.",
              ""
            ],
            [
              "//i.imgur.com/8HCk1Od.jpg",
              "Una imagen de nuestro Certificado de Desarrollo al Lado del Servidor",
              "Para obtener nuestro Certificado de Desarrollo al Lado del Servidor, construirás 10 proyectos empleando Node.js, Express y MongoDB. Usarás Git y Heroku para desplegarlos en la nube.",
              ""
            ],
            [
              "//i.imgur.com/yXyxbDd.jpg",
              "Una imagen de nuestro directorio de organizaciones sin ánimo de lucro.",
              "Después de completar todos los tres certificados, harás equipo con otro campista y usarás metodologías de desarrollo ágil para construir dos proyectos de la vida real para organizaciones sin ánimo de lucro. También añadirás funcionalidad a dos proyectos de fuentes legadas de organizaciones sin ánimo de lucro.  Cuando termines esto, tendrás un portafolio de aplicaciones reales que la gente usa a diario. ",
              ""
            ],
            [
              "//i.imgur.com/PDGQ9ZM.jpg",
              "Una imagen de nuestros campistas construyendo proyectos juntos en un café en Seoul.",
              "Si completas todas las 2,080 horas de desafíos y proyectos, obtendrás un Certificado de Desarrollo de Pila Completa.  Te ofreceremos gratuitamente una práctica en entrevistas para desarrolladores. Incluso ofrecemos un directorio de trabajos donde los empleadores contratan específicamente campistas que han recibido certificaciones de Free Code Camp.",
              ""
            ]
          ]
        },
        "fr": {
          "title": "Apprenez comment FreeCodeCamp fonctionne",
          "description": [
            [
              "//i.imgur.com/6ibIavQ.jpg",
              "Une idée des avantages de Free Code Camp: restez connecté , apprenez le JavaScript , construisez votre portfolio , Aidez les organismes sans but lucratif",
              "Bienvenue sur Free Code Camp . Nous sommes une communauté opensource de gens passionnés qui apprend à coder et aide les organisations à but non lucratif.",
              ""
            ],
            [
              "//i.imgur.com/Elb3dfj.jpg",
              "Une capture d'écran de certains de nos développeurs réunis à Toronto.",
              "<bold>Apprendre à code est dur.</bold> Pour réussir, vous aurez besoin de beaucoup de pratique et de soutien. Voilà pourquoi nous avons créé un programme rigoureux et une communauté de soutien.",
              ""
            ],
            [
              "//i.imgur.com/D7Y5luw.jpg",
              "Un graphique de la vitesse de croissance de l'emploi face à la croissance du nombre de diplômés en études d'informatique . Il y a 1,4 million d'emplois et seulement 400 000 personnes pour les occuper.",
              "Il y a des milliers d'emplois de développeurs actuellement vacants, et la demande pour les développeurs augmente chaque année.",
              ""
            ],
            [
              "//i.imgur.com/WD3STY6.jpg",
              "Photos de trois développeurs qui ont obtenu un emploi après l'apprentissage de code au Free Code Camp.",
              "Free Code Camp est une voie éprouvée pour obtenir votre premier job de développeur. En fait , personne n'a jamais accompli l'ensemble de notre programme , car nos développeurs ont trouvé un emploi avant qu'ils ne soient en mesure de le finir notre parcours.",
              ""
            ],
            [
              "//i.imgur.com/vLNso6h.jpg",
              "Une illustration montrant que vous allez apprendre HTML5 , CSS3 , JavaScript , bases de données , Git , Node.js , React et D3.",
              "Nous avons des centaines de défis de codage optionnels qui vous apprendront les fondamentaux du développement web comme HTML5 , Node.js et les bases de données.",
              ""
            ],
            [
              "//i.imgur.com/UVB9hxp.jpg",
              "Une image d'un développeur dans un café projets sur Camp Code Free.",
              "Nous croyons que les êtres humains apprennent mieux par la pratique . De sorte que vous passerez la plupart de votre temps à construire efficacement des projets. Nous allons vous donner une liste de spécifications ( des témoignages d'utilisateurs agiles ) , et vous allez comprendre comment construire des applications qui répondent à ces spécifications.",
              ""
            ],
            [
              "//i.imgur.com/pbW7K5S.jpg",
              "Une image pour montrer notre front-end, back end, et data visualisation certificat ( 400 heures chacun) , nos projets à but non lucratif (800 heures) , et l'interview de préparation ( 80 heures ) pour un total de 2080 heures d'expérience de codage.",
              "Notre programme est divisé en 4 certifications . Ces certifications sont standardisés , et immédiatement vérifiable par vos clients indépendants et les futurs employeurs . Comme tout le reste au Code Camp gratuit, ces certifications sont gratuits. Nous vous recommandons de les faire dans l'ordre, mais vous êtes libre d'en sauter . Les trois premièrs certifications prennent 400 heures chacune , et la certification finale prend 800 heures , et implique la construction de projets concrets pour les organisations caritatives.",
              ""
            ],
            [
              "//i.imgur.com/akGfLoa.jpg",
              "Une capture d'écran de notre certificat développeur Front-End",
              "Pour réussir notre certificat Front-End vérifié, vous allez construire 10 projets utilisant HTML , CSS , jQuery et JavaScript.",
              ""
            ],
            [
              "//i.imgur.com/ocEL0D3.jpg",
              "Une capture d'écran de notre certificat de visualisation de données",
              "Pour gagner notre certification de visualisation de données , vous allez construire 10 projets utilisant Réagir, Sass et D3.js.",
              ""
            ],
            [
              "//i.imgur.com/8HCk1Od.jpg",
              "Une capture d'écran de notre certificat Back-End",
              "Pour gagner notre certification de développeur Back-End, vous allez construire 10 projets utilisant Node.js , Express, et MongoDB . Vous allez utiliser Git et Heroku de les déployer dans le cloud.",
              ""
            ],
            [
              "//i.imgur.com/yXyxbDd.jpg",
              "Une capture d'écran de notre répertoire de projet à but non lucratif.",
              "Après avoir effectué tous les trois de ces certificats , vous faites équipe avec un autre développeur et utilisez agiles méthodologies de développement de logiciel pour construire deux projets de la vie réelle pour les organismes sans but lucratif . Vous aurez également d'ajouter des fonctionnalités à deux projets à but non lucratif de code hérité. Au moment où vous avez terminé, vous aurez un portefeuille de véritables applications que les gens utilisent tous les jours.",
              ""
            ],
            [
              "//i.imgur.com/PDGQ9ZM.jpg",
              "Une image de campeurs construction des projets ensemble dans un café de Séoul ",
              "Si vous finissez les 2.080 heures de défis et projets, vous gagnerez notre certification complète Stack développement . Nous vous offrons gratuitement la pratique d'entrevue de codage . Nous offrons même un accès à notre si d'emploi où les employeurs embauchent spécifiquement les développeurs qui ont obtenu des certificats de Free Code Camp.",
              ""
            ]
          ]
        },
        "it": {
          "title": "Impara come funziona Free Code Camp",
          "description": [
            [
              "//i.imgur.com/6ibIavQ.jpg",
              "Una immagine dei 4 benefici di Free Code Camp: Creare Contatti, Imparare il JavaScript, costruire il proprio portfolio, Aiutare delle organizzazioni no-profit",
              "Benvenuto in Free Code Camp. Siamo una comunità open source di persone impegnate che imparano a programmare e aiutano le organizzazioni no-profit.",
              ""
            ],
            [
              "//i.imgur.com/Elb3dfj.jpg",
              "Uno screenshot di alcuni dei nostri camper che programmano insieme a Toronto.",
              "<Bold> Imparare a programmare è difficile. </ Bold> Per riuscirci, sono necessari un sacco di pratica e molto sostegno. Per questo motivo abbiamo creato un curriculum rigoroso e una comunità solidale.",
              ""
            ],
            [
              "//i.imgur.com/D7Y5luw.jpg",
              "Un grafico del tasso di crescita dei posti di lavoro contro la crescita di laureati in informatica (in USA). Ci sono 1,4 milioni di posti e solo 400 mila persone adatte ad occuparli.",
              "Ci sono migliaia di posizioni da Sviluppatore Software attualmente vacanti, e la domanda di programmatori cresce ogni anno.",
              ""
            ],
            [
              "//i.imgur.com/WD3STY6.jpg",
              "Foto di tre camper che hanno ottenuto un lavoro dopo aver imparato a programmare con Free Code Camp.",
              "Free Code Camp è un modo collaudato per ottenere il primo lavoro da sviluppatore. In effetti, nessuno ha ancora completato tutto il nostro programma, perché i campers trovano lavoro prima di finire il corso.",
              ""
            ],
            [
              "//i.imgur.com/vLNso6h.jpg",
              "Un esempio che mostra che qui si imparano HTML5, CSS3, JavaScript, Database, Git, Node.js, React e D3.",
              "Abbiamo centinaia di problemi di programmazione opzionali che vi insegneranno tecnologie di sviluppo web fondamentali come HTML5, Node.js e Database.",
              ""
            ],
            [
              "//i.imgur.com/UVB9hxp.jpg",
              "Un'immagine di un camper in un bar che lavora ai progetti di Free Code Camp.",
              "Crediamo che gli esseri umani imparino meglio facendo. Quindi lavorerai per la maggior parte del tempo a dei progetti pratici. Ti daremo una lista di specifiche (Storie-Utente 'Agili'), e Tu dovrai decidere come sviluppare delle applicazioni che soddisfino queste specifiche.",
              ""
            ],
            [
              "//i.imgur.com/pbW7K5S.jpg",
              "Un'immagine che mostra le nostre certificazioni front-end, back-end, e visualizzazione dei dati (400 ore ciascuno), i nostri progetti no-profit (800 ore), e la preparazione ai colloqui (80 ore) per un totale di 2.080 ore di esperienza.",
              "Il nostro curriculum è diviso in 4 certificazioni. Queste certificazioni sono standardizzate, e immediatamente verificabili dai tuoi clienti come freelance e dai futuri datori di lavoro. Come tutto il resto di Free Code Camp, queste certificazioni sono gratuite. Ti consigliamo di farle in ordine, ma non è obbligatorio. Per le prime tre certificazioni, ci vogliono 400 ore ciascuna, per la certificazione finale ci vogliono 800 ore, e questa prevede lo sviluppo di progetti reali per delle organizzazioni no-profit. ",
              ""
            ],
            [
              "//i.imgur.com/akGfLoa.jpg",
              "Uno screenshot del nostro certificato di sviluppatore Front-End",
              "Per ottenere la certificazione verificata di Sviluppatore Front-End, dovrai realizzare 10 progetti utilizzando HTML, CSS, jQuery, e JavaScript.",
              ""
            ],
            [
              "//i.imgur.com/ocEL0D3.jpg",
              "Uno screenshot del nostro certificato di Visualizzazione Dati",
              "Per ottenere la certificazione di Visualizzazione Dati, dovrai realizzare 10 progetti utilizzando React, Sass e D3.js.",
              ""
            ],
            [
              "//i.imgur.com/8HCk1Od.jpg",
              "Uno screenshot del nostro certificato di sviluppatore Back-End",
              "Per ottenere la certificazione di Sviluppatore Back-End, dovrai realizzare 10 progetti utilizzando Node.js, Express e MongoDB. Userai Git e Heroku per distribuirli in rete.",
              ""
            ],
            [
              "//i.imgur.com/yXyxbDd.jpg",
              "Una schermata della nostra directory dei progetti no-profit.",
              "Dopo aver ottenuto tutti e tre i certificati, potrai collaborare con un altro camper e utilizzerai metodologie di sviluppo 'Agili' per sviluppare due progetti reali per delle organizzazioni no-profit. Inoltre dovrai aggiungere funzionalità a due progetti no-profit sviluppati precedentemente. Quando avrai finito, avrai un portafoglio di applicazioni reali utilizzate quotidianamente.",
              ""
            ],
            [
              "//i.imgur.com/PDGQ9ZM.jpg",
              "Un'immagine di alcuni campers che lavorano insieme ai progetti in un bar a Seoul.",
              "Una volta completati tutti i problemi e i progetti, per l'equivalente di 2080 ore, potrai ottenere la nostra Certificazione di sviluppatore Full-Stack. Offriamo gratuitamente anche delle simulazioni di colloqui di lavoro. Abbiamo anche una Bacheca in cui i datori di lavoro stanno cercando dei campers che abbiano completato le certificazioni di Free Code Camp. ",
              ""
            ]
          ]
        },
        "pt-br": {
          "title": "Aprenda como o Free Code Camp funciona",
          "description": [
            [
              "//i.imgur.com/6ibIavQ.jpg",
              "Imagem dos 4 benefícios do Free Code Camp: Conecte-se, Aprenda Javascript, Construa seu Portfolio, Ajude Organizações Sem Fins Lucrativos",
              "Bem-vindo ao Free Code Camp. Nós somos uma comunidade Open Source cujo objetivo é ajudá-lo(a) a aprender a programar e praticar através da construção de projetos para organizações sem fins lucrativos.",
              ""
            ],
            [
              "//i.imgur.com/Elb3dfj.jpg",
              "Um screenshot de alguns dos nossos campistas programando em Toronto.",
              "<bold>Aprender a programar é difícil.</bold> Para ter sucesso, você precisará de muita prática e suporte. É por isto que criamos um rigoroso programa de estudos e uma comunidade com bastante suporte.",
              ""
            ],
            [
              "//i.imgur.com/WD3STY6.jpg",
              "Foto de três campistas que conseguiram emprego depois de aprender a programar através do Free Code Camp.",
              "Free Code Camp é o caminho certo em direção ao seu primeiro emprego como desenvolvedor de software. Várias empresas já contrataram milhares de pessoas como você que aprenderam a programar através do Free Code Camp.",
              ""
            ],
            [
              "//i.imgur.com/D7Y5luw.jpg",
              "Gráfico da taxa de crescimento de emprego em relação ao crescimento de formandos em ciência da computação. Existem 1.4 milhões vagas de emprego e apenas 400 mil pessoas para preenche-las.",
              "Existem milhares de vagas de emprego para desenvolvedores de softwares atualmente não preenchidas e a demanda para programadores cresce a cada ano.",
              ""
            ],
            [
              "//i.imgur.com/vLNso6h.jpg",
              "Uma ilustração mostrando que você aprenderá HTML5, CSS3, JavaScript, Banco de Dados, Git, Node.js, React e D3.",
              "Nós temos centenas de desafios opcionais de programação que o(a) ensinarão as principais tecnologias de desenvolvimento web como HTML5, Node.js e banco de dados.",
              ""
            ],
            [
              "//i.imgur.com/UVB9hxp.jpg",
              "Imagem de um campista numa cafeteria construindo projetos no Free Code Camp.",
              "Nós acreditamos que as pessoas aprendem mais ao praticar, portanto você gastará a maior parte do seu tempo de fato construindo projetos. Nós proveremos a você uma lista de espeficicações (agile user stories), e você dará um jeito de como construir aplicações que satisfaçam a essas espeficações.",
              ""
            ],
            [
              "//i.imgur.com/pbW7K5S.jpg",
              "Uma imagem mostrando nossos certificados de front-end, back-end e visualização de dados (400 horas cada), nossos projetos sem fins lucrativos (800 horas) e uma preparação para entrevista (80 horas) para um total de 2.080 horas de experiência em programação.",
              "Nosso programa de estudos está dividido em 4 certificações. Estas certificações são padronizadas e instantaneamente verificadas por seus clientes freelance e futuros empregadores. Assim como tudo no Free Code Camp, essas certificações são gratuitas. Nós recomendamos que as mesmas sejam feitas em ordem mas você está livre para explorar ao seu modo. As primeiras três certificações levam 400 horas cada e a cetificação final leva 800 horas e envolve a construção de projetos reais para organizações sem fins lucrativos.",
              ""
            ],
            [
              "//i.imgur.com/akGfLoa.jpg",
              "Uma foto de nossa certificação de desenvolvimento Front End",
              "Para ganhar nossa certificação verificada de desenvolvimento Front End, você terá que construir 10 projetos usando HTML, CSS, jQuery e JavaScript.",
              ""
            ],
            [
              "//i.imgur.com/ocEL0D3.jpg",
              "Uma foto de nosso certificado de Visualização de Dados",
              "Para ganhar nossa certificação verificada de Visualização de Dados, você terá que construir 10 projetos usando React, Sass e D3.js.",
              ""
            ],
            [
              "//i.imgur.com/8HCk1Od.jpg",
              "Uma foto de nossa certificação de desenvolvimento Back End",
              "Para ganhar nossa certificação verificada de desenvolvimento Back End, você terá que construir 10 projetos usando Node.js, Express e MongoDB. Você usará Git e Heroku para implanta-los na nuvem.",
              ""
            ],
            [
              "//i.imgur.com/yXyxbDd.jpg",
              "Uma foto de nosso diretório de projetos sem fins lucrativos.",
              "Após você completar todos os três certificados, você formará uma equipe com outro campista e usará metodologias ágeis de desenvolvimento de software para construir dois projetos reais para organizações sem fins lucrativos. Você também adicionará funcionalidades a dois antigos projetos sem fins lucrativos. Quando você terminar, você terá um portfolio com projetos reais que pessoas usam todos os dias.",
              ""
            ],
            [
              "//i.imgur.com/PDGQ9ZM.jpg",
              "Uma imagem de campistas construindo projetos em Seoul.",
              "Se você completar todas as 2.080 horas válidas de desafios e projetos, você ganhará nosso certificado de desenvolvimento Full Stack. Nós o(a) oferecemos prática gratuita para entrevistas de programação. Nós oferecemos ainda um espaço de trabalho onde empregadores espeficamente contratam campistas que conseguiram certificações no Free Code Camp.",
              ""
            ]
          ]
        },
        "ru": {
          "title": "Узнайте как работает Free Code Camp",
          "description": [
            [
              "//i.imgur.com/6ibIavQ.jpg",
              "4 преимущества Free Code Camp: подключайтесь, учите JavaScript, создавайте ваше портфолио, помогайте некоммерческим организациям.",
              "Добро пожаловать в Free Code Camp. Мы открытое сообщество занятых людей, которые изучают программирование и помогают некоммерческим организациям.",
              ""
            ],
            [
              "//i.imgur.com/Elb3dfj.jpg",
              "Некоторое количество наших участников, программирующих вместе в Торонто.",
              "<bold>Учиться программировать сложно.</bold> Для успеха вам понадобится много практики и поддержки. Именно поэтому мы создали строгую учебную программу и поддерживающее сообщество.",
              ""
            ],
            [
              "//i.imgur.com/D7Y5luw.jpg",
              "Граф скорости роста предложений работы по сравнению со скоростью роста количества выпускников, изучивших информатику - 1.4 миллиона вакансий и только 400 тысяч людей для их заполнения.",
              "Существует множество пустеющих вакансий для программистов, и спрос на программистов растёт с каждым годом.",
              ""
            ],
            [
              "//i.imgur.com/WD3STY6.jpg",
              "Фото троих участников, получивших работу после изучения программы Free Code Camp.",
              "Free Code Camp - проверенный путь к вашей первой работе в области программирования. Фактически, мало кто выполнил нашу учебную программу целиком, так как участники получают работы до того, как успевают это сделать.",
              ""
            ],
            [
              "//i.imgur.com/vLNso6h.jpg",
              "",
              "Иллюстрация, показывающая, что вы изучите HTML5, CSS3, JavaScript, Databases, Git, Node.js, React и D3.",
              "У нас есть сотни необязательных заданий, которые научат вас применению основополагающих технологий web-разработки, например: HTML5, Node.js и базы данных.",
              ""
            ],
            [
              "//i.imgur.com/UVB9hxp.jpg",
              "Изображение участника, работающего над созданием проектов по программе Free Code Camp в кафе.",
              "Мы верим, что люди лучше всего учатся на практике. Поэтому большую часть своего времени вы потратите на непосредственную работу над проектами. Мы предоставим вам список спецификаций (гибких пользовательских историй), и вы разберётесь как создать приложения, которые им удовлетворяют.",
              ""
            ],
            [
              "//i.imgur.com/pbW7K5S.jpg",
              "Изображение наших сертификаций: клиентской, серверной и по визуализации данных (400 часов каждая), наших некоммерческих проектов (800 часов), и подготовки к интервью (80 часов), что складывается в 2,080 часов опыта в области программирования.",
              "Наша учебная программа разделена на 4 сертификации. Эти сертификации стандартизованы и могут быть мгновенно проверены вашими клиентами и будущими работодателями. Как и всё остальное в Free Code Camp, эти сертификации бесплатны. Мы рекоммендуем проходить эти сертификационные программы в заданной очереди, но вы можете выполнять их в любом порядке. Первые три сертификации занимают по 400 часов каждая, а конечная сертификаци занимает 800 часов и включает создание реальных проектов для некоммерческих организаций.",
              ""
            ],
            [
              "//i.imgur.com/k8btNUB.jpg",
              "Изображение нашего сертификата разработчика клиентской части",
              "Для получения нашего проверенного сертификата разработчика клиентской части, вы создадите 10 проектов с применением HTML, CSS, jQuery и JavaScript.",
              ""
            ],
            [
              "//i.imgur.com/Et3iD74.jpg",
              "Изображение нашего сертификата по визуализации данных",
              "Для получения нашего сертификата по визуализации данных, вы создадите 10 проектов с применением React, Sass и D3.js.",
              ""
            ],
            [
              "//i.imgur.com/8v3t84p.jpg",
              "Изображение нашего сертификата разработчика серверной части",
              "Для получения нашего сертификата разработчика серверной части, вы создадите 10 проектов с применением Node.js, Express и MongoDB. Вы будете использовать Git и Heroku для их размещения в облаке.",
              ""
            ],
            [
              "//i.imgur.com/yXyxbDd.jpg",
              "Изображение нашего указателя проектов для некоммерческих организаций.",
              "После завершения всех трёх сертификаций, вы объединитесь в команду с другим участником и будете применять гибкие методологии разработки программного обеспечения для создания двух реальных проектов для некоммерческих организаций. Также, вы добавите функционал к двум устаревшим некоммерческим проектам. К моменту завершения у вас в портфолио будут реальные приложения, которые люди используют каждый день.",
              ""
            ],
            [
              "//i.imgur.com/PDGQ9ZM.jpg",
              "Изображение участников, вместе работающих над проектами в кафе в Сеуле.",
              "Если вы завершите всю программу, эквивалентную 2,080 часам заданий и проектов, вы получите наш сертификат разработчика полного стека. Мы предложим вам бесплатную практику прохождения интервью при приёме на работу программистом. Мы даже предоставляем доску объявлений, где работодатели целенаправленно нанимают участников проекта, получивших сертификаты.",
              ""
            ]
          ]
        }
      }
    },
    {
      "id": "560add37cb82ac38a17513bf",
      "title": "Create a GitHub Account and Join our Chat Rooms",
      "description": [
        [
          "//i.imgur.com/EAR7Lvh.jpg",
          "A screenshot of our one of our Gitter chat rooms.",
          "Before we start coding, let's join Free Code Camp's chat rooms. You can come here any time of day to hang out, ask questions, or find another camper to pair program with. First you'll need a GitHub account.",
          ""
        ],
        [
          "//i.imgur.com/n6GeSEm.gif",
          "A gif showing you to click the link below to go to GitHub. Fill in the necessary fields and click submit. Then check your email inbox for an email from GitHub so you can verify your account.",
          "Click the \"Open link in new tab\" button below to open up GitHub. Create a GitHub account by filling in the form. Be sure to use your real email address - GitHub will keep this private. Then check your email inbox for an email from GitHub. Open it and click the \"verify email address\" button inside it. <br><div class=\"small\">Note: If you already have a GitHub account, you can skip this step by clicking \"Open link in new tab\", closing the new tab that opens, then clicking \"go to my next step\". We removed our \"skip step\" button because many people would just click it repeatedly without doing these important steps.</div>",
          "https://github.com/join"
        ],
        [
          "//i.imgur.com/hFqAEr8.gif",
          "A gif showing you how to click the profile image in the upper right hand corner of GitHub. Upload a photo of yourself or you will continue to use the automatically generated pixel art. Then fill in the remaining form fields and click submit.",
          "Click the pixel art in the upper right hand corner of GitHub, then choose settings. Upload a picture of yourself. A picture of your face works best. This is how your fellow campers will see you in our chat rooms, so look your best. You can add your city and your name if you want.",
          "https://github.com/settings/profile"
        ],
        [
          "//i.imgur.com/ommZH5V.gif",
          "A gif showing you Free Code Camp's GitHub repo.",
          "Open Free Code Camp's open-source repository. This is where our volunteer team collaborates on building Free Code Camp.",
          "https://github.com/freecodecamp/freecodecamp"
        ],
        [
          "//i.imgur.com/OmRmLB4.gif",
          "A gif showing you how to click the link below to go to our chat room and click the \"sign in with GitHub\" button. Then you can click into the text input field and type a message to your fellow campers.",
          "Now that you have a GitHub account, you can join our main chat room by logging in with GitHub. Introduce yourself by saying \"Hello world!\" Tell your fellow campers how you found Free Code Camp. Also tell us why you want to learn to code.",
          "https://gitter.im/FreeCodeCamp/FreeCodeCamp"
        ],
        [
          "//i.imgur.com/ud03jig.gif",
          "A gif showing you how you can click the settings button in the upper right hand corner and modify your notification settings.",
          "Our chat rooms are extremely active. You should change your settings so you're only notified if someone mentions you.",
          ""
        ],
        [
          "//i.imgur.com/T0bGJPe.gif",
          "A gif showing how you can click on a user profile image to initiate a private message with that user.",
          "Please note that all of our chat rooms are visible to the public. If you need to share sensitive information, such as an email address or phone number, do it in a private message.",
          ""
        ],
        [
          "//i.imgur.com/GqSiNn5.gif",
          "A gif showing that you can tab back and forth between challenges and our chat rooms.",
          "Keep our chat room open while you work through our challenges. That way, you can ask for help if you get stuck. You can also socialize with other campers when you feel like taking a break.",
          ""
        ],
        [
          "//i.imgur.com/WvQvNGN.gif",
          "A gif showing how you can click the link below to download a native chat room app for your computer.",
          "You can also download the chat room app to your computer or phone.",
          "https://gitter.im/apps"
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "translations": {
        "de": {
          "title": "Erstelle einen GitHub Account und tritt unserem Chat bei",
          "description": [
            [
              "//i.imgur.com/EAR7Lvh.jpg",
              "Ein Screenshot von einem userer Gitter Chats.",
              "Bevor wir zu programmieren beginnen, lass uns den Free Code Camp Chats beitreten. Hier kannst du zu jeder Tageszeit kommen, Fragen stellen oder einen anderen Camper suchen um gemeinsam zu programmieren. Doch zuerst benötigst du einen GitHub Account.",
              ""
            ],
            [
              "//i.imgur.com/n6GeSEm.gif",
              "Ein GIF das zeigt wie der unten stehenden Link angeklickt wird um auf GitHub zu kommen. Füll die notwendigen Felder aus und bestätige. Dann schau in deine Mails nach einer Nachricht von GitHub um deinen Account zu verifizieren.",
              "Klicke unten auf den \"Link in neuem Tab öffnen\" Button um GitHub zu öffnen. Erstelle einen GitHub Account indem du die Felder in dem Formular ausfüllst. Überprüfe ob du deine echte Emailadresse verwendest - GitHub wird sie nicht weitergeben. Dann suche in deinem Posteingang nach einer Nachricht von GitHub. Öffne sie und klicke den darin befindenden \"Emailadresse bestätigen\" Button. <br><div class=\"small\">Hinweis: Wenn du bereits einen GitHub Account besitzt, kannst du diesen Schritt überspringen, indem du \"Link in neuem Tab öffnen\" drückst, den neuen Tab schließt und dann auf \"Gehe zu nächstem Schritt\" klickst. Wir haben den \"Schritt überspringen\" Button entfernt weil viele Leute sich einfach durchgeklickt haben ohne diese wichtigen Schritte zu tun</div>",
              "https://github.com/join"
            ],
            [
              "//i.imgur.com/hFqAEr8.gif",
              "Ein GIF das dir zeigt wie man sein Profilebild im rechten oberen Eck von GitHub anklickt. Lade ein Foto von dir hoch oder verwende weiterhin das automatisch generierte Pixelbild. Dann fülle die übrigen Formularfelder aus und klicke auf Bestätigung.",
              "Klicke auf das Pixel-Art Bild in der rechten oberen Ecke von GitHub, dann gehe auf Einstellungen (settings). Lade ein Bild von dir hoch. Ein Foto von deinem Gesicht bietet sich am Besten an. So sehen dich die anderen Camper im Chat, also mach dich schick. Du kannst deine Stadt und deinen Namen hinzufügen, falls du willst.",
              "https://github.com/settings/profile"
            ],
            [
              "//i.imgur.com/ommZH5V.gif",
              "Ein GIF das dir zeigt wie man einem GitHub Repository einen Stern gibt",
              "Öffne Free Code Camp's open-source Repository. Hier arbeitet das ehrenamtliche Team zusammen an Free Code Camp. Du kannst unserem Repositoy einen Stern geben. Das ist das GitHub Äquivalent für etwas \"liken\"",
              "https://github.com/freecodecamp/freecodecamp"
            ],
            [
              "//i.imgur.com/OmRmLB4.gif",
              "Ein GIF das dir zeigt wie der unten stehende Link geklickt, auf den Chat weitergeleitet und mit dem \"Melde dich mit GitHub an\" Button man angemeldet wird. Dann kannst du auf das Textfeld klicken und eine Nachricht an andere Camper schicken",
              "Jetzt, da du einen GitHub Account besitzt, kannst du unserem Hauptchat beitreten indem du dich mit GitHub anmeldest. Stell dich vor indem du \"Hello World\" schreibst. Erzähl den anderen Campern wie du Free Code Camp gefunden hast. Außerdem könntest du uns erzählen warum du programmieren lernen willst.",
              "https://gitter.im/FreeCodeCamp/FreeCodeCamp"
            ],
            [
              "//i.imgur.com/ud03jig.gif",
              "Ein Gif das dir zeigt wie man den Einstellungsbutton im oberen rechten Eck anklickt und die Benachrichtigungseinstellungen ändert.",
              "Unsere Chats sind sehr aktiv. Du solltest die Einstellungen ändern, damit du nur benachrichtigt wirst falls dich jemand erwähnt",
              ""
            ],
            [
              "//i.imgur.com/T0bGJPe.gif",
              "Ein GIF das dir zeigt wie man ein Profilbild von einem anderen User anklickt um eine private Nachricht zu versenden.",
              "Sei dir bitte bewusst, dass alle unsere Chats komplett öffentlich sind. Falls du also sensible Informationen, wie zum Beispiel Emailadressen oder Telefonnummern, austauschen willst, verwende Privatnachrichten.",
              ""
            ],
            [
              "//i.imgur.com/GqSiNn5.gif",
              "Ein GIF das dir zeigt, dass du mithilfe mehrerer Tabs zwischen Aufgaben und dem Chat hin und her wechseln kannst",
              "Halte den Chat offen, während du an den Aufgaben arbeitest. So kannst du jederzeit nach Hilfe fragen falls du nicht weiterkommst. Außerdem kannst du dich mit anderen Campern unterhalten falls du eine Pause brauchst.",
              ""
            ],
            [
              "//i.imgur.com/WvQvNGN.gif",
              "Ein GIF das dir zeigt wie du den den untenstehenden Link klickst um die native Chatapp für deinen Computer herunterzuladen.",
              "Du kannst dir auch die Chatapp für deinen Computer oder dein Smartphone herunterladen.",
              "https://gitter.im/apps"
            ]
          ]
        },
        "es": {
          "title": "Crea una Cuenta de GitHub y Únete a nuestras Salas de Chat",
          "description": [
            [
              "//i.imgur.com/EAR7Lvh.jpg",
              "Una imagen de una de nuestras salas de chat en Gitter.",
              "Ahora únete a las salas de chat de Free Code Camp. Puedes venir aquí en cualquier momento para charlar, hacer preguntas, o encontrar otro campista para programar juntos. Primero necesitarás una cuenta de GitHub.",
              ""
            ],
            [
              "//i.imgur.com/n6GeSEm.gif",
              "Una imagen mostrándote como pulsar en el enlace inferior para ir a GitHub, llenar los campos necesarios y enviarlos.",
              "Crea una cuenta en GitHub. Asegúrate de usar tu dirección de correo real - GitHub mantendrá esto en privado.",
              "https://github.com/join"
            ],
            [
              "//i.imgur.com/hFqAEr8.gif",
              "Un gif mostrándote como pulsar en la imagen de perfil en la esquina superior derecha de GitHub. Sube una foto tuya o continuaras usando la imagen de píxeles generada automáticamente. Entonces llena los campos restantes y haz clic en enviar.",
              "En la esquina superior derecha pulsa sobre la imagen de píxeles, entonces selecciona configuraciones. Sube una imagen tuya. Una foto de tu cara es mejor. Así es como tus compañeros campistas te verán en nuestras salas de chat, así que toma tu mejor ángulo. Puedes añadir tu ciudad y tu nombre si lo deseas.",
              "https://github.com/settings/profile"
            ],
            [
              "//i.imgur.com/ommZH5V.gif",
              "Un gif mostrándote como puedes dar una estrella a un repositorio de GitHub.",
              "Ve al repositorio de código libre de Free Code Camp y dale una \"estrella\". Las \"estrellas\" son el equivalente en GitHub de los \"me gusta\".",
              "Si quieres, ve al repositorio de código libre de Free Code Camp.",
              "https://github.com/freecodecamp/freecodecamp"
            ],
            [
              "//i.imgur.com/OmRmLB4.gif",
              "Un gif mostrándote como pulsar en el enlace inferior para ir a nuestra sala de chat y pulsar en el botón de \"iniciar sesión con GitHub\". Entonces puedes pulsar en el próximo campo de texto y escribir un mensaje a tus compañeros campistas.",
              "Ahora que tienes una cuenta de GitHub, puedes unirte a nuestro chat principal al iniciar sesión con GitHub. Preséntate diciendo \"Hello world!\" Cuéntales a los tus compañeros campistas como encontraste Free Code Camp. Además cuéntanos porque deseas aprender a programar.",
              "https://gitter.im/FreeCodeCamp/FreeCodeCamp"
            ],
            [
              "//i.imgur.com/ud03jig.gif",
              "Un gif mostrándote como puedes pulsar en el botón de configuraciones en la esquina superior derecha y modificar tus configuraciones de notificaciones.",
              "Nuestras salas de chat son extremadamente activas. Deberías cambiar tus configuraciones para ser notificado únicamente si alguien te menciona.",
              ""
            ],
            [
              "//i.imgur.com/T0bGJPe.gif",
              "Un gif mostrándote como puedes pulsar en la imagen de perfil de un usuario para iniciar una conversación privada con ese usuario.",
              "Por favor nota que todas nuestras salas de chat son visibles para el público. Si necesitas compartir información privada, como una dirección de correo o un número de teléfono, hazlo en un mensaje privado.",
              ""
            ],
            [
              "//i.imgur.com/GqSiNn5.gif",
              "Un gif mostrándote que puedes cambiar entre desafíos y nuestras salas de chat.",
              "Mantén nuestra sala de chat abierta mientras trabajas en nuestros desafíos. De esta manera, puedes pedir ayuda si quedas atascado. Además puedes socializar con otros campistas cuando quieras tomar un descanso.",
              ""
            ],
            [
              "//i.imgur.com/WvQvNGN.gif",
              "Un gif mostrándote como puedes pulsar abajo para descargar una aplicación de chat nativa para tu computadora.",
              "También puedes descargar la aplicación de chat para tu computadora o teléfono móvil.",
              "https://gitter.im/apps"
            ]
          ]
        },
        "fr": {
          "title": "Créer un compte GitHub et rejoignez nos Salons de chat",
          "description": [
            [
              "//i.imgur.com/EAR7Lvh.jpg",
              "Une capture d'écran de notre l'un de nos Gitter salles de chat.",
              "Avant de commencer à coder, nous allons rejoindre les salles de chat de Camp Code Free . Vous pouvez venir ici tout moment de la journée pour se détendre , poser des questions , ou trouver un autre camping de jumeler programme avec. D'abord, vous aurez besoin d'un compte GitHub.",
              ""
            ],
            [
              "//i.imgur.com/n6GeSEm.gif",
              "Un gif vous montrant à cliquer sur le lien ci-dessous pour aller à GitHub . Remplissez les champs nécessaires et cliquez sur soumettre . Ensuite, vérifiez votre boîte de réception pour un courriel de GitHub sorte que vous pouvez vérifier votre compte.",
              "Cliquez sur le \"lien Ouvrir dans une nouvelle touche de tabulation\" ci-dessous pour ouvrir GitHub. Créer un compte GitHub en remplissant le formulaire . Assurez-vous d'utiliser votre adresse email réelle - GitHub gardera cette privé. Ensuite, vérifiez votre boîte de réception pour un courriel de GitHub. Ouvrez-le et cliquez sur \"l'adresse email sur vérifier\" l'intérieur. <br><div class=\"small\">Remarque: Si vous avez déjà un compte GitHub , vous pouvez sauter cette étape en cliquant sur \"Ouvrir le lien dans un nouvel onglet\", fermeture le nouvel onglet qui ouvre, puis en cliquant \"aller à ma prochaine étape\". Nous avons retiré notre bouton de \"l'étape de saut\" , car beaucoup de gens il suffit de cliquer à plusieurs reprises sans faire ces étapes importantes.</div>",
              "https://github.com/join"
            ],
            [
              "//i.imgur.com/hFqAEr8.gif",
              "Un gif vous montrant comment cliquez sur l' image de profil dans le coin supérieur droit de GitHub. Télécharger une photo de vous-même ou vous allez continuer à utiliser l'art de pixel généré automatiquement . Ensuite, remplissez les champs du formulaire restants et cliquez sur soumettre.",
              "Cliquez sur le pixel art dans le coin supérieur droit de GitHub , puis choisissez les paramètres . Télécharger une photo de vous-même. Une photo de votre visage qui fonctionne le mieux . Voici comment les autres campeurs vous voir dans nos salles de chat , donc regarder votre meilleur . Vous pouvez ajouter votre ville et votre nom si vous voulez.",
              "https://github.com/settings/profile"
            ],
            [
              "//i.imgur.com/ommZH5V.gif",
              "Un gif montrant comment vous pouvez activer un repo GitHub.",
              "Ouvrez open-source du dépôt central de Camp Code Free . Ceci est où notre équipe de bénévoles collabore à la construction de Camp Code Free.",
              "https://github.com/freecodecamp/freecodecamp"
            ],
            [
              "//i.imgur.com/OmRmLB4.gif",
              "Un gif vous montrant comment Cliquez sur le lien ci-dessous pour accéder à notre salle de chat et cliquez sur \"Se connecter avec\" bouton GitHub. Puis vous pouvez cliquer dans le champ de saisie de texte et saisissez un message à vos amis campeurs.",
              "Maintenant que vous avez une GitHub compte, vous pouvez vous joindre à notre principale salle de chat en vous connectant à GitHub. Présentez-vous en disant \"Hello World!\" avertissez votre amis campeurs comment vous avez trouvé Libre Code Camp. Aussi nous dire pourquoi vous voulez apprendre à code.",
              "https://gitter.im/FreeCodeCamp/FreeCodeCamp"
            ],
            [
              "//i.imgur.com/ud03jig.gif",
              "Un gif vous montrant comment vous pouvez cliquez sur le bouton Réglages dans le coin supérieur droit et modifier vos paramètres de notification.",
              "Nos salles de chat sont extrêmement actifs. Vous devez modifier vos paramètres pour vous're notifié que si quelqu'un vous mentionne.",
              ""
            ],
            [
              "//i.imgur.com/T0bGJPe.gif",
              "Un gif montrant comment vous pouvez cliquer sur une image de profil utilisateur pour lancer un message privé avec cet utilisateur.",
              "Veuillez noter que tous nos salons de chat sont visibles pour le public. Si vous avez besoin de partager des informations sensibles, comme un numéro de téléphone ou l'adresse e-mail, faites-le dans un message privé.",
              ""
            ],
            [
              "//i.imgur.com/GqSiNn5.gif",
              "Un gif montrant que vous pouvez Tab et retour entre défis et nos salles de chat.",
              "Garder notre salle de discussion ouverte pendant que vous travaillez à travers nos défis. De cette façon, vous pouvez demander de l'aide si vous êtes coincé. Vous pouvez également socialiser avec d'autres campeurs lorsque vous sentez comme prendre une pause.",
              ""
            ],
            [
              "//i.imgur.com/WvQvNGN.gif",
              "Un gif montrant comment vous pouvez cliquer sur le lien ci-dessous pour télécharger un natif salle de chat app pour votre ordinateur.",
              "Vous pouvez également télécharger la salle de chat app pour votre ordinateur ou votre téléphone.",
              "https://gitter.im/apps"
            ]
          ]
        },
        "it": {
          "title": "Crea un account GitHub e iscriviti alle nostre Chat Rooms",
          "description": [
            [
              "//i.imgur.com/EAR7Lvh.jpg",
              "Uno screenshot di una delle nostre chat rooms in Gitter.",
              "Prima di iniziare a scrivere codice, entra nelle chat di Free Code Camp. Potrai venire qui in ogni momento della giornata per chiacchierare, fare domande, o trovare un altro camper per programmare in coppia. Prima di tutto avrai bisogno di un account GitHub.",
              ""
            ],
            [
              "//i.imgur.com/n6GeSEm.gif",
              "Una gif che invita a cliccare sul link qui sotto per andare su GitHub. Compila i campi necessari e fare clic su Invia. Quindi controlla la tua casella di posta elettronica, riceverai una e-mail da GitHub per verificare il tuo account.",
              "Clicca sul pulsante \" Apri link in una nuova scheda \" qui sotto per aprire GitHub. Crea un account compilando il modulo. Assicurati di utilizzare un indirizzo email reale - GitHub lo terrà privato. Poi controlla la tua casella di posta, riceverai un'e-mail da GitHub. Aprila e clicca il pulsante \"verificare l'indirizzo e-mail \" al suo interno <br> <div class=\"small\">. Nota: Se disponi già di un account GitHub, è possibile saltare questo passaggio cliccando \"Apri link in una nuova scheda \", chiudendo poi la scheda appena aperta, quindi facendo clic su \"Vai al mio prossimo passo \". Abbiamo rimosso il pulsante \"Salta il passaggio \" perché molte persone lo premerebbero ripetutamente, saltando questi importanti passaggi. </ div>",
              "https://github.com/join"
            ],
            [
              "//i.imgur.com/hFqAEr8.gif",
              "Una gif che mostra come cliccare l'immagine del profilo nell'angolo in alto a destra di GitHub. Carica una foto di te altrimenti continuerai ad utilizzare la pixel art generata automaticamente. Poi, compila gli altri campi del modulo e fai clic su Invia.",
              "Clicca sulla pixel art nell'angolo in alto a destra di GitHub, quindi seleziona impostazioni. Carica una foto di te stesso. Una foto del viso è la scelta migliore. Gli altri campers ti vedranno così nelle nostre chat rooms, quindi cerca di apparire al meglio . È anche possibile aggiungere la tua città e il tuo nome.",
              "https://github.com/settings/profile"
            ],
            [
              "//i.imgur.com/ommZH5V.gif",
              "Una gif che mostra la repository GitHub di Free Code Camp.",
              "Apri la repository open-source di Free Code Camp. E' qui che il nostro team di volontari collabora allo sviluppo di Free Code Camp.",
              "https://github.com/freecodecamp/freecodecamp"
            ],
            [
              "//i.imgur.com/OmRmLB4.gif",
              "Una gif che mostra come cliccare sul link qui sotto per andare alla nostra chat room e fare clic sul pulsante \" accedi con GitHub \". Quindi potrai cliccare nel campo di immissione testo e digitare un messaggio agli altri campers.",
              "Ora che disponi di un account GitHub, puoi aggiungerti alla nostra chat principale effettuando il login con GitHub. Presentati dicendo \" Hello World! \"Dì ai campers come hai trovato Free Code Camp. Dicci anche perché vuoi imparare a programmare. ",
              "https://gitter.im/FreeCodeCamp/FreeCodeCamp"
            ],
            [
              "//i.imgur.com/ud03jig.gif",
              "Una gif che mostra come cliccare sul pulsante Impostazioni nell'angolo in alto a destra e modificare le impostazioni di notifica.",
              "Le nostre chat rooms sono estremamente attive. È preferibile modificare le impostazioni in modo da essere notificati solo se qualcuno ti menziona direttamente.",
              ""
            ],
            [
              "//i.imgur.com/T0bGJPe.gif",
              "Una gif che mostra come cliccare sull'immagine di un profilo utente per avviare una conversazione privata con quell'utente.",
              "Ti preghiamo di notare che tutte le nostre chat rooms sono visibili al pubblico. Se hai bisogno di condividere le informazioni sensibili, come ad esempio un indirizzo email o il numero di telefono, fallo in un messaggio privato.",
              ""
            ],
            [
              "//i.imgur.com/GqSiNn5.gif",
              "Una gif che mostra come passare ripetutamente tra i problemi e le nostre chat rooms.",
              "Mantieni aperta la nostra chat mentre lavori ai nostri problemi. In questo modo, potrai chiedere aiuto se ti troverai in ​​difficoltà. Potrai anche socializzare con gli altri campers, quando avrai voglia di prendere una pausa.",
              ""
            ],
            [
              "//i.imgur.com/WvQvNGN.gif",
              "Una gif che mostra come è possibile fare clic sul link qui sotto per scaricare applicazione di chat nativa per il computer.",
              "È anche possibile scaricare un'applicazione nativa per il computer o il telefono.",
              "https://gitter.im/apps"
            ]
          ]
        },
        "ja": {
          "title": "Githubアカウントを作成し、チャットに参加しましょう",
          "description": [
            [
              "//i.imgur.com/EAR7Lvh.jpg",
              "Gitterチャットルームの一場面です。",
              "コーディングを始める前に、Free Code Camp のチャットルームに参加してください。いつでも、雑談や質問ができたりペアプログラミングをするための仲間を見つけ流ことができます。最初に GitHub アカウントが必要です。",
              ""
            ],
            [
              "//i.imgur.com/n6GeSEm.gif",
              "この gif は GitHub を開始するまでの流れを表しています。必要な欄に情報を入れて登録をしてください。そして GitHub からあなたのメールアドレス宛にメールが届きますのでアカウントを承認してください。",
              "\"Open link in new tab\"をクリックして GitHub を開いてください。 必要な欄に情報を入力して GitHub アカウントを作ってください。実際に使われている email アドレスかを確認してください( GitHub にはこの情報が保存されます )。メールアドレス宛に GitHub からメールが来たことを確認してください。 メールにある\"verify email address\"をクリックして開いてください。<br><div class=\"small\">注意： もしすでに GitHub アカウントを持っていたら、あなたは \"Open link in new tab\" をクリックすることでこのステップを飛ばすことができます、新しく開かれたタブを閉じて \"go to my next step\" をクリックしてください。私たちはこの大事なステップが飛ばされてしまうのを防ぐために \"このステップを飛ばす\" ボタンは削除してあります。</div>",
              "https://github.com/join"
            ],
            [
              "//i.imgur.com/hFqAEr8.gif",
              "この gif は GitHub の右上にあるプロフィール画像をクリックする方法です。あなたの写真をアップロードするか、自動で生成されるピクセルアートを利用してください。そして、残りの欄に情報を入力し submit ボタンを押してください。",
              "GitHub の右上に表示されているピクセルアートをクリックしてください、そして settings を選んでください。あなたの画像をアップロードしてください。画像はあなたの顔が写っていると良いです。他のキャンパーズの仲間たちがチャットルームであなたを見かけるようになります。住んでいる場所や名前を登録することもできます",
              "https://github.com/settings/profile"
            ],
            [
              "//i.imgur.com/ommZH5V.gif",
              "この gif は GitHub のレポジトリへのスターをつける方法です。",
              "オープンソースの Free Code Camp のレポジトリを開いてください。これは私たちボランティアチームの協力者が Free Code Camp で作っているものです。",
              "https://github.com/freecodecamp/freecodecamp"
            ],
            [
              "//i.imgur.com/OmRmLB4.gif",
              "この git は私たちのチャットルームへのリンクをクリックして、\"sign in with GitHub\" ボタンをクリックしています。そして、テキストを入力してキャンパーズの仲間へメッセージを送る方法を表しています。",
              "あなたは GitHub のアカウントを持っているので、私たちのチャットルームへ GitHub を利用してログインできます。\"Hellow world!\" と言って自己紹介をし、あなたがどうやって Free Code Camp を見つけたかや何故プログラミングを学びたいのかを私たちに話してください。",
              "https://gitter.im/FreeCodeCamp/FreeCodeCamp"
            ],
            [
              "//i.imgur.com/ud03jig.gif",
              "この gif は右上の settings ボタンを押すことで、通知の設定を変更する方法を表しています。",
              "私たちのチャットルームはとても活発です。あなたは誰かがあなたに対してメンションを送った時にだけ通知してもらうように設定を変更した方が良いでしょう。",
              ""
            ],
            [
              "//i.imgur.com/T0bGJPe.gif",
              "この gif はどうやって該当するユーザに向けて個人的なメーッセージを送れるようにするかを表しています。",
              "私たちのチャットルームは全て公開されているので、もしあなたが個人的な情報(メールアドレスや電話番号)を共有したい場合には、プライベートメッセージを利用してください。",
              ""
            ],
            [
              "//i.imgur.com/GqSiNn5.gif",
              "この gif はチャレンジとチャットルームへの行き来がタブを戻すことでできることを表しています。",
              "私たちのチャレンジを通して作業をしている間はチャットルームを開いておくと良いでしょう。そうすることで、必要な時に助けを求めることができます。あなたは休憩をしているかのように他のキャンパーズと関わりを持てるでしょう。",
              ""
            ],
            [
              "//i.imgur.com/WvQvNGN.gif",
              "この gif は、チャットルームアプリをあなたのコンピュータに直接インストールするためにダウンロードする方法を表しています。",
              "チャットルームのアプリをスマホや自分のパソコンにダウンロードして使うことができます。",
              "https://gitter.im/apps"
            ]
          ]
        },
        "pt-br": {
          "title": "Crie uma conta no Github e junte-se a nossas salas de bate-papo",
          "description": [
            [
              "//i.imgur.com/EAR7Lvh.jpg",
              "Um screenshot de uma de nossas salas de bate-papo Gitter.",
              "Antes de começarmos a programar, vamos nos juntar às salas de bate-papo do Free Code Camp. Você pode vir aqui a qualquer momento do dia para socializar, fazer perguntas ou encontar outro campista para programar em dupla. Primeiro, você precisará de uma conta no GitHub.",
              ""
            ],
            [
              "//i.imgur.com/n6GeSEm.gif",
              "Um gif mostrando a você para clicar no botão abaixo para ir ao site do GitHub. Preencha os campos necessários em clique em submeter. Então acesse sua caixa de e-mails e encontre um e-mail enviado por GitHub para que você verifique sua conta.",
              "Clique no botão \"Abrir link em nova aba\" abaixo para abrir o GitHub. Crie uma conta ao preencher o formulário. Certifique-se que você está usando seu verdadeiro e-mail - GitHub manterá sua informação em segredo. Então acesse sua caixa de e-mails e encontre um e-mail enviado por GitHub para que você verifique sua conta. Abra-o e clique no botão \"Verifique seu e-mail\" dentro do e-mail recebido. <br><div class=\"small\">Nota: Se você já possui ma conta no GitHub, você pode pular este passo ao clicar em \"Abrir link em nova aba\", fechar a nova aba que abrirá e então clicar em \"avançar para o próximo passo\". Nós removemos nosso botão \"pular passo\" porque muitas pessoas estavam apenas clicando nele repetidamente sem seguir os importantes passos.</div>",
              "https://github.com/join"
            ],
            [
              "//i.imgur.com/hFqAEr8.gif",
              "Um gif mostrando a você para clicar na sua foto de perfil no canto superior direito na página do GitHub. Faça o upload de uma foto sua ou você continuará a usar a foto automaticamente gerada (arte em pixel). Preencha os campos restantes no formulário e clique em submeter.",
              "Clique na foto (arte em pixel) no canto superior direito na página do GitHub e clique em opções. Faça o upload de uma foto sua. Uma foto de seu rosto é o que funciona melhor. É assim que seus amigos campistas vão ver você nas salas de bate-papo. Você pode adicionar sua cidade e seu nome se você quiser.",
              "https://github.com/settings/profile"
            ],
            [
              "//i.imgur.com/pYk0wOk.gif",
              "Um gif mostrando o repositório do Free Code Camp.",
              "Abra o repositório open-source so Free Code Camp. É lá que nossa equipe voluntária colabora em construir o Free Code Camp.",
              "https://github.com/freecodecamp/freecodecamp"
            ],
            [
              "//i.imgur.com/OmRmLB4.gif",
              "Um gif mostrando como clicar no link abaixo para ir à nossa sala de bate-papo e clicando no botão \"entre com GitHub\". Em seguida, você pode clicar no campo de entrada de texto e digitar uma mensagem para os seus colegas campistas.",
              "Agora que você tem uma conta GitHub, você pode se juntar à nossa sala de chat principal, fazendo login com GitHub. Apresente-se, dizendo \"Hello world! \" e diga a seus colegas campistas como você encontrou Free Code Camp. Também diga-nos por que você quer aprender a programar.",
              "https://gitter.im/FreeCodeCamp/FreeCodeCamp"
            ],
            [
              "//i.imgur.com/Ecs5XAd.gif",
              "Um gif mostrando como você pode clicar no botão Configurações no canto superior direito e modificar suas configurações de notificação.",
              "Nossas salas de chat são extremamente ativas. Você deve alterar as configurações para que você seja notificado somente se alguém mencionar seu nome.",
              ""
            ],
            [
              "//i.imgur.com/T0bGJPe.gif",
              "Um gif mostrando como você pode clicar em uma imagem de perfil para iniciar uma mensagem privada com outro usuário.",
              "Por favor, note que todas as nossas salas de chat são visíveis ao público. Se você precisa compartilhar informações pessoais, tais como um endereço de e-mail ou número de telefone, compartilhe através de uma mensagem privada.",
              ""
            ],
            [
              "//i.imgur.com/vDTMJSh.gif",
              "Um gif mostrando que você pode ir e voltar pros desafios e nossas salas de chat.",
              "Mantenha a nossa sala de chat aberta enquanto você trabalha em um de nossos desafios. Dessa forma, você pode pedir ajuda se você não conseguir avançar. Você também pode socializar com outros campistas quando você sentir vontade de fazer uma pausa.",
              ""
            ],
            [
              "//i.imgur.com/WvQvNGN.gif",
              "Um gif mostrando como você pode clicar no link abaixo para baixar um aplicativo de bate-papo nativo para o seu computador.",
              "Você também pode baixar o app da sala de chat para o seu computador ou telefone.",
              "https://gitter.im/apps"
            ]
          ]
        },
        "ru": {
          "title": "Создайте учётную запись на GitHub и присоединяйтесь к нашим чатам",
          "description": [
            [
              "//i.imgur.com/EAR7Lvh.jpg",
              "Изображение одного из наших чатов в Gitter",
              "Давайте, перед тем как приступить к программированию, присоединимся к чатам Free Code Camp. Вы можете подсоединяться к ним в любое время суток, чтобы просто позависать, позадавать вопросы, или найти другого участника, с которым вы можете объединиться для парной работы. Для начала вам понадобится учётная запись на GitHub.",
              ""
            ],
            [
              "//i.imgur.com/n6GeSEm.gif",
              "Анимация, показывающая нажатие на ссылку, расположенную ниже, для перехода на GitHub. Заполните требуемые поля и подтвердите отправку данных. Затем проверьте вашу электронную почту на предмет получения письма от GitHub, чтобы вы могли подтвердить создание вашей учётной записи.",
              "Нажмите кнопку \"Открыть ссылку в новой вкладке\", расположенную ниже, чтобы открыть GitHub. Создайте учётную запись GitHub путём заполнения формы. Убедитесь, что вы используете ваш настоящий адрес электронной почты - GitHub не публикует эту информацию. Затем проверьте ваши входящие на предмет получения письма от GitHub. Откройте его и нажмите кнопку в теле письма \"подтвердить адрес электронной почты\". <br><div class=\"small\">Заметка: Если у вас уже есть учётная запись GitHub, вы можете пропустить этот шаг путём нажатия на \"Открыть ссылку в новой вкладке\", закрывания открывшейся вкладки, последующего нажатия \"перейти к следующему шагу\". Мы убрали кнопку \"пропустить шаг\", так как многие склонны нажимать её повторно несколько раз подряд, пропуская эти важные шаги.</div>",
              "https://github.com/join"
            ],
            [
              "//i.imgur.com/hFqAEr8.gif",
              "Анимация, показывающая нажатие на изображение профиля в верхнем правом углу экрана на GitHub. Загрузите ваше фото или вы продолжите использование автоматически сгенерированного пиксельного изображения. Затем заполните оставшиеся поля формы и подтвердите отправку данных",
              "Нажмите на пиксельное изображение в правом верхнем углу экрана на GitHub, выберите настройки. Загрузите фаше фото. Изображение вашего лица работает наилучшим образом. Именно так вас будут видеть участники проекта в наших чатах, так что постарайтесь выглядеть наилучшим образом. Вы можете указать ваш город и имя, если хотите.",
              "https://github.com/settings/profile"
            ],
            [
              "//i.imgur.com/ommZH5V.gif",
              "Анимация, показывающая как вы можете установить отметку в виде звезды к репо на GitHub.",
              "Откройте репозиторий Free Code Camp с открытым кодом. Это место, где наша команда добровольцев сотрудничает над созданием Free Code Camp. Вы можете отметить наш репозиторий звездой. Эта отметка на GitHub эквивалентна функции \"нравится\".",
              "https://github.com/freecodecamp/freecodecamp"
            ],
            [
              "//i.imgur.com/OmRmLB4.gif",
              "Анимация, показывающая нажатие на ссылку, расположенную ниже, для перехода в чат и нажатие на кнопку \"войти с помощью GitHub\". Затем вы можете нажать на область поля ввода и напечатать сообщение для ваших приятелей, являющихся участниками проекта.",
              "Теперь, когда у вас есть учётная запись GitHub, вы можете присоединиться к нашему основному чату, войдя с помощью GitHub. Представьтесь отправив фразу \"Hello world!\". Сообщите вашим приятелям, участвующим в проекте, что вы нашли Free Code Camp. Также, сообщите нам почему вы хотите изучать программирование.",
              "https://gitter.im/FreeCodeCamp/FreeCodeCamp"
            ],
            [
              "//i.imgur.com/ud03jig.gif",
              "Анимация, показывающая нажатие на кнопку настроек в правом верхнем углу экрана и изменение ваших настроек уведомлений.",
              "Наши чаты очень активны. Вам следует изменить ваши настройки уведомлений, чтобы вы видели только когда кто-то упоминает вас.",
              ""
            ],
            [
              "//i.imgur.com/T0bGJPe.gif",
              "Анимация, показывающая нажатие на изображение профиля пользователя для начала личной переписки с этим пользователем.",
              "Пожалуйста, обратите внимание, что все наши чаты доступны публично. Если вам нужно поделиться чувствительной информацией, например, адресом электронной почты или номером телефона, пользуйтесь для этого личной перепиской.",
              ""
            ],
            [
              "//i.imgur.com/GqSiNn5.gif",
              "Анимация, показывающая перемещение между заданиями и чатами.",
              "Сохраняйте наши чаты открытыми в процессе работы над заданиями. Таким образом вы сможете обратиться за помощью, если застрянете в процессе выполнения задания. Также, вы можете социализироваться с другими участниками проекта, когда решите сделать перерыв.",
              ""
            ],
            [
              "//i.imgur.com/WvQvNGN.gif",
              "Анимация, показывающая нажатие на ссылку, расположенную ниже, для скачивания приложения-чата на ваш компьютер.",
              "Также, вы можете скачать и установить приложение-чат на ваш компьютер или телефон.",
              "https://gitter.im/apps"
            ]
          ]
        }
      }
    },
    {
      "id": "560add56cb82ac38a17513c0",
      "title": "Configure your Code Portfolio",
      "description": [
        [
          "//i.imgur.com/Tw5allJ.gif",
          "A gif showing how you can click your profile image in your upper right hand corner to your code portfolio and connect GitHub.",
          "Check out your code portfolio. Click your picture in your upper right hand corner. To activate your code portfolio, you'll need to link your GitHub account with Free Code Camp. Your code portfolio shows your progress and how many Brownie Points you have. You can get Brownie Points by completing challenges and by helping other campers in our chat rooms. If you get Brownie Points on several days in a row, you'll get a streak.",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "translations": {
        "de": {
          "title": "Erstelle dein Code Portfolio",
          "description": [
            [
              "//i.imgur.com/Tw5allJ.gif",
              "Ein GIF das dir zeigt wie man sein Profilbild in der rechten oberen Ecke anklickt um zu deinem Code Portfolio zu gelangen und mit GitHub zu verbinden",
              "Schau dir dein Code Portfolio an. Klick auf dein Profilbild in der rechten oberen Ecke. Um dein Portfolio zu aktivieren musst du deinen GitHub Account mit Free Code Camp verbinden. Dein Code Portfolio zeigt deinen Fortschritt und wieviele Brownie Punkte du hast. Du bekommst Brownie Punkte wenn du Aufgaben löst oder anderen Campern im Chat hilfst. Wenn du an mehreren Tagen in Folge Brownie Punkte erhälst bekommst du einen \"streak\"",
              ""
            ]
          ]
        },
        "es": {
          "title": "Configura tu portafolio de código",
          "description": [
            [
              "//i.imgur.com/Tw5allJ.gif",
              "Un gif mostrándote como puedes pulsar en tu imagen de perfil en la esquina superior derecha conectar tu portafolio y GitHub.",
              "Dale un vistazo de tu portafolio de código. Pulsa en tu imagen en la esquina superior derecha. Para activar tu portafolio de código, necesitaras conectar tu cuenta de GitHub con Free Code Camp. Tu portafolio de código muestra tu progreso y cuantos Puntos Cafés tienes. Puedes obtener Puntos Cafés completando desafíos y ayudando a otros campistas en nuestras salas de chat. Si obtienes Puntos Cafés varios días consecutivos, obtendrás una racha.",
              ""
            ]
          ]
        },
        "fr": {
          "title": "Configurer votre code portefeuille",
          "description": [
            [
              "//i.imgur.com/Tw5allJ.gif",
              "Un gif montrant comment vous pouvez cliquez sur l'image de votre profil dans votre coin supérieur droit à votre code portefeuille et connectez GitHub.",
              "Vérifiez votre code portefeuille. Cliquez sur votre photo dans votre coin supérieur droit. Pour activer votre code portefeuille, vous'll nécessité de lier votre compte avec code sans GitHub Camp. Votre code portefeuille affiche votre progression et combien de bons points vous avez. Vous pouvez obtenir de bons points par remplir les défis et en aidant d'autres campeurs dans nos salles de chat. Si vous obtenez Brownie Points sur plusieurs jours d'affilée, vous'll obtenez une rayure.",
              ""
            ]
          ]
        },
        "it": {
          "title": "Configura il tuo portfolio da programmatore",
          "description": [
            [
              "//i.imgur.com/Tw5allJ.gif",
              "Una gif che mostra come puoi cliccare l'immagine del profilo in alto a destra per collegare a GitHub il tuo portfolio da programmatore.",
              "Controlla il tuo portfolio da programmatore. Clicca l'immagine in alto a destra. Per attivare il portfolio da programmatore, è necessario collegare il tuo account GitHub con Free Code Camp. Il tuo portfolio da programmatore mostra i tuoi progressi e quanti Brownie Points hai. È possibile ottenere i Brownie Points completando i problemi e aiutando altri campers nelle nostre chat rooms. Se si ricevono Brownie Points per diversi giorni di fila, si otterrà uno \"Streak\". ",
              ""
            ]
          ]
        },
        "pt-br": {
          "title": "Configure o seu portifólio de código",
          "description": [
            [
              "//i.imgur.com/tP2ccTE.gif",
              "Um gif mostrando como você pode clicar em sua imagem de perfil no canto superior direito do seu portifólio de código e se conectar com GitHub.",
              "Confira seu portifólio de código. Clique na sua imagem no canto superior direito. Para ativar seu portifólio de código, você precisa vincular sua conta do GitHub com Free Code Camp. Seu portfólio de código mostra o seu progresso e quantos Brownie Points você tem. Você pode obter Brownie Points completando desafios e ajudando outros campistas em nossas salas de chat. Se você receber Brownie Points em vários dias em seguida, você vai ter um \"Streak\".",
              ""
            ]
          ]
        },
        "ru": {
          "title": "Настройте ваше портфолио с кодом",
          "description": [
            [
              "//i.imgur.com/Tw5allJ.gif",
              "Анимация, показывающая нажатие на изображение профиля в правом верхнем углу экрана от вашего портфолио с кодом и соединение с GitHub.",
              "Просмотрите ваше портфолио с кодом. Нажмите на ваше изображение в правом верхнем углу экрана. Для активации вашего портфолио с кодом, вам нужно будет присоединить свою учётную запись GitHub к Free Code Camp. Ваше портфолио с кодом отражает выполнение вами программы и количество набранных очков прогресса. Вы можете получить очки прогресса завершая задания или помогая другим участникам проекта в наших чатах. Если вы получаете очки прогресса несколько дней подряд, вы получите полосу.",
              ""
            ]
          ]
        }
      }
    },
    {
      "id": "560add71cb82ac38a17513c2",
      "title": "Join a Free Code Camp Group in Your City",
      "description": [
        [
          "//i.imgur.com/XugIMb4.jpg",
          "A picture of some of our campers meeting in a local cafe.",
          "You can code together with other campers in your city by joining a local Free Code Camp group.",
          ""
        ],
        [
          "//i.imgur.com/iBctF6s.gif",
          "A gif showing how you can click the link below, find your city on the list of local groups.",
          "Find your city on this list and click it. This will take you to its Facebook page. Click the \"Join group\" button. Someone from the group should approve you shortly. If your city isn't on this list, scroll to the top of the wiki article for instructions on how you can start a group in your city.",
          "http://forum.freecodecamp.com/t/free-code-camp-city-based-local-groups/19574"
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "translations": {
        "de": {
          "title": "Tritt einem Campsite in deiner Stadt bei",
          "description": [
            [
              "//i.imgur.com/XugIMb4.jpg",
              "Ein Foto von einigen Campern bei einem Treffen in einem lokalen Cafe.",
              "Unsere Campsites sind Facebook Gruppen die dir helfen dich mit anderen Campern aus deiner Stadt zu treffen. Du kannst diese Gruppen verwenden um an \"Coffee-and-Code\" Treffen, wo du andere Camper in einem Cafe triffst um gemeinsam zu programmieren, teilzunehmen oder zu organisieren",
              ""
            ],
            [
              "//i.imgur.com/iBctF6s.gif",
              "Ein GIF das zeigt wie du auf den untenstehenden Link klickst, deine Stadt aus der Liste aller Campsites suchst, auf den Facebook Link klickst und der Facebook Gruppe beitrittst.",
              "Finde deine Stadt auf dieser Liste und klick sie an. Du wirst auf die Facebook Gruppe des Campsites deiner Stadt geleitet. Klick den \"Gruppe beitreten\" Button um eine Beitrittsanfrage zu stellen. Jemand aus der Gruppe sollte dich in kürzester Zeit annehmen. Falls deine Stadt nicht auf der Liste ist, scrolle zum Ende des Wiki Artikels für eine Anleitung wie du ein Campsite für deine Stadt erstellst.",
              "http://forum.freecodecamp.com/t/free-code-camp-city-based-local-groups/19574"
            ]
          ]
        },
        "es": {
          "title": "Únete a un Campamento en Tu Ciudad",
          "description": [
            [
              "//i.imgur.com/NAOFJWN.jpg",
              "Una imagen de algunos de nuestros campistas compartiendo en un café local. 3 hombres y 3 mujeres están sentados alrededor de una mesa con portátiles afuera, y están sonriendo y programando.",
              "Nuestros Campamentos te ayudan a programar con otros campistas en tu ciudad. Puedes coordinar grupos de estudio o atender eventos de programación locales juntos.",
              ""
            ],
            [
              "//i.imgur.com/iBctF6s.gif",
              "Un gif mostrándote como puedes pulsar en el enlace inferior, encontrar tu ciudad en la lista de Campamentos, entonces haz clic en el enlace de Facebook para tu ciudad y unirte al grupo de Facebook de tu ciudad.",
              "Encuentra tu ciudad en esta lista y haz clic en esta. Esto te llevara al grupo de Facebook del Campamento de tu ciudad. Da clic en el botón de \"Unirse al grupo\" para unirte a el grupo. Alguien del mismo campamento debería aprobarte en breve. Si tu ciudad no esta en esta lista, ve al final del articulo de la wiki para ver instrucciones de como crear un campamento para tu ciudad.",
              "http://forum.freecodecamp.com/t/free-code-camp-city-based-local-groups/19574"
            ]
          ]
        },
        "it": {
          "title": "Unisciti ad un gruppo Free Code Camp nella tua città",
          "description": [
            [
              "//i.imgur.com/XugIMb4.jpg",
              "Una foto di alcuni dei nostri camper riuniti in un bar locale.",
              "È possibile programmare insieme ad altri campers nella tua città aderendo ad un gruppo Free Code Camp vicino a te.",
              ""
            ],
            [
              "//i.imgur.com/iBctF6s.gif",
              "Una gif che mostra come è possibile fare clic sul link qui sotto, e trovare la tua città nella lista dei gruppi locali.",
              "Trova la tua città in questa lista e cliccala. Verrai indirizzato alla sua pagina Facebook. Fai clic sul pulsante \" Entra nel gruppo \". Qualcuno del gruppo dovrebbe approvare a breve la tua richiesta. Se la tua città non è in questo elenco, scorri alla parte superiore di questo articolo wiki per le istruzioni su come iniziare un gruppo nella tua città. ",
              "http://forum.freecodecamp.com/t/free-code-camp-city-based-local-groups/19574"
            ]
          ]
        },
        "pt-br": {
          "title": "Junte-se a um grupo do Free Code Camp em sua cidade",
          "description": [
            [
              "//i.imgur.com/XugIMb4.jpg",
              "Uma imagem de alguns de nossos campistas reunidos em uma cafeteria local.",
              "Você pode programar em conjunto com outros campistas em sua cidade ao se juntar em um grupo local do Free Code Camp.",
              ""
            ],
            [
              "//i.imgur.com/fTFMjwf.gif",
              "Um gif mostrando como você pode clicar no link abaixo e encontrar a sua cidade na lista de grupos locais.",
              "Encontre sua cidade na lista e clique nela. Isto irá levá-lo à sua respectiva página do Facebook. Clique no botão \"Entrar no grupo\". Alguém do grupo irá aprová-lo em breve. Se a sua cidade não está nesta lista, percorra ao topo do artigo wiki para obter instruções sobre como você pode começar um grupo em sua cidade.",
              "http://forum.freecodecamp.com/t/free-code-camp-city-based-local-groups/19574"
            ]
          ]
        },
        "ru": {
          "title": "Присоединяйтесь к группе Free Code Camp в вашем городе",
          "description": [
            [
              "//i.imgur.com/XugIMb4.jpg",
              "Изображение встречи нескольких участников проекта в кафе.",
              "Наши лагери - это группы в Facebook, которые помогают вам встречаться с другими участниками проекта в вашем городе. Вы можете использовать эти группы для планирования и посещения нерегулярных событий \"кофе-и-код\", на которых вы встречаетесь с другими участниками проекта в кафе и программируете вместе.",
              ""
            ],
            [
              "//i.imgur.com/iBctF6s.gif",
              "Анимация, показывающая нажатие на ссылку, расположенную ниже, нахождение вашего города в списке лагерей, последующее нажатие на ссылку для перехода в Facebook и вступление в группу вашего города.",
              "Найдите ваш город в списке и нажмите на его название. Так вы попадёте в группу вашего города в Facebook. Нажмите кнопку \"Вступить в группу\" для подачи заявки на вступление в группу. Кто-нибудь из участников, являющийся членом этой группы, подтвердит вашу заявку в скором времени. Если вашего города нет в списке, переместитесь в нижнюю часть wiki-статьи для получения инструкций о том, как вы можете создать группу для вашего города.",
              "https://github.com/FreeCodeCamp/freecodecamp/wiki/List-of-Free-Code-Camp-city-based-Campsites"
            ]
          ]
        }
      }
    },
    {
      "id": "560adf65cb82ac38a17513c2",
      "title": "Read Coding News on our Medium Publication",
      "description": [
        [
          "//i.imgur.com/AZNLvEC.gif",
          "A gif showing how you can click the \"follow\" button to follow Free Code Camp's publication.",
          "Our community has a popular Medium publication where we publish tons of helpful articles about coding and technology. Once you open the link, click the \"follow\" button in the upper right hand corner. If you don't have a Medium account, you can create one in seconds.",
          "https://medium.freecodecamp.com"
        ]
      ],
      "releasedOn": "February 10, 2016",
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "translations": {
        "de": {
          "title": "Lese Programmier-Nachrichten auf unserer Medium Seite",
          "description": [
            [
              "//i.imgur.com/AZNLvEC.gif",
              "Ein GIF, das dir zeigt, wie du einen Medium Account anlegen kannst.",
              "Unsere Community hat eine Medium Seite, auf der wir viele Artikel über Software Entwicklung veröffentlichen. Kannst du auf die Medium Seite von Free Code Camp gehen und den \"follow\" Button klicken. Unsere Camper veröffentlichen jede Woche mehrere Artikel. Wenn du noch keinen Medium Account hast, kannst du dem Link folgen und dich entweder mit einem Account aus einem Social Network oder einer E-Mail Adresse (sie senden dir eine E-Mail, die du durchklicken kannst, um dir einen Account anzulegen.). Wenn du ein Thema ausgewählt hast, das dich interessiert, kannst du den weiteren Schritten folgen.",
              "https://www.medium.com"
            ]
          ]
        },
        "es": {
          "title": "Lee noticias de codificación en nuestros canal de publicaciones Medium",
          "description": [
            [
              "//i.imgur.com/AZNLvEC.gif",
              "Un gif mostrando cómo crear una cuenta en Medium.",
              "Nuestra comunidad tiene un canal de publicaciones Medium, donde escribimos un montón de artículos sobre desarrollo de software. Ir al canal de publicaciones de Free Code Camp Medium y pulsar \"follow\". Nuestros campistas publican varios artículos cada semana. Si aún no dispones de una cuenta Medium, puedes seguir el enlace y registrarte usando una red social o ingresando un correo electrónico (enviarán un correo electrónico que debes abrirlo para crear tu cuenta.)",
              "https://www.medium.com"
            ]
          ]
        },
        "fr": {
          "title": "Lisez les nouvelles de la programmation sur notre Publication Medium",
          "description": [
            [
              "//i.imgur.com/AZNLvEC.gif",
              "Une gif montrant comment tu peux créer un compte sur Medium.",
              "Notre communauté a une publication sur Medium où on écrit plusieurs articles sur la programmation. Tu peux visiter la publication de Free Code Camp sur Medium et cliquer sur \"follow\". Nos campers publient plusieurs articles chaque semaine. Si tu n’as pas encore un compte Medium, utilise le lien ci-dessous  pour s’inscrire en utilisant un compte sur les médias sociaux ou en utilisant ton email (un email de confirmation sera envoyé à votre email pour terminer l’inscription). Une fois un sujet qui t’intéresse est choisi, tu peux continuer les étapes.",
              "https://www.medium.com"
            ]
          ]
        },
        "it": {
          "title": "Leggi notizie sul mondo della programmazione nelle nostre pubblicazioni su Medium",
          "description": [
            [
              "//i.imgur.com/AZNLvEC.gif",
              "Una gif che mostra come puoi cliccare sul tasto \"follow\" per seguire le pubblicazioni di Free Code Camp.",
              "La nostra comunità ha uno spazio su Medium dove pubblica numerosi articoli pratici che parlano di programmazione e di tecnologia. Una volta aperto il link, clicca sul tasto \"follow\" in alto a destra. Se non hai un account di Medium, puoi crearne uno in pochi secondi.",
              "https://medium.freecodecamp.com"
            ]
          ]
        },
        "pt-br": {
          "title": "Leia notícias sobre programação em nossas publicações nas plataforma Medium",
          "description": [
            [
              "//i.imgur.com/AZNLvEC.gif",
              "Um gif mostrando como você pode clicar no botão \"seguir\" para acompanhar publicações do Free Code Camp.",
              "Nossa comunidade possui um espaço na plataforma Medium onde publicamos toneladas de artigos úteis sobre programação e tecnologia. Uma vez que você abrir o link, clique no botão \"seguir\" no canto superior direito. Se você não tiver uma conta no Medium, você pode criar uma em segundos.",
              "https://medium.freecodecamp.com"
            ]
          ]
        },
        "ru": {
          "title": "Читайте наши публикации в Medium о новостях программирования",
          "description": [
            [
              "//i.imgur.com/AZNLvEC.gif",
              "Анимация, показывающая нажатие кнопки \"follow\", чтобы подписаться на публикации Free Code Camp.",
              "Наше сообщество публикует огромное количество полезных статей по программированию и технологиям на популярной платформе Medium. Когда перейдёте по ссылке, нажмите кнопку \"follow\" в правом верхнем углу экрана. Если у вас нет учётной записи Medium, вы можете создать её за несколько секунд.",
              "https://medium.freecodecamp.com"
            ]
          ]
        }
      }
    },
    {
      "id": "560add8ccb82ac38a17513c4",
      "title": "Learn What to Do If You Get Stuck",
      "description": [
        [
          "//i.imgur.com/3aiJZA3.jpg",
          "The text \"Coding is hard.\"",
          "Coding is hard. You will get stuck. Even experienced coders get stuck. The key is knowing how to get unstuck.",
          ""
        ],
        [
          "//i.imgur.com/oBX0jzR.jpg",
          "The text \"It takes time to get good at coding.\"",
          "It takes time to get good at coding. You wouldn't expect to beat a chess master after playing for 3 months. Don't expect to build the next Facebook after coding for 3 months.",
          ""
        ],
        [
          "//i.imgur.com/EoTfOyC.jpg",
          "An image of some of our campers coding together in Montreal.",
          "Keep practicing coding every day and hanging out with other people who code, and you will become a job-ready coder.",
          ""
        ],
        [
          "//i.imgur.com/wK0mcVh.jpg",
          "An image with the text \"1. Read the error 2. Search Google 3. Ask for help.",
          "Any time you get stuck or don't know what to do next: Read-Search-Ask.",
          ""
        ],
        [
          "//i.imgur.com/99BfAcK.jpg",
          "An image showing jQuery documentation",
          "First, read the documentation or error message. A key skill that good coders have is the ability to interpret and then follow instructions.",
          ""
        ],
        [
          "//i.imgur.com/GxvrsFb.gif",
          "A gif showing you how to do an advanced Google search. First, we enter the query \"jquery doesn't run when my page loads\". Then we click search tools button and change the \"Any time\" select box to \"within the last year\". Then we click on a result and read through the article and find our answer.",
          "If that didn't help, search Google. Good Google queries take a lot of practice. When you search Google, you usually want to include the language or framework you're using. You also want to limit the results to a recent period.",
          ""
        ],
        [
          "//i.imgur.com/xipwagp.gif",
          "A gif showing us following the link below to go to the help chat room and ask \"jquery doesn't run when my page loads\".",
          "If that didn't help, ask your friends. If you have trouble, you can ask your fellow campers in our help chat room.",
          "https://gitter.im/FreeCodeCamp/Help"
        ],
        [
          "//i.imgur.com/Hh8RpYX.gif",
          "A gif showing us scrolling through our challenge map.",
          "Now you're ready to start coding. The \"Map\" button in your upper right hand corner will show you our challenge map. We recommend that you complete these from top to bottom, at a sustainable pace. Our open source community is constantly improving our challenges, so don't be surprised if they change or move around. Don't worry about going back - just keep moving forward.",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "translations": {
        "de": {
          "title": "Lerne was du tun kannst falls du nicht weiterkommst",
          "description": [
            [
              "//i.imgur.com/3aiJZA3.jpg",
              "Der Text \"Coding is hard.\"",
              "Programmieren ist hart. Du wirst zeitweise nicht weiterkommen. Sogar erfahrene Programmierer bleiben manchmal hängen. Der Schlüssel zum Erfolg ist zu wissen wie man in so einer Situation weitermacht",
              ""
            ],
            [
              "//i.imgur.com/oBX0jzR.jpg",
              "Der Text \"It takes time to get good at coding.\"",
              "Es dauert seine Zeit bis man gut programmieren kann. Du erwartest auch nicht einen Schachmeister nach 3 Monaten Übung zu schlagen. Erwarte also auch nicht das nächste Facebook nach 3 Monaten zu programmieren",
              ""
            ],
            [
              "//i.imgur.com/EoTfOyC.jpg",
              "Ein Foto von einigen Campern die gemeinsam in Montreal programmieren.",
              "Übe programmieren jeden Tag und triff dich mit anderen Leuten die programmieren, dann wirst du bereit für einen Programmierjob.",
              ""
            ],
            [
              "//i.imgur.com/wK0mcVh.jpg",
              "Ein Bild mit dem Text \"1. Read the error 2. Search Google 3. Ask for help.",
              "Wann immer du nicht weiterkommst oder nicht weißt was du als nächstes tun sollst: Lesen-Suchen-Fragen",
              ""
            ],
            [
              "//i.imgur.com/99BfAcK.jpg",
              "Ein Bild von der jQuery Dokumentation",
              "Ließ zuerst die Dokumentation oder Fehlermeldung. Eine Schlüsselfähigkeit von guten Programmierern ist die ist die Fähigkeit zu interpretieren und dann Anweisungen zu folgen",
              ""
            ],
            [
              "//i.imgur.com/GxvrsFb.gif",
              "Ein GIF das eine erweiterte Google Suche zeigt. Zuerst wird die Suchanfrage \"jquery doesn't run when my page loads\" eingegeben. Dann wird in den Suchoptionen die Auswahl \"Beliebige Zeit\" zu \"Letztes Jahr\" geändert. Dann wird auf ein Ergebnis geklickt, der Artikel gelesen und die Antwort gefunden",
              "Wenn das nicht geholfen hat, durchsuche Google. Gute Google Abfragen brauchen einiges an Übung. Wenn du Google durchsuchst, wirst du normalerweise die Programmiersprache oder das Framework, das du verwendest, inkludieren. Außerdem solltest du die Ergebnisse auf einen aktuellen Zeitraum limitieren.",
              ""
            ],
            [
              "//i.imgur.com/xipwagp.gif",
              "Ein GIF das zeigt wie der untenstehende Link aufgerufen wird um in den \"Help Chat\" zu kommen um dort zu fragen: \"jquery doesn't run when my page loads\".",
              "Falls das nicht geholfen hat, frag deine Freunde. Wenn du Probleme hast kannst du die anderen Camper in unserem Hilfe Chat fragen.",
              "https://gitter.im/FreeCodeCamp/Help"
            ],
            [
              "//i.imgur.com/Hh8RpYX.gif",
              "Ein GIF das zeigt wie durch die Challenge Übersicht gescrollt wird",
              "Jetzt bist du bereit mit Programmieren zu starten. Der \"Map\" Button in der rechten oberen Ecke zeigt dir deine Challenge Übersicht. Wir empfehlen dir diese von Oben nach Unten in einer angemessenen Geschwindikeit durchzuführen. Unsere Open-Source Gemeinschaft ist permanent am Verbessern der Challenges, wundere dich also nicht falls diese sich ändern oder verschieben. Hab keine Angst davor zurück zu gehen - schau nur dass du vorankommst. Du kommst immer zu deiner aktuellsten Aufgabe indem du den \"Learn\" Button drückst.",
              ""
            ]
          ]
        },
        "es": {
          "title": "Aprende que hacer si te quedas atascado",
          "description": [
            [
              "//i.imgur.com/3aiJZA3.jpg",
              "El texto \"Programar es difícil.\"",
              "Programar es difícil. Quedarás atascado. Incluso programadores experimentados quedan atascados. La clave es saber como desatascarse.",
              ""
            ],
            [
              "//i.imgur.com/oBX0jzR.jpg",
              "El texto \"Volverse bueno programando requiere tiempo.\"",
              "Volverse bueno programando requiere tiempo. No esperarías derrotar a un maestro del ajedrez después de jugar por 3 meses. No esperes crear el próximo Facebook después de programar 3 meses.",
              ""
            ],
            [
              "//i.imgur.com/EoTfOyC.jpg",
              "Una imagen de algunos de nuestros campistas programando juntos en Montreal.",
              "Sigue practicando programación cada día y sal con otras personas que programen, y te volverás un programador listo para un trabajo.",
              ""
            ],
            [
              "//i.imgur.com/wK0mcVh.jpg",
              "Una imagen con el texto \"1. Lee el error 2. Busca en Google 3. Pide ayuda.",
              "En cualquier momento en el que te quedes atascado o no sepas que hacer a continuación: Lee-Busca-Pregunta.",
              ""
            ],
            [
              "//i.imgur.com/99BfAcK.jpg",
              "Una imagen mostrando la documentación de jQuery",
              "Primero, lee la documentación o el mensaje de error. Una habilidad clave que los buenos programadores poseen es el poder interpretar y seguir instrucciones.",
              ""
            ],
            [
              "//i.imgur.com/GxvrsFb.gif",
              "Un gif mostrándote como hacer una búsqueda avanzada en Google. Primero, escribimos la consulta \"jquery no corre cuando mi página carga\". Entonces damos clic en el botón de herramientas y cambiamos la selección de \"En cualquier momento\" a \"en el último año\". Entonces hacemos clic en un resultado o leemos a través del artículo y encontramos nuestra respuesta.",
              "Si eso no ayudo, busca en Google. Realizar buenas búsquedas en Google requiere mucha práctica. Cuando buscas en Google, usualmente querrás incluir el lenguaje o entorno (framework) que estás usando. También querrás limitar los resultados a un período reciente.",
              ""
            ],
            [
              "//i.imgur.com/xipwagp.gif",
              "Un gif mostrándonos como seguir el enlace inferior para ir a nuestra sala de chat de ayuda y preguntar \"jquery no corre cuando mi página carga\".",
              "Si eso no te ayudó, pregúntale a tus amigos. Si tienes problemas, puedes preguntar a tus compañeros campistas en nuestra sala de chat.",
              "https://gitter.im/FreeCodeCamp/Help"
            ],
            [
              "//i.imgur.com/Hh8RpYX.gif",
              "Un gif mostrándonos nuestro mapa de desafíos.",
              "Ahora estas listo para empezar a programar. El botón de  \"Mapa\" en tu esquina superior derecha te mostrará nuestro mapa de desafíos. Te recomendaos que completes los desafíos de arriba hacía abajo, a un ritmo sostenible. Nuestra comunidad de código abierto esta constantemente mejorando nuestros desafíos, así que no te sorprendas si cambian o se mueven alrededor. No te preocupes por volver hacia atrás - solo continúa avanzando. Siempre puedes ir a tu desafío más reciente pulsando el botón de \"Aprender\".",
              ""
            ]
          ]
        },
        "fr": {
          "title": "Apprenez quoi faire quand vous êtes bloqué ?",
          "description": [
            [
              "//i.imgur.com/3aiJZA3.jpg",
              "Le texte \"Coder est difficile.\"",
              "Coder est difficile. Vous serez bloqué un jour ou l'autre. Même les développeurs expérimentés peuvent être bloqués. La solution est de savoir comment se débloquer.",
              ""
            ],
            [
              "//i.imgur.com/oBX0jzR.jpg",
              "Le texte \"Etre un bon développeur prend du temps.\"",
              "Etre un bon développeur prend du temps. Vous ne pouvez pas vous attendre à battre un maitre des echecs aprés 3 mois d'apprentissage. Ne vous attendez pas de construire le prochain Facebook aprés 3 mois de coding.",
              ""
            ],
            [
              "//i.imgur.com/EoTfOyC.jpg",
              "Une image de quelques uns de nos développeurs codant ensemble à Montreal.",
              "Continuez de développer tous les jours et fréquentez d'autres développeurs et vous deviendrez un développeur prêt à l'emploi.",
              ""
            ],
            [
              "//i.imgur.com/wK0mcVh.jpg",
              "Une image avec le texte \"1. Lisez l'erreur 2. Cherchez sur Google 3. Demandez de l'aide.",
              "Chaque fois que vous êtes bloqué ou que vous ne savez pas quoi faire : Lisez-Cherchez-Demandez.",
              ""
            ],
            [
              "//i.imgur.com/99BfAcK.jpg",
              "Une image montrant la document jQuery",
              "Lisez d'abord la documentation ou les messages d'erreurs. Le principal atout que les bon développeurs ont est la capacité d'interpréter et ensuite de suivre les instructions.",
              ""
            ],
            [
              "//i.imgur.com/GxvrsFb.gif",
              "Une image vous montrant comment fiare des recherches avancées sur Google. On commence par rentrer la requète \"jquery ne fonctionne pas lors du chargement de ma page\". Puis nous cliquons sur la barre de recherche et changeons la case à cocher \"Any time\" cochons la case \"au cours de l'année précédente\". Puis nous cliquons sur le résultat et lisons l'article et trouvons notre réponse.",
              "Si cela ne vous aide pas, recherchez sur Google. De bonnes recherches sur Google demande pas mal de pratique. Quand vous recherchez sur Google, vous devez inclure le langage ou le framework que vous utilisez. Vous voulez aussi limiter vos résultats a une période récente.",
              ""
            ],
            [
              "//i.imgur.com/xipwagp.gif",
              "Une image vous montrant le lien ci-dessous pour rejoindre le char et demander \"jquery ne fonctionne pas lors du chargement de ma page\".",
              "Si cela ne vous aide pas, demande à vos amis. Si vous avez des difficultés, vous pouvez demander aux autres développeurs sur le chat.",
              "https://gitter.im/FreeCodeCamp/Help"
            ],
            [
              "//i.imgur.com/Hh8RpYX.gif",
              "Une image vous montrant le cursus de notre carte des défis.",
              "Maintenant vous être prêt pour commencer à coder. Le boutton \"Map\" situé en haut à droite de votre écran vous montrera notre carte des défis. Nous vous recommandons de les completer du début jusqu'à la fin, régulièrement. Notre communauté open source continue de d'améliorer nos défis, ne soyez donc pas surpris si ils changent ou évoluent. Ce n'est pas la peine de revenir en arrière, continuez à progresser. Vous pouvez toujours accéder à nos derniers défis juste en cliquant sur le boutton \"Learn\".",
              ""
            ]
          ]
        },
        "it": {
          "title": "Impara Cosa fare se ti trovi in ​​difficoltà",
          "description": [
            [
              "//i.imgur.com/3aiJZA3.jpg",
              "Il testo \" Programmare è difficile. \"",
              "Programmare è difficile. Prima o poi rimarrai bloccato. Succede anche ai programmatori esperti. La chiave è sapere come uscirne.",
              ""
            ],
            [
              "//i.imgur.com/oBX0jzR.jpg",
              "Il testo \" Ci vuole tempo per diventare bravi sviluppatori. \"",
              "Ci vuole tempo per diventare bravi sviluppatori. Non ti aspetteresti di battere un campione di scacchi dopo aver giocato per 3 mesi. Non aspettarti di realizzare il prossimo Facebook dopo aver programmato per 3 mesi.",
              ""
            ],
            [
              "//i.imgur.com/EoTfOyC.jpg",
              "Un'immagine di alcuni dei nostri campers che programmano insieme a Montreal.",
              "Continua ad esercitarti a programmare tutti i giorni e discuti con altre persone che programmano, e potrai diventare uno sviluppatore pronto per il lavoro.",
              ""
            ],
            [
              "//i.imgur.com/wK0mcVh.jpg",
              "Un'immagine con il testo \" 1. Leggi l'errore 2. Cerca su Google 3. Chiedi aiuto. ",
              "Ogni volta che ti trovi in ​​difficoltà o non sai cosa fare. Leggi-Cerca-Chiedi",
              ""
            ],
            [
              "//i.imgur.com/99BfAcK.jpg",
              "Un'immagine che mostra la documentazione di jQuery",
              "Innanzitutto, leggi la documentazione o il messaggio di errore. Una competenza chiave che i buoni programmatori hanno è la capacità di interpretare e seguire le istruzioni.",
              ""
            ],
            [
              "//i.imgur.com/GxvrsFb.gif",
              "Una gif che mostra come fare una ricerca avanzata su Google. Prima di tutto, si inserisce la query \"jquery non viene eseguito quando la mia pagina si carica\". Poi si clicca sul pulsante strumenti di ricerca e si cambia l'opzione \"Qualsiasi data\" selezionando a \"Ultimo Anno\". Poi si clicca su un risultato, si legge l'articolo e troviamo la nostra risposta.",
              "Se ciò non è stato d'aiuto, cerca su Google. Ci vuole un sacco di pratica per formulare delle buone query. Quando si esegue una ricerca su Google, di solito si preferisce includere il linguaggio o il framework che si sta utilizzando. Inoltre è meglio limitare i risultati ad un periodo recente.",
              ""
            ],
            [
              "//i.imgur.com/xipwagp.gif",
              "Una gif che mostra come seguire il link qui sotto per andare alla chat room di supporto e chiedere \"jquery non viene eseguito quando la mia pagina si carica\".",
              "Se anche questo non ha aiutato, chiedi ai tuoi amici. In caso di problemi, puoi chiedere ai tuoi amici campers nelle nostre chat rooms di supporto.",
              "https://gitter.im/FreeCodeCamp/Help"
            ],
            [
              "//i.imgur.com/Hh8RpYX.gif",
              "Una gif che mostra come scorrere la nostra mappa di problemi.",
              "Ora sei pronto per iniziare a scrivere codice. Il tasto \"Mappa\" in alto a destra ti mostrerà la nostra mappa dei problemi. Ti consigliamo di completarli dall'alto verso il basso, ad un ritmo sostenibile. La nostra comunità open source sta migliorando costantemente i nostri problemi, quindi non stupirti se cambiano o se vengono spostati. Non preoccuparti di tornare indietro - continua ad andare avanti.",
              ""
            ]
          ]
        },
        "pt-br": {
          "title": "Aprenda o que fazer se você não conseguir avançar",
          "description": [
            [
              "//i.imgur.com/lzKvwU2.jpg",
              "A frase \"Programar é difícil.\"",
              "Programar é difícil. Você não vai conseguir sair do lugar. Até mesmo desenvolvedores experientes ficam presos. A chave é saber como conseguir sair do lugar.",
              ""
            ],
            [
              "//i.imgur.com/sfsidp6.jpg",
              "A frase \"Leva tempo para saber como ficar bom em programação\"",
              "Leva-se tempo para ficar bom em programação. Você não esperaria vencer um mestre de xadrez depois de jogar por apenas 3 meses. Não espere conseguir construir o próximo Facebook após programar por apenas 3 meses.",
              ""
            ],
            [
              "//i.imgur.com/EoTfOyC.jpg",
              "Uma imagem de alguns dos nossos campistas programando juntos em Montreal.",
              "Continue a praticar programação todos os dias, socialize com outras pessoas que programam e você se tornará um desenvolvedor pronto para o mercado de trabalho.",
              ""
            ],
            [
              "//i.imgur.com/EWWZBag.jpg",
              "Uma imagem com o texto \"1. Leia o erro 2. Pesquisa no Google 3. Peça ajuda.\"",
              "Toda vez que você ficar preso ou não saber o que fazer a seguir: Leia-Pesquise-Pergunte",
              ""
            ],
            [
              "//i.imgur.com/99BfAcK.jpg",
              "Uma imagem mostrando documentação jQuery",
              "Primeiro, leia a documentação ou mensagem de erro. A habilidade fundamental que os bons programadores têm é a capacidade de interpretar e, em seguida, seguir as instruções.",
              ""
            ],
            [
              "//i.imgur.com/GxvrsFb.gif",
              "Um gif mostrando-nos como fazer uma pesquisa avançada no Google. Primeiro, inserimos a consulta \"jquery não executa quando a minha página carrega\". Em seguida, clique no botão ferramentas de pesquisa e altere a caixa de seleção de \"Qualquer momento\" para \"Ano passado\". Em seguida, clique em um resultado, leia o artigo e encontre a nossa resposta.",
              "Se isso não ajudar, pesquise no Google. Boas consultas no Google levam bastante tempo de prática. Quando você pesquisa no Google, você geralmente deseja incluir a linguagem de programação ou framework que você está usando. Você também quer limitar os resultados para um período recente.",
              ""
            ],
            [
              "//i.imgur.com/LZYU7p2.gif",
              "Um gif mostrando-nos usando link abaixo para ir a sala de bate-papo de ajuda e perguntas \"jquery não executa quando a minha página carrega\".",
              "Se isso não ajudar, pergunte a seus amigos. Se você tiver problemas, você pode perguntar a seus companheiros campistas na nossa sala de bate-papo para ajuda.",
              "https://gitter.im/FreeCodeCamp/Help"
            ],
            [
              "//i.imgur.com/ZRgXraT.gif",
              "Um gif mostrando a navegação no nosso mapa de desafios.",
              "Agora você está pronto para começar a programar. O botão \"Mapa\" no canto superior direito irá mostrar-lhe o nosso mapa de desafios. Recomendamos que você complete estes desafios de cima para baixo, em um ritmo adequado. Nossa comunidade open source está constantemente melhorando os nossos desafios por isso não se surpreenda se os desafios mudarem. Não se preocupe em voltar - apenas continue seguindo em frente.",
              ""
            ]
          ]
        },
        "ru": {
          "title": "Узнайте, что делать если вы застряли",
          "description": [
            [
              "//i.imgur.com/3aiJZA3.jpg",
              "Текст \"Программировать сложно.\"",
              "Программировать сложно. Вы будете застревать. Даже опытные программисты застревают. Главное знать как выйти из этого положения.",
              ""
            ],
            [
              "//i.imgur.com/oBX0jzR.jpg",
              "Текст \"Требуется время, чтобы стать хорошим программистом.\"",
              "Требуется время, чтобы стать хорошим программистом. Вы же не будете ожидать победить мастера по шахматам после игры в шахматы в течение трёх месяцев. Не ожидайте, что построите следующий Facebook через три месяца занятий программированием.",
              ""
            ],
            [
              "//i.imgur.com/EoTfOyC.jpg",
              "Изображение нескольких участников проекта, программирующих вместе в Монтреале.",
              "Практикуйте ежедневное программирование и общение с другими людьми, занимающимися программированием, и вы станете подготовленным к работе программистом.",
              ""
            ],
            [
              "//i.imgur.com/wK0mcVh.jpg",
              "Изображение с текстом \"1. Читай ошибку 2. Ищи с помощью Google 3. Проси помощи.",
              "В любой момент, если вы застряли или не знаете, что делать дальше: Читайте-Ищите-Спрашивайте.",
              ""
            ],
            [
              "//i.imgur.com/99BfAcK.jpg",
              "Изображение документации jQuery",
              "Во-первых, читайте документацию или сообщение об ошибке. Ключевой навык, которым обладают хорошие программисты - способность истолковать и следовать инструкциям впоследствии.",
              ""
            ],
            [
              "//i.imgur.com/GxvrsFb.gif",
              "Анимация, показывающая как осуществлять продвинутый поиск Google. Во-первых, мы вводим запрос \"jquery не запускается при загрузке страницы\". Затем мы нажимаем кнопку вызова меню поисковых инструментов и меняем значение периода с \"За всё время\" на \"За год\". Затем мы нажимаем на результат и просматриваем статью на предмет наличия решения.",
              "Если это не помогло, поищите с помощью Google. Способность писать хорошие Google-запросы - результат продолжительной практики. Когда вы ищите с помощью Google, обычно вам стоит указывать применяемый язык или используемую библиотеку. Также, вам стоит ограничивать результаты поиска недавним периодом.",
              ""
            ],
            [
              "//i.imgur.com/xipwagp.gif",
              "Анимация, показывающая переход по ссылке ниже в чат для помощи и задание вопроса \"jquery не запускается при загрузке страницы\".",
              "Если это не помогло, спросите ваших друзей. Если вы не можете решить проблему, вы можете обратиться к вашим приятелям, участникам проекта, в нашем чате для помощи.",
              "https://gitter.im/FreeCodeCamp/Help"
            ],
            [
              "//i.imgur.com/Hh8RpYX.gif",
              "Анимация, показывающая прокрутку нашей карты заданий.",
              "Теперь вы готовы начать программировать. Нажатие на кнопку \"Карта\" в правом верхнем углу вашего экрана отобразит вам нашу карту заданий. Мы рекоммендуем выполнять задания сверху-вниз в равномерном темпе. Наше открытое сообщество постоянно улучшает наши задания, так что не удивляйтесь, если они будут меняться или перемещаться. Не переживайте о том, чтобы сдвинуться назад - просто продолжайте двигаться вперёд. Вы всегда можете перейти к вашему недавнему заданию путём нажатия на кнопку \"Учиться\".",
              ""
            ]
          ]
        }
      }
    }
  ]
}
