{
  "responsive-web-design": {
    "title": "Застарілий адаптивний вебдизайн",
    "intro": [
      "В сертифікації «Адаптивний вебдизайн» ви вивчите мови, які розробники використовують для створення вебсторінок: HTML (мова розмітки гіпертексту) для вмісту та CSS (каскадні таблиці стилів) для дизайну.",
      "Спочатку ви створите застосунок із фотографіями котів, аби вивчити основи HTML та CSS. Пізніше ви опануєте сучасні методи, такі як змінні CSS, завдяки створенню пінгвіна, а також створите вебформу, щоб опанувати практики покращення доступності.",
      "Ви також дізнаєтеся, як конструювати вебсайти, які відповідають різним розмірам екранів, створивши Twitter Card за допомогою Flexbox, а ще складний макет блогу з CSS Grid."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та темні режими) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють вміст або макет сторінок під час виконання курсу.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "Основи HTML та HTML5",
        "intro": [
          "HTML – це мова розмітки, яка використовує спеціальний синтаксис або примітки для опису структури вебсторінки чи браузера. Елементи HTML зазвичай мають початковий та кінцевий теґи, які оточують вміст та надають йому значення. Наприклад, різні елементи можуть описати текст як заголовок, абзац або елемент списку.",
          "У цьому курсі ви створите застосунок із фотографіями котів, щоб опанувати застосування деяких з найпоширеніших елементів HTML (головних блоків будь-якої вебсторінки)."
        ]
      },
      "basic-css": {
        "title": "Основи CSS",
        "intro": [
          "CSS, або каскадні таблиці стилів, повідомляють браузеру як показати текст та інший вміст, який ви написали в HTML. За допомогою CSS ви можете регулювати колір, шрифт, розмір, відстань і багато інших аспектів елементів HTML.",
          "І зараз, коли ви описали структуру свого застосунку, стилізуйте його за допомогою CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Прикладний візуальний дизайн",
        "intro": [
          "Візуальний дизайн – це поєднання типографії, кольорознавства, графіки, анімації, макетів сторінок і багато чого іншого, аби допомогти вам передати своє унікальне повідомлення.",
          "У цьому курсі ви навчитеся застосовувати усі ці елементи візуального дизайну для своїх вебсайтів."
        ]
      },
      "applied-accessibility": {
        "title": "Прикладна доступність",
        "intro": [
          "У процесі веброзробки спеціальні можливості посилаються на вміст сайту та інтерфейс користувача, який широка аудиторія зможе розпізнати, з яким зможе взаємодіяти та за допомогою якого зможе зорієнтуватися на сайті. У цю аудиторію також входять люди із зоровими, слуховими, руховими та когнітивними розладами.",
          "У цьому курсі ви дізнаєтеся найкращі практики для створення вебсайтів, які доступні кожному."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Принципи адаптивного вебдизайну",
        "intro": [
          "Підключитися до мережі можна з багатьох пристроїв різних форм і розмірів. Адаптивний вебдизайн – це проєктування гнучких вебсайтів, які пристосовуються до різних розмірів, орієнтацій та розширення екранів.",
          "У цьому курсі ви дізнаєтеся як використовувати CSS, аби ваші вебсайти мали гарний вигляд, незалежно від того, на якому пристрої вони відтворені."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox – це потужний режим розмітки, який підтримується практично на всіх пристроях і який було введено з останньою версією CSS, CSS3. За допомогою flexbox набагато легше відцентровувати елементи сторінки та створювати функціональні інтерфейси користувачів, які автоматично зменшуються та розширяються.",
          "У цьому курсі ви дізнаєтеся про складові flexbox та функціональної розмітки, коли створюватимете Twitter card."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "CSS grid – це новіший режим розмітки, за допомогою якого можна легко створювати складну адаптивну композицію. Він перетворює елемент HTML у сітку і допомагає розмістити дочірні елементи будь-де на екрані.",
          "У цьому курсі ви вивчите основи CSS Grid, створюючи різні складні композиції, в тому числі макет блогу."
        ]
      },
      "responsive-web-design-projects": {
        "title": "Проєкти «Адаптивний вебдизайн»",
        "intro": [
          "Настав час скористатися отриманими навичками на практиці. Під час роботи над проєктами ви зможете застосувати всі навички, правила і поняття, які ви нещодавно вивчили, такі як: HTML, CSS, візуальний дизайн, доступність та інше.",
          "Завершіть п'ять проєктів з вебпрограмування, що розташовані нижче, аби отримати сертифікацію «Адаптивний вебдизайн»."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "(Новий) адаптивний вебдизайн",
    "intro": [
      "В сертифікації «Адаптивний вебдизайн» ви вивчите мови, які розробники використовують для створення вебсторінок: HTML (мова розмітки гіпертексту) для вмісту та CSS (каскадні таблиці стилів) для дизайну.",
      "Спочатку ви створите застосунок із фотографіями котів, аби вивчити основи HTML та CSS. Пізніше ви опануєте сучасні методи, такі як змінні CSS, завдяки створенню пінгвіна, а також створите вікторину, щоб опанувати доступність.",
      "Наостанок ви дізнаєтеся, як створити вебсторінки, які реагують на зміну розміру екрану, створивши фотогалерею за допомогою Flexbox і макет журналу з CSS Grid."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та темні режими) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють вміст або макет сторінок під час виконання курсу.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Пам'ятна сторінка",
        "intro": [
          "Це один з обов'язкових до виконання проєктів для отримання сертифікації.",
          "В цьому проєкті ви створите пам'ятку сторінку на тему за власним вибором."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Вебсторінка персонального портфоліо",
        "intro": [
          "Це один з обов'язкових до виконання проєктів для отримання сертифікації.",
          "В цьому проєкті ви створите вебсторінку персонального портфоліо."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Посадкова сторінка продукту",
        "intro": [
          "Це один з обов'язкових до виконання проєктів для отримання сертифікації.",
          "В цьому проєкті ви створите посадкову сторінку продукту, щоб збути продукт за власним вибором."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Форма для опитування",
        "intro": [
          "Це один з обов'язкових до виконання проєктів для отримання сертифікації.",
          "В цьому проєкті ви створите форму для опитування, щоб зібрати дані своїх користувачів."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Сторінка технічної документації",
        "intro": [
          "Це один з обов'язкових до виконання проєктів для отримання сертифікації.",
          "В цьому проєкті ви створите сторінку технічної документації, яка служитиме інструкцією або довідником."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Вивчіть HTML, створивши застосунок з котами",
        "intro": [
          "Теґи HTML надають вебсторінці структуру. Ви можете використовувати теґи HTML, щоб додати фотографії, кнопки та інші елементи до своєї вебсторінки.",
          "У цьому курсі ви вивчите найпоширеніші теґи HTML, створивши власний застосунок з фотографіями котів."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Вивчіть основи CSS, створивши меню для кафе",
        "intro": [
          "CSS повідомляє браузеру, як зображати вашу вебсторінку. Ви можете використовувати CSS, щоб встановити колір, шрифт, розмір та інші властивості елементів HTML.",
          "У цьому курсі ви вивчите CSS, розробивши дизайн меню для вебсторінки кафе."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Вивчіть блокову модель CSS, створивши картину Ротко",
        "intro": [
          "Кожен елемент HTML є своїм власним блоком із власним простором та краєм. Це називається блоковою моделлю.",
          "У цьому курсі ви використовуватимете CSS та блокову модель, щоб створити власну картину в стилі Ротко."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Вивчіть змінні CSS, створивши панораму міста",
        "intro": [
          "Змінні CSS допомагають організувати стилі та повторно використовувати їх.",
          "У цьому курсі ви побудуєте панораму міста. Ви дізнаєтеся, як налаштувати змінні CSS для того, щоб повторно використовувати їх, коли забажаєте."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Вивчіть форми HTML, створивши реєстраційну форму",
        "intro": [
          "Ви можете використовувати форми HTML для збору інформації від людей, які відвідують вашу вебсторінку.",
          "У цьому курсі ви вивчите форми HTML, створивши реєстраційну форму. Ви дізнаєтеся, як керувати типами даних, які люди можуть вводити у вашу форму, і деякі нові інструменти CSS для стилізації своєї сторінки."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Вивчіть доступність, створивши вікторину",
        "intro": [
          "Доступність полегшує користування вашою вебсторінкою для всіх людей, навіть для людей з порушеннями.",
          "У цьому курсі ви створите вебсторінку вікторини. Ви дізнаєтеся про інструменти доступності, такі як комбінації клавіш, атрибути ARIA та найкращі поради щодо дизайну."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Вивчіть перехідний CSS, створивши картину Пікассо",
        "intro": [
          "У цьому курсі ви дізнаєтеся, як використовувати деякі техніки перехідного CSS, кодуючи власну вебсторінку з картиною Пікассо. Ви дізнаєтеся про іконки SVG, позиціювання CSS та пригадаєте інші навички CSS, яких ви навчилися."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Вивчіть адаптивний вебдизайн, створивши піаніно",
        "intro": [
          "Адаптивний дизайн каже вашій вебсторінці, як вона має виглядати на екранах різного розміру.",
          "У цьому курсі ви використовуватимете CSS та адаптивний дизайн для кодування піаніно. До того ж, ви більше дізнаєтесь про медіазапити та псевдоселектори."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Вивчіть CSS Flexbox, створивши фотогалерею",
        "intro": [
          "Flexbox допомагає створити вебсторінку, яка матиме хороший вигляд на екрані будь-якого розміру.",
          "У цьому курсі ви використовуватимете Flexbox для створення адаптивної вебсторінки фотогалереї."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Вивчіть CSS Grid, створивши журнал",
        "intro": [
          "CSS Grid дає вам можливість керувати рядками та стовпчиками своєї вебсторінки.",
          "У цьому курсі ви створите журнальну статтю. Ви дізнаєтеся, як використовувати CSS Grid, включно з рядками та стовпчиками сітки."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Вивчіть типографію, створивши етикетку",
        "intro": [
          "Типографія – це мистецтво стилізації тексту, щоб його було легко читати та він відповідав своєму призначенню.",
          "У цьому курсі ви використовуватимете типографію, щоб створити вебсторінку з харчовою етикеткою. Ви дізнаєтеся, як стилізувати текст, регулювати висоту рядка та позиціювати текст за допомогою CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Вивчіть трансформації CSS, створивши пінгвіна",
        "intro": [
          "Ви можете трансформувати елементи HTML, щоб створити привабливий дизайн, який привертає увагу читача. Ви можете використовувати трансформації, щоб обертати елементи, масштабувати їх тощо.",
          "У цьому курсі ви побудуєте пінгвіна. Ви будете використовувати трансформації CSS, щоб позиціювати та змінювати розмір частин свого пінгвіна, створювати фон та анімувати роботу."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Вивчіть анімацію CSS, створивши оглядове колесо",
        "intro": [
          "Ви можете використовувати анімацію CSS, щоб привернути увагу до певних розділів вебсторінки та зробити її більш привабливою.",
          "У цьому курсі ви побудуєте оглядове колесо. Ви дізнаєтеся, як використовувати CSS для анімації елементів, трансформації та регулювання швидкості."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Вивчіть більше про псевдоселектори CSS, створивши бухгалтерський баланс",
        "intro": [
          "Ви можете використовувати псевдоселектори CSS, щоб змінити певні елементи HTML.",
          "У цьому курсі ви побудуєте бухгалтерський баланс за допомогою псевдоселекторів. Ви дізнаєтеся як змінити стиль елемента, коли ви наводите на нього курсор, та запускати інші події на своїй вебсторінці."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Вивчіть кольори CSS, створивши набір кольорових маркерів",
        "intro": [
          "Вибір правильних кольорів для вебсторінки може значно покращити естетичне вподобання читачів.",
          "У цьому курсі ви створите набір кольорових маркерів. Ви дізнаєтесь про різні способи встановлення значень кольорів та як поєднувати кольори між собою."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Алгоритми JavaScript та структури даних",
    "intro": [
      "Якщо HTML та CSS відповідають за вміст і стилізацію сторінки, то JavaScript робить її інтерактивною. У сертифікації «Алгоритми JavaScript та структури даних» ви вивчите основи JavaScript, включно зі змінними, масивами, об'єктами, циклами та функціями.",
      "Як тільки ви вивчите основи, ви почнете застосовувати ці знання, створюючи алгоритми, щоб уміло маніпулювати рядками, факторизувати числа, і навіть зможете обчислити орбіту міжнародної космічної станції.",
      "Крім того, ви також вивчите два важливих стилі або парадигми в програмуванні: об'єктноорієнтоване програмування (ООП) та функційне програмування (ФП)."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та скриптів) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють або блокують вміст сторінок під час виконання курсу.",
    "blocks": {
      "basic-javascript": {
        "title": "Основи JavaScript",
        "intro": [
          "JavaScript — це скриптова мова, яка використовується для того, аби зробити вебсайти інтерактивними. Це одна з основних технологій в мережі (разом з HTML та CSS), яка підтримується всіма сучасними браузерами.",
          "У цьому курсі ви вивчите головні поняття програмування в JavaScript. Ви почнете з простих структур даних, таких як числа та рядки. Далі ви почнете роботу з масивами, об'єктами, функціями, циклами, умовними конструкціями тощо."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, або ES – це стандартизована версія JavaScript. Оскільки більшість браузерів дотримуються цих стандартів, ECMAScript та JavaScript є взаємозамінними.",
          "Більша частина JavaScript (про яку ви вже дізналися) була в ES5 (ECMAScript 5), який утвердили у 2009 році. Поки ви все ще маєте можливість писати програми в ES5, JavaScript постійно розвивається і там щорічно вводяться нові функції.",
          "ES6, який випустили у 2015 році, додав багато нових потужних функцій до цієї мови. У курсі ви вивчите нові особливості, такі як стрілочні функції, деструкція, класи, проміси та модулі."
        ]
      },
      "regular-expressions": {
        "title": "Регулярні вирази",
        "intro": [
          "Регулярні вирази (відомі як «regex» або «regexp») – шаблони, які допомагають програмістам поєднувати, шукати та замінювати текст. Регулярні вирази дуже важливі, але їх важко читати, оскільки у них використовуються спеціальні символи для створення складніших, гнучкіших поєднань.",
          "У цьому курсі ви дізнаєтеся як використовувати спеціальні символи, групи захоплення, позитивний та негативний огляди та інші техніки, аби текст відповідав бажаному."
        ]
      },
      "debugging": {
        "title": "Налагодження програм",
        "intro": [
          "Налагодження програм – це процес перевірки коду на наявність помилок та їх виправлення.",
          "Помилки в коді, як правило, розподіляють на три категорії: синтаксичні, які заважають вашій програмі працювати; помилки середовища виконання, коли ваш код поводиться непередбачувано; або логічні, коли ваш код не виконує свою функцію.",
          "У цьому курсі ви дізнаєтеся як використовувати консоль JavaScript, аби налагодити програми та уникнути розповсюджених помилок."
        ]
      },
      "basic-data-structures": {
        "title": "Основи структур даних",
        "intro": [
          "Багатьома способами можна зберегти дані та отримати до них доступ. Ви вже знаєте деякі загальні структури даних JavaScript – масиви та об'єкти.",
          "У курсі «Основи структур даних» ви дізнаєтеся більше про різницю між масивами та об'єктами, та в яких ситуаціях вони використовуються. Ви також дізнаєтеся як використовувати корисні методи JS, такі як <code>splice()</code> та <code>Object.keys()</code>, аби отримати доступ до даних та маніпулювати ними."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Основи написання алгоритмів",
        "intro": [
          "Алгоритм – це ряд покрокових інструкцій, які описують як щось робити.",
          "Написання успішного алгоритму допомагає розбити задачу на менші частини та гарно подумати над тим, як вирішити кожну частину за допомогою коду.",
          "У цьому курсі ви вивчите основи алгоритмічного мислення, пишучи алгоритми, які роблять усе: від перетворення температур до користування складними 2D масивами."
        ]
      },
      "object-oriented-programming": {
        "title": "Об'єктноорієнтоване програмування",
        "intro": [
          "ООП, або об'єктноорієнтоване програмування – це один з основних підходів до процесу розробки програмного забезпечення. В ООП об'єкти та класи впорядковують код для опису речей і того, що вони роблять.",
          "У цьому курсі ви вивчите основні принципи ООП в JavaScript, включно з ключовим словом <code>this</code>, прототипи ланцюгів, конструктори та наслідування."
        ]
      },
      "functional-programming": {
        "title": "Функційне програмування",
        "intro": [
          "Функційне програмування – це ще один популярний підхід до розробки програмного забезпечення. У функційному програмуванні код впорядкований у менші, прості функції, які можна об'єднувати для створення складних програм.",
          "У цьому курсі ви вивчите основні поняття функційного програмування, включно з чистими функціями, як уникнути мутацій і як писати чистіший код за допомогою методів, таких як <code>.map()</code> і <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Написання алгоритмів середньої складності",
        "intro": [
          "Тепер, коли ви знаєте основи алгоритмічного мислення, разом з ООП та функційним програмуванням, перевірте свої вміння у написанні алгоритмів середньої складності."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "Проєкти «Алгоритми JavaScript та структури даних»",
        "intro": [
          "Тепер настав час випробувати свої навички роботи з JavaScript на практиці. Ці проєкти подібні до тестів з написання алгоритмів, які ви вже робили, але складніші.",
          "Виконайте п'ять проєктів JavaScript, аби отримати сертифікацію «Алгоритми JavaScript та структури даних»."
        ]
      }
    }
  },
  "2022/javascript-algorithms-and-data-structures": {
    "title": "Алгоритми JavaScript та структури даних (бета-версія)",
    "intro": ["заповнювач", "заповнювач"],
    "note": "",
    "blocks": {
      "build-a-caesars-cipher-project": {
        "title": "Проєкт «Створіть шифр Цезаря»",
        "intro": ["", ""]
      },
      "build-a-cash-register-project": {
        "title": "Проєкт «Створіть касовий апарат»",
        "intro": ["", ""]
      },
      "build-a-palindrome-checker-project": {
        "title": "Проєкт «Створіть перевірку паліндрома»",
        "intro": ["", ""]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Проєкт «Створіть конвертер римських чисел»",
        "intro": ["", ""]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Проєкт «Створіть валідатор мобільного номера»",
        "intro": ["", ""]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Вивчіть основи JavaScript, створивши рольову гру",
        "intro": ["", ""]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Вивчіть валідацію форм, створивши лічильник калорій",
        "intro": ["", ""]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Вивчіть функційне програмування, створивши електронну таблицю",
        "intro": ["", ""]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Бібліотеки Front End",
    "intro": [
      "Тепер, коли ви вже знайомі з HTML, CSS та JavaScript, піднімімо ваш рівень навичок, вивчаючи декілька найбільш популярних бібліотек верстки в галузі.",
      "У сертифікації «Бібліотеки Front End» ви навчитеся швидко стилізувати свій сайт за допомогою Bootstrap. Також ви навчитеся покращувати свої стилі CSS та розширювати їх за допомогою Sass.",
      "Згодом ви розробите кошик для покупок та інші застосунки, щоб навчитися створювати потужні односторінкові застосунки (SPAs) з React та Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap – це фронтенд каркас, створений для проєктування адаптивних вебсторінок та застосунків. Для веброзробки цей фреймворк використовує принцип Mobile First, включає попередньо інтегровані стилі та класи CSS і деякі розширення JavaScript.",
          "Під час цього курсу ви навчитеся створювати адаптивні вебсайти за допомогою Bootstrap та використовувати готові шаблони для стилізації кнопок, зображень, форм, навігації та інших поширених елементів."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery – одна з найпопулярніших у світі бібліотек JavaScript.",
          "До її запуску у 2006 році, кожний браузер використовував JavaScript по-своєму. jQuery спростила роботу з JavaScript для користувачів, а також забезпечила кросбраузерність створених кодів.",
          "Під час цього курсу ви навчитеся використовувати jQuery для виділення, вилучення, копіювання та редагування різних елементів на сторінці."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, або «Syntactically Awesome StyleSheets» – це мовне розширення CSS, що містить функції, яких немає у базовому CSS, і тим самим допомагає спростити створення таблиць стилів для ваших проєктів.",
          "У цьому курсі ви навчитеся зберігати дані у змінних, вкладати CSS, створювати багаторазові стилі за допомогою міксин, додавати умовні конструкції та цикли до своїх стилів тощо."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React – це популярна бібліотека JavaScript для створення багаторазових компонентних користувацьких інтерфейсів для вебсторінок або додатків.",
          "React поєднує HTML з функціями JavaScript, формуючи власну мову розмітки під назвою JSX. React також дозволяє легко керувати потоком даних у всьому додатку.",
          "У цьому курсі ви навчитеся створювати різні компоненти React, керувати даними за допомогою пропсів, а також застосовувати різні методи життєвого циклу, такі як <code>componentDidMount</code> тощо."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "Зі збільшенням розмірів та кількості додатків, керувати спільними даними стає все складніше. Redux називають «відкритою JS бібліотекою призначеною для управління станом програм JavaScript», яка забезпечує належну роботу ваших програм і спрощує тестування.",
          "Хоча ви можете використовувати його з будь-якою іншою бібліотекою, ми лише коротко розповімо про Redux, а тоді об'єднаємо його з React у наступному наборі курсів.",
          "Під час цього курсу ви вивчите базову інформацію про сховища, дії, редуктори та проміжне програмне забезпечення Redux для керування даними у своєму додатку."
        ]
      },
      "react-and-redux": {
        "title": "React та Redux",
        "intro": [
          "React часто використовують разом із Redux, і не дарма. Redux і React створив один програміст, який хотів зробити процес передачі даних між компонентами простішим.",
          "Тепер коли ви вже навчились керувати загальними даними за допомогою Redux, ви можете виконувати дії в React. На курсах React і Redux, ви навчитесь будувати компонент React і дізнаєтесь, як локально керувати станом на рівні компонента, та й у цілому додатку, за допомогою Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Проєкти «Бібліотеки Front End»",
        "intro": [
          "Прийшов час протестувати ваші навички роботи з бібліотеками фронтенд розробки. Використайте Bootstrap, jQuery, Sass, React та Redux, аби створити 5 проєктів, що перевірять ваші знання з усього, що ви вивчили дотепер.",
          "Виконайте п'ять проєктів та отримайте сертифікацію «Бібліотеки Front End»."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Візуалізація даних",
    "intro": [
      "Дані повсюди, але це не означає, що більшість з них без форми чи контексту.",
      "У сертифікації «Візуалізація даних» ви створите діаграми, графіки та карти, що показують різні типи даних, за допомогою бібліотеки D3.js.",
      "Ви також дізнаєтесь про JSON (JavaScript Object Notation) та як працювати з даними онлайн, користуючись API (Application Programing Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Візуалізація даних з D3",
        "intro": [
          "D3, або D3.js, розшифровується як «Data Driven Documents». Це бібліотека JavaScript для створення функціональної та інтерактивної візуалізації даних у браузері.",
          "D3 створено для роботи з поширеними вебстандартами, а саме: HTML, CSS і SVG (масштабована векторна графіка).",
          "D3 підтримує багато різних форматів даних. Тому, використовуючи її потужні вбудовані методи, ви можете перетворити ці дані у різні діаграми, графіки та карти.",
          "У курсі «Візуалізація даних з D3» ви навчитеся працювати з даними, аби створювати різні діаграми, графіки, елементи наведення та інші складові частини, аби створити динамічну та принадну візуалізацію даних."
        ]
      },
      "json-apis-and-ajax": {
        "title": "JSON API та AJAX",
        "intro": [
          "Так само як інтерфейс користувача (UIs) допомагає людям користуватися програмами, так само й APIs (Application Programming Interfaces) допомагає програмам взаємодіяти між собою. APIs – це інструменти, які використовуються комп'ютерами для комунікування один з одним, і, частково, для надсилання та отримання даних.",
          "Програмісти часто використовують AJAX (Asynchronous JavaScript and XML) при роботі з APIs. AJAX належить до групи технологій, які роблять асинхронні запити до сервера для передачі даних, а потім завантажують будь-які отримані дані до сторінки. І дані, що були передані між браузером і сервером, часто мають формат JSON (JavaScript Object Notation).",
          "Цей курс навчить вас основ роботи з APIs та різними технологіями AJAX в браузері."
        ]
      },
      "data-visualization-projects": {
        "title": "Проєкти «Візуалізація даних»",
        "intro": [
          "Тепер, коли ви дізналися як працювати з D3, APIs та AJAX технологіями, перевірте свої навички за допомогою цього тесту з 5-ма проєктами візуалізації даних.",
          "У цих проєктах вам потрібно буде отримати й проаналізувати набір даних, тоді використати D3 для створення різної візуалізації даних. Завершіть усі проєкти, аби отримати сертифікацію «Візуалізація даних»."
        ]
      },
      "d3-dashboard": {
        "title": "Інформаційна панель D3",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Реляційна база даних (бета-версія)",
    "intro": [
      "У цих курсах ви використовуватимете реальні інструменти розробника та програмне забезпечення, включно з VS Code, PostgreSQL та командним рядком Linux / Unix для завершення інтерактивних уроків і створення проєктів.",
      "Ці курси починаються з основних команд Bash. За допомогою терміналу ви навчитеся усього необхідного (від навігації та маніпуляції файловою системою, написання скрипту в Bash до просунутого використання).",
      "Далі ви навчитеся створювати та використовувати реляційну базу даних з PostgreSQL (система керування базами даних) та SQL (мова баз даних).",
      "Зрештою, ви дізнаєтеся про Git, систему контролю версій, важливий інструмент кожного розробника."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "База даних «Небесні тіла»",
        "intro": [
          "Це один з обов'язкових до виконання проєктів для отримання сертифікації.",
          "У цьому проєкті ви побудуєте базу даних небесних тіл, використовуючи PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Гра «Вгадай число»",
        "intro": [
          "Це один з обов'язкових до виконання проєктів для отримання сертифікації.",
          "У цьому проєкті ви використовуватимете сценарії Bash, PostgreSQL та Git, щоб створити гру з вгадуванням чисел, яка запускається в терміналі та зберігає інформацію користувача."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "База даних «Періодична таблиця»",
        "intro": [
          "Це один з обов'язкових до виконання проєктів для отримання сертифікації.",
          "У цьому проєкті ви створите скрипт Bash для отримання інформації про хімічні елементи з бази даних періодичної таблиці."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Планувальник «Записи в салоні»",
        "intro": [
          "Це один з обов'язкових до виконання проєктів для отримання сертифікації.",
          "У цьому проєкті ви створите інтерактивну програму Bash, яка використовує PostgreSQL для відстеження клієнтів і зустрічей у вашому салоні."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "База даних «Чемпіонат світу»",
        "intro": [
          "Це один з обов'язкових до виконання проєктів для отримання сертифікації.",
          "У цьому проєкті ви створите скрипт Bash, який вводить інформацію з ігор чемпіонату світу в PostgreSQL, а потім запитує базу даних для отримання статистики."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Вивчіть прогресивний Bash, створивши перекладач Kitty Ipsum",
        "intro": [
          "У командах Bash більше, ніж ви могли собі уявити.",
          "У цьому курсі з 140 уроків ви дізнаєтеся про деякі складніші команди, а також детально дізнаєтеся як вони працюють."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Вивчіть Bash та SQL, створивши магазин прокату велосипедів",
        "intro": [
          "У цьому курсі з 210 уроків ви створите інтерактивну програму Bash, яка зберігатиме інформацію про оренду для вашого магазину прокату велосипедів, використовуючи PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Вивчіть Bash, створивши шаблонний код",
        "intro": [
          "Термінал дозволяє відправляти текстові команди на ваш комп’ютер, які можуть маніпулювати файловою системою, запускати програми, автоматизувати завдання та багато іншого.",
          "У цьому курсі з 170 уроків ви вивчите команди терміналу, створивши шаблонний код вебсайту, використовуючи лише командний рядок."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Вивчіть скрипт Bash, створивши п’ять програм",
        "intro": [
          "Скрипти Bash поєднують команди терміналу та логіку в програми, які можуть виконувати або автоматизувати завдання та багато іншого.",
          "У цьому курсі з 220 уроків ви вивчите більше про команди терміналу та як їх використовувати в скриптах Bash, створивши п’ять невеликих програм."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Вивчіть Git, створивши об'єкт SQL",
        "intro": [
          "Git – це система контролю версій, яка відстежує усі зміни, внесені вами до свого коду.",
          "У цьому курсі з 240 уроків ви вивчите як Git відстежує ваш код, створюючи об’єкт, що містить часто використовувані команди SQL."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Вивчіть Nano, створивши замок",
        "intro": [
          "Nano – це програма, яка дозволяє редагувати файли прямо в терміналі.",
          "У цьому курсі з 40 уроків ви вивчите як редагувати файли в терміналі за допомогою Nano під час будівництва замку."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Вивчіть реляційні бази даних, створивши базу даних «Mario»",
        "intro": [
          "Реляційна база даних організовує дані в таблиці, які пов’язані між собою через спорідненість.",
          "В цьому курсі з 165 уроків ви вивчите основи реляційної бази даних, створивши базу даних PostgreSQL, наповнену персонажами з відеоігор."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Вивчіть SQL, створивши студентську базу даних (частина 1)",
        "intro": [
          "SQL, або Structured Query Language (мова структурованих запитів) – це мова для спілкування з реляційною базою даних.",
          "В цьому курсі з 140 уроків ви створите скрипт Bash, який використовує SQL для введення інформації про ваших студентів з інформатики в PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Вивчіть SQL, створивши студентську базу даних (частина 2)",
        "intro": [
          "Команди об’єднання SQL використовуються, щоб поєднати інформацію з кількох таблиць у реляційній базі даних",
          "У цьому курсі з 140 уроків ви завершите свою базу даних студентів, глибше занурившись в команди SQL."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Розробка Back End та API",
    "intro": [
      "До цього моменту ви використовували JavaScript тільки для фронтенду, аби зробити вебсторінку інтерактивнішою, розв'язати завдання з алгоритмами, або створити SPA. Але JavaScript можна використовувати й в бекенд, або на сервері, для створення цілих вебзастосунків.",
      "Сьогодні один із найпопулярніших способів створення застосунків – за допомогою мікросервісів, маленьких модульних застосунків, які разом формують єдине ціле.",
      "У сертифікації «Розробка Back End та API» ви навчитеся писати бекенд програми за допомогою Node.js та npm. Ви також створите вебзастосунок за допомогою фреймворку Express та мікросервіс для пошуку людей за допомогою MongoDB і бібліотеки Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Керування пакетами з NPM",
        "intro": [
          "npm (Node Package Manager) – це інструмент командного рядка для встановлення, створення та поширення пакетів коду JavaScript, написаного для Node.js. На npm знаходиться багато пакетів з відкритим вихідним кодом, тому спершу ретельно їх вивчіть, щоб вам не довелося виправляти помилки під час роботи з даними чи отримання даних з API.",
          "У цьому курсі ви вивчите основи використання npm, включно з тим як працювати із <code>package.json</code> та як керувати встановленими залежностями."
        ]
      },
      "basic-node-and-express": {
        "title": "Основи Node та Express",
        "intro": [
          "Node.js – це середовище виконання JavaScript, що дозволяє розробникам писати бекенд (серверні) програми в JavaScript. Node.js має кілька вбудованих модулів, – маленьких, незалежних програм – які допомагають з цим. Деякі з основних модулів містять HTTP, який працює на зразок сервера, і файлову систему – модуль для читання і редагування файлів.",
          "В останній групі курсів ви навчилися встановлювати та керувати пакетами npm, які є скупченнями менших модулів. Ці пакети можуть допомогти вам створити більші, складніші застосунки.",
          "Express – це спрощений фреймворк вебзастосунків та один з найбільш популярних пакетів на npm. Express значно полегшує створення сервера та керування маршрутизацією вашого застосунку, що відповідає за такі речі як перенаправлення людей до потрібної сторінки, коли вони відвідують певну кінцеву точку, наприклад <pre>/blog</pre>.",
          "У цьому курсі ви дізнаєтесь основи Node та Express, включно з тим, як створювати сервер, обслуговувати різні файли та обробляти різні запити з браузера."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB та Mongoose",
        "intro": [
          "MongoDB – це програма бази даних, яка зберігає JSON документи (чи записи), які ви можете використати у своєму застосунку. На відміну від SQL, іншого типу бази даних, MongoDB – це нереляційна, або «NoSQL» база даних. Це означає, що MongoDB зберігає усі збірні дані в межах одного запису, замість того, щоб тримати їх у багатьох попередньо налаштованих таблицях, як у базі даних SQL.",
          "Moongoose – це популярний пакет npm для взаємодії з MongoDB. З Moongoose ви можете використовувати прості об'єкти JavaScript замість JSON, що полегшує роботу із MongoDB. Він також дозволяє створити нарис документів під назвою «схеми», щоб ви ненароком не зберегли хибний тип даних та не спричинили помилок.",
          "На курсах MongoDB та Mongoose ви вивчите основи роботи із постійними даними, враховуючи налаштування моделі, збереження, видалення та пошук документів у базі даних."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Проєкти «Розробка Back End та API»",
        "intro": [
          "Раніше ви уже мали справу з API, але тепер, коли ви знайомі із nmp, Node, Express, Mongo DB та Mongoose, прийшов час створити щось власне. Застосуйте усі отримані знання, щоб створити 5 окремих мікросерверів, які є меншими застосунками з обмеженими можливостями.",
          "Створивши їх, ви матимете 5 крутих API мікросерверів, якими можна похвалитися перед друзями, рідними чи потенційними роботодавцями. О, а ще новеньку сертифікацію «Розробка Back End та APIs»."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Забезпечення якості",
    "intro": [
      "Оскільки ваші програми чи вебзастосунки стають складнішими, ви захочете протестувати їх, щоб переконатися, що нові зміни не порушують початкові функції.",
      "У сертифікації «Забезпечення якості» ви дізнаєтесь як писати тести з Chai, щоб переконатись, що ваші застосунки працюють так, як ви очікуєте.",
      "Потім ви створите застосунок чату, щоб вивчити розширені концепції Node та Express. Ви також будете використовувати Pug як шаблонізатор, Passport для автентифікації та Socket.io для комунікування в режимі реального часу між сервером та підключеними клієнтами."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Забезпечення якості та тестування з Chai",
        "intro": [
          "Chai – це бібліотека тестування JavaScript, яка допомагає вам переконатись, що ваша програма все ще поводиться так, як ви очікуєте, після внесення змін до коду.",
          "Використовуючи Chai, ви зможете писати тести, які описують ваші програмні вимоги, та бачити чи ваш застосунок відповідає їм.",
          "У цьому курсі ви дізнаєтесь про припущення, глибоку рівність, правдивість, тестування API та інші основи тестування програм JavaScript."
        ]
      },
      "advanced-node-and-express": {
        "title": "Просунутий Node та Express",
        "intro": [
          "Настав час глибоко зануритися у Node.js та Express.js, створивши застосунок чату із системою входу.",
          "Щоб безпечно впровадити систему входу, вам потрібно буде дізнатися про автентифікацію. Це акт перевірки особи або процесу.",
          "У цьому курсі ви дізнаєтесь, як використовувати Passport для управління автентифікацією, Pug для створення шаблонів багаторазового використання для швидкого створення інтерфейсу та вебсокети для комунікування в реальному часі між клієнтами та сервером."
        ]
      },
      "quality-assurance-projects": {
        "title": "Проєкти «Забезпечення якості»",
        "intro": [
          "Тепер, коли ви добре розбираєтесь у фронт енд та бек енд, настав час застосувати всі навички та концепції, які ви вивчили до цього моменту. Ви створите 5 різних вебзастосунків і напишете тести для кожного, щоб переконатися чи вони працюють і обробляють всі можливі сценарії.",
          "Після завершення цих проєктів із забезпечення якості у вас буде ще 5 проєктів, а також нова сертифікація, якою можна похвалитись у портфоліо."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Наукові обчислення з Python",
    "intro": [
      "Python – одна з найпопулярніших, гнучких мов програмування на сьогодні. Ви можете використовувати її для всього: від базових скриптів до машинного навчання.",
      "У сертифікації «Наукові обчислення з Python» ви дізнаєтесь основи Python, такі як змінні, цикли, умовні переходи та функції. Тоді ви швидко перейдете до складних структур даних, роботи з мережами, реляційних баз даних та візуалізації даних."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python для всіх",
        "intro": [
          "Python для всіх – це безоплатна серія відеокурсів, яка вчить основам використання Python 3.",
          "Курси були створені Чарльзом Северансом (також відомим як Dr. Chuck). Він є професором школи інформації університету Мічигану, де викладає різні технологічні курси, включно з програмуванням, дизайном баз даних та веброзробкою."
        ]
      },
      "scientific-computing-with-python-projects": {
        "title": "Проєкти «Наукові обчислення з Python»",
        "intro": [
          "Час перевірити свої навички роботи з Python. Завершивши ці проєкти, ви продемонструєте, що володієте хорошими фундаментальними знаннями Python і маєте право на сертифікацію «Наукові обчислення з Python»."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Аналіз даних з Python",
    "intro": [
      "Аналіз даних існує вже давно. Але ще кілька років тому розробники практикували його за допомогою дорогих інструментів із закритим кодом, таких як Tableau. Але нещодавно Python, SQL та інші відкриті бібліотеки назавжди змінили аналіз даних.",
      "У сертифікації «Аналіз даних з Python» ви дізнаєтесь про основи аналізу даних за допомогою Python. Наприкінці цієї сертифікації ви будете знати, як читати дані з таких джерел, як CSV та SQL, і як використовувати бібліотеки, такі як Numpy, Pandas, Matplotlib та Seaborn для обробки та візуалізації даних."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Аналіз даних з Python",
        "intro": [
          "У цих комплексних відеокурсах, створених Сантьяго Басульто, ви дізнаєтесь про весь процес аналізу даних. Ви будете зчитувати дані з різних джерел (CSV, SQL, Excel), обробляти ці дані за допомогою NumPy та Pandas і візуалізовувати їх за допомогою Matplotlib та Seaborn.",
          "Крім того, ми включили детальний курс по Jupyter Notebook та короткий довідник з Python, щоб оновити ваші навички програмування."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Вивчіть основи бібліотеки NumPy у наступному відеокурсі, створеному Кейтом Галлі.",
          "У цьому курсі ви дізнаєтесь, як працює NumPy і як він порівнюється із вбудованими списками Python. Ви також дізнаєтесь, як писати код з NumPy, індексувати, змінювати форму, застосовувати статистику та багато іншого."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Проєкти «Аналіз даних з Python»",
        "intro": [
          "Існує багато способів аналізу даних за допомогою Python. Завершивши ці проєкти, ви продемонструєте, що володієте хорошими фундаментальними знаннями аналізу даних, використовуючи Python.",
          "Завершіть всі проєкти, щоб отримати сертифікацію «Аналіз даних з Python»."
        ]
      }
    }
  },
  "information-security": {
    "title": "Інформаційна безпека",
    "intro": [
      "Завдяки всьому, що ми робимо в Інтернеті, величезна кількість конфіденційної інформації знаходиться в зоні ризику: електронні адреси, паролі, номери телефонів тощо.",
      "Завдяки сертифікації «Інформаційна безпека» ви створите безпечний вебзастосунок за допомогою HelmetJS, щоб вивчити основи захисту інформації людей в Інтернеті.",
      "Ви також створите TCP client, а ще Nmap і сканер портів у Python. Це допоможе вам вивчити основи тесту на проникнення – важливого компоненту надійної інформаційної безпеки."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Інформаційна безпека з HelmetJS",
        "intro": [
          "Цей курс програмування зосереджений на HelmetJS, типі проміжного програмного забезпечення для застосунків на основі Express, яке автоматично встановлює заголовки HTTP. Таким чином, він може запобігти випадковому передаванню конфіденційної інформації між сервером та клієнтом.",
          "Завершення курсів допоможе вам зрозуміти, як захистити свій сайт від зловмисної поведінки."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python для тесту на проникнення",
        "intro": [
          "Ці відеокурси навчать вас тесту на проникнення за допомогою Python. Також відомий як пен тест (pen test), тест на проникнення – це змодельована атака на систему задля перевірки на вразливі місця.",
          "У цьому курсі ви дізнаєтеся про сокети, створите TCP сервер та клієнт, створите Nmap сканер і інші інструменти та техніки, які пен тестувальники використовують щоденно."
        ]
      },
      "information-security-projects": {
        "title": "Проєкти «Інформаційна безпека»",
        "intro": [
          "Настав час перевірити ваші навички з інформаційної безпеки на практиці. Ці проєкти дадуть вам шанс застосувати всі набуті вміння, вивчені правила та поняття з інформаційної безпеки.",
          "Коли ви закінчите, у вас буде достатньо проєктів з інформаційної безпеки за плечима, разом з сертифікацією, якою ви можете похизуватись перед друзям, сім'єю та роботодавцями."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Машинне навчання з Python",
    "intro": [
      "Машинне навчання має багато практичних застосунків, які ви можете використовувати у своїх проєктах чи роботі.",
      "У сертифікації «Машинне навчання з Python» ви використовуватимете фреймворк TensorFlow, аби створити декілька нейронних мереж і вивчити складніші техніки, такі як обробка природної мови й навчання з підкріпленням.",
      "Також ви зануритеся у нейронні мережі та вивчите правила, за якими працюють глибокі, рекурентні та згорткові нейронні мережі."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "Tensorflow – це фреймворк з відкритим вихідним кодом, що полегшує використання машинного навчання та нейронних мереж.",
          "Наступний відеокурс був створений Тімом Рущіцею, також відомим як «Tech With Tim». Він допоможе зрозуміти TensorFlow і деякі з його потужних можливостей."
        ]
      },
      "how-neural-networks-work": {
        "title": "Як працюють нейронні мережі",
        "intro": [
          "Нейронні мережі лежать в основі того, що ми зараз називаємо штучним інтелектом. Але їх, як правило, було складно зрозуміти. Особливо початківцям у галузі машинного навчання.",
          "Навіть якщо ви вперше зіштовхуєтеся з нейронними мережами, ці відеокурси Брендона Рорера навчать вас орієнтуватися у їхніх поняттях та підрахунках."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Проєкти «Машинне навчання з Python»",
        "intro": [
          "Машинне навчання може бути дуже корисним. Завершивши ці безоплатні складні проєкти з програмування, ви покажете, що маєте базові знання з машинного навчання й отримаєте сертифікацію «Машинне навчання з Python»."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Підготовка до співбесіди по кодуванню",
    "intro": [
      "Шукаєте безоплатні вправи з кодування, щоб підготуватися до наступної співбесіди? Ми уже про це подбали.",
      "Цей розділ містить сотні завдань з програмування, які перевіряють ваші знання алгоритмів, структур даних і математики. Тут також є декілька проєктів, які ви можете використати для зміцнення своїх навичок або просто додати до свого портфоліо."
    ],
    "note": "",
    "blocks": {
      "algorithms": {
        "title": "Алгоритми",
        "intro": [
          "Ці безоплатні вправи з програмування навчать вас загальних алгоритмів, з якими ви скоріш за все зіткнетеся в житті. Це чудова можливість вдосконалити як логіку, так і програмувальні навички.",
          "Подібні алгоритми часто використовують на співбесідах, щоб перевірити навички кандидатів. Ми чітко пояснимо, як саме функціонують різноманітні алгоритми, щоб ви могли підібрати рішення до кожного."
        ]
      },
      "data-structures": {
        "title": "Структура даних",
        "intro": [
          "Ці безплатні курси програмування спрямовані на те, щоб допомогти вам у роботі з численними структурами даних, з якими ви ще не стикалися.",
          "Під час роботи з цими курсами, ви вивчите кожний тип структур даних та реалізуєте алгоритми, щоб зрозуміти їх краще."
        ]
      },
      "take-home-projects": {
        "title": "Проєкти на самостійне опрацювання",
        "intro": [
          "Люди завжди нервують на співбесідах з програмування. Іноді, замість інтерв'ю, кандидатам можуть запропонувати створити проєкт вдома. Співбесіди такого типу часто передбачають виконання великого обсягу роботи, однак якнайкраще показують роботодавцям ваші здібності.",
          "Попрактикуйтеся створювати запропоновані нами проєкти. Не поспішайте, добре над ними попрацюйте та додайте до свого резюме чи портфоліо, щоб вразити потенційних роботодавців."
        ]
      },
      "rosetta-code": {
        "title": "Rosetta Code",
        "intro": [
          "Розвиньте свої навички творчого підходу до розв'язання проблем за допомогою завдань з базової бібліотеки Rosetta Code.",
          "Ці завдання можуть виявитися важкими, але вони підштовхнуть ваше логічне мислення до нових висот.",
          "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Атрибут: Rosetta Code</a>"
        ]
      },
      "project-euler": {
        "title": "Проєкт «Ейлер»",
        "intro": [
          "Виконайте завдання з програмування з архівів проєкту «Ейлер». Вони удосконалять ваші алгоритмічні та математичні знання.",
          "Тут є завдання різної складності, а для багатьох здобуття досвіду полягає в індуктивному методі навчання. Тобто, вирішення одного завдання прояснить нову концепцію та дозволить вирішити раніше незрозумілу задачу. Чи під силу вам вирішити кожну?"
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "Проєкт «Odin»",
    "intro": [
      "Проєкт «Odin» є одним з тих ресурсів, про які хотіли б дізнатися ще коли навчались. ",
      "Не кожен має доступ до технологічної освіти або коштів, необхідних для відвідування інтенсивної школи. Однак це не остаточне рішення для тих, хто хоче вчитися.",
      "Цей проєкт розроблений, щоб заповнити прогалину для людей, які намагаються вчитись самостійно, але все ж таки хочуть високоякісну освіту."
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Вивчіть основи HTML",
        "intro": ["Опис буде надано пізніше"]
      },
      "top-build-a-recipe-project": {
        "title": "Вивчіть основи HTML, побудувавши сторінку з рецептами",
        "intro": ["Опис буде надано пізніше"]
      }
    }
  },
  "misc-text": {
    "certification": "Сертифікація «{{cert}}»",
    "browse-other": "Перегляньте інші безоплатні сертифікації\n(ми рекомендуємо виконувати їх послідовно)",
    "courses": "Курси",
    "steps": "Кроки",
    "expand": "Розгорнути курс",
    "collapse": "Згорнути курс",
    "legacy-header": "Застарілі курси",
    "legacy-desc": "Ці курси більше не входять до сертифікацій, але вони все ще доступні для навчання.",
    "legacy-go-back": "Перейти до поточної версії навчальної програми.",
    "new-rwd-desc": "Ми оновили нашу навчальну програму «Адаптивний вебдизайн». Якщо ви раніше працювали з навчальною програмою, ваш прогрес досі збережено! Ви можете знайти його в секції «Застарілий адаптивний вебдизайн».",
    "new-rwd-article": "Ми радимо прочитати про внесені зміни та розглянути можливість вивчення оновленої навчальної програми.",
    "viewing-upcoming-change": "Ви дивитесь на бета-версію сторінки. ",
    "go-back-to-learn": "Поверніться до стабільної версії навчальної програми.",
    "read-database-cert-article": "Будь ласка, прочитайте повідомлення на форумі, перш ніж продовжити.",
    "enable-cookies": "Ви повинні ввімкнути сторонні файли cookie перед початком роботи.",
    "english-only": "Курси в цьому розділі доступні лише англійською мовою. Наразі ми можемо перекладати лише заголовки й вступи, а не самі уроки."
  }
}
