{
  "responsive-web-design": {
    "title": "Адаптивний вебдизайн (застаріла версія)",
    "intro": [
      "У сертифікації «Адаптивний вебдизайн» ви вивчите мови, які розробники використовують для створення вебсторінок: HTML (мова розмітки гіпертексту) для вмісту та CSS (каскадні таблиці стилів) для дизайну.",
      "Спочатку ви створите застосунок із фотографіями котів, аби вивчити основи HTML та CSS. Пізніше ви опануєте сучасні методи (серед яких змінні CSS) завдяки створенню пінгвіна, а також опануєте найкращі практики доступності, побудувавши вебформу.",
      "Ви також дізнаєтеся, як конструювати вебсайти, які відповідають різним розмірам екранів, створивши Twitter Card за допомогою Flexbox, а ще складний макет блогу з CSS Grid."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та темні режими) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють вміст або макет сторінок під час виконання курсу.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "Основи HTML та HTML5",
        "intro": [
          "HTML — це мова розмітки, яка використовує спеціальний синтаксис або примітки для опису структури вебсторінки чи браузера. Елементи HTML зазвичай мають початковий та кінцевий теги, які оточують вміст та надають йому значення. Наприклад, різні елементи можуть описати текст як заголовок, абзац або елемент списку.",
          "У цьому курсі ви створите застосунок із фотографіями котів, щоб опанувати застосування деяких з найпоширеніших елементів HTML (головних блоків будь-якої вебсторінки)."
        ]
      },
      "basic-css": {
        "title": "Основи CSS",
        "intro": [
          "CSS, або каскадні таблиці стилів, повідомляють браузеру як показати текст та інший вміст, який ви написали в HTML. За допомогою CSS ви можете регулювати колір, шрифт, розмір, відстань і багато інших аспектів елементів HTML.",
          "І зараз, коли ви описали структуру свого застосунку, стилізуйте його за допомогою CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Прикладний візуальний дизайн",
        "intro": [
          "Візуальний дизайн — це поєднання типографії, кольорознавства, графіки, анімації, макетів сторінок і багато чого іншого, аби допомогти вам передати своє унікальне повідомлення.",
          "У цьому курсі ви навчитеся застосовувати усі ці елементи візуального дизайну для своїх вебсайтів."
        ]
      },
      "applied-accessibility": {
        "title": "Прикладна доступність",
        "intro": [
          "У процесі веброзробки спеціальні можливості посилаються на вміст сайту та інтерфейс користувача, який широка аудиторія зможе розпізнати, з яким зможе взаємодіяти та за допомогою якого зможе зорієнтуватися на сайті. У цю аудиторію також входять люди із зоровими, слуховими, руховими та когнітивними розладами.",
          "У цьому курсі ви дізнаєтеся найкращі практики для створення вебсайтів, які доступні кожному."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Принципи адаптивного вебдизайну",
        "intro": [
          "Підключитися до мережі можна з багатьох пристроїв різних форм і розмірів. Адаптивний вебдизайн — це проєктування гнучких вебсайтів, які пристосовуються до різних розмірів, орієнтацій та розширення екранів.",
          "У цьому курсі ви дізнаєтеся як використовувати CSS, аби ваші вебсайти мали гарний вигляд, незалежно від того, на якому пристрої вони відтворені."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox — це потужний режим розмітки, який підтримується практично на всіх пристроях і який було введено з останньою версією CSS, CSS3. За допомогою flexbox набагато легше відцентровувати елементи сторінки та створювати функціональні інтерфейси користувачів, які автоматично зменшуються та розширяються.",
          "У цьому курсі ви дізнаєтеся про складові flexbox та функціональної розмітки, коли створюватимете Twitter card."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "CSS grid — це новіший режим розмітки, за допомогою якого можна легко створювати складну адаптивну композицію. Він перетворює елемент HTML у сітку і допомагає розмістити дочірні елементи будь-де на екрані.",
          "У цьому курсі ви вивчите основи CSS Grid, створюючи різні складні композиції, в тому числі макет блогу."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Адаптивний вебдизайн",
    "intro": [
      "В сертифікації «Адаптивний вебдизайн» ви вивчите мови, які розробники використовують для створення вебсторінок: HTML (мова розмітки гіпертексту) для вмісту та CSS (каскадні таблиці стилів) для дизайну.",
      "Спочатку ви створите застосунок із фотографіями котів, аби вивчити основи HTML та CSS. Пізніше ви опануєте сучасні методи, такі як змінні CSS, завдяки створенню пінгвіна, а також створите вікторину, щоб опанувати доступність.",
      "Наостанок ви дізнаєтеся, як створити вебсторінки, які реагують на зміну розміру екрану, створивши фотогалерею за допомогою Flexbox і макет журналу з CSS Grid."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та темні режими) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють вміст або макет сторінок під час виконання курсу.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Пам’ятна сторінка",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите пам’ятну сторінку на тему за власним вибором."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Вебсторінка персонального портфоліо",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите вебсторінку персонального портфоліо."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Посадкова сторінка продукту",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите посадкову сторінку продукту, щоб збути продукт за власним вибором."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Форма для опитування",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите форму для опитування, щоб зібрати дані своїх користувачів."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Сторінка технічної документації",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите сторінку технічної документації, яка служитиме інструкцією або довідником."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Вивчіть HTML, створивши застосунок з котами",
        "intro": [
          "Теги HTML надають вебсторінці структуру. Ви можете використовувати теги HTML, щоб додати фотографії, кнопки та інші елементи до своєї вебсторінки.",
          "У цьому курсі ви вивчите найпоширеніші теги HTML, створивши власний застосунок з фотографіями котів."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Вивчіть основи CSS, створивши меню для кафе",
        "intro": [
          "CSS повідомляє браузеру, як зображати вашу вебсторінку. Ви можете використовувати CSS, щоб встановити колір, шрифт, розмір та інші властивості елементів HTML.",
          "У цьому курсі ви вивчите CSS, розробивши дизайн меню для вебсторінки кафе."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Вивчіть блокову модель CSS, створивши картину Ротко",
        "intro": [
          "Кожен елемент HTML є своїм власним блоком із власним простором та краєм. Це називається блоковою моделлю.",
          "У цьому курсі ви використовуватимете CSS та блокову модель, щоб створити власну картину в стилі Ротко."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Вивчіть змінні CSS, створивши панораму міста",
        "intro": [
          "Змінні CSS допомагають організувати стилі та повторно використовувати їх.",
          "У цьому курсі ви побудуєте панораму міста. Ви дізнаєтеся, як налаштувати змінні CSS для того, щоб повторно використовувати їх, коли забажаєте."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Вивчіть форми HTML, створивши реєстраційну форму",
        "intro": [
          "Ви можете використовувати форми HTML для збору інформації від людей, які відвідують вашу вебсторінку.",
          "У цьому курсі ви вивчите форми HTML, створивши реєстраційну форму. Ви дізнаєтеся, як керувати типами даних, які люди можуть вводити у вашу форму, і деякі нові інструменти CSS для стилізації своєї сторінки."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Вивчіть доступність, створивши вікторину",
        "intro": [
          "Доступність полегшує користування вашою вебсторінкою для всіх людей, навіть для людей з порушеннями.",
          "У цьому курсі ви створите вебсторінку вікторини. Ви дізнаєтеся про інструменти доступності, серед яких комбінації клавіш, атрибути ARIA та найкращі поради щодо дизайну."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Вивчіть перехідний CSS, створивши картину Пікассо",
        "intro": [
          "У цьому курсі ви дізнаєтеся, як використовувати деякі техніки перехідного CSS, кодуючи власну вебсторінку з картиною Пікассо. Ви дізнаєтеся про іконки SVG, позиціювання CSS та пригадаєте інші навички CSS, яких ви навчилися."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Вивчіть адаптивний вебдизайн, створивши піаніно",
        "intro": [
          "Адаптивний дизайн каже вашій вебсторінці, як вона має виглядати на екранах різного розміру.",
          "У цьому курсі ви використовуватимете CSS та адаптивний дизайн для програмування піаніно. До того ж, ви більше дізнаєтесь про медіазапити та псевдоселектори."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Вивчіть CSS Flexbox, створивши фотогалерею",
        "intro": [
          "Flexbox допомагає створити вебсторінку, яка матиме хороший вигляд на екрані будь-якого розміру.",
          "У цьому курсі ви використовуватимете Flexbox для створення адаптивної вебсторінки фотогалереї."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Вивчіть CSS Grid, створивши журнал",
        "intro": [
          "CSS Grid дає вам можливість керувати рядками та стовпчиками своєї вебсторінки.",
          "У цьому курсі ви створите журнальну статтю. Ви дізнаєтеся, як використовувати CSS Grid, включно з рядками та стовпчиками сітки."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Вивчіть типографію, створивши етикетку",
        "intro": [
          "Типографія — це мистецтво стилізації тексту, щоб його було легко читати та він відповідав своєму призначенню.",
          "У цьому курсі ви використовуватимете типографію, щоб створити вебсторінку з харчовою етикеткою. Ви дізнаєтеся, як стилізувати текст, регулювати висоту рядка та позиціювати текст за допомогою CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Вивчіть трансформації CSS, створивши пінгвіна",
        "intro": [
          "Ви можете трансформувати елементи HTML, щоб створити привабливий дизайн, який привертає увагу читача. Ви можете використовувати трансформації, щоб обертати елементи, масштабувати їх тощо.",
          "У цьому курсі ви побудуєте пінгвіна. Ви будете використовувати трансформації CSS, щоб позиціювати та змінювати розмір частин свого пінгвіна, створювати фон та анімувати роботу."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Вивчіть анімацію CSS, створивши оглядове колесо",
        "intro": [
          "Ви можете використовувати анімацію CSS, щоб привернути увагу до певних розділів вебсторінки та зробити її більш привабливою.",
          "У цьому курсі ви побудуєте оглядове колесо. Ви дізнаєтеся, як використовувати CSS для анімації елементів, трансформації та регулювання швидкості."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Вивчіть більше про псевдоселектори CSS, створивши бухгалтерський баланс",
        "intro": [
          "Ви можете використовувати псевдоселектори CSS, щоб змінити певні елементи HTML.",
          "У цьому курсі ви побудуєте бухгалтерський баланс за допомогою псевдоселекторів. Ви дізнаєтеся як змінити стиль елемента, коли ви наводите на нього курсор, та запускати інші події на своїй вебсторінці."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Вивчіть кольори CSS, створивши набір кольорових маркерів",
        "intro": [
          "Вибір правильних кольорів для вебсторінки може значно покращити естетичне вподобання читачів.",
          "У цьому курсі ви створите набір кольорових маркерів. Ви дізнаєтесь про різні способи встановлення значень кольорів та як поєднувати кольори між собою."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Вивчіть перехідний CSS, створивши малюнок кота",
        "intro": [
          "Позиціювання CSS важливо опанувати для того, щоб створювати візуально привабливі та адаптивні вебмакети",
          "У цьому курсі ви створите малюнок кота. Ви дізнаєтесь, як працювати з абсолютним позиціюванням, властивістю z-index та властивістю transform."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Алгоритми JavaScript та структури даних (застаріла версія)",
    "intro": [
      "Якщо HTML та CSS відповідають за вміст і стилізацію сторінки, то JavaScript робить її інтерактивною. У сертифікації «Алгоритми JavaScript та структури даних» ви вивчите основи JavaScript, включно зі змінними, масивами, об’єктами, циклами та функціями.",
      "Як тільки ви вивчите основи, ви почнете застосовувати ці знання, створюючи алгоритми, щоб уміло маніпулювати рядками, факторизувати числа, і навіть зможете обчислити орбіту міжнародної космічної станції.",
      "Крім того, ви також вивчите два важливих стилі або парадигми в програмуванні: об’єктноорієнтоване програмування (ООП) та функційне програмування (ФП)."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та скриптів) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють або блокують вміст сторінок під час виконання курсу.",
    "blocks": {
      "basic-javascript": {
        "title": "Основи JavaScript",
        "intro": [
          "JavaScript — це скриптова мова, яка використовується для того, аби зробити вебсайти інтерактивними. Це одна з основних технологій в мережі (разом з HTML та CSS), яка підтримується всіма сучасними браузерами.",
          "У цьому курсі ви вивчите головні поняття програмування в JavaScript. Ви почнете з простих структур даних, таких як числа та рядки. Далі ви почнете роботу з масивами, об’єктами, функціями, циклами, умовними конструкціями тощо."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, або ES — це стандартизована версія JavaScript. Оскільки більшість браузерів дотримуються цих стандартів, ECMAScript та JavaScript є взаємозамінними.",
          "Більша частина JavaScript (про яку ви вже дізналися) була в ES5 (ECMAScript 5), який утвердили у 2009 році. Поки ви все ще маєте можливість писати програми в ES5, JavaScript постійно розвивається і там щорічно вводяться нові функції.",
          "ES6, який випустили у 2015 році, додав багато нових потужних функцій до цієї мови. У курсі ви вивчите нові особливості, серед яких стрілкові функції, деструкція, класи, проміси та модулі."
        ]
      },
      "regular-expressions": {
        "title": "Регулярні вирази",
        "intro": [
          "Регулярні вирази (відомі як «regex» або «regexp») — шаблони, які допомагають програмістам поєднувати, шукати та замінювати текст. Регулярні вирази дуже важливі, але їх важко читати, оскільки у них використовуються спеціальні символи для створення складніших, гнучкіших поєднань.",
          "У цьому курсі ви дізнаєтеся як використовувати спеціальні символи, групи захоплення, позитивний та негативний огляди та інші техніки, аби текст відповідав бажаному."
        ]
      },
      "debugging": {
        "title": "Налагодження програм",
        "intro": [
          "Налагодження програм — це процес перевірки коду на наявність помилок та їх виправлення.",
          "Помилки в коді, як правило, розподіляють на три категорії: синтаксичні, які заважають вашій програмі працювати; помилки середовища виконання, коли ваш код поводиться непередбачувано; або логічні, коли ваш код не виконує свою функцію.",
          "У цьому курсі ви дізнаєтеся як використовувати консоль JavaScript, аби налагодити програми та уникнути розповсюджених помилок."
        ]
      },
      "basic-data-structures": {
        "title": "Основи структур даних",
        "intro": [
          "Багатьома способами можна зберегти дані та отримати до них доступ. Ви вже знаєте деякі загальні структури даних JavaScript — масиви та об’єкти.",
          "У курсі «Основи структур даних» ви дізнаєтеся більше про різницю між масивами та об’єктами, та в яких ситуаціях вони використовуються. Ви також дізнаєтеся як використовувати корисні методи JS, такі як <code>splice()</code> та <code>Object.keys()</code>, аби отримати доступ до даних та маніпулювати ними."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Основи написання алгоритмів",
        "intro": [
          "Алгоритм — це ряд покрокових інструкцій, які описують як щось робити.",
          "Написання успішного алгоритму допомагає розбити задачу на менші частини та гарно подумати над тим, як вирішити кожну частину за допомогою коду.",
          "У цьому курсі ви вивчите основи алгоритмічного мислення, пишучи алгоритми, які роблять усе: від перетворення температур до користування складними 2D масивами."
        ]
      },
      "object-oriented-programming": {
        "title": "Об’єктноорієнтоване програмування",
        "intro": [
          "ООП, або об’єктноорієнтоване програмування — це один з основних підходів до процесу розробки програмного забезпечення. Об’єкти та класи в ООП впорядковують код для опису будь-чого і того, що воно виконує.",
          "У цьому курсі ви вивчите основні принципи ООП в JavaScript, включно з ключовим словом <code>this</code>, прототипами ланцюгів, конструкторами та наслідуванням."
        ]
      },
      "functional-programming": {
        "title": "Функційне програмування",
        "intro": [
          "Функційне програмування — це ще один популярний підхід до розробки програмного забезпечення. У функційному програмуванні код впорядкований у менші, прості функції, які можна об’єднувати для створення складних програм.",
          "У цьому курсі ви вивчите основні поняття функційного програмування, включно з чистими функціями, як уникнути мутацій і як писати чистіший код за допомогою методів, таких як <code>.map()</code> і <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Написання алгоритмів середньої складності",
        "intro": [
          "Тепер, коли ви знаєте основи алгоритмічного мислення, разом з ООП та функційним програмуванням, перевірте свої вміння у написанні алгоритмів середньої складності."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "Проєкти «Алгоритми JavaScript та структури даних»",
        "intro": [
          "Тепер настав час випробувати свої навички роботи з JavaScript на практиці. Ці проєкти подібні до тестів з написання алгоритмів, які ви вже робили, але складніші.",
          "Виконайте п’ять проєктів JavaScript, аби отримати сертифікацію «Алгоритми JavaScript та структури даних»."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "Алгоритми JavaScript та структури даних (бета-версія)",
    "intro": [
      "Розробники використовують HTML та CSS, щоб контролювати вміст та стилізувати сторінку, а JavaScript — щоб зробити цю сторінку інтерактивною.",
      "У сертифікації «Алгоритми JavaScript та структури даних» ви вивчите основи JavaScript, включно зі змінними, масивами, об’єктами, циклами, функціями, об’єктною моделлю документа та багато іншого.",
      "Ви також вивчите об’єктноорієнтоване програмування, функціональне програмування, алгоритмічне мислення, способи роботи з локальним сховищем і отримання даних з API."
    ],
    "note": "Примітка: деякі розширення браузера (наприклад, блокувальники реклами та скриптів) можуть втручатися в тести. Якщо ви зіткнулися з подібною проблемою, ми рекомендуємо вимкнути розширення, які змінюють або блокують вміст сторінок під час виконання курсу.",
    "blocks": {
      "build-a-pokemon-search-app-project": {
        "title": "Проєкт «Створіть застосунок Pokémon Search»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите застосунок з пошуку покемонів."
        ]
      },
      "build-a-cash-register-project": {
        "title": "Проєкт «Створіть касовий апарат»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите вебзастосунок касового апарату."
        ]
      },
      "build-a-palindrome-checker-project": {
        "title": "Проєкт «Створіть перевірку паліндрома»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите застосунок, який перевіряє, чи дане слово є паліндромом."
        ]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Проєкт «Створіть конвертер римських чисел»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите застосунок, який конвертує цілі числа в римські."
        ]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Проєкт «Створіть валідатор мобільного номера»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите застосунок, який перевіряє, чи мобільний номер є дійсним номером США."
        ]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Вивчіть основи JavaScript, створивши рольову гру",
        "intro": [
          "JavaScript — це потужна скриптова мова, яку використовують, щоб зробити вебсайти інтерактивними. Це одна з основних технологій в мережі (разом з HTML та CSS), яка підтримується всіма сучасними браузерами.",
          "У цьому практичному проєкті ви вивчите основні поняття програмування на JavaScript, створивши власну рольову гру. Ви навчитеся працювати з масивами, рядками, об’єктами, функціями, циклами, інструкціями <code>if/else</code> тощо."
        ]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Вивчіть валідацію форм, створивши лічильник калорій",
        "intro": [
          "Іноді при створенні вебзастосунків потрібно працювати з введенням користувача. У цьому проєкті з підрахунку калорій ви навчитеся обробляти введення користувача, виконувати обчислення на основі цього введення та динамічно оновлювати інтерфейс для відтворення результатів.",
          "У цьому практичному проєкті ви вивчите основні регулярні вирази, шаблонні літерали, метод <code>addEventListener()</code> та багато іншого."
        ]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Вивчіть функційне програмування, створивши електронну таблицю",
        "intro": [
          "Функційне програмування — це популярний підхід до розробки програмного забезпечення. У функційному програмуванні код впорядкований у менші функції, які можна об’єднати для створення складних програм.",
          "У цьому проєкті зі створення застосунку з таблицями ви дізнаєтесь про парсинг та обчислення математичних виразів, реалізацію функцій таблиць, обробку посилань на комірки та створення інтерактивних вебінтерфейсів. Ви дізнаєтесь, як динамічно оновити сторінку на основі введення користувача.",
          "У цьому проєкті охоплено різні поняття, серед яких методи <code>map()</code>, <code>find()</code> й <code>includes()</code> та функція <code>parseInt()</code>."
        ]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Вивчіть сучасні методи JavaScript, створивши карточки футбольних команд",
        "intro": [
          "Один із загальних аспектів створення вебзастосунків — обробка наборів даних та виведення інформації на екран. У проєкті з картками спортивних команд ви дізнаєтесь, як працювати з маніпулюванням DOM, деструктуризацією об’єктів, обробкою подій та фільтрацією даних.",
          "Цей проєкт охоплює різні поняття, серед яких параметри за замовчуванням та <code>Object.freeze()</code>, а також допоможе закріпити ваші знання з інструкції <code>switch</code> і методу <code>map()</code>."
        ]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Вивчіть передові методи масиву, створивши статистичний калькулятор",
        "intro": [
          "Ви розвиваєте навички володіння JavaScript, а отже потрібно розібратись з методами маніпулювання масивами, серед яких <code>map()</code>, <code>reduce()</code> та <code>filter()</code>.",
          "У цьому проєкті зі створення статистичного калькулятора ви здобудете досвід роботи з введення користувача, маніпулювання DOM та ланцюжкових методів, виконуючи статистичні обчислення середнього значення, медіани, моди, дисперсії та стандартного відхилення."
        ]
      },
      "learn-basic-oop-by-building-a-shopping-cart": {
        "title": "Вивчіть основи ООП, створивши список покупок",
        "intro": [
          "ООП, або об’єктноорієнтоване програмування — це один з основних підходів до процесу розробки програмного забезпечення. Розробники використовують об’єкти та класи, щоб впорядкувати код в ООП.",
          "У цьому проєкті зі списком покупок ви дізнаєтесь, як визначити класи та використати їх. Ви створите екземпляри класу та впровадите методи для маніпуляцій даними.",
          "Цей проєкт охопить такі поняття, як тернарний оператор, оператор розширення, ключове слово <code>this</code> та інше."
        ]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Вивчіть фетч та проміси, створивши сторінку автора fCC",
        "intro": [
          "Один із загальних аспектів веброзробки, якого потрібно навчитись — отримувати дані від зовнішнього API, а потім працювати з асинхронним JavaScript.",
          "Цей проєкт зі сторінкою авторів freeCodeCamp покаже, як використовувати метод fetch, а потім оновити DOM, щоб відтворити отримані дані.",
          "Цей проєкт також навчить, як робити навігацію даних, щоб ви могли завантажувати результати партіями."
        ]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Вивчіть регулярні вирази, створивши спам-фільтр",
        "intro": [
          "Регулярні вирази (відомі як «regex» або «regexp») — шаблони, які допомагають програмістам поєднувати, шукати та замінювати текст. Регулярні вирази надзвичайно потужні, але їх важко зрозуміти, оскільки у них використовуються спеціальні символи.",
          "У цьому проєкті з фільтрування спаму ви дізнаєтеся про групи захоплення, позитивний та негативний огляди, а також інші техніки, щоб текст відповідав бажаному."
        ]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Вивчіть базове алгоритмічне мислення, створивши сортувальник чисел",
        "intro": [
          "У галузі комп’ютерних наук існують основні алгоритми сортування, які всі розробники повинні вивчити. У цьому проєкті з сортування чисел ви навчитеся реалізовувати та візуалізувати різні алгоритми сортування, серед яких сортування бульбашкою, сортування вибором та сортування вставками з використанням JavaScript.",
          "Цей проєкт допоможе зрозуміти основні поняття за цими алгоритмами та як їх можна застосувати для сортування числових даних у вебзастосунках."
        ]
      },
      "review-algorithmic-thinking-by-building-a-dice-game": {
        "title": "Повторіть алгоритмічне мислення, створивши гру з кубиками",
        "intro": [
          "Алгоритмічне мислення передбачає здатність розбивати складні завдання на чітко визначені кроки.",
          "У проєкті зі створення гри з кубиками ви дізнаєтесь, як керувати станом гри та реалізуєте логіку гри, щоб викидати кубики, зберігати бали й застосовувати правила для різних комбінацій.",
          "Цей проєкт охоплює обробку подій, маніпулювання масивами, умовну логіку та динамічне оновлення інтерфейсу користувача на основі стану гри."
        ]
      },
      "learn-intermediate-oop-by-building-a-platformer-game": {
        "title": "Вивчіть проміжне ООП, створивши платформну гру",
        "intro": [
          "Створення ігор — чудовий спосіб засвоїти основні принципи програмування, ще й під час здобуття інтерактивного ігрового досвіду.",
          "У проєкті зі створення платформної гри ви продовжите вивчати класи, об’єкти, успадкування та інкапсуляцію. Ви також навчитеся ефективно проєктувати та організовувати елементи гри, отримаєте уявлення про розв’язання проблем та можливість повторного використання коду."
        ]
      },
      "learn-localstorage-by-building-a-todo-app": {
        "title": "Вивчіть localStorage, створивши застосунок зі списком справ",
        "intro": [
          "Локальне сховище — це функція вебпереглядача, яка дозволяє вебзастосункам зберігати пари ключ-значення в браузері користувача. Воно також дозволяє зберігати дані протягом одного сеансу та використовувати їх в наступному.",
          "У цьому застосунку для списку справ ви навчитеся обробляти введення форми, управляти локальним сховищем, виконувати операції CRUD (створення, читання, оновлення, видалення) на завданнях, реалізовувати слухачів подій та перемикати елементи інтерфейсу користувача."
        ]
      },
      "learn-the-date-object-by-building-a-date-formatter": {
        "title": "Вивчіть об’єкт Date, створивши форматувальник дат",
        "intro": [
          "При роботі з датами в JavaScript ви можете зіткнутися з викликами, оскільки доведеться орієнтуватися у різних методах, форматах і часових поясах. У цьому проєкті ви дізнаєтесь, як працювати з об’єктом Date в JavaScript, включно з його методами та властивостями, а також навчитеся форматувати дати.",
          "Цей проєкт охоплює такі поняття, як методи <code>getDate()</code>, <code>getMonth()</code> та <code>getFullYear()</code>."
        ]
      },
      "learn-asynchronous-programming-by-building-an-fcc-forum-leaderboard": {
        "title": "Вивчіть асинхронне програмування, створивши таблицю лідерів форуму fCC",
        "intro": [
          "JavaScript — це асинхронна мова програмування. Цей проєкт допоможе розібратись з асинхронними поняттями. Ви створите власну таблицю лідерів форуму freeCodeCamp.",
          "Цей проєкт охопить Fetch API, проміси, Async/Await та інструкцію try..catch."
        ]
      },
      "learn-basic-string-and-array-methods-by-building-a-music-player": {
        "title": "Вивчіть базові методи рядка та масиву, створивши музичний програвач",
        "intro": [
          "Тепер вивчимо основні методи рядка та масиву, серед яких <code>find()</code>, <code>forEach()</code>, <code>map()</code> та <code>join()</code>. Ці методи відіграють важливу роль для розробки динамічних вебзастосунків.",
          "У цьому проєкті ви створите MP3-плеєр за допомогою HTML, CSS та JavaScript. Цей проєкт охоплює ключові поняття, серед яких обробка відтворення аудіо, управління плейлистом, реалізація функцій програвання, паузи, наступної пісні та перемішування. Ви навіть дізнаєтесь, як динамічно оновити інтерфейс користувача на основі поточної пісні."
        ]
      },
      "learn-recursion-by-building-a-decimal-to-binary-converter": {
        "title": "Вивчіть рекурсію, створивши конвертер десяткових чисел в бінарні",
        "intro": [
          "Рекурсія — це таке поняття в програмуванні, коли функція викликає сама себе. Це може перетворити складне завдання на декілька менших простіших завдань, допоки вони не стануть зрозумілими.",
          "У цьому проєкті ви побудуєте конвертер десяткових чисел в бінарні за допомогою JavaScript. Ви вивчите основні поняття рекурсії, дослідите стек викликів та побудуєте візуальне представлення процесу рекурсії через анімацію."
        ]
      },
      "learn-introductory-javascript-by-building-a-pyramid-generator": {
        "title": "Вивчіть основи JavaScript, створивши генератор пірамід",
        "intro": [
          "JavaScript — це потужна скриптова мова, яку використовують, щоб зробити вебсайти інтерактивними. Це одна з основних технологій в мережі (разом з HTML та CSS), яка підтримується всіма сучасними браузерами.",
          "У цьому практичному проєкті ви вивчите основні поняття програмування на JavaScript, створивши власний генератор пірамід. Ви навчитеся працювати з масивами, рядками, функціями, циклами, інструкціями <code>if/else</code> тощо."
        ]
      },
      "review-js-fundamentals-by-building-a-gradebook-app": {
        "title": "Повторіть основи JavaScript, створивши журнал з оцінками",
        "intro": [
          "У цьому мініпроєкті ви зможете повторити основи JavaScript, серед яких функції, змінні, інструкції та багато іншого, створивши застосунок з журналом оцінювання.",
          "Це дозволить розв’язувати невеликі проблеми та краще розуміти базові поняття."
        ]
      },
      "learn-basic-debugging-by-building-a-random-background-color-changer": {
        "title": "Вивчіть базове налагодження, створивши перемикач фонового кольору",
        "intro": [
          "Налагодження програм — це процес перевірки коду на наявність помилок та їх виправлення.",
          "У цьому проєкті ви допоможете CamperBot побудувати перемикач фонового кольору, а також допоможете йому знаходити та налагоджувати помилки."
        ]
      },
      "review-dom-manipulation-by-building-a-rock-paper-scissors-game": {
        "title": "Повторіть маніпуляцію DOM, створивши гру «Камінь, ножиці, папір»",
        "intro": [
          "У попередніх проєктах ви навчились працювати з базовою маніпуляцією DOM. Тепер настав час це все повторити, створивши гру «Камінь, ножиці, папір».",
          "У цьому мініпроєкті ви пригадаєте інструкції, функції, <code>getElementById</code> та багато іншого. Це дозволить розв’язувати невеликі проблеми та краще розуміти базові поняття."
        ]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Бібліотеки Front End",
    "intro": [
      "Тепер, коли ви вже знайомі з HTML, CSS та JavaScript, піднімімо ваш рівень навичок, вивчаючи декілька найбільш популярних бібліотек верстки в галузі.",
      "У сертифікації «Бібліотеки Front End» ви навчитеся швидко стилізувати свій сайт за допомогою Bootstrap. Також ви навчитеся покращувати свої стилі CSS та розширювати їх за допомогою Sass.",
      "Згодом ви розробите кошик для покупок та інші застосунки, щоб навчитися створювати потужні односторінкові застосунки (SPAs) з React та Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap — це front end каркас, створений для проєктування адаптивних вебсторінок та застосунків. Для веброзробки цей фреймворк використовує принцип Mobile First та включає попередньо інтегровані стилі, класи CSS і деякі функціональності JavaScript.",
          "Під час цього курсу ви навчитеся створювати адаптивні вебсайти за допомогою Bootstrap та використовувати готові шаблони для стилізації кнопок, зображень, форм, навігації та інших поширених елементів."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery — одна з найпопулярніших у світі бібліотек JavaScript.",
          "До її запуску у 2006 році, кожний браузер використовував JavaScript по-своєму. jQuery спростила роботу з JavaScript для користувачів, а також забезпечила кросбраузерність створених кодів.",
          "Під час цього курсу ви навчитеся використовувати jQuery для виділення, вилучення, копіювання та редагування різних елементів на сторінці."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, або «Syntactically Awesome StyleSheets» — це мовне розширення CSS, що містить функції, яких немає у базовому CSS, і тим самим допомагає спростити створення таблиць стилів для ваших проєктів.",
          "У цьому курсі ви навчитеся зберігати дані у змінних, вкладати CSS, створювати багаторазові стилі за допомогою міксин, додавати умовні конструкції та цикли до своїх стилів тощо."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React — це популярна бібліотека JavaScript для створення багаторазових компонентних користувацьких інтерфейсів для вебсторінок або застосунків.",
          "React поєднує HTML з функціями JavaScript, формуючи власну мову розмітки під назвою JSX. React також дозволяє легко керувати потоком даних у всьому застосунку.",
          "У цьому курсі ви навчитеся створювати різні компоненти React, керувати даними за допомогою пропсів, а також застосовувати різні методи життєвого циклу, такі як <code>componentDidMount</code> тощо."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "Зі збільшенням розмірів та кількості застосунків, керувати спільними даними стає все складніше. Redux називають «відкритою JS бібліотекою призначеною для управління станом програм JavaScript», яка забезпечує належну роботу ваших програм і спрощує тестування.",
          "Хоча ви можете використовувати його з будь-якою іншою бібліотекою, ми лише коротко розповімо про Redux, а тоді об’єднаємо його з React у наступному наборі курсів.",
          "Під час цього курсу ви вивчите базову інформацію про сховища, дії, редуктори та проміжне програмне забезпечення Redux для керування даними у своєму застосунку."
        ]
      },
      "react-and-redux": {
        "title": "React та Redux",
        "intro": [
          "React часто використовують разом із Redux, і не дарма. Redux і React створив один програміст, який хотів зробити процес передачі даних між компонентами простішим.",
          "Тепер коли ви вже навчились керувати загальними даними за допомогою Redux, ви можете виконувати дії в React. На курсах React і Redux, ви навчитесь будувати компонент React і дізнаєтесь, як локально керувати станом на рівні компонента, та й у цілому застосунку, за допомогою Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Проєкти «Бібліотеки Front End»",
        "intro": [
          "Прийшов час протестувати ваші навички роботи з бібліотеками front end розробки. Використайте Bootstrap, jQuery, Sass, React та Redux, аби створити 5 проєктів, які перевірять ваші знання з усього, що ви вивчили дотепер.",
          "Виконайте п’ять проєктів та отримайте сертифікацію «Бібліотеки Front End»."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Візуалізація даних",
    "intro": [
      "Дані повсюди, але це не означає, що більшість з них без форми чи контексту.",
      "У сертифікації «Візуалізація даних» ви створите діаграми, графіки та карти, що показують різні типи даних, за допомогою бібліотеки D3.js.",
      "Ви також дізнаєтесь про JSON (JavaScript Object Notation) та як працювати з даними онлайн, користуючись API (Application Programing Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Візуалізація даних з D3",
        "intro": [
          "D3, або D3.js, розшифровується як «Data Driven Documents». Це бібліотека JavaScript для створення функціональної та інтерактивної візуалізації даних у браузері.",
          "D3 створено для роботи з поширеними вебстандартами, а саме: HTML, CSS і SVG (масштабована векторна графіка).",
          "D3 підтримує багато різних форматів даних. Тому, використовуючи її потужні вбудовані методи, ви можете перетворити ці дані у різні діаграми, графіки та карти.",
          "У курсі «Візуалізація даних з D3» ви навчитеся працювати з даними, аби створювати різні діаграми, графіки, елементи наведення та інші складові частини, аби створити динамічну та принадну візуалізацію даних."
        ]
      },
      "json-apis-and-ajax": {
        "title": "JSON API та AJAX",
        "intro": [
          "Так само як інтерфейс користувача (UI) допомагає людям користуватися програмами, API (Application Programming Interfaces) також допомагає програмам взаємодіяти між собою. API — це інструменти, які використовуються комп’ютерами для комунікування один з одним, і, частково, для надсилання та отримання даних.",
          "Програмісти часто використовують AJAX (Asynchronous JavaScript and XML) при роботі з API. AJAX належить до групи технологій, які роблять асинхронні запити до сервера для передачі даних, а потім завантажують будь-які отримані дані до сторінки. І дані, що були передані між браузером і сервером, часто мають формат JSON (JavaScript Object Notation).",
          "Цей курс навчить вас основ роботи з API та різними технологіями AJAX в браузері."
        ]
      },
      "data-visualization-projects": {
        "title": "Проєкти «Візуалізація даних»",
        "intro": [
          "Ви дізналися як працювати з технологіями D3, APIs та AJAX, тому перевірте свої навички завдяки тесту з п’яти проєктів візуалізації даних.",
          "У цих проєктах вам потрібно буде отримати й проаналізувати набір даних, тоді використати D3 для створення різної візуалізації даних. Завершіть усі проєкти, аби отримати сертифікацію «Візуалізація даних»."
        ]
      },
      "d3-dashboard": {
        "title": "Інформаційна панель D3",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Реляційна база даних",
    "intro": [
      "У цих курсах ви використовуватимете реальні інструменти розробника та програмне забезпечення, включно з VS Code, PostgreSQL та командним рядком Linux / Unix для завершення інтерактивних уроків і створення проєктів.",
      "Ці курси починаються з основних команд Bash. За допомогою терміналу ви навчитеся усього необхідного (від навігації та маніпуляції файловою системою, написання скрипту в Bash до просунутого використання).",
      "Далі ви навчитеся створювати та використовувати реляційну базу даних з PostgreSQL (система керування базами даних) та SQL (мова баз даних).",
      "Зрештою, ви дізнаєтеся про Git, систему контролю версій, важливий інструмент кожного розробника."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "База даних «Небесні тіла»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте базу даних небесних тіл, використовуючи PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Гра «Вгадай число»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви використовуватимете сценарії Bash, PostgreSQL та Git, щоб створити гру з вгадуванням чисел, яка запускається в терміналі та зберігає інформацію користувача."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "База даних «Періодична таблиця»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите Bash-скрипт, щоб отримати інформацію про хімічні елементи з бази даних періодичної таблиці."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Планувальник «Записи в салоні»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите інтерактивну програму Bash, яка використовує PostgreSQL для відстеження клієнтів і зустрічей у вашому салоні."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "База даних «Чемпіонат світу»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите скрипт Bash, який вводить інформацію з ігор чемпіонату світу в PostgreSQL, а потім запитує базу даних для отримання статистики."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Вивчіть прогресивний Bash, створивши перекладач Kitty Ipsum",
        "intro": [
          "У командах Bash більше, ніж ви могли собі уявити.",
          "У цьому курсі з 140 уроків ви дізнаєтеся про деякі складніші команди, а також детально дізнаєтеся як вони працюють."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Вивчіть Bash та SQL, створивши магазин прокату велосипедів",
        "intro": [
          "У цьому курсі з 210 уроків ви створите інтерактивну програму Bash, яка зберігатиме інформацію про оренду для вашого магазину прокату велосипедів, використовуючи PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Вивчіть Bash, створивши шаблонний код",
        "intro": [
          "Термінал дозволяє відправляти текстові команди на ваш комп’ютер, які можуть маніпулювати файловою системою, запускати програми, автоматизувати завдання та багато іншого.",
          "У цьому курсі з 170 уроків ви вивчите команди терміналу, створивши шаблонний код вебсайту, використовуючи лише командний рядок."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Вивчіть скрипт Bash, створивши п’ять програм",
        "intro": [
          "Скрипти Bash поєднують команди терміналу та логіку в програми, які можуть виконувати або автоматизувати завдання та багато іншого.",
          "У цьому курсі з 220 уроків ви вивчите більше про команди терміналу та як їх використовувати в скриптах Bash, створивши п’ять невеликих програм."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Вивчіть Git, створивши об’єкт SQL",
        "intro": [
          "Git — це система контролю версій, яка відстежує усі зміни, внесені вами до свого коду.",
          "У цьому курсі з 240 уроків ви вивчите як Git відстежує ваш код, створюючи об’єкт, що містить часто використовувані команди SQL."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Вивчіть Nano, створивши замок",
        "intro": [
          "Nano — це програма, яка дозволяє редагувати файли одразу в терміналі.",
          "У цьому курсі з 40 уроків ви вивчите як редагувати файли в терміналі за допомогою Nano під час будівництва замку."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Вивчіть реляційні бази даних, створивши базу даних «Mario»",
        "intro": [
          "Реляційна база даних організовує дані в таблиці, які пов’язані між собою через спорідненість.",
          "В цьому курсі з 165 уроків ви вивчите основи реляційної бази даних, створивши базу даних PostgreSQL, наповнену персонажами з відеоігор."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Вивчіть SQL, створивши студентську базу даних (частина 1)",
        "intro": [
          "SQL, або Structured Query Language (мова структурованих запитів) — це мова для спілкування з реляційною базою даних.",
          "В цьому курсі з 140 уроків ви створите скрипт Bash, який використовує SQL для введення інформації про ваших студентів з науки про дані в PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Вивчіть SQL, створивши студентську базу даних (частина 2)",
        "intro": [
          "Команди об’єднання SQL використовуються, щоб поєднати інформацію з кількох таблиць у реляційній базі даних",
          "У цьому курсі з 140 уроків ви завершите свою базу даних студентів, глибше занурившись в команди SQL."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Розробка Back End та API",
    "intro": [
      "До цього моменту ви використовували JavaScript тільки для front end, аби зробити вебсторінку інтерактивнішою, розв’язати завдання з алгоритмами, або створити SPA. Але JavaScript можна використовувати й у back end, або на сервері, для створення цілих вебзастосунків.",
      "Сьогодні один із найпопулярніших способів створення застосунків — за допомогою мікрослужб, які є маленькими модульними застосунками та разом формують єдине ціле.",
      "У сертифікації «Розробка Back End та API» ви навчитеся писати back end програми за допомогою Node.js та npm. Ви також створите вебзастосунок за допомогою фреймворку Express та мікрослужбу для пошуку людей за допомогою MongoDB і бібліотеки Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Керування пакетами з NPM",
        "intro": [
          "npm (Node Package Manager) — це інструмент командного рядка для встановлення, створення та поширення пакетів коду JavaScript, написаного для Node.js. На npm знаходиться багато пакетів з відкритим вихідним кодом, тому спершу ретельно їх вивчіть, щоб вам не довелося виправляти помилки під час роботи з даними чи отримання даних з API.",
          "У цьому курсі ви вивчите основи використання npm, включно з тим як працювати із <code>package.json</code> та як керувати встановленими залежностями."
        ]
      },
      "basic-node-and-express": {
        "title": "Основи Node та Express",
        "intro": [
          "Node.js — це середовище виконання JavaScript, що дозволяє розробникам писати back end (серверні) програми в JavaScript. Node.js має кілька вбудованих модулів (маленьких незалежних програм), які допомагають з цим. Деякі з основних модулів містять HTTP, який працює на зразок сервера, і файлову систему (модуль для читання і редагування файлів).",
          "В останній групі курсів ви навчилися встановлювати та керувати пакетами npm, які є скупченнями менших модулів. Ці пакети можуть допомогти вам створити більші, складніші застосунки.",
          "Express — це спрощений фреймворк вебзастосунків та один з найбільш популярних пакетів на npm. Express значно полегшує створення сервера та керування маршрутизацією вашого застосунку, що відповідає за такі речі, як перенаправлення людей до потрібної сторінки, коли вони відвідують певну кінцеву точку (наприклад, <pre>/blog</pre>).",
          "У цьому курсі ви дізнаєтесь основи Node та Express, включно з тим, як створювати сервер, обслуговувати різні файли та обробляти різні запити з браузера."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB та Mongoose",
        "intro": [
          "MongoDB — це програма бази даних, яка зберігає JSON документи (чи записи), які ви можете використати у своєму застосунку. На відміну від SQL, іншого типу бази даних, MongoDB — це нереляційна, або «NoSQL» база даних. Це означає, що MongoDB зберігає усі збірні дані в межах одного запису, замість того, щоб тримати їх у багатьох попередньо налаштованих таблицях, як у базі даних SQL.",
          "Moongoose — це популярний пакет npm для взаємодії з MongoDB. З Moongoose ви можете використовувати прості об’єкти JavaScript замість JSON, що полегшує роботу із MongoDB. Він також дозволяє створити нарис документів під назвою «схеми», щоб ви ненароком не зберегли хибний тип даних та не спричинили помилок.",
          "На курсах MongoDB та Mongoose ви вивчите основи роботи із постійними даними, враховуючи налаштування моделі, збереження, видалення та пошук документів у базі даних."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Проєкти «Розробка Back End та API»",
        "intro": [
          "Раніше ви мали справу з API, але тепер, коли ви знайомі із nmp, Node, Express, Mongo DB та Mongoose, прийшов час створити щось власне. Застосуйте усі отримані знання, щоб створити 5 окремих мікрослужб, які є меншими застосунками з обмеженими можливостями.",
          "Створивши їх, ви матимете 5 крутих мікрослужб API, якими можна похвалитися перед друзями, рідними чи потенційними роботодавцями. О, а ще новеньку сертифікацію «Розробка Back End та API»."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Забезпечення якості",
    "intro": [
      "Оскільки ваші програми чи вебзастосунки стають складнішими, ви захочете протестувати їх, щоб переконатися, що нові зміни не порушують початкові функції.",
      "У сертифікації «Забезпечення якості» ви дізнаєтесь як писати тести з Chai, щоб переконатись, що ваші застосунки працюють так, як ви очікуєте.",
      "Потім ви створите застосунок чату, щоб вивчити розширені концепції Node та Express. Ви також будете використовувати Pug як шаблонізатор, Passport для автентифікації та Socket.io для комунікування в режимі реального часу між сервером та підключеними клієнтами."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Забезпечення якості та тестування з Chai",
        "intro": [
          "Chai — це бібліотека тестування JavaScript, яка допомагає переконатись, що після внесення змін до коду ваша програма досі поводиться так, як ви очікуєте.",
          "Використовуючи Chai, ви зможете писати тести, які описують ваші програмні вимоги, та бачити чи ваш застосунок відповідає їм.",
          "У цьому курсі ви дізнаєтесь про припущення, глибоку рівність, правдивість, тестування API та інші основи тестування програм JavaScript."
        ]
      },
      "advanced-node-and-express": {
        "title": "Просунутий Node та Express",
        "intro": [
          "Настав час глибоко зануритися у Node.js та Express.js, створивши застосунок чату із системою входу.",
          "Щоб безпечно впровадити систему входу, вам потрібно буде дізнатися про автентифікацію. Це акт перевірки особи або процесу.",
          "У цьому курсі ви дізнаєтесь, як використовувати Passport для управління автентифікацією, Pug для створення шаблонів багаторазового використання для швидкого створення інтерфейсу та вебсокети для комунікування в реальному часі між клієнтами та сервером."
        ]
      },
      "quality-assurance-projects": {
        "title": "Проєкти «Забезпечення якості»",
        "intro": [
          "Тепер, коли ви добре розбираєтесь у frond end та back end, настав час застосувати всі навички та концепції, які ви вивчили до цього моменту. Ви створите 5 різних вебзастосунків і напишете тести для кожного, щоб переконатися чи вони працюють і обробляють всі можливі сценарії.",
          "Після завершення цих проєктів із забезпечення якості у вас буде ще 5 проєктів, а також нова сертифікація, якою можна похвалитись у портфоліо."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Наукові обчислення з Python (бета-версія)",
    "intro": [
      "Навчальна програма «Наукові обчислення з Python (бета-версія)» допоможе отримати навички аналізу та маніпулювання даними за допомогою Python — потужної та універсальної мови програмування. Ви вивчите ключові поняття, серед яких структури даних, алгоритми, об’єктноорієнтоване програмування, а також як виконувати складні обчислення за допомогою різноманітних інструментів.",
      "Цей комплексний курс ознайомить вас з основами наукових обчислень, включно зі структурами даних та алгоритмами."
    ],
    "note": "",
    "blocks": {
      "learn-string-manipulation-by-building-a-cipher": {
        "title": "Вивчіть маніпуляцію рядками, створивши шифр",
        "intro": [
          "Python — це потужна та популярна мова програмування, яку широко використовують для науки про дані, візуалізації даних, веброзробки, розробки ігор, машинного навчання та багатьох інших галузей.",
          "У цьому проєкті ви ознайомитеся з основними поняттями програмування на Python, серед яких змінні, функції, цикли та умовні інструкції. Ви використаєте їх для написання своїх перших програм."
        ]
      },
      "learn-how-to-work-with-numbers-and-strings-by-implementing-the-luhn-algorithm": {
        "title": "Навчіться працювати з числами та рядками, імплементувавши алгоритм Луна",
        "intro": [
          "Алгоритм Луна широко використовується для перевірки помилок у різних програмах (наприклад, щоб перевірити номер кредитної картки).",
          "Створивши цей проєкт, ви отримаєте досвід роботи з чисельними обчисленнями та маніпулюванням рядками."
        ]
      },
      "learn-list-comprehension-by-building-a-case-converter-program": {
        "title": "Вивчіть спискові вирази Python, створивши програму для зміни регістру",
        "intro": [
          "Спискові вирази — це спосіб створення нового списку Python з ітерабельних типів (списків, кортежів і рядків) без використання циклу for або методу списку .append().",
          "У цьому проєкті ви напишете програму, яка приймає рядок у верхньому або нижньому верблюдячому регістрі, а потім перетворює його у зміїний регістр.",
          "Проєкт складається з двох етапів: спочатку ви використаєте цикл for, щоб імплементувати програму. Потім ви дізнаєтесь, як використовувати спискові вирази замість циклу, щоб отримати ті ж результати."
        ]
      },
      "learn-regular-expressions-by-building-a-password-generator": {
        "title": "Вивчіть регулярні вирази, створивши генератор паролів",
        "intro": [
          "Модуль Python — це файл, який містить набір інструкцій та визначень, які можна використати у коді.",
          "У цьому проєкті ви навчитеся імпортувати модулі зі стандартної бібліотеки Python. Також ви дізнаєтесь, як використовувати регулярні вирази, створивши власну програму для генерації паролів."
        ]
      },
      "learn-algorithm-design-by-building-a-shortest-path-algorithm": {
        "title": "Вивчіть алгоритмічний дизайн, створивши алгоритм найкоротшого шляху",
        "intro": [
          "Алгоритми — це покрокові процедури, які розробники використовують для виконання розрахунків та розв’язання обчислювальних задач.",
          "У цьому проєкті ви дізнаєтеся, як використовувати функції, цикли, умовні інструкції та словникові вирази, щоб імплементувати алгоритм найкоротшого шляху."
        ]
      },
      "learn-recursion-by-solving-the-tower-of-hanoi-puzzle": {
        "title": "Вивчіть рекурсію, розгадавши головоломку Ханойської вежі",
        "intro": [
          "Рекурсія — це підхід до програмування, який дозволяє розв’язати обчислювальні задачі за допомогою невеликої кількості коду.",
          "У цьому проєкті ви почнете з підходу на основі циклів, щоб розв’язати математичну головоломку Ханойської вежі. Потім ви дізнаєтеся, як імплементувати рекурсивний розв’язок."
        ]
      },
      "learn-data-structures-by-building-the-merge-sort-algorithm": {
        "title": "Вивчіть структури даних, створивши алгоритм сортування злиттям",
        "intro": [
          "Алгоритм сортування злиттям — це алгоритм сортування, заснований на принципі «розділяй і володарюй».",
          "У цьому проєкті ви навчитеся взаємодіяти зі структурами даних, сортуючи список випадкових чисел за допомогою алгоритму сортування злиттям."
        ]
      },
      "learn-classes-and-objects-by-building-a-sudoku-solver": {
        "title": "Вивчіть класи та об’єкти, створивши розв’язувач судоку",
        "intro": [
          "Класи та об’єкти є важливими поняттями програмування. Ці інструменти об’єктноорієнтованого програмування допомагають розробникам з модульністю коду, абстракцією та читабельністю, а також сприяють повторному використанню.",
          "У цьому проєкті з розв’язувачем судоку ви дізнаєтесь, як використовувати класи та об’єкти, щоб створити сітку судоку та вирішити цю головоломку."
        ]
      },
      "learn-tree-traversal-by-building-a-binary-search-tree": {
        "title": "Вивчіть обхід дерева, створивши бінарне дерево пошуку",
        "intro": [
          "Бінарне дерево пошуку — це поширена структура даних, де дані впорядковані ієрархічно.",
          "У цьому проєкті ви дізнаєтесь, як сконструювати власне бінарне дерево пошуку і виконати серединний обхід. Також ви ознайомитеся з ключовими операціями (наприклад, вставка, пошук та видалення)."
        ]
      },
      "learn-lambda-functions-by-building-an-expense-tracker": {
        "title": "Вивчіть лямбда-функції, створивши трекер витрат",
        "intro": [
          "Завдяки лямбда-функціям можна написати невеликі одноразові функції у своєму коді.",
          "У цьому проєкті ви дослідите потужність лямбда-функцій, створивши трекер витрат. Кінцевий застосунок продемонструє, як можна використовувати лямбда-функції для ефективних і оптимізованих операцій."
        ]
      },
      "build-an-arithmetic-formatter-project": {
        "title": "Проєкт «Створіть арифметичний форматор»",
        "intro": ["Цей проєкт потрібно виконати, щоб отримати сертифікацію."]
      },
      "build-a-time-calculator-project": {
        "title": "Проєкт «Створіть калькулятор часу»",
        "intro": ["Цей проєкт потрібно виконати, щоб отримати сертифікацію."]
      },
      "build-a-budget-app-project": {
        "title": "Проєкт «Створіть застосунок для ведення бюджету»",
        "intro": ["Цей проєкт потрібно виконати, щоб отримати сертифікацію."]
      },
      "build-a-polygon-area-calculator-project": {
        "title": "Проєкт «Створіть калькулятор площі багатокутника»",
        "intro": ["Цей проєкт потрібно виконати, щоб отримати сертифікацію."]
      },
      "build-a-probability-calculator-project": {
        "title": "Проєкт «Створіть калькулятор вірогідностей»",
        "intro": ["Цей проєкт потрібно виконати, щоб отримати сертифікацію."]
      },
      "learn-interfaces-by-building-an-equation-solver": {
        "title": "Вивчіть інтерфейси, створивши розв’язувач рівнянь",
        "intro": [
          "Абстрактні класи дозволяють визначити формальні інтерфейси — а саме об’єкти, які виступають як шаблони для класів.",
          "У цьому проєкті ви дізнаєтесь, як реалізувати інтерфейс у Python, створивши просту програму для розв’язку рівнянь."
        ]
      },
      "learn-special-methods-by-building-a-vector-space": {
        "title": "Вивчіть спеціальні методи, створивши векторний простір",
        "intro": [
          "Спеціальні методи в Python викликаються у відповідь на конкретні операції та дозволяють налаштувати поведінку об’єктів у деталізований й ефективний спосіб.",
          "У цьому проєкті ви дослідите деякі з найпоширеніших спеціальних методів, вивчаючи вектори через створення векторного простору."
        ]
      },
      "learn-encapsulation-by-building-a-projectile-trajectory-calculator": {
        "title": "Вивчіть інкапсуляцію, створивши калькулятор траєкторії налітної частинки",
        "intro": [
          "Інкапсуляція — це основний принцип ООП, що базується на написанні коду, який обмежує прямий доступ до даних.",
          "У цьому проєкті ви відкриєте нові поняття, пов’язані з інкапсуляцією, серед яких гетери, сетери та спотворення імен, і використовуватимете їх разом з тим, що вже вивчили, щоб створити програму, яка обчислює траєкторію налітної частинки."
        ]
      },
      "learn-the-bisection-method-by-finding-the-square-root-of-a-number": {
        "title": "Вивчіть метод бісекції, знайшовши квадратний корінь числа",
        "intro": [
          "Числові методи використовують для наближеного розв‘язку математичних задач, які важко або неможливо розв’язати аналітично.",
          "У цьому проєкті ви дізнаєтесь про числовий метод бісекції, щоб знайти квадратний корінь числа, поступово звужуючи можливий діапазон його значень."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Аналіз даних з Python",
    "intro": [
      "Аналіз даних існує вже давно. Але ще кілька років тому розробники практикували його за допомогою дорогих інструментів із закритим кодом, таких як Tableau. Але нещодавно Python, SQL та інші відкриті бібліотеки назавжди змінили аналіз даних.",
      "У сертифікації «Аналіз даних з Python» ви дізнаєтесь про основи аналізу даних за допомогою Python. Наприкінці цієї сертифікації ви будете знати, як читати дані з таких джерел, як CSV та SQL, і як використовувати бібліотеки, такі як Numpy, Pandas, Matplotlib та Seaborn для обробки та візуалізації даних."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Аналіз даних з Python",
        "intro": [
          "У цих комплексних відеокурсах, створених Сантьяго Басульто, ви дізнаєтесь про весь процес аналізу даних. Ви будете зчитувати дані з різних джерел (CSV, SQL, Excel), обробляти ці дані за допомогою NumPy та Pandas і візуалізовувати їх за допомогою Matplotlib та Seaborn.",
          "Крім того, ми включили детальний курс по Jupyter Notebook та короткий довідник з Python, щоб оновити ваші навички програмування."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Вивчіть основи бібліотеки NumPy у наступному відеокурсі, створеному Кейтом Галлі.",
          "У цьому курсі ви дізнаєтесь, як працює NumPy і як він порівнюється із вбудованими списками Python. Ви також дізнаєтесь, як писати код з NumPy, індексувати, змінювати форму, застосовувати статистику та багато іншого."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Проєкти «Аналіз даних з Python»",
        "intro": [
          "Існує багато способів аналізу даних за допомогою Python. Завершивши ці проєкти, ви продемонструєте, що володієте хорошими фундаментальними знаннями аналізу даних, використовуючи Python.",
          "Завершіть всі проєкти, щоб отримати сертифікацію «Аналіз даних з Python»."
        ]
      }
    }
  },
  "information-security": {
    "title": "Інформаційна безпека",
    "intro": [
      "Завдяки всьому, що ми робимо в Інтернеті, величезна кількість конфіденційної інформації знаходиться в зоні ризику: електронні адреси, паролі, номери телефонів тощо.",
      "Завдяки сертифікації «Інформаційна безпека» ви створите безпечний вебзастосунок за допомогою HelmetJS, щоб вивчити основи захисту інформації людей в Інтернеті.",
      "Ви також створите TCP client, а ще Nmap і сканер портів у Python. Це допоможе вам вивчити основи тесту на проникнення — важливого компоненту надійної інформаційної безпеки."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Інформаційна безпека з HelmetJS",
        "intro": [
          "Цей курс програмування зосереджений на HelmetJS, типі проміжного програмного забезпечення для застосунків на основі Express, яке автоматично встановлює заголовки HTTP. Таким чином, він може запобігти випадковому передаванню конфіденційної інформації між сервером та клієнтом.",
          "Завершення курсів допоможе вам зрозуміти, як захистити свій сайт від зловмисної поведінки."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python для тесту на проникнення",
        "intro": [
          "Ці відеокурси навчать вас тесту на проникнення за допомогою Python. Також відомий як пен тест (pen test), тест на проникнення — це змодельована атака на систему задля перевірки на вразливі місця.",
          "У цьому курсі ви дізнаєтеся про сокети, створите TCP сервер та клієнт, створите Nmap сканер і інші інструменти та техніки, які пен тестувальники використовують щоденно."
        ]
      },
      "information-security-projects": {
        "title": "Проєкти «Інформаційна безпека»",
        "intro": [
          "Настав час перевірити ваші навички з інформаційної безпеки на практиці. Ці проєкти дадуть вам шанс застосувати всі набуті вміння, вивчені правила та поняття з інформаційної безпеки.",
          "Коли ви закінчите, у вас буде достатньо проєктів з інформаційної безпеки за плечима, разом з сертифікацією, якою ви можете похизуватись перед друзям, сім’єю та роботодавцями."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Машинне навчання з Python",
    "intro": [
      "Машинне навчання має багато практичних застосунків, які ви можете використовувати у своїх проєктах чи роботі.",
      "У сертифікації «Машинне навчання з Python» ви використовуватимете фреймворк TensorFlow, аби створити декілька нейронних мереж і вивчити складніші техніки, серед яких обробка природної мови й навчання з підкріпленням.",
      "Також ви зануритеся у нейронні мережі та вивчите правила, за якими працюють глибокі, рекурентні та згорткові нейронні мережі."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "TensorFlow",
        "intro": [
          "Tensorflow — це фреймворк з відкритим вихідним кодом, що полегшує використання машинного навчання та нейронних мереж.",
          "Наступний відеокурс був створений Тімом Рущіцею, також відомим як «Tech With Tim». Він допоможе зрозуміти TensorFlow і деякі з його потужних можливостей."
        ]
      },
      "how-neural-networks-work": {
        "title": "Як працюють нейронні мережі",
        "intro": [
          "Нейронні мережі лежать в основі того, що ми зараз називаємо штучним інтелектом. Але їх, як правило, складно зрозуміти. Особливо початківцям у галузі машинного навчання.",
          "Навіть якщо ви вперше зіштовхуєтеся з нейронними мережами, ці відеокурси Брендона Рорера навчать вас орієнтуватися у їхніх поняттях та підрахунках."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Проєкти «Машинне навчання з Python»",
        "intro": [
          "Машинне навчання може бути дуже корисним. Завершивши ці безоплатні складні проєкти з програмування, ви покажете, що маєте базові знання з машинного навчання й отримаєте сертифікацію «Машинне навчання з Python»."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "Алгебра з Python",
    "intro": [
      "Цей курс розроблений як односеместровий курс коледжу. Він складається з навчальних відео та блокнотів Google Colaboratory, за якими потрібно слідкувати протягом інтерактивів, завдань та проєктів.",
      "Під час проходження кожної частини курсу ви повністю зрозумієте алгебру та навчитесь писати код Python, який розв’язуватиме приклади.",
      "Протягом курсу ви також побудуєте блокнот Algebra Colab, який зможете використовувати як власний калькулятор. Цей курс (та код, який ви напишете) надасть вам основу, щоб краще зрозуміти математику та науку про дані."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Вивчіть співвідношення та пропорції",
        "intro": [
          "Тут починається ваша подорож. Ви дізнаєтесь, як налаштувати Colab Notebook, який може запускати код Python. Потім ви використовуватимете блокнот, щоб за допомогою відео вивчити співвідношення та пропорції з Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Вивчіть, як знайти Х",
        "intro": [
          "Ця тема фокусуватиметься на знаходженні невідомого числа (часто називається «х»), використовуючи алгебраїчні вирази та код Python."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Вивчіть дроби та десяткові числа",
        "intro": [
          "Ця тема зосереджуватиметься на перетворенні десяткових чисел у дроби та відсотки."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Вивчіть функції та графіки",
        "intro": ["Ця тема навчить вас математичних функцій."]
      },
      "learn-linear-functions": {
        "title": "Вивчіть лінійні функції",
        "intro": [
          "Ця тема покаже, як знайти рівняння прямої, що проходить через дві задані точки."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Вивчіть спільні множники та квадратні корені",
        "intro": [
          "У цій темі ви навчитесь знаходити спільні множники та скорочувати їх. Це буде корисно при спрощенні дробів та розкладанні квадратних коренів."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Багатофункціональний калькулятор",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте багатофункціональний калькулятор."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Вивчіть, як побудувати графік системи рівнянь",
        "intro": [
          "Ця тема фокусуватиметься на побудові графіку з двома рівняннями на одній координатній площині, де можна побачити перетин ліній."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Вивчіть, як розв’язувати системи рівнянь",
        "intro": [
          "У цій темі ви навчитесь розв’язувати систему з двох рівнянь (з двома змінними) без графіка. Ви побачите, як можна розкласти рівняння та розв’язати задану змінну в Python. Після цього ви зможете розв’язувати та будувати графік системи за допомогою одного блоку коду."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Дізнайтесь про прикладне застосування лінійних систем",
        "intro": [
          "У цій темі ви побачите, як можна використовувати вивчену алгебру для розв’язку завдань, пов’язаних з реальним світом."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Вивчіть квадратні рівняння",
        "intro": [
          "Ця тема виходить за межі лінійних рівнянь і зосереджується на піднесенні до степеня та побудові параболи. Ви навчитеся знаходити ключові точки на параболах і розв’язувати квадратні рівняння."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Графічний калькулятор",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте графічний калькулятор."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Вивчіть батьківські графіки та многочлени",
        "intro": [
          "Ця тема покаже багато різних видів «батьківських» графіків, тобто базових шаблонів, з яких створюються складніші графіки. Многочлени — це математичні вирази з декількома елементами, тобто складнішими членами. Ви побачите, як ці графіки виглядають, як їх змінити та як зробити це за допомогою Python."
        ]
      },
      "build-three-math-games-project": {
        "title": "Три математичні ігри",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте три математичні ігри."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Дізнайтесь про прикладне застосування алгебри у бізнесі",
        "intro": [
          "Ця тема покаже, як застосувати навички розв’язання та побудови графіків, щоб знайти витрати, дохід та прибуток. Ви напишете код, який створюватиме криву попиту з двох точок. Ви побачите, як ціна впливає на графік прибутку і те, як взаємодіють усі рівняння."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Вивчіть прості та складні відсотки",
        "intro": [
          "Ця тема покаже, як розрахувати відсотки, сплату позики та прогнозний розрахунок інвестицій. Ви побачите математичні формули та перетворите їх у код. Оскільки ці формули зазвичай складні, корисно мати код і лише змінювати значення."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Вивчіть піднесення до степеня та логарифми",
        "intro": [
          "Ця тема покаже, що піднесення до степеня та логарифми є оберненими функціями, які можна використовувати для різного застосування."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Фінансовий калькулятор",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте фінансовий калькулятор."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "Алгебра з Python: висновок",
        "intro": [
          "Це остання тема даного курсу. Поглянемо, як ви можете поєднати знання з математики та Python із зовнішніми даними."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Дослідник графіку даних",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте дослідник графіку даних."
        ]
      }
    }
  },
  "python-for-everybody": {
    "title": "Python для всіх (застаріла версія)",
    "intro": [
      "Python — одна з найпопулярніших гнучких мов програмування на сьогодні. Ви можете використовувати її для всього: від базових скриптів до машинного навчання."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python для всіх",
        "intro": [
          "Python для всіх — це безоплатна серія відеокурсів, яка вчить основам використання Python 3.",
          "Курси були створені Чарльзом Северансом (також відомим як Dr. Chuck). Він є професором школи інформації університету Мічигану, де викладає різні технологічні курси, включно з програмуванням, дизайном баз даних та веброзробкою."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Підготовка до співбесіди з програмування",
    "intro": [
      "Шукаєте безоплатні вправи з програмування, щоб підготуватися до наступної співбесіди? Ми про це подбали.",
      "Цей розділ містить сотні завдань з програмування, які перевіряють ваші знання алгоритмів, структур даних і математики. Тут також є декілька проєктів, які ви можете використати для зміцнення своїх навичок або просто додати до свого портфоліо."
    ],
    "note": "Проєкт Ейлера та Rosetta Code переміщені в окремі курси. Поверніться до навчальної програми, щоб побачити перелік всіх курсів.",
    "blocks": {
      "algorithms": {
        "title": "Алгоритми",
        "intro": [
          "Ці безоплатні вправи з програмування навчать вас загальних алгоритмів, з якими ви скоріш за все зіткнетеся в житті. Це чудова можливість вдосконалити як логіку, так і програмувальні навички.",
          "Подібні алгоритми часто використовують на співбесідах, щоб перевірити навички кандидатів. Ми чітко пояснимо, як саме функціонують різноманітні алгоритми, щоб ви могли підібрати рішення до кожного."
        ]
      },
      "data-structures": {
        "title": "Структура даних",
        "intro": [
          "Ці безплатні курси програмування спрямовані на те, щоб допомогти вам у роботі з численними структурами даних, з якими ви ще не стикалися.",
          "Під час роботи з цими курсами, ви вивчите кожний тип структур даних та реалізуєте алгоритми, щоб зрозуміти їх краще."
        ]
      },
      "take-home-projects": {
        "title": "Проєкти на самостійне опрацювання",
        "intro": [
          "Люди завжди нервують на співбесідах з програмування. Іноді, замість інтерв’ю, кандидатам можуть запропонувати створити проєкт вдома. Співбесіди такого типу часто передбачають виконання великого обсягу роботи, однак якнайкраще показують роботодавцям ваші здібності.",
          "Попрактикуйтеся створювати запропоновані нами проєкти. Не поспішайте, добре над ними попрацюйте та додайте до свого резюме чи портфоліо, щоб вразити потенційних роботодавців."
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "Проєкт «Odin»: версія freeCodeCamp (бета-версія)",
    "intro": [
      "Проєкт «Odin» був створений розробником Еріком Траутманом у 2013 році. Протягом років з’явилася відкрита спільнота, яка доглядає за проєктом та розширює його.",
      "freeCodeCamp розширив відкриту навчальну програму, щоб зробити її інтерактивною у браузері. Проєкт міститиме тести, щоб оцінити ваш код та переконатись, що ви зрозуміли основні поняття.",
      "Якщо ви хочете отримати оригінальний досвід налаштування проєкту на локальному комп’ютері, див. першоджерело проєкту на <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>The Odin Project</a>. Велика подяка спільноті проєкту «Odin» за підтримку цього цінного навчального ресурсу для розробників з усього світу.",
      "Цей курс неофіційний та не підтримується The Odin Project. До навчальної програми проєкту було внесено зміни, а весь навчальний матеріал курсу підлягає ліцензуванню <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; Проєкт «Odin»</a>",
      "Цей курс містить матеріал з <a href='javascript.info'>JavaScript.info</a>, що підлягає ліцензуванню <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>"
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Вивчіть основи HTML",
        "intro": [
          "Вивчіть основи HTML за допомогою цього курсу. Від структурування вебсторінок до розуміння семантичних тегів, ви побудуєте міцну основу для створення організованого та доступного контенту в мережі."
        ]
      },
      "top-working-with-text": {
        "title": "Робота з текстом",
        "intro": [
          "Дізнайтесь про складнощі роботи з текстом у веброзробці. Вивчіть форматування, маніпулювання та презентацію тексту, щоб покращити свої навички у створенні вебконтенту."
        ]
      },
      "top-links-and-images": {
        "title": "Посилання та зображення",
        "intro": [
          "Дізнайтеся, як використовувати посилання та зображення у вебпроєктах. Цей курс охоплює основи створення посилань та вбудовування зображень, щоб зробити вебсайт більш інтерактивним та візуально привабливим."
        ]
      },
      "top-build-a-recipe-project": {
        "title": "Вивчіть основи HTML, побудувавши сторінку з рецептами",
        "intro": [
          "Використайте свої навички HTML, створивши сторінку з рецептами. Цей практичний проєкт дозволяє застосувати отримані знання та створити функціональну вебсторінку, закріпивши ключові поняття розробки HTML."
        ]
      },
      "top-learn-css-foundations": {
        "title": "Вивчіть основи CSS",
        "intro": [
          "Зануртеся у світ каскадних таблиць стилів (CSS) та дізнайтесь, як стилізувати елементи HTML. Вивчіть властивості стилізації, селектори та макети, щоб оживити вебсторінки."
        ]
      },
      "top-learn-css-foundations-projects": {
        "title": "Проєкти «Вивчіть основи CSS»",
        "intro": [
          "Розвиньте свої навички CSS, працюючи над практичними проєктами. Цей курс надає практичний досвід застосування CSS для створення адаптивних дизайнів для реальних сценаріїв."
        ]
      },
      "top-learn-css-specificity": {
        "title": "Вивчіть специфічність CSS",
        "intro": [
          "Дослідіть специфічність CSS та отримайте краще розуміння того, як застосовувати стилі до елементів HTML. Цей курс навчає правил CSS, що допоможе написати ефективні та націлені стилі для вебсторінок."
        ]
      },
      "top-the-box-model": {
        "title": "Вивчіть блокову модель",
        "intro": [
          "Вивчіть блокову модель CSS завдяки цьому курсу. Дізнайтесь, як відтворюються елементи, та навчіться маніпулювати простором, кордонами та відступами, щоб досягти бажаного макету та дизайну."
        ]
      },
      "top-introduction-to-flexbox": {
        "title": "Вступ до Flexbox",
        "intro": [
          "Відкрийте для себе потужність Flexbox — моделі макету, яка спрощує проєктування гнучких та адаптивних вебмакетів. Навчіться створювати динамічні та адаптивні структури сторінок з легкістю."
        ]
      },
      "top-learn-block-and-inline": {
        "title": "Вивчіть блокові та рядкові елементи",
        "intro": [
          "Дослідіть відмінності між блоковими та рядковими елементами в HTML та CSS. Цей курс надасть уявлення про те, як такі відтворення впливають на макет та поведінку, що дозволить вам приймати обґрунтовані рішення у дизайні."
        ]
      },
      "top-learn-variables-and-operators": {
        "title": "Вивчіть змінні та оператори",
        "intro": [
          "Почніть знайомство з JavaScript зі змінних та операторів. Цей курс охоплює основи програмування на JavaScript, включно з типами даних, операторами та оголошенням змінних."
        ]
      },
      "top-learn-data-types-and-conditionals": {
        "title": "Вивчіть типи даних та умови",
        "intro": [
          "Дізнайтесь про типи даних та умовні інструкції в JavaScript."
        ]
      },
      "top-learn-function-basics": {
        "title": "Вивчіть основи функцій",
        "intro": ["Дізнайтесь про функції в JavaScript."]
      },
      "top-basic-function-projects": {
        "title": "Проєкти «Базові функції»",
        "intro": [
          "Випробуйте свої навички по JavaScript, побудувавши базові функції."
        ]
      },
      "top-learn-arrays-and-loops": {
        "title": "Вивчіть масиви та цикли",
        "intro": ["Дізнайтесь про масиви та цикли в JavaScript."]
      },
      "top-learn-to-solve-problems-and-understand-errors": {
        "title": "Навчіться розв’язувати проблеми та розуміти помилки",
        "intro": [
          "Дізнайтесь, як розв’язувати проблеми та розуміти помилки в JavaScript."
        ]
      },
      "top-build-a-rock-paper-scissors-game": {
        "title": "Побудуйте гру «Камінь-ножиці-папір»",
        "intro": [
          "Випробуйте свої навички по JavaScript, побудувавши гру «Камінь-ножиці-папір»."
        ]
      }
    }
  },
  "project-euler": {
    "title": "Проєкт Ейлера",
    "intro": [
      "Виконайте завдання з програмування з архівів проєкту Ейлера. Вони удосконалять ваші алгоритмічні та математичні знання.",
      "Тут є завдання різної складності, а для багатьох здобуття досвіду полягає в індуктивному методі навчання. Тобто вирішення одного завдання прояснить нову концепцію та дозволить вирішити раніше незрозуміле завдання. Чи під силу вам вирішити кожне?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Проєкт Ейлера. Завдання 1-100",
        "intro": [
          "У першому наборі завдань ви використовуватимете послідовність Фібоначчі, теорему про розподіл простих чисел та комбінаторику, щоб написати алгоритми для розв’язку завдань."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Проєкт Ейлера. Завдання 101-200",
        "intro": [
          "У цьому наборі завдань ви закріпите знання з першої частини курсу та використовуватимете обчислення вектора, трикутник Паскаля й алгоритм RSA, щоб розв’язати завдання."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Проєкт Ейлера. Завдання 201-300",
        "intro": [
          "У цьому наборі завдань ви продовжите розвивати навички з попередніх завдань та використовуватимете біном Ньютона, числа Гемінґа й послідовність Коллатца."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Проєкт Ейлера. Завдання 301-400",
        "intro": [
          "Тут ви продовжите працювати над своїми навичками, використовуючи комбінаторну теорію ігор, бітові операції та послідовність Ґоломба."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Проєкт Ейлера. Завдання 401-480",
        "intro": [
          "У кінцевому наборі завдань ви підкреслите свої знання та використовуватимете унітарні дільники, програму Капрекара та багато іншого, щоб розв’язати складні завдання."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "(Нове) Основи C# з Microsoft",
    "intro": [
      "Цей курс пропонує всебічне знайомство з мовою програмування C#, розглядаючи основні поняття, синтаксис та практичне застосування у розробці програмного забезпечення.",
      "Завдяки практичним вправам та проєктам ви вивчите основи C#, включно зі змінними, типами даних, структурами керування та принципами об’єктноорієнтованого програмування.",
      "Після завершення курсу ви отримаєте практичні навички та знання, необхідні для впевненого використання C# при побудові застосунків."
    ],
    "note": "Кожен розділ має трофей, пов’язаний з розділом, та який ви маєте отримати на навчальній платформі Microsoft. Після здобуття кожного трофею, їх потрібно підтвердити на freeCodeCamp. Після цього ви зможете скласти екзамен з сертифікації.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Написання першого коду за допомогою C#",
        "intro": [
          "Розпочніть подорож із написання коду на C#. Завдяки основам та синтаксису мови ви отримаєте хорошу базу, створивши підґрунтя для своїх пригод з програмування."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Створення та запуск простих консольних застосунків C#",
        "intro": [
          "Опануйте мистецтво створення та запуску звичайних консольних застосунків C#. Пориньте у світ консольного програмування, де ви отримаєте практичний досвід та побачите свій код у дії."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Додавання логіки до консольних застосунків C#",
        "intro": [
          "Розблокуйте потужність логіки у консольних застосунках C#. Дізнайтесь, як додати логіку та прийняття рішень до свого коду, що дозволить застосункам робити динамічний вибір та реагувати на різні сценарії."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Робота з даними змінних в консольних застосунках C#",
        "intro": [
          "Дізнайтесь більше про дані змінних у консольних застосунках C#. Приборкайте можливість зберігати та маніпулювати різними типами даних, серед яких числа й текст, ознайомившись з основними поняттями змінних та обробки даних."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Створення методів в консольних застосунках C#",
        "intro": [
          "Перенесіть власні консольні застосунки C# на новий рівень, опанувавши мистецтво створення методів. Дізнайтесь, як організувати та модуляризувати свій код, зробивши його слухнянішим та ефективнішим."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Налагодження консольних застосунків C#",
        "intro": [
          "Вдоскональте свої навички з усунення неполадок у консольних застосунках C#. Отримайте можливість визначити та розв’язати проблеми у своєму коді, забезпечуючи безперебійну роботу програм та бажані результати."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Екзамен з сертифікації «Основи C# з Microsoft»",
        "intro": [
          "Використайте набуті знання, щоб скласти екзамен та отримати сертифікацію «Основи C# з Microsoft»"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Майбутній Python",
    "intro": ["заповнювач"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Вивчіть Python, створивши гру «Блекджек»",
        "intro": ["Вивчіть Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Майбутній проєкт з Python",
        "intro": ["заповнювач"]
      }
    }
  },
  "a2-english-for-developers": {
    "title": "Англійська мова рівня A2 для розробників (бета-версія)",
    "note": "Сертифікація знаходиться в стані активної розробки. Наразі для цього розділу немає сертифіката, але він буде доступний найближчим часом. Тим часом ви можете дослідити курси, які ми вже створили.",
    "intro": [
      "У цьому курсі з вивчення англійської мови для розробників ви опануєте основи англійської комунікації. Курс створено відповідно до загальноєвропейських рекомендацій з мовної освіти рівня A2 (CEFR). Ми зосередилися на словниковому запасі, що є особливо корисним для розробників.",
      "Перша частина допоможе освоїти граматику та використання англійської мови. Ви виконаєте багато практичних вправ, дізнавшись основи (наприклад, представлення себе, проведення коротких розмов і обговорення роботи).",
      "У другій частині ви практикуватимете словниковий запас, специфічний для розробки програмного забезпечення. Ви навчитеся описувати код, обговорювати технологічні тенденції та брати участь у зустрічах.",
      "Весь курс рівня A2 складається з 105 різних діалогів. Кожен з них створений для того, щоб розширити ваш словниковий запас та підвищити впевненість під час спілкування в професійному середовищі."
    ],
    "blocks": {
      "learn-greetings-in-your-first-day-at-the-office": {
        "title": "Дізнайтесь про привітання в офісі першого робочого дня",
        "intro": [
          "У цьому курсі ви навчитеся поширених висловів для ситуацій, з якими можете зіткнутись у перший робочий день. Ви дізнаєтесь про представлення, знайомство з іншими людьми, спілкування під час перерви та отримання картки доступу."
        ]
      },
      "learn-introductions-in-an-online-team-meeting": {
        "title": "Дізнайтесь про знайомство на онлайн-зустрічі",
        "intro": [
          "У цьому курсі ви навчитеся представляти себе, а також вказувати свою професію та ділитися цілями на групових зустрічах."
        ]
      },
      "learn-conversation-starters-in-the-break-room": {
        "title": "Дізнайтесь про початок розмови в кімнаті відпочинку",
        "intro": [
          "У цьому курсі ви навчитеся розпочинати розмову в неформальних обставинах. Ви також дізнаєтеся, як говорити про свої хобі та особисті риси, і навіть навчитеся запитувати про місця у місті."
        ]
      },
      "learn-how-to-talk-about-a-typical-workday-and-tasks": {
        "title": "Дізнайтесь, як говорити про типовий робочий день та завдання",
        "intro": [
          "У цьому курсі ви навчитесь розповідати про свій робочий день і завдання, які виконуєте на роботі, а також як ділитися ними з іншими. Основний акцент зроблено на структурах, які використовують для опису діяльності, а також на словниковому запасі, пов’язаному з завданнями."
        ]
      },
      "learn-how-to-discuss-your-morning-or-evening-routine": {
        "title": "Дізнайтесь, як обговорювати ранкову або вечірню рутину",
        "intro": [
          "У цьому курсі ви навчитесь розповідати про свою щоденну рутину та ділитися нею з іншими. Основний акцент зроблено на структурах, які використовують для опису рутини, а також на словниковому запасі, пов’язаному з щоденними завданнями."
        ]
      },
      "learn-how-to-describe-your-current-project": {
        "title": "Дізнайтесь, як описувати поточний проєкт",
        "intro": [
          "У цьому курсі ви навчитесь розповідати про проєкти, в яких ви берете участь, та як інформувати інших про свою участь. Основний акцент зроблено на структурах, які використовують для інформування, а також на пов’язаному словниковому запасі."
        ]
      },
      "learn-how-to-ask-and-share-about-educational-and-professional-background": {
        "title": "Дізнайтесь, як запитувати та розповідати про освіту і досвід роботи",
        "intro": [
          "У цьому курсі ви дізнаєтесь, як запитувати про освіту та досвід роботи іншої людини, а також навчитесь ділитися інформацією про власний досвід."
        ]
      },
      "learn-how-to-talk-about-hobbies-and-interests": {
        "title": "Дізнайтесь, як говорити про хобі та захоплення",
        "intro": [
          "У цьому курсі ви навчитесь говорити про хобі та речі, які вас цікавлять. Ви також дізнаєтесь, як запитувати про захоплення інших людей та як запропонувати їм скласти компанію."
        ]
      },
      "learn-how-to-discuss-roles-and-responsibilies": {
        "title": "Дізнайтесь, як обговорювати посади та обов’язки",
        "intro": [
          "У цьому курсі ви обговорюватимете посади та обов’язки людей в компанії й поза нею. Ви дізнаєтеся, як запитувати про посади та обов’язки, а також як ділитися власною інформацією на цю тему."
        ]
      },
      "learn-how-to-have-a-conversation-about-preferences-and-motivations": {
        "title": "Дізнайтесь, як говорити про вподобання та вмотивованість",
        "intro": [
          "У цьому курсі ви дізнаєтесь, як запитувати про мотивацію в особистому і професійному житті, як відповідати на такі запитання та як обговорювати вподобання."
        ]
      },
      "learn-how-to-discuss-popular-trends-in-technology": {
        "title": "Дізнайтесь, як обговорювати технологічні тренди",
        "intro": [
          "У цьому курсі ви навчитеся обговорювати технології, про які зараз всі говорять."
        ]
      },
      "learn-how-to-clarify-information-in-different-interactions": {
        "title": "Дізнайтесь, як уточнити інформацію в різних ситуаціях",
        "intro": [
          "У цьому курсі ви навчитеся перевіряти інформацію та правильно просити уточнення, якщо щось не зрозуміло."
        ]
      },
      "learn-how-to-use-basic-programming-vocabulary-in-conversations": {
        "title": "Дізнайтесь, як використовувати базові слова з програмування",
        "intro": [
          "Цей курс ознайомить вас з основною термінологією, пов’язаною з програмуванням. Ви навчитесь ставити запитання щодо основних понять програмування."
        ]
      },
      "learn-how-to-use-code-related-concepts-and-terms": {
        "title": "Дізнайтесь, як використовувати поняття та терміни з програмування",
        "intro": [
          "У цьому курсі ви ознайомитесь з термінами, пов’язаними з програмуванням, і навчитесь використовувати їх у розмові."
        ]
      },
      "learn-how-to-discuss-tech-trends-and-updates": {
        "title": "Дізнайтесь, як обговорювати технологічні тренди та оновлення",
        "intro": [
          "У цьому курсі ви ознайомитесь з деякими останніми трендами у світі технологій і навчитесь обговорювати їх англійською мовою."
        ]
      },
      "learn-how-to-help-a-coworker-troubleshoot-on-github": {
        "title": "Дізнайтесь, як допомогти колезі розв’язати проблему на GitHub",
        "intro": [
          "У цьому курсі ви вивчите вирази, пов’язані із проханням про допомогу у колеги, а також тим, як запропонувати свою допомогу."
        ]
      },
      "learn-how-to-share-your-progress-in-weekly-stand-up-meetings": {
        "title": "Дізнайтесь, як ділитись своїм прогресом на щотижневій зустрічі",
        "intro": [
          "Цей курс покаже, як говорити про свої проєкти в контексті того, що ви вже зробили та що виконуєте зараз."
        ]
      },
      "learn-how-to-ask-for-clarification-on-code-understanding": {
        "title": "Дізнайтесь, як просити роз’яснення коду",
        "intro": [
          "У цьому курсі ви дізнаєтесь, як ставити запитання, щоб уточнити те, що не зовсім зрозуміле у коді."
        ]
      },
      "learn-how-to-document-code-for-a-project": {
        "title": "Дізнайтесь, як документувати код проєкту",
        "intro": [
          "Цей курс ознайомить вас з виразами, пов’язаними із документацією коду."
        ]
      },
      "learn-how-to-read-and-understand-code-documentation": {
        "title": "Дізнайтесь, як читати та розуміти документацію",
        "intro": [
          "У цьому курсі ще більше виразів, пов’язаних із документацією коду, а також декілька порад, як розуміти його."
        ]
      },
      "learn-how-to-analyze-code-documentation": {
        "title": "Дізнайтесь, як аналізувати документацію",
        "intro": [
          "У цьому курсі ви дізнаєтесь, як правильно читати документацію та аналізувати її."
        ]
      },
      "learn-how-to-share-progress-and-accomplishments": {
        "title": "Дізнайтесь, як ділитись прогресом та досягненнями",
        "intro": [
          "У цьому курсі ви навчитесь ділитись прогресом та досягненнями зі своїми колегами."
        ]
      },
      "learn-how-to-talk-about-updates-and-plans-for-tasks-and-projects": {
        "title": "Дізнайтесь, як говорити про оновлення та плани щодо завдань і проєктів",
        "intro": [
          "У цьому курсі ви дізнаєтесь, як говорити про останні досягнення проєктів та про свої плани."
        ]
      },
      "learn-how-to-express-agreement-or-disagreement": {
        "title": "Дізнайтесь, як погоджуватись та не погоджуватись",
        "intro": [
          "Цей курс навчить, як погоджуватись та не погоджуватись з твердженнями інших."
        ]
      },
      "learn-how-to-offer-technical-support-and-guidance": {
        "title": "Дізнайтесь, як надавати технічну підтримку та супровід",
        "intro": [
          "У цьому курсі ви дізнаєтесь, як пропонувати свою допомогу по технічних питаннях."
        ]
      },
      "learn-how-to-request-and-receive-guidance": {
        "title": "Дізнайтесь, як запитувати та отримувати супровід",
        "intro": [
          "Цей курс роз’яснить, як просити допомоги від колеги, коли це потрібно."
        ]
      },
      "learn-how-to-provide-explanations-when-helping-others": {
        "title": "Дізнайтесь, як надавати пояснення при допомозі іншим",
        "intro": [
          "Цей курс ознайомить з тим, як правильно надавати пояснення іншим людям."
        ]
      }
    }
  },
  "b1-english-for-developers": {
    "title": "Англійська мова рівня B1 для розробників (бета-версія)",
    "note": "Сертифікація знаходиться в стані активної розробки. Наразі для цього розділу немає сертифіката, але він буде доступний найближчим часом. Тим часом ви можете дослідити курси, які ми вже створили.",
    "intro": ["Placeholder intro"],
    "blocks": {
      "learn-how-to-describe-places-and-events": {
        "title": "Дізнайтесь, як описувати місця і події",
        "intro": [""]
      },
      "learn-how-to-talk-about-past-experiences": {
        "title": "Дізнайтесь, як говорити про досвід",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-past-activities": {
        "title": "Дізнайтесь, як говорити про дії з минулого",
        "intro": ["", ""]
      },
      "learn-present-perfect-while-talking-about-accessibility": {
        "title": "Дізнайтесь про теперішній доконаний час, говорячи про доступність",
        "intro": ["", ""]
      },
      "learn-how-to-plan-future-events": {
        "title": "Дізнайтесь, як планувати майбутні події",
        "intro": ["", ""]
      },
      "learn-future-continuous-while-describing-actions": {
        "title": "Дізнайтесь про майбутній тривалий час, описуючи дії",
        "intro": ["", ""]
      },
      "learn-how-to-use-conditionals": {
        "title": "Дізнайтесь, як використовувати умовні речення",
        "intro": ["", ""]
      },
      "learn-how-to-share-feedback": {
        "title": "Дізнайтесь, як ділитись фідбеком",
        "intro": ["", ""]
      },
      "learn-how-to-share-your-opinion": {
        "title": "Дізнайтесь, як ділитись своєю думкою",
        "intro": ["", ""]
      },
      "learn-how-to-express-agreement": {
        "title": "Дізнайтесь, як виражати згоду",
        "intro": ["", ""]
      },
      "learn-how-to-express-disagreement": {
        "title": "Дізнайтесь, як виражати незгоду",
        "intro": ["", ""]
      },
      "learn-how-to-express-concerns": {
        "title": "Дізнайтесь, як виражати занепокоєння",
        "intro": ["", ""]
      },
      "learn-how-to-express-decisions-based-on-comparisons": {
        "title": "Дізнайтесь, як виражати вибір на основі порівняння",
        "intro": ["", ""]
      },
      "learn-how-to-use-modal-verbs": {
        "title": "Дізнайтесь, як використовувати модальні дієслова",
        "intro": ["", ""]
      },
      "learn-how-to-manage-a-conversation": {
        "title": "Дізнайтесь, як керувати бесідою",
        "intro": ["", ""]
      },
      "learn-how-to-clarify-misunderstandings": {
        "title": "Дізнайтесь, як уточнити непорозуміння",
        "intro": ["", ""]
      },
      "learn-about-speculation-and-requests": {
        "title": "Дізнайтесь про припущення та запити",
        "intro": ["", ""]
      },
      "learn-about-adverbial-phrases": {
        "title": "Дізнайтесь про прислівникові звороти",
        "intro": ["", ""]
      },
      "learn-how-to-use-adjectives-in-conversations": {
        "title": "Дізнайтесь, як використовувати прикметники",
        "intro": ["", ""]
      },
      "learn-determiners-and-advanced-use-of-articles": {
        "title": "Дізнайтесь про означальні слова та поглиблене використання артиклів",
        "intro": ["", ""]
      },
      "learn-how-to-use-reported-speech": {
        "title": "Дізнайтесь, як використовувати непряму мову",
        "intro": ["", ""]
      },
      "learn-how-to-use-prepositions-according-to-context": {
        "title": "Дізнайтесь, як використовувати прийменники відповідно до контексту",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-numbers-with-a-coworker": {
        "title": "Дізнайтесь, як говорити про числа з колегою",
        "intro": ["", ""]
      },
      "learn-common-phrasal-verbs-and-idioms": {
        "title": "Дізнайтесь про найпоширеніші фразові дієслова та ідіоми",
        "intro": ["", ""]
      }
    }
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Розвиньте свої навички творчого підходу до розв’язання проблем за допомогою завдань з базової бібліотеки Rosetta Code.",
      "Ці завдання можуть виявитися важкими, але вони підштовхнуть ваше логічне мислення до нових висот.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Атрибут: Rosetta Code</a>"
    ],
    "blocks": {
      "rosetta-code-challenges": {
        "title": "Завдання з «Rosetta Code»",
        "intro": ["Перелік завдань з «Rosetta Code»."]
      }
    }
  },
  "front-end-development": {
    "title": "Front End розробка",
    "intro": ["placeholder"],
    "blocks": {
      "efpl": {
        "title": "0",
        "intro": []
      },
      "xpmy": {
        "title": "1",
        "intro": []
      },
      "workshop-cat-photo-app": {
        "title": "Створіть застосунок із фото котів",
        "intro": [
          "HTML розшифровується як «мова розмітки гіпертексту» та представляє вміст і структуру вебсторінки.",
          "У цьому практичному завданні ви дізнаєтесь, як працювати з базовими елементами HTML, серед яких заголовки, абзаци, зображення, посилання та списки."
        ]
      },
      "lab-recipe-page": {
        "title": "Створіть сторінку з рецептом",
        "intro": [
          "У цій лабораторній роботі ви створите вебсторінку з улюбленим рецептом."
        ]
      },
      "gwyd": {
        "title": "4",
        "intro": []
      },
      "lab-travel-agency-page": {
        "title": "Створіть сторінку туристичної агенції",
        "intro": [
          "У цій лабораторній роботі ви створите вебсторінку туристичної агенції."
        ]
      },
      "vipr": {
        "title": "6",
        "intro": []
      },
      "lab-video-compilation-page": {
        "title": "Створіть сторінку із відео",
        "intro": ["У цій лабораторній роботі ви створите вебсторінку із відео."]
      },
      "bzfv": {
        "title": "8",
        "intro": []
      },
      "snuv": {
        "title": "9",
        "intro": []
      },
      "quiz-basic-html": {
        "title": "Тест «Основи HTML»",
        "intro": ["Перевірте, що ви дізнались з основ HTML."]
      },
      "evdc": {
        "title": "11",
        "intro": []
      },
      "workshop-blog-page": {
        "title": "Створіть сторінку блогу про котів",
        "intro": [
          "У цьому практичному завданні ви дізнаєтесь, як створити сторінку блогу лише на HTML, використовуючи семантичні елементи, серед яких <code>main</code>, <code>nav</code>, <code>article</code> та <code>footer</code>."
        ]
      },
      "lab-event-hub": {
        "title": "Створіть хаб для подій",
        "intro": [
          "У цій лабораторній роботі ви створите хаб для подій за допомогою семантичного HTML."
        ]
      },
      "ijdq": {
        "title": "14",
        "intro": []
      },
      "quiz-semantic-html": {
        "title": "Тест «Семантичний HTML»",
        "intro": ["Перевірте, що ви дізнались про семантичний HTML."]
      },
      "cfgp": {
        "title": "16",
        "intro": []
      },
      "workshop-hotel-feedback-form": {
        "title": "Створіть форму зворотного зв’язку для готелю",
        "intro": [
          "У цьому практичному завданні ви дізнаєтесь, як працювати з формами, створивши форму зворотного зв’язку для готелю.",
          "Ви навчитесь працювати з мітками, полями введення даних, наборами полів, легендами, текстовими полями та кнопками."
        ]
      },
      "lab-survey-form": {
        "title": "Створіть форму для опитування",
        "intro": ["У цій лабораторній роботі ви створите форму для опитування."]
      },
      "wgot": {
        "title": "19",
        "intro": []
      },
      "workshop-final-exams-table": {
        "title": "Створіть таблицю з кінцевими екзаменами",
        "intro": [
          "У цьому практичному завданні ви дізнаєтесь, як працювати з HTML-таблицями, створивши таблицю кінцевих екзаменів."
        ]
      },
      "lab-book-catalog-table": {
        "title": "Створіть каталог книг",
        "intro": [
          "У цій лабораторній роботі ви створите таблицю з інформацією про книги."
        ]
      },
      "rsve": {
        "title": "22",
        "intro": []
      },
      "xzam": {
        "title": "23",
        "intro": []
      },
      "quiz-html-tables-and-forms": {
        "title": "Тест «Таблиці та форми в HTML»",
        "intro": ["Перевірте, що ви дізнались про таблиці та форми в CSS."]
      },
      "ghoc": {
        "title": "25",
        "intro": []
      },
      "lab-checkout-page": {
        "title": "Створіть платіжну сторінку",
        "intro": [
          "У цій лабораторній роботі ви створите доступну платіжну сторінку."
        ]
      },
      "fqai": {
        "title": "27",
        "intro": []
      },
      "quiz-html-accessibility": {
        "title": "Тест «Доступність в HTML»",
        "intro": ["Перевірте, що ви дізнались про доступність в HTML."]
      },
      "pspj": {
        "title": "29",
        "intro": []
      },
      "qpra": {
        "title": "30",
        "intro": []
      },
      "joim": {
        "title": "31",
        "intro": []
      },
      "gvtb": {
        "title": "32",
        "intro": []
      },
      "cqhu": {
        "title": "33",
        "intro": []
      },
      "tmdc": {
        "title": "34",
        "intro": []
      },
      "quiz-computer-basics": {
        "title": "Тест «Основи комп’ютера»",
        "intro": ["Перевірте, що ви дізнались з основ комп'ютера."]
      },
      "dxpc": {
        "title": "36",
        "intro": []
      },
      "workshop-cafe-menu": {
        "title": "Розробіть меню для кафе",
        "intro": [
          "CSS повідомляє браузеру, як відтворювати вебсторінку. CSS можна використовувати, щоб встановити колір, шрифт, розмір та інші властивості HTML-елементів.",
          "У цьому практичному завданні ви вивчите CSS, розробивши дизайн меню для вебсторінки кафе."
        ]
      },
      "lab-business-card": {
        "title": "Створіть дизайн візитівки",
        "intro": [
          "У цій лабораторній роботі ви створите візитівку та стилізуєте її за допомогою CSS."
        ]
      },
      "gnuk": {
        "title": "39",
        "intro": []
      },
      "zlfj": {
        "title": "40",
        "intro": []
      },
      "quiz-basic-css": {
        "title": "Тест «Основи CSS»",
        "intro": ["Перевірте, що ви дізнались з основ CSS."]
      },
      "sdul": {
        "title": "42",
        "intro": []
      },
      "lab-stylized-to-do-list": {
        "title": "Створіть стилізований список справ",
        "intro": [
          "У цій лабораторній роботі ви створите список справ, які потрібно виконати, та застосуєте різні стилі до посилань."
        ]
      },
      "humj": {
        "title": "44",
        "intro": []
      },
      "pahx": {
        "title": "45",
        "intro": []
      },
      "rzdx": {
        "title": "46",
        "intro": []
      },
      "quiz-css-backgrounds-and-borders": {
        "title": "Тест «Фони та кордони в CSS»",
        "intro": ["Перевірте, що ви дізнались про фони та кордони в CSS."]
      },
      "ljmt": {
        "title": "48",
        "intro": []
      },
      "lxpk": {
        "title": "49",
        "intro": []
      },
      "lzqy": {
        "title": "50",
        "intro": []
      },
      "gvel": {
        "title": "51",
        "intro": []
      },
      "quiz-design-fundamentals": {
        "title": "Тест «Основи дизайну»",
        "intro": ["Перевірте, що ви дізнались з основ дизайну UI."]
      },
      "bgrw": {
        "title": "53",
        "intro": []
      },
      "sbnz": {
        "title": "54",
        "intro": []
      },
      "lab-event-flyer-page": {
        "title": "Створіть запрошення на подію",
        "intro": [
          "У цій лабораторній роботі ви будете використовувати абсолютні та відносні одиниці CSS, щоб створити запрошення на подію."
        ]
      },
      "ywfm": {
        "title": "56",
        "intro": []
      },
      "quiz-css-relative-and-absolute-units": {
        "title": "Тест «Відносні та абсолютні одиниці CSS»",
        "intro": [
          "Перевірте, що ви дізнались про відносні та абсолютні одиниці в CSS."
        ]
      },
      "ohhu": {
        "title": "58",
        "intro": []
      },
      "syga": {
        "title": "59",
        "intro": []
      },
      "sdym": {
        "title": "60",
        "intro": []
      },
      "ivpx": {
        "title": "61",
        "intro": []
      },
      "quiz-css-pseudo-classes": {
        "title": "Тест «Псевдокласи в CSS»",
        "intro": ["Перевірте, що ви дізнались про псевдокласи в CSS."]
      },
      "fvcj": {
        "title": "63",
        "intro": []
      },
      "ogdb": {
        "title": "64",
        "intro": []
      },
      "zxiy": {
        "title": "65",
        "intro": []
      },
      "qpze": {
        "title": "66",
        "intro": []
      },
      "quiz-css-colors": {
        "title": "Тест «Кольори в CSS»",
        "intro": ["Перевірте, що ви дізнались про використання кольорів у CSS."]
      },
      "jnqt": {
        "title": "68",
        "intro": []
      },
      "vkei": {
        "title": "69",
        "intro": []
      },
      "lab-contact-form": {
        "title": "Розробіть контактну форму",
        "intro": [
          "У цій лабораторній роботі ви створите контактну форму в HTML та стилізуєте її за допомогою CSS."
        ]
      },
      "ipmw": {
        "title": "71",
        "intro": []
      },
      "quiz-styling-forms": {
        "title": "Тест «Стилізація форм»",
        "intro": [
          "Перевірте, що ви дізнались про стилізацію форм за допомогою CSS."
        ]
      },
      "qzcx": {
        "title": "73",
        "intro": []
      },
      "wozq": {
        "title": "74",
        "intro": []
      },
      "lab-confidential-email-page": {
        "title": "Створіть сторінку конфіденційної пошти",
        "intro": [
          "У цій лабораторній роботі ви створите конфіденційну пошту, використовуючи HTML та CSS."
        ]
      },
      "zter": {
        "title": "76",
        "intro": []
      },
      "quiz-css-layout-and-effects": {
        "title": "Тест «Макети та ефекти в CSS»",
        "intro": [
          "Перевірте, що ви дізнались про блокову модель, трансформації, фільтри та переповнення в CSS."
        ]
      },
      "tcwi": {
        "title": "78",
        "intro": []
      },
      "uptf": {
        "title": "79",
        "intro": []
      },
      "lab-page-of-playing-cards": {
        "title": "Створіть сторінку гральних карт",
        "intro": [
          "У цій лабораторній роботі ви будете використовувати flexbox, щоб створити вебсторінку з гральними картами."
        ]
      },
      "kqao": {
        "title": "81",
        "intro": []
      },
      "quiz-css-flexbox": {
        "title": "Тест «CSS Flexbox»",
        "intro": ["Перевірте, що ви дізнались про гнучкий блок у CSS."]
      },
      "vqut": {
        "title": "83",
        "intro": []
      },
      "ujcf": {
        "title": "84",
        "intro": []
      },
      "lab-newspaper-article": {
        "title": "Створіть статтю в газеті",
        "intro": [
          "У цій лабораторній роботі ви створите сторінку зі статтею, використовуючи HTML та CSS."
        ]
      },
      "hbme": {
        "title": "86",
        "intro": []
      },
      "quiz-css-typography": {
        "title": "Тест «Типографія в CSS»",
        "intro": ["Перевірте, що ви дізнались про типографію в CSS."]
      },
      "dyvj": {
        "title": "88",
        "intro": []
      },
      "rjsv": {
        "title": "89",
        "intro": []
      },
      "lab-tribute-page": {
        "title": "Створіть пам’ятну сторінку",
        "intro": [
          "У цій лабораторній роботі ви створите пам’ятну сторінку на власну тему."
        ]
      },
      "fnde": {
        "title": "91",
        "intro": []
      },
      "quiz-css-accessibility": {
        "title": "Тест «Доступність в CSS»",
        "intro": [
          "Перевірте, що ви дізнались про доступність вебсторінок за допомогою CSS."
        ]
      },
      "swpl": {
        "title": "93",
        "intro": []
      },
      "hcje": {
        "title": "94",
        "intro": []
      },
      "lab-book-inventory-app": {
        "title": "Створіть застосунок для інвентаризації книг",
        "intro": [
          "У цій лабораторній роботі ви створите застосунок для інвентаризації книг."
        ]
      },
      "huyd": {
        "title": "96",
        "intro": []
      },
      "quiz-css-attribute-selectors": {
        "title": "Тест «Селектори атрибутів у CSS»",
        "intro": ["Перевірте, що ви дізнались про селектори атрибутів у CSS."]
      },
      "rxzk": {
        "title": "98",
        "intro": []
      },
      "xobh": {
        "title": "99",
        "intro": []
      },
      "lab-house-painting": {
        "title": "Створіть малюнок будинку",
        "intro": [
          "У цій лабораторній роботі ви створите малюнок будинку за допомогою CSS."
        ]
      },
      "rrtt": {
        "title": "101",
        "intro": []
      },
      "quiz-css-positioning": {
        "title": "Тест «Позиціювання в CSS»",
        "intro": ["Перевірте, що ви дізнались про позиціювання в CSS."]
      },
      "xebj": {
        "title": "103",
        "intro": []
      },
      "jkdt": {
        "title": "104",
        "intro": []
      },
      "lab-technical-documentation-page": {
        "title": "Створіть сторінку технічної документації",
        "intro": [
          "У цій лабораторній роботі ви створите сторінку технічної документації, яка служитиме інструкцією або довідником."
        ]
      },
      "xcti": {
        "title": "106",
        "intro": []
      },
      "quiz-responsive-web-design": {
        "title": "Тест «Адаптивний вебдизайн»",
        "intro": ["Перевірте, що ви дізнались про адаптацію вебсторінок."]
      },
      "mtbl": {
        "title": "108",
        "intro": []
      },
      "vlov": {
        "title": "109",
        "intro": []
      },
      "lab-availability-table": {
        "title": "Створіть таблицю з вільними годинами",
        "intro": [
          "У цій лабораторній роботі ви створите таблицю з вільними годинами для запису."
        ]
      },
      "sget": {
        "title": "111",
        "intro": []
      },
      "quiz-css-variables": {
        "title": "Тест «Змінні в CSS»",
        "intro": ["Перевірте, що ви дізнались про використання змінних в CSS."]
      },
      "agbl": {
        "title": "113",
        "intro": []
      },
      "ogko": {
        "title": "114",
        "intro": []
      },
      "harp": {
        "title": "115",
        "intro": []
      },
      "nsiq": {
        "title": "116",
        "intro": []
      },
      "lab-product-landing-page": {
        "title": "Створіть посадкову сторінку продукту",
        "intro": [
          "У цьому проєкті ви створите посадкову сторінку продукту, щоб прорекламувати продукт за власним вибором."
        ]
      },
      "fdam": {
        "title": "118",
        "intro": []
      },
      "quiz-css-grid": {
        "title": "Тест «Сітка в CSS»",
        "intro": ["Перевірте, що ви дізнались про використання сітки в CSS."]
      },
      "dorc": {
        "title": "120",
        "intro": []
      },
      "adzu": {
        "title": "121",
        "intro": []
      },
      "lab-moon-orbit": {
        "title": "Побудуйте орбіту Місяця",
        "intro": [
          "У цій лабораторній роботі ви створите анімацію оберту Місяця навколо Землі."
        ]
      },
      "lugl": {
        "title": "123",
        "intro": []
      },
      "lab-personal-portfolio": {
        "title": "Створіть особисте портфоліо",
        "intro": ["У цьому проєкті ви створите особисте портфоліо."]
      },
      "lvqc": {
        "title": "125",
        "intro": []
      },
      "quiz-css-animations": {
        "title": "Тест «Анімації в CSS»",
        "intro": ["Перевірте, що ви дізнались про анімацію в CSS."]
      },
      "wvjx": {
        "title": "127",
        "intro": []
      },
      "uquz": {
        "title": "128",
        "intro": []
      },
      "kdgd": {
        "title": "129",
        "intro": []
      },
      "wryp": {
        "title": "130",
        "intro": []
      },
      "workshop-greeting-bot": {
        "title": "Створіть вітального бота",
        "intro": [
          "У цьому практичному завданні ви дізнаєтесь, як працювати з основами JavaScript, створивши вітального бота.",
          "Ви дізнаєтесь про змінні, <code>let</code>, <code>const</code>, <code>console.log</code> та базове використання рядка."
        ]
      },
      "lab-javascript-trivia-bot": {
        "title": "Build a JavaScript Trivia Bot",
        "intro": [
          "In this lab, you will practice working with JavaScript variables and strings by building a trivia bot."
        ]
      },
      "dthi": {
        "title": "133",
        "intro": []
      },
      "yskn": {
        "title": "134",
        "intro": []
      },
      "quiz-javascript-variables-and-data-types": {
        "title": "Тест «Змінні та типи даних в JavaScript»",
        "intro": [
          "Перевірте, що ви дізнались про змінні та типи даних в JavaScript."
        ]
      },
      "hoec": {
        "title": "136",
        "intro": []
      },
      "workshop-teacher-chatbot": {
        "title": "Створіть вчителя-бота",
        "intro": [
          "У цьому практичному завданні ви продовжите знайомство з рядками JavaScript, створюючи чат-бот.",
          "Ви навчитеся працювати з шаблонними літерами та методом <code>indexOf</code>."
        ]
      },
      "axgb": {
        "title": "138",
        "intro": []
      },
      "rwac": {
        "title": "139",
        "intro": []
      },
      "quiz-javascript-strings": {
        "title": "Тест «Рядки в JavaScript»",
        "intro": ["Перевірте, що ви дізнались про рядки в JavaScript."]
      },
      "hxwa": {
        "title": "141",
        "intro": []
      },
      "workshop-mathbot": {
        "title": "Build a Mathbot",
        "intro": [
          "In this workshop, you will review how to work with the different Math object methods by building a Mathbot."
        ]
      },
      "lab-fortune-teller": {
        "title": "Створіть генератор передбачень",
        "intro": [
          "У цій лабораторній роботі ви створите генератор передбачень, де користувач випадково обиратиме передбачення зі всіх доступних."
        ]
      },
      "wfyg": {
        "title": "144",
        "intro": []
      },
      "guqy": {
        "title": "145",
        "intro": []
      },
      "quiz-javascript-math": {
        "title": "Тест «Математика на JavaScript»",
        "intro": ["Перевірте, що ви дізнались про математику на JavaScript."]
      },
      "hafd": {
        "title": "147",
        "intro": []
      },
      "phko": {
        "title": "148",
        "intro": []
      },
      "quiz-javascript-comparisons-and-conditionals": {
        "title": "Тест «Порівняння та умови в JavaScript»",
        "intro": [
          "Перевірте, що ви дізнались про порівняння та умови в JavaScript."
        ]
      },
      "tsdq": {
        "title": "150",
        "intro": []
      },
      "workshop-calculator": {
        "title": "Створіть калькулятор",
        "intro": [
          "У цьому практичному завданні ви пригадаєте, як працювати з функціями, створивши калькулятор."
        ]
      },
      "lab-email-masker": {
        "title": "Створіть маскування електронної пошти",
        "intro": [
          "У цій лабораторній роботі ви створите маскування е-пошти, яке прийматиме адресу та приховуватиме її."
        ]
      },
      "lab-sentence-maker": {
        "title": "Створіть творця речень",
        "intro": [
          "У цій лабораторній роботі ви створите різноманітні історії, призначаючи різні слова до різних змінних."
        ]
      },
      "workshop-loan-qualification-checker": {
        "title": "Створіть перевірку на дотримання вимог до позики",
        "intro": [
          "У цьому практичному завданні ви продовжите вивчати про умовні інструкції, створивши перевірку на дотримання вимог до позики.",
          "Ви детальніше дізнаєтесь про інструкції <code>if</code> та як використовувати оператори порівняння і декілька умов в інструкції <code>if</code>."
        ]
      },
      "lab-leap-year-calculator": {
        "title": "Створіть калькулятор високосних років ",
        "intro": [
          "У цій лабораторній роботі ви будете використовувати умовні інструкції та цикли, щоб визначити, чи рік високосний."
        ]
      },
      "pljo": {
        "title": "156",
        "intro": []
      },
      "quiz-javascript-functions": {
        "title": "Тест «Функції в JavaScript»",
        "intro": ["Перевірте, що ви дізнались про функції в JavaScript."]
      },
      "mexq": {
        "title": "158",
        "intro": []
      },
      "ifgn": {
        "title": "159",
        "intro": []
      },
      "workshop-shopping-list": {
        "title": "Створіть список покупок",
        "intro": [
          "У цьому практичному завданні ви попрактикуєтесь працювати з масивами, створивши список покупок.",
          "Ви пригадаєте, як додавати й видаляти елементи з масиву за допомогою різних методів, серед яких <code>push</code>, <code>pop</code>, <code>shift</code> та <code>unshift</code>."
        ]
      },
      "lab-lunch-picker-program": {
        "title": "Створіть програму для вибору перекусу",
        "intro": [
          "У цій лабораторній роботі ви пригадаєте, як працювати з масивами й випадковими числами, створивши програму для вибору перекусу."
        ]
      },
      "mokm": {
        "title": "161",
        "intro": []
      },
      "froz": {
        "title": "162",
        "intro": []
      },
      "quiz-javascript-arrays": {
        "title": "Тест «Масиви в JavaScript»",
        "intro": ["Перевірте, що ви дізнались про масиви в JavaScript."]
      },
      "dvnt": {
        "title": "164",
        "intro": []
      },
      "ekdb": {
        "title": "165",
        "intro": []
      },
      "lab-quiz-game": {
        "title": "Build a Quiz Game",
        "intro": ["For this lab, you will build a quiz game."]
      },
      "lab-factorial-calculator": {
        "title": "Створіть калькулятор факторіалів ",
        "intro": [
          "У цій лабораторній роботі ви створите калькулятор факторіалів."
        ]
      },
      "quiz-javascript-objects": {
        "title": "Тест «Об’єкти в JavaScript»",
        "intro": ["Перевірте, що ви дізнались про об’єкти в JavaScript."]
      },
      "kgtw": {
        "title": "169",
        "intro": []
      },
      "workshop-sentence-analyzer": {
        "title": "Створіть аналізатор речень",
        "intro": [
          "У цьому практичному завданні ви пригадаєте, як працювати з циклами в JavaScript, створивши аналізатор речення."
        ]
      },
      "kcci": {
        "title": "171",
        "intro": []
      },
      "puhe": {
        "title": "172",
        "intro": []
      },
      "quiz-javascript-loops": {
        "title": "Тест «Цикли в JavaScript»",
        "intro": ["Перевірте, що ви дізнались про цикли в JavaScript."]
      },
      "hjtr": {
        "title": "174",
        "intro": []
      },
      "lab-pyramid-generator": {
        "title": "Створіть генератор пірамід",
        "intro": ["У цій лабораторній роботі ви створите генератор пірамід."]
      },
      "lab-gradebook-app": {
        "title": "Створіть журнал з оцінками",
        "intro": [
          "У цій лабораторній роботі ви створите електронний журнал з оцінками."
        ]
      },
      "epfc": {
        "title": "177",
        "intro": []
      },
      "lab-inventory-management-program": {
        "title": "Створіть програму керування запасами",
        "intro": [
          "У цій лабораторній роботі ви створите програму керування запасами за допомогою JavaScript."
        ]
      },
      "fbbn": {
        "title": "179",
        "intro": []
      },
      "lnmg": {
        "title": "180",
        "intro": []
      },
      "wead": {
        "title": "181",
        "intro": []
      },
      "quiz-javascript-fundamentals": {
        "title": "Тест «Основи JavaScript»",
        "intro": ["Перевірте, що ви дізнались з основ JavaScript."]
      },
      "plic": {
        "title": "183",
        "intro": []
      },
      "vjmm": {
        "title": "184",
        "intro": []
      },
      "bxtv": {
        "title": "185",
        "intro": []
      },
      "xiqk": {
        "title": "186",
        "intro": []
      },
      "quiz-javascript-higher-order-functions": {
        "title": "Тест «Функції вищого порядку в JavaScript»",
        "intro": [
          "Перевірте, що ви дізнались про функції вищого порядку в JavaScript."
        ]
      },
      "esfh": {
        "title": "188",
        "intro": []
      },
      "gibb": {
        "title": "189",
        "intro": []
      },
      "lab-favorite-icon-toggler": {
        "title": "Створіть перемикач вподобаної іконки",
        "intro": [
          "У цій лабораторній роботі ви створите перемикач вподобаної іконки, використавши подію click в JavaScript."
        ]
      },
      "fhxc": {
        "title": "191",
        "intro": []
      },
      "quiz-dom-manipulation-and-click-event-with-javascript": {
        "title": "Тест «Маніпуляція DOM та події Click в JavaScript»",
        "intro": [
          "Перевірте, що ви дізнались про маніпуляцію DOM та події Click в JavaScript."
        ]
      },
      "ubpx": {
        "title": "193",
        "intro": []
      },
      "lbyi": {
        "title": "194",
        "intro": []
      },
      "lab-real-time-counter": {
        "title": "Створіть лічильник реального часу",
        "intro": [
          "У цій лабораторній роботі ви створите лічильник символів у реальному часі."
        ]
      },
      "fmbk": {
        "title": "196",
        "intro": []
      },
      "lab-lightbox-viewer": {
        "title": "Створіть переглядач Lightbox",
        "intro": [
          "У цій лабораторній роботі ви створите переглядач lightbox для перегляду зображень у сфокусованому режимі."
        ]
      },
      "workshop-rps-game": {
        "title": "Створіть гру «Камінь-ножиці-папір»",
        "intro": [
          "У цьому практичному завданні ви пригадаєте маніпуляцію та події DOM, створивши гру «Камінь-ножиці-папір»."
        ]
      },
      "lab-palindrome-checker": {
        "title": "Створіть перевірку паліндрома",
        "intro": [
          "У цій лабораторній роботі ви створите застосунок, який перевіряє, чи слово є паліндромом."
        ]
      },
      "lab-football-team-cards": {
        "title": "Build a Set of Football Team Cards",
        "intro": [
          "One common aspect of building web applications is processing datasets and outputting information to the screen. In this project, you will use DOM manipulation, object destructuring, event handling, and data filtering to build a set of football team cards."
        ]
      },
      "iejn": {
        "title": "201",
        "intro": []
      },
      "quiz-javascript-events": {
        "title": "Тест «Події в JavaScript»",
        "intro": ["Перевірте, що ви дізнались про події в JavaScript."]
      },
      "kaqq": {
        "title": "203",
        "intro": []
      },
      "lab-random-background-color-changer": {
        "title": "Налагодьте перемикач кольору фону",
        "intro": [
          "У цій лабораторній роботі ви налагодите перемикач кольору фону та виправите помилки, щоб він працював правильно."
        ]
      },
      "ksfc": {
        "title": "205",
        "intro": []
      },
      "quiz-debugging-javascript": {
        "title": "Тест «Налагодження JavaScript»",
        "intro": ["Перевірте, що ви дізнались про налагодження JavaScript."]
      },
      "dqth": {
        "title": "207",
        "intro": []
      },
      "ilop": {
        "title": "208",
        "intro": []
      },
      "qrer": {
        "title": "209",
        "intro": []
      },
      "lab-regex-sandbox": {
        "title": "Build a RegEx Sandbox",
        "intro": ["In this lab you will build a regex sandbox."]
      },
      "svsl": {
        "title": "211",
        "intro": []
      },
      "quiz-javascript-regular-expressions": {
        "title": "Тест «Регулярні вирази в JavaScript»",
        "intro": [
          "Перевірте, що ви дізнались про регулярні вирази в JavaScript."
        ]
      },
      "zalp": {
        "title": "213",
        "intro": []
      },
      "hhvp": {
        "title": "214",
        "intro": []
      },
      "egkv": {
        "title": "215",
        "intro": []
      },
      "qlvw": {
        "title": "216",
        "intro": []
      },
      "quiz-form-validation-with-javascript": {
        "title": "Тест «Валідація форми з JavaScript»",
        "intro": [
          "Перевірте, що ви дізнались про валідацію форм за допомогою JavaScript."
        ]
      },
      "lupt": {
        "title": "218",
        "intro": []
      },
      "lab-date-conversion": {
        "title": "Build a Date Conversion Program",
        "intro": [
          "In this lab, you will build a program to convert a date from one format to another."
        ]
      },
      "xtfk": {
        "title": "220",
        "intro": []
      },
      "quiz-javascript-dates": {
        "title": "Тест «Дати в JavaScript»",
        "intro": ["Перевірте, що ви дізнались про дати в JavaScript."]
      },
      "lvts": {
        "title": "222",
        "intro": []
      },
      "foal": {
        "title": "223",
        "intro": []
      },
      "crzf": {
        "title": "224",
        "intro": []
      },
      "xofr": {
        "title": "225",
        "intro": []
      },
      "quiz-javascript-audio-and-video": {
        "title": "Тест «Аудіо та відео в JavaScript»",
        "intro": ["Перевірте, що ви дізнались про аудіо та відео в JavaScript."]
      },
      "pehm": {
        "title": "227",
        "intro": []
      },
      "cvsw": {
        "title": "228",
        "intro": []
      },
      "lab-bookmark-manager-app": {
        "title": "Build a Bookmark Manager App",
        "intro": ["For this lab, you will build a bookmark manager app."]
      },
      "fgbp": {
        "title": "230",
        "intro": []
      },
      "quiz-local-storage-and-crud": {
        "title": "Тест «Локальне сховище та CRUD»",
        "intro": ["Перевірте, що ви дізнались про локальне сховище та CRUD."]
      },
      "jbst": {
        "title": "232",
        "intro": []
      },
      "peyf": {
        "title": "233",
        "intro": []
      },
      "bdqj": {
        "title": "234",
        "intro": []
      },
      "ndlf": {
        "title": "235",
        "intro": []
      },
      "quiz-recursion": {
        "title": "Тест «Рекурсія»",
        "intro": ["Перевірте, що ви дізнались про рекурсію."]
      },
      "yshh": {
        "title": "237",
        "intro": []
      },
      "wyxz": {
        "title": "238",
        "intro": []
      },
      "lab-quicksort-algorithm": {
        "title": "Створіть алгоритм швидкого сортування",
        "intro": [
          "У цій лабораторній роботі ви імплементуєте алгоритм швидкого сортування, використовуючи JavaScript."
        ]
      },
      "dtfv": {
        "title": "240",
        "intro": []
      },
      "quiz-searching-and-sorting-algorithms": {
        "title": "Тест «Алгоритми пошуку та сортування»",
        "intro": [
          "Перевірте, що ви дізнались про алгоритми пошуку та сортування."
        ]
      },
      "bnvw": {
        "title": "242",
        "intro": []
      },
      "xkhk": {
        "title": "243",
        "intro": []
      },
      "lab-roman-numeral-converter": {
        "title": "Створіть конвертер римських чисел",
        "intro": [
          "У цій лабораторній роботі ви створите застосунок, який перетворює цілі числа в римські."
        ]
      },
      "yaxm": {
        "title": "245",
        "intro": []
      },
      "lab-telephone-number-validator": {
        "title": "Створіть валідатор мобільного номера",
        "intro": [
          "У цій лабораторній роботі ви створите застосунок, який перевіряє, чи мобільний номер є дійсним номером США."
        ]
      },
      "lab-cash-register": {
        "title": "Створіть касовий апарат",
        "intro": ["У цій лабораторній роботі ви створите касовий апарат."]
      },
      "udia": {
        "title": "248",
        "intro": []
      },
      "quiz-javascript-problem-solving-and-algorithmic-thinking": {
        "title": "Тест «Розв’язання проблем в JavaScript та алгоритмічне мислення»",
        "intro": [
          "Перевірте, що ви дізнались про розв’язання проблем в JavaScript та алгоритмічне мислення."
        ]
      },
      "xayi": {
        "title": "250",
        "intro": []
      },
      "mjbe": {
        "title": "251",
        "intro": []
      },
      "byqx": {
        "title": "252",
        "intro": []
      },
      "alda": {
        "title": "253",
        "intro": []
      },
      "quiz-javascript-functional-programming": {
        "title": "Тест «Функціональне програмування в JavaScript»",
        "intro": [
          "Перевірте, що ви дізнались про функціональне програмування в JavaScript."
        ]
      },
      "cvaf": {
        "title": "255",
        "intro": []
      },
      "tdgy": {
        "title": "256",
        "intro": []
      },
      "saxu": {
        "title": "257",
        "intro": []
      },
      "kagw": {
        "title": "258",
        "intro": []
      },
      "mbib": {
        "title": "259",
        "intro": []
      },
      "oxiv": {
        "title": "260",
        "intro": []
      },
      "quiz-javascript-object-oriented-programming": {
        "title": "Тест «Об’єктноорієнтоване програмування на JavaScript»",
        "intro": [
          "Перевірте, що ви дізнались про об’єктноорієнтоване програмування на JavaScript."
        ]
      },
      "nixz": {
        "title": "262",
        "intro": []
      },
      "lab-stack-class": {
        "title": "Створіть клас stack",
        "intro": [
          "У цій лабораторній роботі ви створите клас stack за допомогою JavaScript."
        ]
      },
      "lab-linked-list-class": {
        "title": "Створіть клас linked list",
        "intro": [
          "У цій лабораторній роботі ви створите клас linked list за допомогою JavaScript."
        ]
      },
      "lab-hash-table-class": {
        "title": "Створіть клас hash table",
        "intro": [
          "У цій лабораторній роботі ви створите клас hash table за допомогою JavaScript."
        ]
      },
      "muyw": {
        "title": "266",
        "intro": []
      },
      "quiz-javascript-data-structures": {
        "title": "Тест «Структури даних в JavaScript»",
        "intro": [
          "Перевірте, що ви дізнались про структури даних в JavaScript."
        ]
      },
      "rmpy": {
        "title": "268",
        "intro": []
      },
      "lab-depth-first-search": {
        "title": "Implement the Depth-First Search Algorithm",
        "intro": [
          "For this lab, you will use JavaScript to implement the Depth-First Search algorithm."
        ]
      },
      "xdyh": {
        "title": "270",
        "intro": []
      },
      "quiz-graphs-and-trees": {
        "title": "Тест «Графи та дерева»",
        "intro": ["Перевірте, що ви дізнались про графи та дерева."]
      },
      "vjgg": {
        "title": "272",
        "intro": []
      },
      "lab-nth-fibonacci-number-generator": {
        "title": "Створіть генератор n-го числа Фібоначчі",
        "intro": [
          "У цій лабораторній роботі ви імплементуєте генератор n-го числа Фібоначчі."
        ]
      },
      "kaui": {
        "title": "274",
        "intro": []
      },
      "quiz-dynamic-programming": {
        "title": "Тест «Динамічне програмування»",
        "intro": ["Перевірте, що ви дізнались про динамічне програмування."]
      },
      "sgau": {
        "title": "276",
        "intro": []
      },
      "clak": {
        "title": "277",
        "intro": []
      },
      "fcom": {
        "title": "278",
        "intro": []
      },
      "ffpt": {
        "title": "279",
        "intro": []
      },
      "lab-pokemon-search-app": {
        "title": "Створіть застосунок «Pokémon Search»",
        "intro": ["У цьому проєкті ви створите застосунок з пошуку покемонів."]
      },
      "vyzp": {
        "title": "281",
        "intro": []
      },
      "quiz-asynchronous-javascript": {
        "title": "Тест «Асинхронний JavaScript»",
        "intro": ["Перевірте, що ви дізнались про асинхронний JavaScript."]
      },
      "icdr": {
        "title": "283",
        "intro": []
      },
      "zdsj": {
        "title": "284",
        "intro": []
      },
      "mzae": {
        "title": "285",
        "intro": []
      },
      "gjbf": {
        "title": "286",
        "intro": []
      },
      "mbpv": {
        "title": "287",
        "intro": []
      },
      "eeez": {
        "title": "288",
        "intro": []
      },
      "quiz-web-standards": {
        "title": "Тест «Вебстандарти»",
        "intro": ["Перевірте, що ви дізнались про вебстандарти."]
      },
      "khuu": {
        "title": "290",
        "intro": []
      },
      "xdly": {
        "title": "291",
        "intro": []
      },
      "rhhl": {
        "title": "292",
        "intro": []
      },
      "trvf": {
        "title": "293",
        "intro": []
      },
      "kwmg": {
        "title": "294",
        "intro": []
      },
      "nodx": {
        "title": "295",
        "intro": []
      },
      "erfj": {
        "title": "296",
        "intro": []
      },
      "quiz-react-basics": {
        "title": "Тест «Основи React»",
        "intro": ["Перевірте, що ви дізнались з основ React."]
      },
      "hfwi": {
        "title": "298",
        "intro": []
      },
      "rnwr": {
        "title": "299",
        "intro": []
      },
      "oeqv": {
        "title": "300",
        "intro": []
      },
      "rdzk": {
        "title": "301",
        "intro": []
      },
      "vtpz": {
        "title": "302",
        "intro": []
      },
      "dfwl": {
        "title": "303",
        "intro": []
      },
      "adzm": {
        "title": "304",
        "intro": []
      },
      "quiz-react-state-and-hooks": {
        "title": "Тест «Стани та хуки в React»",
        "intro": ["Перевірте, що ви дізнались про стани та хуки в React."]
      },
      "voks": {
        "title": "306",
        "intro": []
      },
      "uwum": {
        "title": "307",
        "intro": []
      },
      "ukem": {
        "title": "308",
        "intro": []
      },
      "sdjg": {
        "title": "309",
        "intro": []
      },
      "buzx": {
        "title": "310",
        "intro": []
      },
      "pexz": {
        "title": "311",
        "intro": []
      },
      "prlo": {
        "title": "312",
        "intro": []
      },
      "jsnd": {
        "title": "313",
        "intro": []
      },
      "quiz-advanced-react": {
        "title": "Тест «Advanced React»",
        "intro": ["Перевірте, що ви дізнались про Advanced React."]
      },
      "tkgg": {
        "title": "315",
        "intro": []
      },
      "coip": {
        "title": "316",
        "intro": []
      },
      "quiz-web-performance": {
        "title": "Тест «Вебпродуктивність»",
        "intro": ["Перевірте, що ви дізнались про вебпродуктивність."]
      },
      "hzab": {
        "title": "318",
        "intro": []
      },
      "ggea": {
        "title": "319",
        "intro": []
      },
      "vgvz": {
        "title": "320",
        "intro": []
      },
      "jkfc": {
        "title": "321",
        "intro": []
      },
      "quiz-typescript": {
        "title": "Тест «TypeScript»",
        "intro": ["Перевірте, що ви дізнались про TypeScript."]
      },
      "zhhp": {
        "title": "323",
        "intro": []
      },
      "nwwd": {
        "title": "324",
        "intro": []
      },
      "quiz-css-libraries-and-frameworks": {
        "title": "Тест «Бібліотеки та фреймворки CSS»",
        "intro": [
          "Перевірте, що ви дізнались про бібліотеки та фреймворки CSS."
        ]
      },
      "gora": {
        "title": "326",
        "intro": []
      },
      "vpkl": {
        "title": "327",
        "intro": []
      },
      "quiz-testing": {
        "title": "Тест «Тестування»",
        "intro": ["Перевірте, що ви дізнались про тестування."]
      },
      "lzvx": {
        "title": "329",
        "intro": []
      },
      "mfwu": {
        "title": "330",
        "intro": []
      },
      "dfcd": {
        "title": "331",
        "intro": []
      },
      "workshop-bash-boilerplate": {
        "title": "Створіть шаблонний код",
        "intro": [
          "Термінал дозволяє надсилати на комп’ютер текстові команди, які можуть маніпулювати файловою системою, запускати програми, автоматизувати завдання та багато іншого.",
          "У цьому практичному завданні зі 170 уроків ви вивчите команди терміналу, створивши шаблонний код вебсайту, використовуючи лише командний рядок."
        ]
      },
      "vfje": {
        "title": "333",
        "intro": []
      },
      "quiz-bash-commands": {
        "title": "Тест «Команди Bash»",
        "intro": ["Перевірте, що ви дізнались про команди Bash."]
      },
      "thsj": {
        "title": "335",
        "intro": []
      },
      "workshop-mario-database": {
        "title": "Створіть базу даних «Mario»",
        "intro": [
          "Реляційна база даних організовує дані в таблиці, які пов’язані між собою через спорідненість.",
          "У цьому практичному завданні зі 165 уроків ви вивчите основи реляційної бази даних, створивши базу даних PostgreSQL, наповнену персонажами з відеоігор."
        ]
      },
      "lab-celestial-bodies-database": {
        "title": "Створіть базу даних «Небесні тіла»",
        "intro": [
          "У цьому проєкті ви побудуєте базу даних небесних тіл, використовуючи PostgreSQL."
        ]
      },
      "cvvu": {
        "title": "338",
        "intro": []
      },
      "quiz-relational-database": {
        "title": "Тест «Реляційна база даних»",
        "intro": ["Перевірте, що ви дізнались про реляційні бази даних."]
      },
      "ynqt": {
        "title": "340",
        "intro": []
      },
      "workshop-bash-five-programs": {
        "title": "Створіть п’ять програм",
        "intro": [
          "Скрипти Bash поєднують команди терміналу і логіку в програми, які можуть виконувати або автоматизувати завдання та багато іншого.",
          "У цьому практичному завданні з 220 уроків ви детальніше вивчите команди терміналу та як їх використовувати в скриптах Bash, створивши п’ять невеликих програм."
        ]
      },
      "hnta": {
        "title": "342",
        "intro": []
      },
      "quiz-bash-scripting": {
        "title": "Тест «Скрипти Bash»",
        "intro": ["Перевірте, що ви дізнались про скрипти Bash."]
      },
      "pegc": {
        "title": "344",
        "intro": []
      },
      "workshop-sql-student-database-part-1": {
        "title": "Створіть базу даних студентів: частина 1",
        "intro": [
          "SQL, або Structured Query Language (мова структурованих запитів) — це мова для спілкування з реляційною базою даних.",
          "У цьому практичному завданні зі 140 уроків ви створите скрипт Bash, який використовує SQL, щоб ввести інформацію про студентів з інформатики в PostgreSQL."
        ]
      },
      "workshop-sql-student-database-part-2": {
        "title": "Створіть базу даних студентів: частина 2",
        "intro": [
          "У SQL використовують команди join, щоб об’єднати інформацію з декількох таблиць у реляційну базу даних.",
          "У цьому практичному завданні зі 140 уроків ви завершите свою базу даних студентів, глибше занурившись в команди SQL."
        ]
      },
      "lab-world-cup-database": {
        "title": "Створіть базу даних «Чемпіонат світу»",
        "intro": [
          "У цьому проєкті ви створите скрипт Bash, який вводить інформацію з ігор чемпіонату світу в PostgreSQL, а потім запитує базу даних для отримання статистики."
        ]
      },
      "workshop-kitty-ipsum-translator": {
        "title": "Створіть перекладач Kitty Ipsum",
        "intro": [
          "Команди Bash можуть більше, ніж ви могли собі уявити.",
          "У цьому практичному завданні зі 140 уроків ви вивчите деякі складніші команди, а також дізнаєтесь про деталі їхньої роботи."
        ]
      },
      "workshop-bike-rental-shop": {
        "title": "Створіть магазин прокату велосипедів",
        "intro": [
          "У цьому практичному завданні з 210 уроків ви створите інтерактивну програму Bash, яка зберігатиме інформацію про оренду для магазину прокату велосипедів, використовуючи PostgreSQL."
        ]
      },
      "lab-salon-appointment-scheduler": {
        "title": "Build a Salon Appointment Scheduler",
        "intro": [
          "For this lab, you will create an interactive Bash program that uses PostgreSQL to track the customers and appointments for your salon."
        ]
      },
      "udfh": {
        "title": "351",
        "intro": []
      },
      "quiz-bash-and-sql": {
        "title": "Тест «Bash та SQL»",
        "intro": ["Перевірте, що ви дізнались про Bash та SQL."]
      },
      "movb": {
        "title": "353",
        "intro": []
      },
      "workshop-castle": {
        "title": "Створіть замок",
        "intro": [
          "Nano — це програма, яка дозволяє редагувати файли одразу в терміналі.",
          "У цьому практичному завданні з 40 уроків ви дізнаєтесь, як редагувати файли в терміналі за допомогою Nano під час будівництва замку."
        ]
      },
      "dzsr": {
        "title": "355",
        "intro": []
      },
      "quiz-nano": {
        "title": "Тест «Nano»",
        "intro": ["Перевірте, що ви дізнались про Nano."]
      },
      "pzmc": {
        "title": "357",
        "intro": []
      },
      "workshop-sql-reference-object": {
        "title": "Build an SQL Reference Object",
        "intro": [
          "Git — це система контролю версій, яка відстежує усі зміни, внесені вами до кодової бази.",
          "У цьому практичному завданні з 240 уроків ви вивчите, як Git відстежує код, створивши об’єкт, що містить часто використовувані команди SQL."
        ]
      },
      "lab-periodic-table-database": {
        "title": "Створіть базу даних «Періодична таблиця»",
        "intro": [
          "У цій лабораторній роботі ви створите Bash-скрипт, щоб отримати інформацію про хімічні елементи з бази даних періодичної таблиці."
        ]
      },
      "lab-number-guessing-game": {
        "title": "Build a Number Guessing Game",
        "intro": [
          "For this lab, you will use Bash scripting, PostgreSQL, and Git to create a number guessing game that runs in the terminal and saves user information."
        ]
      },
      "nfoc": {
        "title": "361",
        "intro": []
      },
      "quiz-git": {
        "title": "Тест «Git»",
        "intro": ["Перевірте, що ви дізнались про Git."]
      },
      "ibmn": {
        "title": "363",
        "intro": []
      },
      "zpjj": {
        "title": "364",
        "intro": []
      },
      "ghfk": {
        "title": "365",
        "intro": []
      },
      "ugfq": {
        "title": "366",
        "intro": []
      },
      "quiz-security-and-privacy": {
        "title": "Тест «Безпека та приватність»",
        "intro": ["Перевірте, що ви дізнались про безпеку та приватність."]
      },
      "qjov": {
        "title": "368",
        "intro": []
      },
      "workshop-npm-packages": {
        "title": "Managing Packages with npm",
        "intro": [
          "npm (Node Package Manager), is a command line tool to install, create, and share packages of JavaScript code written for Node.js. There are many open source packages available on npm, so before starting a project, take some time to explore so you don't end up recreating the wheel for things like working with dates or fetching data from an API.",
          "In this workshop, you'll learn the basics of using npm, including how to work with the <code>package.json</code> file and how to manage your installed dependencies."
        ]
      },
      "hjku": {
        "title": "370",
        "intro": []
      },
      "workshop-node-and-express": {
        "title": "Basic Node and Express",
        "intro": [
          "Node.js is a JavaScript runtime that allows developers to write backend (server-side) programs in JavaScript. Node.js comes with a handful of built-in modules — small, independent programs — that help with this. Some of the core modules include HTTP, which acts like a server, and File System, a module to read and modify files.",
          "In the last set of courses you learned to install and manage packages from npm, which are collections of smaller modules. These packages can help you build larger, more complex applications.",
          "Express is a lightweight web application framework, and is one of the most popular packages on npm. Express makes it much easier to create a server and handle routing for your application, which handles things like directing people to the correct page when they visit a certain endpoint like <pre>/blog</pre>.",
          "In this course, you'll learn the basics of Node and Express including how to create a server, serve different files, and handle different requests from the browser."
        ]
      },
      "lab-timestamp-microservice": {
        "title": "Build a Timestamp Microservice",
        "intro": ["In this lab you will build a timestamp microservice"]
      },
      "lab-request-header-parser-microservice": {
        "title": "Build a Request Header Parser Microservice",
        "intro": [
          "In this lab, you will build a request header parser microservice"
        ]
      },
      "lab-url-shortener-microservice": {
        "title": "Build a URL Shortener Microservice",
        "intro": ["In this lab, you will build a URL Shortener Microservice"]
      },
      "lab-exercise-tracker": {
        "title": "Створіть трекер вправ",
        "intro": ["У цій лабораторній роботі ви створите трекер вправ."]
      },
      "lab-file-metadata-microservice": {
        "title": "Build a File Metadata Microservice",
        "intro": ["For this lab you will build a file metadata microservice"]
      },
      "kegi": {
        "title": "377",
        "intro": []
      },
      "quiz-backend-javascript": {
        "title": "Тест «Backend JavaScript»",
        "intro": ["Перевірте, що ви дізнались про Backend JavaScript."]
      },
      "vnfu": {
        "title": "379",
        "intro": []
      },
      "rlli": {
        "title": "380",
        "intro": []
      },
      "rjpv": {
        "title": "381",
        "intro": []
      },
      "xbri": {
        "title": "382",
        "intro": []
      },
      "quiz-tooling-and-deployment": {
        "title": "Tooling and Deployment Quiz",
        "intro": [
          "Test what you've learned in this quiz of tooling and deployment"
        ]
      },
      "nkjt": {
        "title": "384",
        "intro": []
      },
      "pgjj": {
        "title": "385",
        "intro": []
      },
      "exom": {
        "title": "386",
        "intro": []
      },
      "bvqc": {
        "title": "387",
        "intro": []
      },
      "xish": {
        "title": "388",
        "intro": []
      },
      "front-end-development-certification-exam": {
        "title": "Екзамен з сертифікації «Front End розробка»",
        "intro": ["", ""]
      }
    }
  },
  "misc-text": {
    "certification": "Сертифікація «{{cert}}»",
    "browse-other": "Перегляньте інші безоплатні сертифікації\n(ми рекомендуємо виконувати їх послідовно)",
    "courses": "Курси",
    "steps": "Кроки",
    "expand": "Розгорнути курс",
    "collapse": "Згорнути курс",
    "legacy-header": "Застарілі курси",
    "legacy-desc": "Ці курси більше не входять до сертифікацій, але вони досі доступні для навчання.",
    "legacy-go-back": "Перейдіть до поточної версії навчальної програми.",
    "course-maintenance": "Ці курси знаходяться на технічному обслуговуванні. Якщо вони не працюють, див. як запустити їх локально на <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "course-disabling-soon": "Вебверсія цих курсів буде тимчасово недоступна, а віртуальні машини будуть видалені. Будь-який прогрес на віртуальних машинах буде втрачено. Якщо у вас є файли, які ви хочете зберегти, збережіть їх на своєму комп’ютері. Просимо вибачення за будь-які незручності. Ми сподіваємося, що покращена вебверсія цих курсів стане доступною в найближчий час.",
    "course-disabled": "Ці курси тимчасово недоступні для виконання в браузері. Просимо вибачення за будь-які незручності. Ви можете дізнатись, як запустити їх локально на <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. Ми сподіваємося, що покращена вебверсія стане доступною в найближчий час.",
    "run-locally": "Наразі ми рекомендуємо запускати курси локально на своєму комп’ютері. Більше деталей за посиланням <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "Ваш прогрес не буде збережений в обліковому записі freeCodeCamp при локальному запуску.",
    "go-back-to-learn": "Поверніться до стабільної версії навчальної програми.",
    "read-database-cert-article": "Будь ласка, прочитайте повідомлення на форумі, перш ніж продовжити.",
    "enable-cookies": "Увімкніть сторонні файли cookie перед початком роботи.",
    "english-only": "Курси в цьому розділі доступні лише англійською мовою. Наразі ми можемо перекладати лише заголовки й вступи, а не самі уроки.",
    "exam-english-only": "Зверніть увагу, що наразі екзамен доступний лише англійською мовою. Решта курсів доступні деякими іншими мовами."
  }
}
