{
  "responsive-web-design": {
    "title": "Адаптивний вебдизайн (застаріла версія)",
    "intro": [
      "У сертифікації «Адаптивний вебдизайн» ви вивчите мови, які розробники використовують для створення вебсторінок: HTML (мова розмітки гіпертексту) для вмісту та CSS (каскадні таблиці стилів) для дизайну.",
      "Спочатку ви створите застосунок із фотографіями котів, аби вивчити основи HTML та CSS. Пізніше ви опануєте сучасні методи (серед яких змінні CSS) завдяки створенню пінгвіна, а також опануєте найкращі практики доступності, побудувавши вебформу.",
      "Ви також дізнаєтеся, як конструювати вебсайти, які відповідають різним розмірам екранів, створивши Twitter Card за допомогою Flexbox, а ще складний макет блогу з CSS Grid."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та темні режими) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють вміст або макет сторінок під час виконання курсу."
  },
  "2022/responsive-web-design": {
    "title": "Адаптивний вебдизайн",
    "intro": [
      "В сертифікації «Адаптивний вебдизайн» ви вивчите мови, які розробники використовують для створення вебсторінок: HTML (мова розмітки гіпертексту) для вмісту та CSS (каскадні таблиці стилів) для дизайну.",
      "Спочатку ви створите застосунок із фотографіями котів, аби вивчити основи HTML та CSS. Пізніше ви опануєте сучасні методи, такі як змінні CSS, завдяки створенню пінгвіна, а також створите вікторину, щоб опанувати доступність.",
      "Наостанок ви дізнаєтеся, як створити вебсторінки, які реагують на зміну розміру екрану, створивши фотогалерею за допомогою Flexbox і макет журналу з CSS Grid."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та темні режими) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють вміст або макет сторінок під час виконання курсу."
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Алгоритми JavaScript та структури даних (застаріла версія)",
    "intro": [
      "Якщо HTML та CSS відповідають за вміст і стилізацію сторінки, то JavaScript робить її інтерактивною. У сертифікації «Алгоритми JavaScript та структури даних» ви вивчите основи JavaScript, включно зі змінними, масивами, об’єктами, циклами та функціями.",
      "Як тільки ви вивчите основи, ви почнете застосовувати ці знання, створюючи алгоритми, щоб уміло маніпулювати рядками, факторизувати числа, і навіть зможете обчислити орбіту міжнародної космічної станції.",
      "Крім того, ви також вивчите два важливих стилі або парадигми в програмуванні: об’єктноорієнтоване програмування (ООП) та функційне програмування (ФП)."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та скриптів) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють або блокують вміст сторінок під час виконання курсу."
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "Алгоритми та структури даних JavaScript",
    "intro": [
      "Розробники використовують HTML та CSS, щоб контролювати вміст та стилізувати сторінку, а JavaScript — щоб зробити цю сторінку інтерактивною.",
      "У сертифікації «Алгоритми JavaScript та структури даних» ви вивчите основи JavaScript, включно зі змінними, масивами, об’єктами, циклами, функціями, об’єктною моделлю документа та багато іншого.",
      "Ви також вивчите об’єктноорієнтоване програмування, функціональне програмування, алгоритмічне мислення, способи роботи з локальним сховищем і отримання даних з API."
    ],
    "note": "Примітка: деякі розширення браузера (наприклад, блокувальники реклами та скриптів) можуть втручатися в тести. Якщо ви зіткнулися з подібною проблемою, ми рекомендуємо вимкнути розширення, які змінюють або блокують вміст сторінок під час виконання курсу."
  },
  "front-end-development-libraries": {
    "title": "Бібліотеки Front End",
    "intro": [
      "Тепер, коли ви вже знайомі з HTML, CSS та JavaScript, піднімімо ваш рівень навичок, вивчаючи декілька найбільш популярних бібліотек верстки в галузі.",
      "У сертифікації «Бібліотеки Front End» ви навчитеся швидко стилізувати свій сайт за допомогою Bootstrap. Також ви навчитеся покращувати свої стилі CSS та розширювати їх за допомогою Sass.",
      "Згодом ви розробите кошик для покупок та інші застосунки, щоб навчитися створювати потужні односторінкові застосунки (SPAs) з React та Redux."
    ],
    "note": ""
  },
  "data-visualization": {
    "title": "Візуалізація даних",
    "intro": [
      "Дані повсюди, але це не означає, що більшість з них без форми чи контексту.",
      "У сертифікації «Візуалізація даних» ви створите діаграми, графіки та карти, що показують різні типи даних, за допомогою бібліотеки D3.js.",
      "Ви також дізнаєтесь про JSON (JavaScript Object Notation) та як працювати з даними онлайн, користуючись API (Application Programing Interface)."
    ],
    "note": ""
  },
  "relational-database": {
    "title": "Реляційна база даних",
    "intro": [
      "У цих курсах ви використовуватимете реальні інструменти розробника та програмне забезпечення, включно з VS Code, PostgreSQL та командним рядком Linux / Unix для завершення інтерактивних уроків і створення проєктів.",
      "Ці курси починаються з основних команд Bash. За допомогою терміналу ви навчитеся усього необхідного (від навігації та маніпуляції файловою системою, написання скрипту в Bash до просунутого використання).",
      "Далі ви навчитеся створювати та використовувати реляційну базу даних з PostgreSQL (система керування базами даних) та SQL (мова баз даних).",
      "Зрештою, ви дізнаєтеся про Git, систему контролю версій, важливий інструмент кожного розробника."
    ]
  },
  "back-end-development-and-apis": {
    "title": "Розробка Back End та API",
    "intro": [
      "До цього моменту ви використовували JavaScript тільки для front end, аби зробити вебсторінку інтерактивнішою, розв’язати завдання з алгоритмами, або створити SPA. Але JavaScript можна використовувати й у back end, або на сервері, для створення цілих вебзастосунків.",
      "Сьогодні один із найпопулярніших способів створення застосунків — за допомогою мікрослужб, які є маленькими модульними застосунками та разом формують єдине ціле.",
      "У сертифікації «Розробка Back End та API» ви навчитеся писати back end програми за допомогою Node.js та npm. Ви також створите вебзастосунок за допомогою фреймворку Express та мікрослужбу для пошуку людей за допомогою MongoDB і бібліотеки Mongoose."
    ],
    "note": ""
  },
  "quality-assurance": {
    "title": "Забезпечення якості",
    "intro": [
      "Оскільки ваші програми чи вебзастосунки стають складнішими, ви захочете протестувати їх, щоб переконатися, що нові зміни не порушують початкові функції.",
      "У сертифікації «Забезпечення якості» ви дізнаєтесь як писати тести з Chai, щоб переконатись, що ваші застосунки працюють так, як ви очікуєте.",
      "Потім ви створите застосунок чату, щоб вивчити розширені концепції Node та Express. Ви також будете використовувати Pug як шаблонізатор, Passport для автентифікації та Socket.io для комунікування в режимі реального часу між сервером та підключеними клієнтами."
    ],
    "note": ""
  },
  "scientific-computing-with-python": {
    "title": "Наукові обчислення з Python",
    "intro": [
      "Навчальна програма «Наукові обчислення з Python» допоможе отримати навички аналізу та маніпулювання даними за допомогою Python — потужної та універсальної мови програмування. Ви вивчите ключові поняття, серед яких структури даних, алгоритми, об’єктноорієнтоване програмування, а також як виконувати складні обчислення за допомогою різноманітних інструментів.",
      "Цей комплексний курс ознайомить вас з основами наукових обчислень, включно зі структурами даних та алгоритмами."
    ],
    "note": ""
  },
  "data-analysis-with-python": {
    "title": "Аналіз даних з Python",
    "intro": [
      "Аналіз даних існує вже давно. Але ще кілька років тому розробники практикували його за допомогою дорогих інструментів із закритим кодом, таких як Tableau. Але нещодавно Python, SQL та інші відкриті бібліотеки назавжди змінили аналіз даних.",
      "У сертифікації «Аналіз даних з Python» ви дізнаєтесь про основи аналізу даних за допомогою Python. Наприкінці цієї сертифікації ви будете знати, як читати дані з таких джерел, як CSV та SQL, і як використовувати бібліотеки, такі як Numpy, Pandas, Matplotlib та Seaborn для обробки та візуалізації даних."
    ],
    "note": ""
  },
  "information-security": {
    "title": "Інформаційна безпека",
    "intro": [
      "Завдяки всьому, що ми робимо в Інтернеті, величезна кількість конфіденційної інформації знаходиться в зоні ризику: електронні адреси, паролі, номери телефонів тощо.",
      "Завдяки сертифікації «Інформаційна безпека» ви створите безпечний вебзастосунок за допомогою HelmetJS, щоб вивчити основи захисту інформації людей в Інтернеті.",
      "Ви також створите TCP client, а ще Nmap і сканер портів у Python. Це допоможе вам вивчити основи тесту на проникнення — важливого компоненту надійної інформаційної безпеки."
    ],
    "note": ""
  },
  "machine-learning-with-python": {
    "title": "Машинне навчання з Python",
    "intro": [
      "Машинне навчання має багато практичних застосунків, які ви можете використовувати у своїх проєктах чи роботі.",
      "У сертифікації «Машинне навчання з Python» ви використовуватимете фреймворк TensorFlow, аби створити декілька нейронних мереж і вивчити складніші техніки, серед яких обробка природної мови й навчання з підкріпленням.",
      "Також ви зануритеся у нейронні мережі та вивчите правила, за якими працюють глибокі, рекурентні та згорткові нейронні мережі."
    ],
    "note": ""
  },
  "college-algebra-with-python": {
    "title": "Алгебра з Python",
    "intro": [
      "Цей курс розроблений як односеместровий курс коледжу. Він складається з навчальних відео та блокнотів Google Colaboratory, за якими потрібно слідкувати протягом інтерактивів, завдань та проєктів.",
      "Під час проходження кожної частини курсу ви повністю зрозумієте алгебру та навчитесь писати код Python, який розв’язуватиме приклади.",
      "Протягом курсу ви також побудуєте блокнот Algebra Colab, який зможете використовувати як власний калькулятор. Цей курс (та код, який ви напишете) надасть вам основу, щоб краще зрозуміти математику та науку про дані."
    ],
    "note": ""
  },
  "python-for-everybody": {
    "title": "Python для всіх (застаріла версія)",
    "intro": [
      "Python — одна з найпопулярніших гнучких мов програмування на сьогодні. Ви можете використовувати її для всього: від базових скриптів до машинного навчання."
    ],
    "note": ""
  },
  "coding-interview-prep": {
    "title": "Підготовка до співбесіди з програмування",
    "intro": [
      "Шукаєте безоплатні вправи з програмування, щоб підготуватися до наступної співбесіди? Ми про це подбали.",
      "Цей розділ містить завдання з програмування, які перевіряють ваші знання алгоритмів, структур даних і математики. Тут також є декілька проєктів, які ви можете використати для зміцнення навичок або просто додати їх до свого портфоліо.",
      "Тут містяться матеріали з <a href=\"https://www.wikipedia.org/\" target=\"_blank\">вікіпедії</a>, які дозволені ліцензією <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\" target=\"_blank\">Creative Commons Attribution-ShareAlike License 4.0</a>. Оригінальний вміст міг бути змінений та адаптований. Для перегляду оригінальної версії та інших деталей відвідайте оригінальну сторінку на <a href=\"https://www.wikipedia.org/\" target\"_blank\">вікіпедії</a>."
    ]
  },
  "the-odin-project": {
    "title": "Проєкт «Odin»: версія freeCodeCamp",
    "intro": [
      "Проєкт «Odin» був створений розробником Еріком Траутманом у 2013 році. Протягом років з’явилася відкрита спільнота, яка доглядає за проєктом та розширює його.",
      "freeCodeCamp розширив відкриту навчальну програму, щоб зробити її інтерактивною у браузері. Проєкт міститиме тести, щоб оцінити ваш код та переконатись, що ви зрозуміли основні поняття.",
      "Якщо ви хочете отримати оригінальний досвід налаштування проєкту на локальному комп’ютері, див. першоджерело проєкту на <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>The Odin Project</a>. Велика подяка спільноті проєкту «Odin» за підтримку цього цінного навчального ресурсу для розробників з усього світу.",
      "Цей курс неофіційний та не підтримується The Odin Project. До навчальної програми проєкту було внесено зміни, а весь навчальний матеріал курсу підлягає ліцензуванню <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; Проєкт «Odin»</a>",
      "Цей курс містить матеріал з <a href='https://javascript.info/' target='_blank' rel='noopener noreferrer nofollow'>JavaScript.info</a>, що підлягає ліцензуванню <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>."
    ]
  },
  "project-euler": {
    "title": "Проєкт Ейлера",
    "intro": [
      "Виконайте завдання з програмування з архівів проєкту Ейлера. Вони удосконалять ваші алгоритмічні та математичні знання.",
      "Тут є завдання різної складності, а для багатьох здобуття досвіду полягає в індуктивному методі навчання. Тобто вирішення одного завдання прояснить нову концепцію та дозволить вирішити раніше незрозуміле завдання. Чи під силу вам вирішити кожне?"
    ]
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "Безоплатна сертифікація «Основи C# з Microsoft»",
    "intro": [
      "Цей курс пропонує всебічне знайомство з мовою програмування C#, розглядаючи основні поняття, синтаксис та практичне застосування у розробці програмного забезпечення.",
      "Завдяки практичним вправам та проєктам ви вивчите основи C#, включно зі змінними, типами даних, структурами керування та принципами об’єктноорієнтованого програмування.",
      "Після завершення курсу ви отримаєте практичні навички та знання, необхідні для впевненого використання C# при побудові застосунків."
    ],
    "note": "Кожен розділ має трофей, пов’язаний з розділом, та який ви маєте отримати на навчальній платформі Microsoft. Після здобуття кожного трофею, їх потрібно підтвердити на freeCodeCamp. Після цього ви зможете скласти екзамен з сертифікації."
  },
  "a2-english-for-developers": {
    "title": "Сертифікація «Англійська мова A2 для розробників» (бета)",
    "intro": [
      "У цьому курсі з вивчення англійської мови для розробників ви опануєте основи англійської комунікації. Курс створено відповідно до загальноєвропейських рекомендацій з мовної освіти рівня A2 (CEFR). Ми зосередилися на словниковому запасі, що є особливо корисним для розробників.",
      "Перша частина допоможе освоїти граматику та використання англійської мови. Ви виконаєте багато практичних вправ, дізнавшись основи (наприклад, представлення себе, проведення коротких розмов і обговорення роботи).",
      "У другій частині ви практикуватимете словниковий запас, специфічний для розробки програмного забезпечення. Ви навчитеся описувати код, обговорювати технологічні тенденції та брати участь у зустрічах.",
      "Весь курс рівня A2 складається з 105 різних діалогів. Кожен з них створений для того, щоб розширити ваш словниковий запас та підвищити впевненість під час спілкування в професійному середовищі."
    ]
  },
  "b1-english-for-developers": {
    "title": "Сертифікація «Англійська мова B1 для розробників» (бета)",
    "intro": [
      "У цьому курсі з вивчення англійської мови для розробників ви опануєте основи англійської комунікації. Курс створено відповідно до загальноєвропейських рекомендацій з мовної освіти рівня B1 (CEFR). Ми зосередилися на словниковому запасі, що є особливо корисним для розробників.",
      "Курс допоможе зміцнити базові знання, одночасно ознайомлюючи із більш складною граматикою та використанням. Ви навчитесь описувати місця та речі, ділитися досвідом і впевнено використовувати часи, серед яких теперішній доконаний та простий майбутній. А також отримаєте практичні поради: як вести розмову, ділитись думкою та висловлювати згоду чи незгоду.",
      "Основний фокус на застосуванні цих навичок у професійній та технологічній галузях. Ви будете практикувати словниковий запас і фрази, важливі для розробників: як описувати код, брати участь у зустрічах і обговорювати технологічні тенденції. До складніших тем належать умовні речення, порівняльні конструкції та підтримка розмови, щоб підготувати вас до реальних взаємодій у технологічній індустрії.",
      "Весь курс рівня B1 складається з 73 різних діалогів. Кожен з них створений для того, щоб розширити ваш словниковий запас та підвищити впевненість під час спілкування в професійному середовищі."
    ]
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Розвиньте свої навички творчого підходу до розв’язання проблем за допомогою завдань з базової бібліотеки Rosetta Code.",
      "Ці завдання можуть виявитися важкими, але вони підштовхнуть ваше логічне мислення до нових висот.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Атрибут: Rosetta Code</a>"
    ]
  },
  "full-stack-developer": {
    "title": "Навчальна програма «Сертифікований Full Stack розробник»",
    "intro": [
      "Цей курс надає комплексний шлях, щоб стати сертифікованим Full Stack розробником. У ньому охоплено всі технології, необхідні для створення сучасних масштабованих програм від початку до кінця.",
      "Завдяки поєднанню інтерактивних уроків, практичних завдань та реальних проєктів, ви опануєте як Front End, так і Back End. Ви працюватимете з HTML, CSS і JavaScript для створення адаптивних інтерфейсів, досліджуватимете React і TypeScript для створення складних вебзастосунків та навчитеся керувати даними за допомогою реляційних баз даних. На стороні Back End ви використовуватимете Git, Npm, Node.js і Python для створення потужних серверних рішень.",
      "Наприкінці курсу ви отримаєте практичні навички та досвід, які дозволять впевнено розробляти повноцінні вебзастосунки, що підготує вас до успішної кар’єри Full Stack розробника.",
      "Для отримання цієї сертифікації потрібно багато часу і зусиль. Якщо ви розпочнете зараз, то будете готові до решти матеріалу і кінцевого екзамену як тільки ми опублікуємо їх протягом найближчих місяців."
    ],
    "chapters": {
      "html": "HTML",
      "css": "CSS",
      "javascript": "JavaScript",
      "frontend-libraries": "Бібліотеки для Front End",
      "relational-databases": "Реляційні бази даних",
      "backend-javascript": "Back End JavaScript",
      "python": "Python",
      "career": "Кар’єра"
    },
    "modules": {
      "basic-html": "Основи HTML",
      "semantic-html": "Семантичний HTML",
      "html-forms-and-tables": "Форми та таблиці",
      "html-and-accessibility": "Доступність",
      "review-html": "Повторення HTML",
      "exam-html": "Екзамен «HTML»",
      "computer-basics": "Основи комп’ютера",
      "basic-css": "Основи CSS",
      "design-for-developers": "Дизайн",
      "absolute-and-relative-units": "Відносні та абсолютні одиниці",
      "pseudo-classes-and-elements": "Псевдокласи й псевдоелементи",
      "css-colors": "Кольори",
      "styling-forms": "Стилізація форм",
      "css-box-model": "Блокова модель",
      "css-flexbox": "Flexbox",
      "css-typography": "Типографія",
      "css-and-accessibility": "Доступність",
      "attribute-selectors": "Селектори атрибутів",
      "css-positioning": "Позиціювання",
      "responsive-design": "Адаптивний дизайн",
      "css-variables": "Змінні",
      "css-grid": "Сітка",
      "css-animations": "Анімації",
      "review-css": "Повторення CSS",
      "exam-css": "Екзамен «CSS»",
      "code-editors": "Редактори коду",
      "javascript-variables-and-strings": "Змінні та рядки",
      "javascript-booleans-and-numbers": "Булеві значення та числа",
      "javascript-functions": "Функції",
      "javascript-arrays": "Масиви",
      "javascript-objects": "Об’єкти",
      "javascript-loops": "Цикли",
      "review-javascript-fundamentals": "Повторення основ JavaScript",
      "higher-order-functions-and-callbacks": "Функції вищого порядку та зворотного виклику",
      "dom-manipulation-and-events": "Маніпуляція DOM та події Click в JavaScript",
      "js-a11y": "JavaScript та доступність",
      "debugging-javascript": "Налагодження",
      "basic-regex": "Основи регулярних виразів",
      "form-validation": "Валідація форм",
      "javascript-dates": "Дати",
      "audio-and-video-events": "Аудіо- та відеоподії",
      "maps-and-sets": "Map та set",
      "localstorage-and-crud-operations": "localStorage та операції CRUD",
      "classes-and-the-this-keyword": "Класи",
      "recursion": "Рекурсія",
      "functional-programming": "Функціональне програмування",
      "asynchronous-javascript": "Асинхронний JavaScript",
      "review-javascript": "Повторення JavaScript",
      "exam-javascript": "Екзамен «JavaScript»",
      "react-fundamentals": "Основи React",
      "react-state-hooks-and-routing": "Стани, хуки та маршрутизація в React",
      "performance": "Продуктивність",
      "testing": "Тестування",
      "css-libraries-and-frameworks": "Бібліотеки та фреймворки CSS",
      "data-visualization": "Data Visualization and D3",
      "typescript-fundamentals": "Основи TypeScript",
      "review-front-end-libraries": "Повторення бібліотек для Front End",
      "exam-front-end-libraries": "Екзамен «Бібліотеки для Front End»",
      "python-basics": "Основи Python",
      "python-loops-and-sequences": "Цикли та послідовності",
      "python-dictionaries-and-sets": "Словники та набори",
      "python-error-handling": "Обробка помилок",
      "python-classes-and-objects": "Класи та об’єкти",
      "python-object-oriented-programming": "Об’єктноорієнтоване програмування (ООП)",
      "python-linear-data-structures": "Лінійні структури даних",
      "python-algorithms": "Алгоритми",
      "python-graphs-and-trees": "Графи та дерева",
      "python-dynamic-programming": "Динамічне програмування",
      "review-python": "Повторення Python",
      "exam-python": "Екзамен «Python»",
      "bash-fundamentals": "Основи Bash",
      "sql-and-postgresql": "SQL and PostgreSQL",
      "bash-scripting": "Скрипти Bash",
      "sql-and-bash": "SQL та Bash",
      "git": "Git",
      "review-relational-databases": "Relational Databases Review",
      "exam-relational-databases": "Relational Databases Exam",
      "introduction-to-nodejs": "Вступ до Node.js",
      "nodejs-core-libraries": "Основні бібліотеки Node.js",
      "node-package-manager": "Node Package Manager",
      "http-and-the-web-standards-model": "HTTP та модель вебстандартів",
      "rest-api-and-web-services": "REST API та вебсервіси",
      "introduction-to-express": "Вступ до Express",
      "express-middleware": "Проміжне програмне забезпечення Express",
      "error-handling-in-express": "Обробка помилок в Express",
      "websockets": "WebSockets",
      "node-and-sql": "Node та SQL",
      "security-and-privacy": "Безпека та приватність",
      "authentication": "Автентифікація",
      "tooling-and-deployment": "Інструменти та розгортання",
      "how-to-get-a-developer-job": "Як знайти роботу розробнику",
      "capstone-project": "Фінальний проєкт",
      "certified-full-stack-developer-exam": "Екзамен «Сертифікований Full Stack розробник»"
    },
    "module-intros": {
      "data-visualization": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will be introduced to data visualization and learn how to work with the D3 library."
        ]
      },
      "typescript-fundamentals": {
        "note": "Очікуйте цієї осені",
        "intro": [
          "У цьому модулі ви ознайомитесь з TypeScript — розширеною версією JavaScript, яка дозволяє додавати статичну типізацію до JavaScript-коду. Ви виконаєте декілька практичних занять і лабораторних робіт, де застосуєте узагальнення, звуження типів, TSX і багато іншого. А потім перевірите отримані знання з основ TypeScript, пройшовши короткий тест."
        ]
      },
      "python-classes-and-objects": {
        "note": "Очікуйте цієї зими",
        "intro": [
          "У цьому модулі ви навчитесь працювати з класами, методами, атрибутами і властивостями. Ви застосуєте ці поняття в практичних заняттях і лабораторних роботах, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "python-object-oriented-programming": {
        "note": "Очікуйте цієї зими",
        "intro": [
          "У цьому модулі ви дізнаєтесь про деякі поняття об’єктноорієнтованого програмування, серед яких інкапсуляція, успадкування і поліморфізм. Ви застосуєте ці поняття в практичних заняттях і лабораторних роботах, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "python-linear-data-structures": {
        "note": "Очікуйте цієї зими",
        "intro": [
          "У цьому модулі ви дізнаєтесь про структури даних, до яких належать стеки, зв’язані списки і багато іншого. Ви застосуєте ці поняття в практичному занятті і лабораторній роботі, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "python-algorithms": {
        "note": "Очікуйте цієї зими",
        "intro": [
          "У цьому модулі ви дізнаєтесь про поширені алгоритми, до яких належать бінарний пошук, сортування злиттям, сортування вибором і багато іншого. Ви застосуєте ці поняття в практичних заняттях і лабораторних роботах, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "python-graphs-and-trees": {
        "note": "Очікуйте цієї зими",
        "intro": [
          "У цьому модулі ви дізнаєтесь про графи в інформатиці, а також про списки суміжності, дерева і багато іншого. Ви застосуєте ці поняття в практичних заняттях і лабораторних роботах, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "python-dynamic-programming": {
        "note": "Очікуйте цієї зими",
        "intro": [
          "У цьому модулі ви дізнаєтесь про динамічне програмування і застосуєте ці знання на практиці, виконавши лабораторну роботу із послідовністю Фібоначчі. Потім ви пройдете короткий тест, щоб перевірити отримані знання."
        ]
      },
      "bash-fundamentals": {
        "note": "Очікуйте цієї зими",
        "intro": [
          "У цьому модулі ви дізнаєтесь про командний рядок та поширені команди Bash. Потім ви виконаєте практичне заняття і перевірите отримані знання завдяки короткому тесту."
        ]
      },
      "sql-and-postgresql": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "bash-scripting": {
        "note": "Очікуйте цієї зими",
        "intro": [
          "У цьому модулі ви дізнаєтесь про скрипти bash і застосуєте ці навички на практиці, створивши п’ять програм. А завдяки тесту перевірите отримані знання."
        ]
      },
      "sql-and-bash": {
        "note": "Очікуйте цієї зими",
        "intro": [
          "У цьому модулі ви дізнаєтесь про нормалізацію, SQL-ін’єкцію та проблему N+1. Потім ви застосуєте SQL і Bash на практиці, виконавши декілька практичних занять і лабораторних робіт. А завдяки тесту перевірите отримані знання."
        ]
      },
      "git": {
        "note": "Очікуйте цієї зими",
        "intro": [
          "У цьому модулі ви дізнаєтесь, як використовувати Git, Nano та GitHub. Потім ви перейдете до практичної частини з Git, де виконаєте декілька практичних занять і лабораторних робіт. А завдяки тесту перевірите отримані знання."
        ]
      },
      "introduction-to-nodejs": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви ознайомитесь з Node.js — середовищем виконання JavaScript, яке дозволяє створювати бекендні застосунки за допомогою JavaScript. Потім ви виконаєте невеличке практичне заняття і перевірите отримані знання за допомогою тесту."
        ]
      },
      "nodejs-core-libraries": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви ознайомитесь з поширеними бібліотеками Node.js, до яких належать fs, os, path та інші. Потім ви перейдете до практичних занять і лабораторних робіт, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "node-package-manager": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви ознайомитесь з Node Package Manager, який розробники використовують для керування залежностями і скриптами проєкту. Потім ви перейдете до практичних занять і лабораторних робіт, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "http-and-the-web-standards-model": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви дізнаєтесь про HTTP та інші важливі поняття (зокрема про модель системи запит-відповідь, поширені коди стану, DNS, TCP/IP тощо). Потім ви застосуєте ці навички на практиці, створивши власний вебсервер, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "rest-api-and-web-services": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви дізнаєтесь про REST API (Representational State Transfer Application Programming Interface) і принципи роботи мікросервісів. А потім пройдете короткий тест, щоб перевірити отримані знання."
        ]
      },
      "introduction-to-express": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви ознайомитесь з Express.js — фреймворком, який використовують для створення RESTful API. Потім ви перейдете до практичних занять і лабораторних робіт, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "express-middleware": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви дізнаєтесь про проміжне програмне забезпечення в Express.js, яке обробляє запити та відповіді між клієнтом і сервером. Потім ви перейдете до практичного заняття і лабораторної роботи, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "error-handling-in-express": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви дізнаєтесь про обробку помилок, налагодження і перевірку справності в Express.js. Потім ви застосуєте ці навички в лабораторній роботі, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "websockets": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви ознайомитесь з Websocket — протоколом, який використовують для спілкування між клієнтом і сервером в режимі реального часу. Потім ви перейдете до практичних занять і лабораторних робіт, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "node-and-sql": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви застосуєте Node і SQL на практиці, створивши пару застосунків. А потім пройдете короткий тест, щоб перевірити отримані знання."
        ]
      },
      "security-and-privacy": {
        "note": "Очікуйте цієї осені",
        "intro": [
          "У цьому модулі ви дізнаєтесь про різницю між безпекою і приватністю, а також ознайомитесь з різними поняттями (включно з CSP, Permissions Policy, PII, CORS і багато іншим). Потім ви пройдете короткий тест, щоб перевірити отримані знання."
        ]
      },
      "authentication": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви дізнаєтесь про принципи роботи автентифікації у вебзастосунках та інші важливі поняття (JWT, CSRF, Passport, Helmet, криптографія, шифрування тощо). Потім ви перейдете до практичних занять і лабораторних робіт, а також перевірите отримані знання за допомогою тесту."
        ]
      },
      "tooling-and-deployment": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі ви дізнаєтесь про поширені інструменти для розгортання фулстекових програм. А потім пройдете короткий тест, щоб перевірити отримані знання."
        ]
      },
      "how-to-get-a-developer-job": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "У цьому модулі Квінсі Ларсон (засновник і вчитель freeCodeCamp) поділиться тим, як розпочати кар’єру в IT. Квінсі розкаже про резюме, портфоліо, ринок праці, підготовку до співбесіди та багато іншого."
        ]
      },
      "capstone-project": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "Чудова можливість створити повнофункціональний застосунок, використавши всі знання, отримані протягом сертифікації."
        ]
      },
      "certified-full-stack-developer-exam": {
        "note": "Очікуйте наприкінці 2026 року",
        "intro": [
          "Екзамен містить 90 запитань, які перевірять ваші знання з вивченого матеріалу."
        ]
      }
    }
  },
  "javascript-v9": {
    "title": "JavaScript Certification",
    "intro": [
      "This course teaches you core JavaScript programming concepts such as working with variables, functions, objects, arrays, and control flow. You'll also learn how to manipulate the DOM, handle events, and apply techniques like asynchronous programming, functional programming, and accessibility best practices.",
      "To qualify for the exam, you must complete the following projects:",
      "- Build a Markdown to HTML Converter",
      "- Build a Drum Machine",
      "- Build a Voting System",
      "- Build a Bank Account Management Program",
      "- Build a Weather App",
      "Pass the exam to earn your JavaScript Certification."
    ],
    "chapters": {
      "javascript": "JavaScript"
    },
    "modules": {
      "javascript-variables-and-strings": "Variables and Strings",
      "javascript-booleans-and-numbers": "Booleans and Numbers",
      "javascript-functions": "Functions",
      "javascript-arrays": "Arrays",
      "javascript-objects": "Objects",
      "javascript-loops": "Loops",
      "review-javascript-fundamentals": "JavaScript Fundamentals Review",
      "higher-order-functions-and-callbacks": "Higher Order Functions and Callbacks",
      "dom-manipulation-and-events": "DOM Manipulation and Events",
      "js-a11y": "JavaScript and Accessibility",
      "debugging-javascript": "Debugging",
      "basic-regex": "Basic Regex",
      "lab-markdown-to-html-converter": "Build a Markdown to HTML Converter",
      "form-validation": "Form Validation",
      "javascript-dates": "Dates",
      "audio-and-video-events": "Audio and Video Events",
      "lab-drum-machine": "Build a Drum Machine",
      "maps-and-sets": "Maps and Sets",
      "lab-voting-system": "Build a Voting System",
      "localstorage-and-crud-operations": "localStorage and CRUD Operations",
      "classes-and-the-this-keyword": "Classes",
      "lab-bank-account-manager": "Build a Bank Account Management Program",
      "recursion": "Recursion",
      "functional-programming": "Functional Programming",
      "asynchronous-javascript": "Asynchronous JavaScript",
      "lab-weather-app": "Build a Weather App",
      "review-javascript": "JavaScript Review",
      "javascript-certification-exam": "JavaScript Certification Exam"
    }
  },
  "front-end-development-libraries-v9": {
    "title": "Front End Development Libraries Certification",
    "intro": [
      "This course teaches you the libraries that developers use to build webpages: React, TypeScript, and more.",
      "To earn your Front End Development Libraries Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Front End Development Libraries Certification exam."
    ],
    "chapters": {
      "front-end-development-libraries": "Front End Development Libraries"
    },
    "modules": {
      "front-end-development-libraries-certification-exam": "Front End Development Libraries Certification Exam"
    }
  },
  "python-v9": {
    "title": "Python Certification",
    "intro": [
      "This course teaches you the fundamentals of Python programming.",
      "To earn your Python Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Python Certification exam."
    ],
    "chapters": {
      "python": "Python"
    },
    "modules": {
      "python-certification-exam": "Python Certification Exam"
    }
  },
  "relational-databases-v9": {
    "title": "Relational Databases Certification",
    "intro": [
      "This course teaches you the fundamentals of relational databases.",
      "To earn your Relational Databases Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Relational Databases Certification exam."
    ],
    "chapters": {
      "relational-databases": "Relational Databases"
    },
    "modules": {
      "relational-databases-certification-exam": "Relational Databases Certification Exam"
    }
  },
  "back-end-development-and-apis-v9": {
    "title": "Back End Development and APIs Certification",
    "intro": [
      "This course teaches you the fundamentals of back end development and APIs.",
      "To earn your Back End Development and APIs Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Back End Development and APIs Certification exam."
    ],
    "chapters": {
      "back-end-development-and-apis": "Back End Development and APIs"
    },
    "modules": {
      "back-end-development-and-apis-certification-exam": "Back End Development and APIs Certification Exam"
    }
  },
  "a1-professional-spanish": {
    "title": "A1 Professional Spanish Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"],
    "chapters": {
      "es-a1-chapter-welcome-to-a1-professional-spanish": "Welcome to A1 Professional Spanish",
      "es-a1-chapter-letters-and-sounds": "Letters and Sounds",
      "es-a1-chapter-greetings-and-introductions": "Greetings and Introductions"
    },
    "modules": {
      "es-a1-module-introduction-and-certification-overview": "Introduction and Certification Overview",
      "es-a1-module-alphabet-accents-and-punctuation": "Alphabet, Accents, and Punctuation",
      "es-a1-module-greetings-and-farewells": "Greetings and Farewells",
      "es-a1-module-introducing-yourself": "Introducing Yourself",
      "es-a1-module-first-questions": "First Questions"
    },
    "module-intros": {
      "es-a1-module-introduction-and-certification-overview": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-alphabet-accents-and-punctuation": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-greetings-and-farewells": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-introducing-yourself": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-first-questions": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      }
    }
  },
  "responsive-web-design-v9": {
    "title": "Responsive Web Design Certification",
    "intro": [
      "This course teaches the fundamentals of HTML and CSS, including modern layout, design, accessibility, and responsive web development. You'll build practical projects and gain the skills to create professional, user-friendly webpages.",
      "To qualify for the exam, you must complete the following projects:",
      "- Build a Survey Form",
      "- Build a Page of Playing Cards",
      "- Build a Book Inventory App",
      "- Build a Technical Documentation Page",
      "- Build a Product Landing Page",
      "Pass the exam to earn your Responsive Web Design Certification."
    ],
    "chapters": {
      "html": "HTML",
      "css": "CSS",
      "responsive-web-design-certification-exam": "Responsive Web Design Certification Exam"
    },
    "modules": {
      "basic-html": "Basic HTML",
      "semantic-html": "Semantic HTML",
      "html-forms-and-tables": "Forms and Tables",
      "html-and-accessibility": "Accessibility",
      "review-html": "HTML Review",
      "computer-basics": "Computer Basics",
      "basic-css": "Basic CSS",
      "design-for-developers": "Design",
      "absolute-and-relative-units": "Absolute and Relative Units",
      "pseudo-classes-and-elements": "Pseudo Classes and Elements",
      "css-colors": "Colors",
      "styling-forms": "Styling Forms",
      "css-box-model": "The Box Model",
      "css-flexbox": "Flexbox",
      "css-typography": "Typography",
      "css-and-accessibility": "Accessibility",
      "attribute-selectors": "Attribute Selectors",
      "css-positioning": "Positioning",
      "responsive-design": "Responsive Design",
      "css-variables": "Variables",
      "css-grid": "Grid",
      "css-animations": "Animations",
      "review-css": "CSS Review",
      "lab-survey-form": "Build a Survey Form",
      "lab-page-of-playing-cards": "Build a Page of Playing Cards",
      "lab-book-inventory-app": "Build a Book Inventory App",
      "lab-technical-documentation-page": "Build a Technical Documentation Page",
      "lab-product-landing-page": "Build a Product Landing Page",
      "responsive-web-design-certification-exam": "Responsive Web Design Certification Exam"
    }
  },
  "a2-professional-spanish": {
    "title": "Сертифікація «Іспанська мова A2 для роботи» (бета)",
    "note": "Сертифікація знаходиться в стані активної розробки. Наразі для цього розділу немає сертифіката, але він буде доступний найближчим часом. Тим часом ви можете дослідити курси, які ми вже створили.",
    "intro": ["Placeholder intro"]
  },
  "a2-professional-chinese": {
    "title": "Сертифікація «Китайська мова A2 для роботи» (бета)",
    "note": "Сертифікація знаходиться в стані активної розробки. Наразі для цього розділу немає сертифіката, але він буде доступний найближчим часом. Тим часом ви можете дослідити курси, які ми вже створили.",
    "intro": ["Placeholder intro"]
  },
  "a1-professional-chinese": {
    "title": "A1 Professional Chinese Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"]
  },
  "basic-html": {
    "title": "Основи HTML",
    "summary": [
      "Навчіться створювати прості вебсторінки з текстом, зображеннями і посиланнями, доданими за допомогою HTML-тегів."
    ],
    "intro": ["Larger intro for the superblock page."]
  },
  "semantic-html": {
    "title": "Семантичний HTML",
    "summary": [
      "Дізнайтесь, як писати чистіший і змістовніший HTML завдяки семантичним тегам, які покращують структуру, доступність та SEO."
    ],
    "intro": ["Larger intro for the superblock page."]
  },
  "dev-playground": {
    "title": "Ігровий майданчик",
    "intro": ["Ігровий майданчик для створення і тестування завдань"]
  },
  "full-stack-open": {
    "title": "Full Stack Open",
    "intro": ["A good intro is to be added here."],
    "chapters": {
      "part-0": "Fundamentals of Web Apps",
      "part-1": "Introduction to React",
      "part-2": "Communicating with Servers",
      "part-3": "Programming a Server with NodeJS and Express",
      "part-4": "Testing Express Servers, User Administration",
      "part-5": "Testing React Apps",
      "part-6": "Advanced State Management",
      "part-7": "React router, custom hooks, styling app with CSS and webpack",
      "part-8": "GraphQL",
      "part-9": "TypeScript",
      "part-10": "React Native",
      "part-11": "CI/CD",
      "part-12": "Containers",
      "part-13": "Using Relational Databases"
    },
    "modules": {
      "basic-html": "Basic HTML"
    },
    "module-intros": {
      "basic-html": {
        "title": "Basic HTML",
        "intro": [
          "Learn how to build simple webpages using HTML tags to add text, images, and links."
        ]
      }
    }
  },
  "daily-coding-challenge": {
    "title": "Daily Coding Challenge"
  },
  "misc-text": {
    "browse-other": "Перегляньте інші безоплатні сертифікації",
    "courses": "Курси",
    "steps": "Кроки",
    "expand": "Розгорнути курс",
    "collapse": "Згорнути курс",
    "legacy-header": "Застарілі курси",
    "legacy-desc": "Ці курси більше не входять до сертифікацій, але вони досі доступні для навчання.",
    "legacy-go-back": "Перейдіть до поточної версії навчальної програми.",
    "course-maintenance": "Ці курси знаходяться на технічному обслуговуванні. Якщо вони не працюють, див. як запустити їх локально на <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "course-disabling-soon": "Вебверсія цих курсів буде тимчасово недоступна, а віртуальні машини будуть видалені. Будь-який прогрес на віртуальних машинах буде втрачено. Якщо у вас є файли, які ви хочете зберегти, збережіть їх на своєму комп’ютері. Просимо вибачення за будь-які незручності. Ми сподіваємося, що покращена вебверсія цих курсів стане доступною в найближчий час.",
    "course-disabled": "Ці курси тимчасово недоступні для виконання в браузері. Просимо вибачення за будь-які незручності. Ви можете дізнатись, як запустити їх локально на <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. Ми сподіваємося, що покращена вебверсія стане доступною в найближчий час.",
    "run-locally": "Наразі ми рекомендуємо запускати курси локально на своєму комп’ютері. Більше деталей за посиланням <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "Ваш прогрес не буде збережений в обліковому записі freeCodeCamp при локальному запуску.",
    "go-back-to-learn": "Поверніться до стабільної версії навчальної програми.",
    "read-database-cert-article": "Будь ласка, прочитайте повідомлення на форумі, перш ніж продовжити.",
    "enable-cookies": "Увімкніть сторонні файли cookie перед початком роботи.",
    "english-only": "Курси в цьому розділі доступні лише англійською мовою. Наразі ми можемо перекладати лише заголовки й вступи, а не самі уроки.",
    "exam-english-only": "Зверніть увагу, що наразі екзамен доступний лише англійською мовою. Решта курсів доступні деякими іншими мовами."
  }
}
