{
  "responsive-web-design": {
    "title": "Завдання застарілого адаптивного вебдизайну",
    "intro": [
      "У сертифікації «Адаптивний вебдизайн» ви вивчите мови, які розробники використовують для створення вебсторінок: HTML (мова розмітки гіпертексту) для вмісту та CSS (каскадні таблиці стилів) для дизайну.",
      "Спочатку ви створите застосунок із фотографіями котів, аби вивчити основи HTML та CSS. Пізніше ви опануєте сучасні методи (серед яких змінні CSS) завдяки створенню пінгвіна, а також опануєте найкращі практики доступності, побудувавши вебформу.",
      "Ви також дізнаєтеся, як конструювати вебсайти, які відповідають різним розмірам екранів, створивши Twitter Card за допомогою Flexbox, а ще складний макет блогу з CSS Grid."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та темні режими) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють вміст або макет сторінок під час виконання курсу.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "Основи HTML та HTML5",
        "intro": [
          "HTML — це мова розмітки, яка використовує спеціальний синтаксис або примітки для опису структури вебсторінки чи браузера. Елементи HTML зазвичай мають початковий та кінцевий теги, які оточують вміст та надають йому значення. Наприклад, різні елементи можуть описати текст як заголовок, абзац або елемент списку.",
          "У цьому курсі ви створите застосунок із фотографіями котів, щоб опанувати застосування деяких з найпоширеніших елементів HTML (головних блоків будь-якої вебсторінки)."
        ]
      },
      "basic-css": {
        "title": "Основи CSS",
        "intro": [
          "CSS, або каскадні таблиці стилів, повідомляють браузеру як показати текст та інший вміст, який ви написали в HTML. За допомогою CSS ви можете регулювати колір, шрифт, розмір, відстань і багато інших аспектів елементів HTML.",
          "І зараз, коли ви описали структуру свого застосунку, стилізуйте його за допомогою CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Прикладний візуальний дизайн",
        "intro": [
          "Візуальний дизайн — це поєднання типографії, кольорознавства, графіки, анімації, макетів сторінок і багато чого іншого, аби допомогти вам передати своє унікальне повідомлення.",
          "У цьому курсі ви навчитеся застосовувати усі ці елементи візуального дизайну для своїх вебсайтів."
        ]
      },
      "applied-accessibility": {
        "title": "Прикладна доступність",
        "intro": [
          "У процесі веброзробки спеціальні можливості посилаються на вміст сайту та інтерфейс користувача, який широка аудиторія зможе розпізнати, з яким зможе взаємодіяти та за допомогою якого зможе зорієнтуватися на сайті. У цю аудиторію також входять люди із зоровими, слуховими, руховими та когнітивними розладами.",
          "У цьому курсі ви дізнаєтеся найкращі практики для створення вебсайтів, які доступні кожному."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Принципи адаптивного вебдизайну",
        "intro": [
          "Підключитися до мережі можна з багатьох пристроїв різних форм і розмірів. Адаптивний вебдизайн — це проєктування гнучких вебсайтів, які пристосовуються до різних розмірів, орієнтацій та розширення екранів.",
          "У цьому курсі ви дізнаєтеся як використовувати CSS, аби ваші вебсайти мали гарний вигляд, незалежно від того, на якому пристрої вони відтворені."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox — це потужний режим розмітки, який підтримується практично на всіх пристроях і який було введено з останньою версією CSS, CSS3. За допомогою flexbox набагато легше відцентровувати елементи сторінки та створювати функціональні інтерфейси користувачів, які автоматично зменшуються та розширяються.",
          "У цьому курсі ви дізнаєтеся про складові flexbox та функціональної розмітки, коли створюватимете Twitter card."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "CSS grid — це новіший режим розмітки, за допомогою якого можна легко створювати складну адаптивну композицію. Він перетворює елемент HTML у сітку і допомагає розмістити дочірні елементи будь-де на екрані.",
          "У цьому курсі ви вивчите основи CSS Grid, створюючи різні складні композиції, в тому числі макет блогу."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Адаптивний вебдизайн",
    "intro": [
      "В сертифікації «Адаптивний вебдизайн» ви вивчите мови, які розробники використовують для створення вебсторінок: HTML (мова розмітки гіпертексту) для вмісту та CSS (каскадні таблиці стилів) для дизайну.",
      "Спочатку ви створите застосунок із фотографіями котів, аби вивчити основи HTML та CSS. Пізніше ви опануєте сучасні методи, такі як змінні CSS, завдяки створенню пінгвіна, а також створите вікторину, щоб опанувати доступність.",
      "Наостанок ви дізнаєтеся, як створити вебсторінки, які реагують на зміну розміру екрану, створивши фотогалерею за допомогою Flexbox і макет журналу з CSS Grid."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та темні режими) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють вміст або макет сторінок під час виконання курсу.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Пам’ятна сторінка",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите пам’ятну сторінку на тему за власним вибором."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Вебсторінка персонального портфоліо",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите вебсторінку персонального портфоліо."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Посадкова сторінка продукту",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите посадкову сторінку продукту, щоб збути продукт за власним вибором."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Форма для опитування",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите форму для опитування, щоб зібрати дані своїх користувачів."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Сторінка технічної документації",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите сторінку технічної документації, яка служитиме інструкцією або довідником."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Вивчіть HTML, створивши застосунок з котами",
        "intro": [
          "Теги HTML надають вебсторінці структуру. Ви можете використовувати теги HTML, щоб додати фотографії, кнопки та інші елементи до своєї вебсторінки.",
          "У цьому курсі ви вивчите найпоширеніші теги HTML, створивши власний застосунок з фотографіями котів."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Вивчіть основи CSS, створивши меню для кафе",
        "intro": [
          "CSS повідомляє браузеру, як зображати вашу вебсторінку. Ви можете використовувати CSS, щоб встановити колір, шрифт, розмір та інші властивості елементів HTML.",
          "У цьому курсі ви вивчите CSS, розробивши дизайн меню для вебсторінки кафе."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Вивчіть блокову модель CSS, створивши картину Ротко",
        "intro": [
          "Кожен елемент HTML є своїм власним блоком із власним простором та краєм. Це називається блоковою моделлю.",
          "У цьому курсі ви використовуватимете CSS та блокову модель, щоб створити власну картину в стилі Ротко."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Вивчіть змінні CSS, створивши панораму міста",
        "intro": [
          "Змінні CSS допомагають організувати стилі та повторно використовувати їх.",
          "У цьому курсі ви побудуєте панораму міста. Ви дізнаєтеся, як налаштувати змінні CSS для того, щоб повторно використовувати їх, коли забажаєте."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Вивчіть форми HTML, створивши реєстраційну форму",
        "intro": [
          "Ви можете використовувати форми HTML для збору інформації від людей, які відвідують вашу вебсторінку.",
          "У цьому курсі ви вивчите форми HTML, створивши реєстраційну форму. Ви дізнаєтеся, як керувати типами даних, які люди можуть вводити у вашу форму, і деякі нові інструменти CSS для стилізації своєї сторінки."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Вивчіть доступність, створивши вікторину",
        "intro": [
          "Доступність полегшує користування вашою вебсторінкою для всіх людей, навіть для людей з порушеннями.",
          "У цьому курсі ви створите вебсторінку вікторини. Ви дізнаєтеся про інструменти доступності, серед яких комбінації клавіш, атрибути ARIA та найкращі поради щодо дизайну."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Вивчіть перехідний CSS, створивши картину Пікассо",
        "intro": [
          "У цьому курсі ви дізнаєтеся, як використовувати деякі техніки перехідного CSS, кодуючи власну вебсторінку з картиною Пікассо. Ви дізнаєтеся про іконки SVG, позиціювання CSS та пригадаєте інші навички CSS, яких ви навчилися."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Вивчіть адаптивний вебдизайн, створивши піаніно",
        "intro": [
          "Адаптивний дизайн каже вашій вебсторінці, як вона має виглядати на екранах різного розміру.",
          "У цьому курсі ви використовуватимете CSS та адаптивний дизайн для програмування піаніно. До того ж, ви більше дізнаєтесь про медіазапити та псевдоселектори."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Вивчіть CSS Flexbox, створивши фотогалерею",
        "intro": [
          "Flexbox допомагає створити вебсторінку, яка матиме хороший вигляд на екрані будь-якого розміру.",
          "У цьому курсі ви використовуватимете Flexbox для створення адаптивної вебсторінки фотогалереї."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Вивчіть CSS Grid, створивши журнал",
        "intro": [
          "CSS Grid дає вам можливість керувати рядками та стовпчиками своєї вебсторінки.",
          "У цьому курсі ви створите журнальну статтю. Ви дізнаєтеся, як використовувати CSS Grid, включно з рядками та стовпчиками сітки."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Вивчіть типографію, створивши етикетку",
        "intro": [
          "Типографія — це мистецтво стилізації тексту, щоб його було легко читати та він відповідав своєму призначенню.",
          "У цьому курсі ви використовуватимете типографію, щоб створити вебсторінку з харчовою етикеткою. Ви дізнаєтеся, як стилізувати текст, регулювати висоту рядка та позиціювати текст за допомогою CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Вивчіть трансформації CSS, створивши пінгвіна",
        "intro": [
          "Ви можете трансформувати елементи HTML, щоб створити привабливий дизайн, який привертає увагу читача. Ви можете використовувати трансформації, щоб обертати елементи, масштабувати їх тощо.",
          "У цьому курсі ви побудуєте пінгвіна. Ви будете використовувати трансформації CSS, щоб позиціювати та змінювати розмір частин свого пінгвіна, створювати фон та анімувати роботу."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Вивчіть анімацію CSS, створивши оглядове колесо",
        "intro": [
          "Ви можете використовувати анімацію CSS, щоб привернути увагу до певних розділів вебсторінки та зробити її більш привабливою.",
          "У цьому курсі ви побудуєте оглядове колесо. Ви дізнаєтеся, як використовувати CSS для анімації елементів, трансформації та регулювання швидкості."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Вивчіть більше про псевдоселектори CSS, створивши бухгалтерський баланс",
        "intro": [
          "Ви можете використовувати псевдоселектори CSS, щоб змінити певні елементи HTML.",
          "У цьому курсі ви побудуєте бухгалтерський баланс за допомогою псевдоселекторів. Ви дізнаєтеся як змінити стиль елемента, коли ви наводите на нього курсор, та запускати інші події на своїй вебсторінці."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Вивчіть кольори CSS, створивши набір кольорових маркерів",
        "intro": [
          "Вибір правильних кольорів для вебсторінки може значно покращити естетичне вподобання читачів.",
          "У цьому курсі ви створите набір кольорових маркерів. Ви дізнаєтесь про різні способи встановлення значень кольорів та як поєднувати кольори між собою."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Вивчіть перехідний CSS, створивши малюнок кота",
        "intro": [
          "Позиціювання CSS важливо опанувати для того, щоб створювати візуально привабливі та адаптивні вебмакети",
          "У цьому курсі ви створите малюнок кота. Ви дізнаєтесь, як працювати з абсолютним позиціюванням, властивістю z-index та властивістю transform."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Алгоритми JavaScript та структури даних",
    "intro": [
      "Якщо HTML та CSS відповідають за вміст і стилізацію сторінки, то JavaScript робить її інтерактивною. У сертифікації «Алгоритми JavaScript та структури даних» ви вивчите основи JavaScript, включно зі змінними, масивами, об’єктами, циклами та функціями.",
      "Як тільки ви вивчите основи, ви почнете застосовувати ці знання, створюючи алгоритми, щоб уміло маніпулювати рядками, факторизувати числа, і навіть зможете обчислити орбіту міжнародної космічної станції.",
      "Крім того, ви також вивчите два важливих стилі або парадигми в програмуванні: об’єктноорієнтоване програмування (ООП) та функційне програмування (ФП)."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та скриптів) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють або блокують вміст сторінок під час виконання курсу.",
    "blocks": {
      "basic-javascript": {
        "title": "Основи JavaScript",
        "intro": [
          "JavaScript — це скриптова мова, яка використовується для того, аби зробити вебсайти інтерактивними. Це одна з основних технологій в мережі (разом з HTML та CSS), яка підтримується всіма сучасними браузерами.",
          "У цьому курсі ви вивчите головні поняття програмування в JavaScript. Ви почнете з простих структур даних, таких як числа та рядки. Далі ви почнете роботу з масивами, об’єктами, функціями, циклами, умовними конструкціями тощо."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, або ES — це стандартизована версія JavaScript. Оскільки більшість браузерів дотримуються цих стандартів, ECMAScript та JavaScript є взаємозамінними.",
          "Більша частина JavaScript (про яку ви вже дізналися) була в ES5 (ECMAScript 5), який утвердили у 2009 році. Поки ви все ще маєте можливість писати програми в ES5, JavaScript постійно розвивається і там щорічно вводяться нові функції.",
          "ES6, який випустили у 2015 році, додав багато нових потужних функцій до цієї мови. У курсі ви вивчите нові особливості, серед яких стрілкові функції, деструкція, класи, проміси та модулі."
        ]
      },
      "regular-expressions": {
        "title": "Регулярні вирази",
        "intro": [
          "Регулярні вирази (відомі як «regex» або «regexp») — шаблони, які допомагають програмістам поєднувати, шукати та замінювати текст. Регулярні вирази дуже важливі, але їх важко читати, оскільки у них використовуються спеціальні символи для створення складніших, гнучкіших поєднань.",
          "У цьому курсі ви дізнаєтеся як використовувати спеціальні символи, групи захоплення, позитивний та негативний огляди та інші техніки, аби текст відповідав бажаному."
        ]
      },
      "debugging": {
        "title": "Налагодження програм",
        "intro": [
          "Налагодження програм — це процес перевірки коду на наявність помилок та їх виправлення.",
          "Помилки в коді, як правило, розподіляють на три категорії: синтаксичні, які заважають вашій програмі працювати; помилки середовища виконання, коли ваш код поводиться непередбачувано; або логічні, коли ваш код не виконує свою функцію.",
          "У цьому курсі ви дізнаєтеся як використовувати консоль JavaScript, аби налагодити програми та уникнути розповсюджених помилок."
        ]
      },
      "basic-data-structures": {
        "title": "Основи структур даних",
        "intro": [
          "Багатьома способами можна зберегти дані та отримати до них доступ. Ви вже знаєте деякі загальні структури даних JavaScript — масиви та об’єкти.",
          "У курсі «Основи структур даних» ви дізнаєтеся більше про різницю між масивами та об’єктами, та в яких ситуаціях вони використовуються. Ви також дізнаєтеся як використовувати корисні методи JS, такі як <code>splice()</code> та <code>Object.keys()</code>, аби отримати доступ до даних та маніпулювати ними."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Основи написання алгоритмів",
        "intro": [
          "Алгоритм — це ряд покрокових інструкцій, які описують як щось робити.",
          "Написання успішного алгоритму допомагає розбити задачу на менші частини та гарно подумати над тим, як вирішити кожну частину за допомогою коду.",
          "У цьому курсі ви вивчите основи алгоритмічного мислення, пишучи алгоритми, які роблять усе: від перетворення температур до користування складними 2D масивами."
        ]
      },
      "object-oriented-programming": {
        "title": "Об’єктноорієнтоване програмування",
        "intro": [
          "ООП, або об’єктноорієнтоване програмування — це один з основних підходів до процесу розробки програмного забезпечення. Об’єкти та класи в ООП впорядковують код для опису будь-чого і того, що воно виконує.",
          "У цьому курсі ви вивчите основні принципи ООП в JavaScript, включно з ключовим словом <code>this</code>, прототипами ланцюгів, конструкторами та наслідуванням."
        ]
      },
      "functional-programming": {
        "title": "Функційне програмування",
        "intro": [
          "Функційне програмування — це ще один популярний підхід до розробки програмного забезпечення. У функційному програмуванні код впорядкований у менші, прості функції, які можна об’єднувати для створення складних програм.",
          "У цьому курсі ви вивчите основні поняття функційного програмування, включно з чистими функціями, як уникнути мутацій і як писати чистіший код за допомогою методів, таких як <code>.map()</code> і <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Написання алгоритмів середньої складності",
        "intro": [
          "Тепер, коли ви знаєте основи алгоритмічного мислення, разом з ООП та функційним програмуванням, перевірте свої вміння у написанні алгоритмів середньої складності."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "Проєкти «Алгоритми JavaScript та структури даних»",
        "intro": [
          "Тепер настав час випробувати свої навички роботи з JavaScript на практиці. Ці проєкти подібні до тестів з написання алгоритмів, які ви вже робили, але складніші.",
          "Виконайте п’ять проєктів JavaScript, аби отримати сертифікацію «Алгоритми JavaScript та структури даних»."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "JavaScript Algorithms and Data Structures (Beta)",
    "intro": [
      "Developers use HTML and CSS to control the content and styling of a page. And they use JavaScript to make that page interactive.",
      "In this JavaScript Algorithm and Data Structures Certification, you'll learn the JavaScript fundamentals like variables, arrays, objects, loops, functions, the DOM and more.",
      "You'll also learn about Object Oriented Programming (OOP), Functional Programming, algorithmic thinking, how to work with local storage, and how to fetch data using an API."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and script-blockers can interfere with the tests. If you face issues, we recommend disabling extensions that modify or block the content of pages while taking the course.",
    "blocks": {
      "build-a-pokemon-search-app-project": {
        "title": "Build a Pokémon Search App Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a Pokémon search app."
        ]
      },
      "build-a-cash-register-project": {
        "title": "Build a Cash Register Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you'll build a cash register web app."
        ]
      },
      "build-a-palindrome-checker-project": {
        "title": "Build a Palindrome Checker Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you'll build an application that checks whether a given word is a palindrome."
        ]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Build a Roman Numeral Converter Project",
        "intro": [
          "This is one of the required projects to claim your certification.",
          "For this project, you'll build an application that converts integers to Roman numerals."
        ]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Build a Telephone Number Validator Project",
        "intro": [
          "This is one of the required projects to claim your certification.",
          "For this project, you'll build an application that checks if a number is a valid United States phone number."
        ]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Learn Basic JavaScript by Building a Role Playing Game",
        "intro": [
          "JavaScript is a powerful scripting language that you can use to make web pages interactive. It's one of the core technologies of the web, along with HTML and CSS. All modern browsers support JavaScript.",
          "In this practice project, you'll learn fundamental programming concepts in JavaScript by coding your own Role Playing Game. You'll learn how to work with arrays, strings, objects, functions, loops, <code>if/else</code> statements, and more."
        ]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Learn Form Validation by Building a Calorie Counter",
        "intro": [
          "Sometimes when you're coding a web application, you'll need to be able to accept input from a user. In this calorie counter project, you'll learn how to validate user input, perform calculations based on that input, and dynamically update your interface to display the results.",
          "In this practice project, you'll learn basic regular expressions, template literals, the <code>addEventListener()</code> method, and more."
        ]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Learn Functional Programming by Building a Spreadsheet",
        "intro": [
          "Functional Programming is a popular approach to software development. In Functional Programming, developers organize code into smaller functions, then combine those functions to build complex programs.",
          "In this spreadsheet application project, you'll learn about parsing and evaluating mathematical expressions, implementing spreadsheet functions, handling cell references, and creating interactive web interfaces. You'll learn how to dynamically update the page based on user input.",
          "This project will cover concepts like the <code>map()</code> method, <code>find()</code> method, <code>parseInt()</code>, the <code>includes()</code> method."
        ]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Learn Modern JavaScript Methods By Building Football Team Cards",
        "intro": [
          "One common aspect of building web applications: processing datasets, and then outputting information to the screen. In this sports team cards project, you'll learn how to work with DOM manipulation, object destructuring, event handling, and data filtering.",
          "This project will cover concepts like switch statements, default parameters, <code>Object.freeze()</code>, the <code>map()</code> method, and more."
        ]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Learn Advanced Array Methods by Building a Statistics Calculator",
        "intro": [
          "As you expand your JavaScript skills, you'll want to get comfortable with array manipulation methods, such as <code>map()</code>, <code>reduce()</code>, and <code>filter()</code>.",
          "In this statistics calculator project, you'll gain experience with handling user input, DOM manipulation, and method chaining. You'll get practice by performing statistical calculations like mean, median, mode, variance, and standard deviation."
        ]
      },
      "learn-basic-oop-by-building-a-shopping-cart": {
        "title": "Learn Basic OOP by Building a Shopping Cart",
        "intro": [
          "OOP, or Object Oriented Programming, is one of the major approaches to the software development process. In OOP, developers use objects and classes to structure their code.",
          "In this shopping cart project, you'll learn how to define classes and use them. You'll create class instances and implement methods for data manipulation.",
          "This project will cover concepts like the ternary operator, the spread operator, the <code>this</code> keyword, and more."
        ]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Learn Fetch and Promises By Building an fCC Authors Page",
        "intro": [
          "One common aspect of web development is learning how to fetch data from an external API, then work with asynchronous JavaScript.",
          "This freeCodeCamp authors page project will show you how to use the fetch method, then dynamically update the DOM to display the fetched data.",
          "This project will also teach you how to paginate your data so you can load results in batches."
        ]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Learn Regular Expressions by Building a Spam Filter",
        "intro": [
          "Regular expressions, often shortened to \"regex\" or \"regexp\", are patterns that help programmers match, search, and replace text. Regular expressions are powerful, but can be difficult to understand because they use so many special characters.",
          "In this spam filter project, you'll learn about capture groups, positive lookaheads, negative lookaheads, and other techniques to match any text you want."
        ]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Learn Basic Algorithmic Thinking by Building a Number Sorter",
        "intro": [
          "In computer science, there are fundamental sorting algorithms that all developers should learn. In this number sorter project, you'll learn how to implement and visualize different sorting algorithms like bubble sort, selection sort, and insertion sort – all with JavaScript.",
          "This project will help you understand the fundamental concepts behind these algorithms, and how you can apply them to sort numerical data in web applications."
        ]
      },
      "learn-intermediate-algorithmic-thinking-by-building-a-dice-game": {
        "title": "Learn Intermediate Algorithmic Thinking by Building a Dice Game",
        "intro": [
          "Algorithmic thinking involves the ability to break down complex problems into a sequence of well-defined, step-by-step instructions.",
          "In this Dice game project, you’ll learn how to manage game state, implement game logic for rolling dice, keeping score, and applying rules for various combinations.",
          "This project covers concepts such as event handling, array manipulation, conditional logic, and updating the user interface dynamically based on game state."
        ]
      },
      "learn-intermediate-oop-by-building-a-platformer-game": {
        "title": "Learn Intermediate OOP by Building a Platformer Game",
        "intro": [
          "Coding a game is a great way to grasp fundamental programming principles, while also creating an interactive gaming experience.",
          "In this platformer game project, you'll continue to learn about classes, objects, inheritance, and encapsulation. You'll also learn how to design and organize game elements efficiently and gain insights into problem-solving and code reusability."
        ]
      },
      "learn-localstorage-by-building-a-todo-app": {
        "title": "Learn localStorage by Building a Todo App",
        "intro": [
          "Local storage is a web browser feature that lets web applications store key-value pairs persistently within a user's browser. This allows web apps to save data during one session, then retrieve it in a later page session.",
          "In this TODO application, you'll learn how to handle form inputs, manage local storage, perform CRUD (Create, Read, Update, Delete) operations on tasks, implement event listeners, and toggle UI elements."
        ]
      },
      "learn-the-date-object-by-building-a-date-formatter": {
        "title": "Learn the Date Object by Building a Date Formatter",
        "intro": [
          "Working with dates in JavaScript can be challenging. You have to navigate various methods, formats, and time zones. In this project, you'll learn how to work with the JavaScript Date object, including its methods and properties. You'll also learn how to correctly format dates.",
          "This project will cover concepts such as the <code>getDate()</code>, <code>getMonth()</code>, and <code>getFullYear()</code> methods."
        ]
      },
      "learn-asynchronous-programming-by-building-an-fcc-forum-leaderboard": {
        "title": "Learn Asynchronous Programming by Building an fCC Forum Leaderboard",
        "intro": [
          "JavaScript is an asynchronous programming language. And this project will help you gain proficiency in asynchronous concepts. You'll code your own freeCodeCamp forum leaderboard.",
          "This project will cover the Fetch API, promises, Async/Await, and the try..catch statement."
        ]
      },
      "learn-basic-string-and-array-methods-by-building-a-music-player": {
        "title": "Learn Basic String and Array Methods by Building a Music Player",
        "intro": [
          "Now let's learn some essential string and array methods like the <code>find()</code>, <code>forEach()</code>, <code>map()</code>, and <code>join()</code>. These methods are crucial for developing dynamic web applications.",
          "In this project, you'll code a basic MP3 player using HTML, CSS, and JavaScript. The project covers fundamental concepts such as handling audio playback, managing a playlist, implementing play, pause, next, previous, and shuffle functionalities. You'll even learn how to dynamically update your user interface based on the current song."
        ]
      },
      "learn-recursion-by-building-a-decimal-to-binary-converter": {
        "title": "Learn Recursion by Building a Decimal to Binary Converter",
        "intro": [
          "Recursion is a programming concept where a function calls itself. This can reduce a complex problem into simpler sub-problems, until they become straightforward to solve.",
          "In this project, you’ll build a decimal-to-binary converter using JavaScript. You’ll learn the fundamental concepts of recursion, explore the call stack, and build out a visual representation of the recursion process through an animation."
        ]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Бібліотеки Front End",
    "intro": [
      "Тепер, коли ви вже знайомі з HTML, CSS та JavaScript, піднімімо ваш рівень навичок, вивчаючи декілька найбільш популярних бібліотек верстки в галузі.",
      "У сертифікації «Бібліотеки Front End» ви навчитеся швидко стилізувати свій сайт за допомогою Bootstrap. Також ви навчитеся покращувати свої стилі CSS та розширювати їх за допомогою Sass.",
      "Згодом ви розробите кошик для покупок та інші застосунки, щоб навчитися створювати потужні односторінкові застосунки (SPAs) з React та Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap — це front end каркас, створений для проєктування адаптивних вебсторінок та застосунків. Для веброзробки цей фреймворк використовує принцип Mobile First та включає попередньо інтегровані стилі, класи CSS і деякі функціональності JavaScript.",
          "Під час цього курсу ви навчитеся створювати адаптивні вебсайти за допомогою Bootstrap та використовувати готові шаблони для стилізації кнопок, зображень, форм, навігації та інших поширених елементів."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery — одна з найпопулярніших у світі бібліотек JavaScript.",
          "До її запуску у 2006 році, кожний браузер використовував JavaScript по-своєму. jQuery спростила роботу з JavaScript для користувачів, а також забезпечила кросбраузерність створених кодів.",
          "Під час цього курсу ви навчитеся використовувати jQuery для виділення, вилучення, копіювання та редагування різних елементів на сторінці."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, або «Syntactically Awesome StyleSheets» — це мовне розширення CSS, що містить функції, яких немає у базовому CSS, і тим самим допомагає спростити створення таблиць стилів для ваших проєктів.",
          "У цьому курсі ви навчитеся зберігати дані у змінних, вкладати CSS, створювати багаторазові стилі за допомогою міксин, додавати умовні конструкції та цикли до своїх стилів тощо."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React — це популярна бібліотека JavaScript для створення багаторазових компонентних користувацьких інтерфейсів для вебсторінок або застосунків.",
          "React поєднує HTML з функціями JavaScript, формуючи власну мову розмітки під назвою JSX. React також дозволяє легко керувати потоком даних у всьому застосунку.",
          "У цьому курсі ви навчитеся створювати різні компоненти React, керувати даними за допомогою пропсів, а також застосовувати різні методи життєвого циклу, такі як <code>componentDidMount</code> тощо."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "Зі збільшенням розмірів та кількості застосунків, керувати спільними даними стає все складніше. Redux називають «відкритою JS бібліотекою призначеною для управління станом програм JavaScript», яка забезпечує належну роботу ваших програм і спрощує тестування.",
          "Хоча ви можете використовувати його з будь-якою іншою бібліотекою, ми лише коротко розповімо про Redux, а тоді об’єднаємо його з React у наступному наборі курсів.",
          "Під час цього курсу ви вивчите базову інформацію про сховища, дії, редуктори та проміжне програмне забезпечення Redux для керування даними у своєму застосунку."
        ]
      },
      "react-and-redux": {
        "title": "React та Redux",
        "intro": [
          "React часто використовують разом із Redux, і не дарма. Redux і React створив один програміст, який хотів зробити процес передачі даних між компонентами простішим.",
          "Тепер коли ви вже навчились керувати загальними даними за допомогою Redux, ви можете виконувати дії в React. На курсах React і Redux, ви навчитесь будувати компонент React і дізнаєтесь, як локально керувати станом на рівні компонента, та й у цілому застосунку, за допомогою Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Проєкти «Бібліотеки Front End»",
        "intro": [
          "Прийшов час протестувати ваші навички роботи з бібліотеками front end розробки. Використайте Bootstrap, jQuery, Sass, React та Redux, аби створити 5 проєктів, які перевірять ваші знання з усього, що ви вивчили дотепер.",
          "Виконайте п’ять проєктів та отримайте сертифікацію «Бібліотеки Front End»."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Візуалізація даних",
    "intro": [
      "Дані повсюди, але це не означає, що більшість з них без форми чи контексту.",
      "У сертифікації «Візуалізація даних» ви створите діаграми, графіки та карти, що показують різні типи даних, за допомогою бібліотеки D3.js.",
      "Ви також дізнаєтесь про JSON (JavaScript Object Notation) та як працювати з даними онлайн, користуючись API (Application Programing Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Візуалізація даних з D3",
        "intro": [
          "D3, або D3.js, розшифровується як «Data Driven Documents». Це бібліотека JavaScript для створення функціональної та інтерактивної візуалізації даних у браузері.",
          "D3 створено для роботи з поширеними вебстандартами, а саме: HTML, CSS і SVG (масштабована векторна графіка).",
          "D3 підтримує багато різних форматів даних. Тому, використовуючи її потужні вбудовані методи, ви можете перетворити ці дані у різні діаграми, графіки та карти.",
          "У курсі «Візуалізація даних з D3» ви навчитеся працювати з даними, аби створювати різні діаграми, графіки, елементи наведення та інші складові частини, аби створити динамічну та принадну візуалізацію даних."
        ]
      },
      "json-apis-and-ajax": {
        "title": "JSON API та AJAX",
        "intro": [
          "Так само як інтерфейс користувача (UI) допомагає людям користуватися програмами, API (Application Programming Interfaces) також допомагає програмам взаємодіяти між собою. API — це інструменти, які використовуються комп’ютерами для комунікування один з одним, і, частково, для надсилання та отримання даних.",
          "Програмісти часто використовують AJAX (Asynchronous JavaScript and XML) при роботі з API. AJAX належить до групи технологій, які роблять асинхронні запити до сервера для передачі даних, а потім завантажують будь-які отримані дані до сторінки. І дані, що були передані між браузером і сервером, часто мають формат JSON (JavaScript Object Notation).",
          "Цей курс навчить вас основ роботи з API та різними технологіями AJAX в браузері."
        ]
      },
      "data-visualization-projects": {
        "title": "Проєкти «Візуалізація даних»",
        "intro": [
          "Ви дізналися як працювати з технологіями D3, APIs та AJAX, тому перевірте свої навички завдяки тесту з п’яти проєктів візуалізації даних.",
          "У цих проєктах вам потрібно буде отримати й проаналізувати набір даних, тоді використати D3 для створення різної візуалізації даних. Завершіть усі проєкти, аби отримати сертифікацію «Візуалізація даних»."
        ]
      },
      "d3-dashboard": {
        "title": "Інформаційна панель D3",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Реляційна база даних",
    "intro": [
      "У цих курсах ви використовуватимете реальні інструменти розробника та програмне забезпечення, включно з VS Code, PostgreSQL та командним рядком Linux / Unix для завершення інтерактивних уроків і створення проєктів.",
      "Ці курси починаються з основних команд Bash. За допомогою терміналу ви навчитеся усього необхідного (від навігації та маніпуляції файловою системою, написання скрипту в Bash до просунутого використання).",
      "Далі ви навчитеся створювати та використовувати реляційну базу даних з PostgreSQL (система керування базами даних) та SQL (мова баз даних).",
      "Зрештою, ви дізнаєтеся про Git, систему контролю версій, важливий інструмент кожного розробника."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "База даних «Небесні тіла»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте базу даних небесних тіл, використовуючи PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Гра «Вгадай число»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви використовуватимете сценарії Bash, PostgreSQL та Git, щоб створити гру з вгадуванням чисел, яка запускається в терміналі та зберігає інформацію користувача."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "База даних «Періодична таблиця»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите скрипт Bash для отримання інформації про хімічні елементи з бази даних періодичної таблиці."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Планувальник «Записи в салоні»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите інтерактивну програму Bash, яка використовує PostgreSQL для відстеження клієнтів і зустрічей у вашому салоні."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "База даних «Чемпіонат світу»",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви створите скрипт Bash, який вводить інформацію з ігор чемпіонату світу в PostgreSQL, а потім запитує базу даних для отримання статистики."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Вивчіть прогресивний Bash, створивши перекладач Kitty Ipsum",
        "intro": [
          "У командах Bash більше, ніж ви могли собі уявити.",
          "У цьому курсі з 140 уроків ви дізнаєтеся про деякі складніші команди, а також детально дізнаєтеся як вони працюють."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Вивчіть Bash та SQL, створивши магазин прокату велосипедів",
        "intro": [
          "У цьому курсі з 210 уроків ви створите інтерактивну програму Bash, яка зберігатиме інформацію про оренду для вашого магазину прокату велосипедів, використовуючи PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Вивчіть Bash, створивши шаблонний код",
        "intro": [
          "Термінал дозволяє відправляти текстові команди на ваш комп’ютер, які можуть маніпулювати файловою системою, запускати програми, автоматизувати завдання та багато іншого.",
          "У цьому курсі з 170 уроків ви вивчите команди терміналу, створивши шаблонний код вебсайту, використовуючи лише командний рядок."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Вивчіть скрипт Bash, створивши п’ять програм",
        "intro": [
          "Скрипти Bash поєднують команди терміналу та логіку в програми, які можуть виконувати або автоматизувати завдання та багато іншого.",
          "У цьому курсі з 220 уроків ви вивчите більше про команди терміналу та як їх використовувати в скриптах Bash, створивши п’ять невеликих програм."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Вивчіть Git, створивши об’єкт SQL",
        "intro": [
          "Git — це система контролю версій, яка відстежує усі зміни, внесені вами до свого коду.",
          "У цьому курсі з 240 уроків ви вивчите як Git відстежує ваш код, створюючи об’єкт, що містить часто використовувані команди SQL."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Вивчіть Nano, створивши замок",
        "intro": [
          "Nano — це програма, яка дозволяє редагувати файли одразу в терміналі.",
          "У цьому курсі з 40 уроків ви вивчите як редагувати файли в терміналі за допомогою Nano під час будівництва замку."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Вивчіть реляційні бази даних, створивши базу даних «Mario»",
        "intro": [
          "Реляційна база даних організовує дані в таблиці, які пов’язані між собою через спорідненість.",
          "В цьому курсі з 165 уроків ви вивчите основи реляційної бази даних, створивши базу даних PostgreSQL, наповнену персонажами з відеоігор."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Вивчіть SQL, створивши студентську базу даних (частина 1)",
        "intro": [
          "SQL, або Structured Query Language (мова структурованих запитів) — це мова для спілкування з реляційною базою даних.",
          "В цьому курсі з 140 уроків ви створите скрипт Bash, який використовує SQL для введення інформації про ваших студентів з науки про дані в PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Вивчіть SQL, створивши студентську базу даних (частина 2)",
        "intro": [
          "Команди об’єднання SQL використовуються, щоб поєднати інформацію з кількох таблиць у реляційній базі даних",
          "У цьому курсі з 140 уроків ви завершите свою базу даних студентів, глибше занурившись в команди SQL."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Розробка Back End та API",
    "intro": [
      "До цього моменту ви використовували JavaScript тільки для front end, аби зробити вебсторінку інтерактивнішою, розв’язати завдання з алгоритмами, або створити SPA. Але JavaScript можна використовувати й у back end, або на сервері, для створення цілих вебзастосунків.",
      "Сьогодні один із найпопулярніших способів створення застосунків — за допомогою мікрослужб, які є маленькими модульними застосунками та разом формують єдине ціле.",
      "У сертифікації «Розробка Back End та API» ви навчитеся писати back end програми за допомогою Node.js та npm. Ви також створите вебзастосунок за допомогою фреймворку Express та мікрослужбу для пошуку людей за допомогою MongoDB і бібліотеки Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Керування пакетами з NPM",
        "intro": [
          "npm (Node Package Manager) — це інструмент командного рядка для встановлення, створення та поширення пакетів коду JavaScript, написаного для Node.js. На npm знаходиться багато пакетів з відкритим вихідним кодом, тому спершу ретельно їх вивчіть, щоб вам не довелося виправляти помилки під час роботи з даними чи отримання даних з API.",
          "У цьому курсі ви вивчите основи використання npm, включно з тим як працювати із <code>package.json</code> та як керувати встановленими залежностями."
        ]
      },
      "basic-node-and-express": {
        "title": "Основи Node та Express",
        "intro": [
          "Node.js — це середовище виконання JavaScript, що дозволяє розробникам писати back end (серверні) програми в JavaScript. Node.js має кілька вбудованих модулів (маленьких незалежних програм), які допомагають з цим. Деякі з основних модулів містять HTTP, який працює на зразок сервера, і файлову систему (модуль для читання і редагування файлів).",
          "В останній групі курсів ви навчилися встановлювати та керувати пакетами npm, які є скупченнями менших модулів. Ці пакети можуть допомогти вам створити більші, складніші застосунки.",
          "Express — це спрощений фреймворк вебзастосунків та один з найбільш популярних пакетів на npm. Express значно полегшує створення сервера та керування маршрутизацією вашого застосунку, що відповідає за такі речі, як перенаправлення людей до потрібної сторінки, коли вони відвідують певну кінцеву точку (наприклад, <pre>/blog</pre>).",
          "У цьому курсі ви дізнаєтесь основи Node та Express, включно з тим, як створювати сервер, обслуговувати різні файли та обробляти різні запити з браузера."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB та Mongoose",
        "intro": [
          "MongoDB — це програма бази даних, яка зберігає JSON документи (чи записи), які ви можете використати у своєму застосунку. На відміну від SQL, іншого типу бази даних, MongoDB — це нереляційна, або «NoSQL» база даних. Це означає, що MongoDB зберігає усі збірні дані в межах одного запису, замість того, щоб тримати їх у багатьох попередньо налаштованих таблицях, як у базі даних SQL.",
          "Moongoose — це популярний пакет npm для взаємодії з MongoDB. З Moongoose ви можете використовувати прості об’єкти JavaScript замість JSON, що полегшує роботу із MongoDB. Він також дозволяє створити нарис документів під назвою «схеми», щоб ви ненароком не зберегли хибний тип даних та не спричинили помилок.",
          "На курсах MongoDB та Mongoose ви вивчите основи роботи із постійними даними, враховуючи налаштування моделі, збереження, видалення та пошук документів у базі даних."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Проєкти «Розробка Back End та API»",
        "intro": [
          "Раніше ви мали справу з API, але тепер, коли ви знайомі із nmp, Node, Express, Mongo DB та Mongoose, прийшов час створити щось власне. Застосуйте усі отримані знання, щоб створити 5 окремих мікрослужб, які є меншими застосунками з обмеженими можливостями.",
          "Створивши їх, ви матимете 5 крутих мікрослужб API, якими можна похвалитися перед друзями, рідними чи потенційними роботодавцями. О, а ще новеньку сертифікацію «Розробка Back End та API»."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Забезпечення якості",
    "intro": [
      "Оскільки ваші програми чи вебзастосунки стають складнішими, ви захочете протестувати їх, щоб переконатися, що нові зміни не порушують початкові функції.",
      "У сертифікації «Забезпечення якості» ви дізнаєтесь як писати тести з Chai, щоб переконатись, що ваші застосунки працюють так, як ви очікуєте.",
      "Потім ви створите застосунок чату, щоб вивчити розширені концепції Node та Express. Ви також будете використовувати Pug як шаблонізатор, Passport для автентифікації та Socket.io для комунікування в режимі реального часу між сервером та підключеними клієнтами."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Забезпечення якості та тестування з Chai",
        "intro": [
          "Chai — це бібліотека тестування JavaScript, яка допомагає переконатись, що після внесення змін до коду ваша програма досі поводиться так, як ви очікуєте.",
          "Використовуючи Chai, ви зможете писати тести, які описують ваші програмні вимоги, та бачити чи ваш застосунок відповідає їм.",
          "У цьому курсі ви дізнаєтесь про припущення, глибоку рівність, правдивість, тестування API та інші основи тестування програм JavaScript."
        ]
      },
      "advanced-node-and-express": {
        "title": "Просунутий Node та Express",
        "intro": [
          "Настав час глибоко зануритися у Node.js та Express.js, створивши застосунок чату із системою входу.",
          "Щоб безпечно впровадити систему входу, вам потрібно буде дізнатися про автентифікацію. Це акт перевірки особи або процесу.",
          "У цьому курсі ви дізнаєтесь, як використовувати Passport для управління автентифікацією, Pug для створення шаблонів багаторазового використання для швидкого створення інтерфейсу та вебсокети для комунікування в реальному часі між клієнтами та сервером."
        ]
      },
      "quality-assurance-projects": {
        "title": "Проєкти «Забезпечення якості»",
        "intro": [
          "Тепер, коли ви добре розбираєтесь у frond end та back end, настав час застосувати всі навички та концепції, які ви вивчили до цього моменту. Ви створите 5 різних вебзастосунків і напишете тести для кожного, щоб переконатися чи вони працюють і обробляють всі можливі сценарії.",
          "Після завершення цих проєктів із забезпечення якості у вас буде ще 5 проєктів, а також нова сертифікація, якою можна похвалитись у портфоліо."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Scientific Computing with Python (Beta)",
    "intro": [
      "Python — одна з найпопулярніших, гнучких мов програмування на сьогодні. Ви можете використовувати її для всього: від базових скриптів до машинного навчання.",
      "У сертифікації «Наукові обчислення з Python» ви дізнаєтесь основи Python, серед яких змінні, цикли, умовні переходи та функції. Тоді ви швидко перейдете до складних структур даних, роботи з мережами, реляційних баз даних та візуалізації даних."
    ],
    "note": "",
    "blocks": {
      "learn-string-manipulation-by-building-a-cipher": {
        "title": "Learn String Manipulation by Building a Cipher",
        "intro": [
          "Python is a powerful and popular programming language widely used for data science, data visualization, web and game development, machine learning and much more.",
          "In this project, you'll learn fundamental programming concepts in Python, such as variables, functions, loop, conditional statements, and and how to work with them to build your first program."
        ]
      },
      "learn-how-to-work-with-numbers-and-strings-by-implementing-the-luhn-algorithm": {
        "title": "Learn How to Work with Numbers and Strings by Implementing the Luhn Algorithm",
        "intro": [
          "The Luhn Algorithm is widely used for error-checking in various applications, including credit card numbers.",
          "Through this project, you'll gain valuable experience in working with numerical computations and string manipulation while implementing the Luhn Algorithm."
        ]
      },
      "learn-list-comprehension-by-building-a-case-converter-program": {
        "title": "Learn Python List Comprehension By Building a Case Converter Program",
        "intro": [
          "A list comprehension in Python is a way to construct a new list from an iterable types such as lists, tuples, and strings without using a for loop or the `.append()` list method",
          "In this project, you will write a program that takes a string formatted in camel or pascal case and converts that to snake case. The project has two phases.",
          "During the first phase, you will use a for loop to implement the program.",
          "Then in the second phase you will learn about applying list comprehension instead of a loop to achieve the same results."
        ]
      },
      "learn-regular-expressions-by-building-a-password-generator": {
        "title": "Learn Regular Expressions by Building a Password Generator",
        "intro": [
          "In Python, a module is a file containing a set of statements and definitions that you can use in your code.",
          "In this project, you'll learn how to import and use modules from the Python standard library and how to use regular expressions while building your own password generator program."
        ]
      },
      "learn-algorithm-design-by-building-the-shortest-path-algorithm": {
        "title": "Learn Algorithm Design by Building the Shortest Path Algorithm",
        "intro": [
          "Algorithms are step-by-step procedures used to perform calculations and solve computational problems.",
          "In this project, you'll learn how to use functions, loops, conditional statements, dictionary comprehensions and more to design and implement the shortest path algorithm."
        ]
      },
      "learn-recursion-by-solving-the-tower-of-hanoi-puzzle": {
        "title": "Learn Recursion by Solving the Tower of Hanoi Puzzle",
        "intro": [
          "Recursion allows you to write concise and elegant code to solve complex computational problems.",
          "In this project, you'll start with an iterative approach to solve the tower of Hanoi mathematical puzzle and then you'll learn how to implement a recursive solution."
        ]
      },
      "learn-data-structures-by-building-the-merge-sort-algorithm": {
        "title": "Learn Data Structures by Building the Merge Sort Algorithm",
        "intro": [
          "The merge sort algorithm is a sorting algorithm based on the divide and conquer principle.",
          "In this project, you'll learn how to interact with data structures by sorting a list of random numbers using the merge sort algorithm."
        ]
      },
      "learn-classes-and-objects-by-building-a-sudoku-solver": {
        "title": "Learn Classes and Objects by Building a Sudoku Solver",
        "intro": [
          "Classes and objects are an important programming concept and they enable developers to achieve code modularity, abstraction, readability, and promote reusability.",
          "In this Sudoku solver project, you'll learn how to use classes and objects to build a sudoku grid and to solve a sudoku puzzle."
        ]
      },
      "learn-tree-traversal-by-building-a-binary-search-tree": {
        "title": "Learn Tree Traversal by Building a Binary Search Tree",
        "intro": [
          "A Binary Search Tree (BST) is an important data structure concept, where data is sorted in a hierarchical structure.",
          "In this project, you will learn how to construct a BST, perform an inorder traversal, and also cover key operations like insertion, search, and deletion."
        ]
      },
      "learn-lambda-functions-by-building-an-expense-tracker": {
        "title": "Learn Lambda Functions by Building an Expense Tracker",
        "intro": ["", ""]
      },
      "scientific-computing-with-python-projects": {
        "title": "Проєкти «Наукові обчислення з Python»",
        "intro": [
          "Час перевірити свої навички роботи з Python. Завершивши ці проєкти, ви продемонструєте, що володієте хорошими фундаментальними знаннями Python і маєте право на сертифікацію «Наукові обчислення з Python»."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Аналіз даних з Python",
    "intro": [
      "Аналіз даних існує вже давно. Але ще кілька років тому розробники практикували його за допомогою дорогих інструментів із закритим кодом, таких як Tableau. Але нещодавно Python, SQL та інші відкриті бібліотеки назавжди змінили аналіз даних.",
      "У сертифікації «Аналіз даних з Python» ви дізнаєтесь про основи аналізу даних за допомогою Python. Наприкінці цієї сертифікації ви будете знати, як читати дані з таких джерел, як CSV та SQL, і як використовувати бібліотеки, такі як Numpy, Pandas, Matplotlib та Seaborn для обробки та візуалізації даних."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Аналіз даних з Python",
        "intro": [
          "У цих комплексних відеокурсах, створених Сантьяго Басульто, ви дізнаєтесь про весь процес аналізу даних. Ви будете зчитувати дані з різних джерел (CSV, SQL, Excel), обробляти ці дані за допомогою NumPy та Pandas і візуалізовувати їх за допомогою Matplotlib та Seaborn.",
          "Крім того, ми включили детальний курс по Jupyter Notebook та короткий довідник з Python, щоб оновити ваші навички програмування."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Вивчіть основи бібліотеки NumPy у наступному відеокурсі, створеному Кейтом Галлі.",
          "У цьому курсі ви дізнаєтесь, як працює NumPy і як він порівнюється із вбудованими списками Python. Ви також дізнаєтесь, як писати код з NumPy, індексувати, змінювати форму, застосовувати статистику та багато іншого."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Проєкти «Аналіз даних з Python»",
        "intro": [
          "Існує багато способів аналізу даних за допомогою Python. Завершивши ці проєкти, ви продемонструєте, що володієте хорошими фундаментальними знаннями аналізу даних, використовуючи Python.",
          "Завершіть всі проєкти, щоб отримати сертифікацію «Аналіз даних з Python»."
        ]
      }
    }
  },
  "information-security": {
    "title": "Інформаційна безпека",
    "intro": [
      "Завдяки всьому, що ми робимо в Інтернеті, величезна кількість конфіденційної інформації знаходиться в зоні ризику: електронні адреси, паролі, номери телефонів тощо.",
      "Завдяки сертифікації «Інформаційна безпека» ви створите безпечний вебзастосунок за допомогою HelmetJS, щоб вивчити основи захисту інформації людей в Інтернеті.",
      "Ви також створите TCP client, а ще Nmap і сканер портів у Python. Це допоможе вам вивчити основи тесту на проникнення — важливого компоненту надійної інформаційної безпеки."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Інформаційна безпека з HelmetJS",
        "intro": [
          "Цей курс програмування зосереджений на HelmetJS, типі проміжного програмного забезпечення для застосунків на основі Express, яке автоматично встановлює заголовки HTTP. Таким чином, він може запобігти випадковому передаванню конфіденційної інформації між сервером та клієнтом.",
          "Завершення курсів допоможе вам зрозуміти, як захистити свій сайт від зловмисної поведінки."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python для тесту на проникнення",
        "intro": [
          "Ці відеокурси навчать вас тесту на проникнення за допомогою Python. Також відомий як пен тест (pen test), тест на проникнення — це змодельована атака на систему задля перевірки на вразливі місця.",
          "У цьому курсі ви дізнаєтеся про сокети, створите TCP сервер та клієнт, створите Nmap сканер і інші інструменти та техніки, які пен тестувальники використовують щоденно."
        ]
      },
      "information-security-projects": {
        "title": "Проєкти «Інформаційна безпека»",
        "intro": [
          "Настав час перевірити ваші навички з інформаційної безпеки на практиці. Ці проєкти дадуть вам шанс застосувати всі набуті вміння, вивчені правила та поняття з інформаційної безпеки.",
          "Коли ви закінчите, у вас буде достатньо проєктів з інформаційної безпеки за плечима, разом з сертифікацією, якою ви можете похизуватись перед друзям, сім’єю та роботодавцями."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Машинне навчання з Python",
    "intro": [
      "Машинне навчання має багато практичних застосунків, які ви можете використовувати у своїх проєктах чи роботі.",
      "У сертифікації «Машинне навчання з Python» ви використовуватимете фреймворк TensorFlow, аби створити декілька нейронних мереж і вивчити складніші техніки, серед яких обробка природної мови й навчання з підкріпленням.",
      "Також ви зануритеся у нейронні мережі та вивчите правила, за якими працюють глибокі, рекурентні та згорткові нейронні мережі."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "Tensorflow — це фреймворк з відкритим вихідним кодом, що полегшує використання машинного навчання та нейронних мереж.",
          "Наступний відеокурс був створений Тімом Рущіцею, також відомим як «Tech With Tim». Він допоможе зрозуміти TensorFlow і деякі з його потужних можливостей."
        ]
      },
      "how-neural-networks-work": {
        "title": "Як працюють нейронні мережі",
        "intro": [
          "Нейронні мережі лежать в основі того, що ми зараз називаємо штучним інтелектом. Але їх, як правило, складно зрозуміти. Особливо початківцям у галузі машинного навчання.",
          "Навіть якщо ви вперше зіштовхуєтеся з нейронними мережами, ці відеокурси Брендона Рорера навчать вас орієнтуватися у їхніх поняттях та підрахунках."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Проєкти «Машинне навчання з Python»",
        "intro": [
          "Машинне навчання може бути дуже корисним. Завершивши ці безоплатні складні проєкти з програмування, ви покажете, що маєте базові знання з машинного навчання й отримаєте сертифікацію «Машинне навчання з Python»."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "Алгебра з Python",
    "intro": [
      "Цей курс розроблений як односеместровий курс коледжу. Він складається з навчальних відео та блокнотів Google Colaboratory, за якими потрібно слідкувати протягом інтерактивів, завдань та проєктів.",
      "Під час проходження кожної частини курсу ви повністю зрозумієте алгебру та навчитесь писати код Python, який розв’язуватиме приклади.",
      "Протягом курсу ви також побудуєте блокнот Algebra Colab, який зможете використовувати як власний калькулятор. Цей курс (та код, який ви напишете) надасть вам основу, щоб краще зрозуміти математику та науку про дані."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Вивчіть співвідношення та пропорції",
        "intro": [
          "Тут починається ваша подорож. Ви дізнаєтесь, як налаштувати Colab Notebook, який може запускати код Python. Потім ви використовуватимете блокнот, щоб за допомогою відео вивчити співвідношення та пропорції з Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Вивчіть, як знайти Х",
        "intro": [
          "Ця тема фокусуватиметься на знаходженні невідомого числа (часто називається «х»), використовуючи алгебраїчні вирази та код Python."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Вивчіть дроби та десяткові числа",
        "intro": [
          "Ця тема зосереджуватиметься на перетворенні десяткових чисел у дроби та відсотки."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Вивчіть функції та графіки",
        "intro": ["Ця тема навчить вас математичних функцій."]
      },
      "learn-linear-functions": {
        "title": "Вивчіть лінійні функції",
        "intro": [
          "Ця тема покаже, як знайти рівняння прямої, що проходить через дві задані точки."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Вивчіть спільні множники та квадратні корені",
        "intro": [
          "У цій темі ви навчитесь знаходити спільні множники та скорочувати їх. Це буде корисно при спрощенні дробів та розкладанні квадратних коренів."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Багатофункціональний калькулятор",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте багатофункціональний калькулятор."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Вивчіть, як побудувати графік системи рівнянь",
        "intro": [
          "Ця тема фокусуватиметься на побудові графіку з двома рівняннями на одній координатній площині, де можна побачити перетин ліній."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Вивчіть, як розв’язувати системи рівнянь",
        "intro": [
          "У цій темі ви навчитесь розв’язувати систему з двох рівнянь (з двома змінними) без графіка. Ви побачите, як можна розкласти рівняння та розв’язати задану змінну в Python. Після цього ви зможете розв’язувати та будувати графік системи за допомогою одного блоку коду."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Дізнайтесь про прикладне застосування лінійних систем",
        "intro": [
          "У цій темі ви побачите, як можна використовувати вивчену алгебру для розв’язку завдань, пов’язаних з реальним світом."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Вивчіть квадратні рівняння",
        "intro": [
          "Ця тема виходить за межі лінійних рівнянь і зосереджується на піднесенні до степеня та побудові параболи. Ви навчитеся знаходити ключові точки на параболах і розв’язувати квадратні рівняння."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Графічний калькулятор",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте графічний калькулятор."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Вивчіть батьківські графіки та многочлени",
        "intro": [
          "Ця тема покаже багато різних видів «батьківських» графіків, тобто базових шаблонів, з яких створюються складніші графіки. Многочлени — це математичні вирази з декількома елементами, тобто складнішими членами. Ви побачите, як ці графіки виглядають, як їх змінити та як зробити це за допомогою Python."
        ]
      },
      "build-three-math-games-project": {
        "title": "Три математичні ігри",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте три математичні ігри."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Дізнайтесь про прикладне застосування алгебри у бізнесі",
        "intro": [
          "Ця тема покаже, як застосувати навички розв’язання та побудови графіків, щоб знайти витрати, дохід та прибуток. Ви напишете код, який створюватиме криву попиту з двох точок. Ви побачите, як ціна впливає на графік прибутку і те, як взаємодіють усі рівняння."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Вивчіть прості та складні відсотки",
        "intro": [
          "Ця тема покаже, як розрахувати відсотки, сплату позики та прогнозний розрахунок інвестицій. Ви побачите математичні формули та перетворите їх у код. Оскільки ці формули зазвичай складні, корисно мати код і лише змінювати значення."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Вивчіть піднесення до степеня та логарифми",
        "intro": [
          "Ця тема покаже, що піднесення до степеня та логарифми є оберненими функціями, які можна використовувати для різного застосування."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Фінансовий калькулятор",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте фінансовий калькулятор."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "Алгебра з Python: висновок",
        "intro": [
          "Це остання тема даного курсу. Поглянемо, як ви можете поєднати знання з математики та Python із зовнішніми даними."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Дослідник графіку даних",
        "intro": [
          "Цей проєкт потрібно виконати, щоб отримати сертифікацію.",
          "У цьому проєкті ви побудуєте дослідник графіку даних."
        ]
      }
    }
  },
  "python-for-everybody": {
    "title": "Legacy Python for Everybody",
    "intro": [
      "Python is one of the most popular, flexible programming languages today. You can use it for everything from basic scripting to machine learning."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python for Everybody",
        "intro": [
          "Python for everybody is a free video course series that teaches the basics of using Python 3.",
          "The courses were created by Dr. Charles Severance (also known as Dr. Chuck). He is a Clinical Professor at the University of Michigan School of Information, where he teaches various technology-oriented courses including programming, database design, and web development."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Підготовка до співбесіди з програмування",
    "intro": [
      "Шукаєте безоплатні вправи з програмування, щоб підготуватися до наступної співбесіди? Ми про це подбали.",
      "Цей розділ містить сотні завдань з програмування, які перевіряють ваші знання алгоритмів, структур даних і математики. Тут також є декілька проєктів, які ви можете використати для зміцнення своїх навичок або просто додати до свого портфоліо."
    ],
    "note": "Проєкт Ейлера переміщено в окремий курс. Поверніться до навчальної програми, щоб побачити перелік всіх курсів.",
    "blocks": {
      "algorithms": {
        "title": "Алгоритми",
        "intro": [
          "Ці безоплатні вправи з програмування навчать вас загальних алгоритмів, з якими ви скоріш за все зіткнетеся в житті. Це чудова можливість вдосконалити як логіку, так і програмувальні навички.",
          "Подібні алгоритми часто використовують на співбесідах, щоб перевірити навички кандидатів. Ми чітко пояснимо, як саме функціонують різноманітні алгоритми, щоб ви могли підібрати рішення до кожного."
        ]
      },
      "data-structures": {
        "title": "Структура даних",
        "intro": [
          "Ці безплатні курси програмування спрямовані на те, щоб допомогти вам у роботі з численними структурами даних, з якими ви ще не стикалися.",
          "Під час роботи з цими курсами, ви вивчите кожний тип структур даних та реалізуєте алгоритми, щоб зрозуміти їх краще."
        ]
      },
      "take-home-projects": {
        "title": "Проєкти на самостійне опрацювання",
        "intro": [
          "Люди завжди нервують на співбесідах з програмування. Іноді, замість інтерв’ю, кандидатам можуть запропонувати створити проєкт вдома. Співбесіди такого типу часто передбачають виконання великого обсягу роботи, однак якнайкраще показують роботодавцям ваші здібності.",
          "Попрактикуйтеся створювати запропоновані нами проєкти. Не поспішайте, добре над ними попрацюйте та додайте до свого резюме чи портфоліо, щоб вразити потенційних роботодавців."
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "The Odin Project (Beta)",
    "intro": [
      "Проєкт «Odin» є одним з тих ресурсів, про які хотіли б дізнатися ще коли навчались. ",
      "Не кожен має доступ до технологічної освіти або коштів, необхідних для відвідування інтенсивної школи. Однак це не остаточне рішення для тих, хто хоче вчитися.",
      "Цей проєкт розроблений, щоб заповнити прогалину для людей, які намагаються вчитись самостійно, але все ж таки хочуть високоякісну освіту."
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Вивчіть основи HTML",
        "intro": [
          "Get a solid grasp of HTML essentials with this course. From structuring web pages to understanding semantic tags, you'll build a strong foundation for creating well-organized and accessible content on the web."
        ]
      },
      "top-working-with-text": {
        "title": "Робота з текстом",
        "intro": [
          "Explore the intricacies of working with text in web development. Learn about text formatting, manipulation, and presentation to enhance your skills in creating web content."
        ]
      },
      "top-links-and-images": {
        "title": "Посилання та зображення",
        "intro": [
          "Learn how to incorporate links and images into your web projects. This course covers the fundamentals of creating links and embedding images to make your websites more interactive and visually appealing."
        ]
      },
      "top-build-a-recipe-project": {
        "title": "Вивчіть основи HTML, побудувавши сторінку з рецептами",
        "intro": [
          "Put your HTML skills into practice by building a recipe page. This hands-on project allows you to apply your knowledge and create a functional web page while reinforcing key concepts of HTML development."
        ]
      },
      "top-learn-css-foundations": {
        "title": "Вивчіть основи CSS",
        "intro": [
          "Dive into the world of  Cascading Style Sheets (CSS) and learn how to style your HTML elements. Explore styling properties, selectors, and layouts to bring your web pages to life."
        ]
      },
      "top-learn-css-foundations-projects": {
        "title": "Проєкти «Вивчіть основи CSS»",
        "intro": [
          "Take your CSS skills to the next level by working on practical projects. This course provides hands-on experience in applying CSS to create responsive designs for real-world scenarios."
        ]
      },
      "top-learn-css-specificity": {
        "title": "Вивчіть специфічність CSS",
        "intro": [
          "Learn CSS specificity and gain a better understanding of how styles are applied to HTML elements. This course explores the nuances of CSS rules and helps you write efficient and targeted styles for your web pages."
        ]
      },
      "top-the-box-model": {
        "title": "Вивчіть блокову модель",
        "intro": [
          "Learn the CSS box model with this course. Understand how elements are rendered on the web, and learn to manipulate spacing, borders, and padding to achieve your desired layout and design."
        ]
      },
      "top-introduction-to-flexbox": {
        "title": "Вступ до Flexbox",
        "intro": [
          "Discover the power of Flexbox, a layout model that simplifies the design of flexible and responsive web layouts. Learn how to create dynamic and adaptive page structures with ease."
        ]
      },
      "top-learn-block-and-inline": {
        "title": "Вивчіть блокові та рядкові елементи",
        "intro": [
          "Explore the distinctions between block and inline elements in HTML and CSS. This course provides insights into how these display types affect layout and behavior, empowering you to make informed design decisions."
        ]
      }
    }
  },
  "project-euler": {
    "title": "Проєкт Ейлера",
    "intro": [
      "Виконайте завдання з програмування з архівів проєкту Ейлера. Вони удосконалять ваші алгоритмічні та математичні знання.",
      "Тут є завдання різної складності, а для багатьох здобуття досвіду полягає в індуктивному методі навчання. Тобто вирішення одного завдання прояснить нову концепцію та дозволить вирішити раніше незрозуміле завдання. Чи під силу вам вирішити кожне?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Проєкт Ейлера. Завдання 1-100",
        "intro": [
          "У першому наборі завдань ви використовуватимете послідовність Фібоначчі, теорему про розподіл простих чисел та комбінаторику, щоб написати алгоритми для розв’язку завдань."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Проєкт Ейлера. Завдання 101-200",
        "intro": [
          "У цьому наборі завдань ви закріпите знання з першої частини курсу та використовуватимете обчислення вектора, трикутник Паскаля й алгоритм RSA, щоб розв’язати завдання."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Проєкт Ейлера. Завдання 201-300",
        "intro": [
          "У цьому наборі завдань ви продовжите розвивати навички з попередніх завдань та використовуватимете біном Ньютона, числа Гемінґа й послідовність Коллатца."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Проєкт Ейлера. Завдання 301-400",
        "intro": [
          "Тут ви продовжите працювати над своїми навичками, використовуючи комбінаторну теорію ігор, бітові операції та послідовність Ґоломба."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Проєкт Ейлера. Завдання 401-480",
        "intro": [
          "У кінцевому наборі завдань ви підкреслите свої знання та використовуватимете унітарні дільники, програму Капрекара та багато іншого, щоб розв’язати складні завдання."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "(Нове) Основи C# з Microsoft",
    "intro": [
      "Цей курс пропонує всебічне знайомство з мовою програмування C#, розглядаючи основні поняття, синтаксис та практичне застосування у розробці програмного забезпечення.",
      "Завдяки практичним вправам та проєктам ви вивчите основи C#, включно зі змінними, типами даних, структурами керування та принципами об’єктноорієнтованого програмування.",
      "Після завершення курсу ви отримаєте практичні навички та знання, необхідні для впевненого використання C# при побудові застосунків."
    ],
    "note": "Кожен розділ має трофей, пов’язаний з розділом, та який ви маєте отримати на навчальній платформі Microsoft. Після здобуття кожного трофею, їх потрібно підтвердити на freeCodeCamp. Після цього ви зможете скласти екзамен з сертифікації.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Написання першого коду за допомогою C#",
        "intro": [
          "Розпочніть подорож із написання коду на C#. Завдяки основам та синтаксису мови ви отримаєте хорошу базу, створивши підґрунтя для своїх пригод з програмування."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Створення та запуск простих консольних застосунків C#",
        "intro": [
          "Опануйте мистецтво створення та запуску звичайних консольних застосунків C#. Пориньте у світ консольного програмування, де ви отримаєте практичний досвід та побачите свій код у дії."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Додавання логіки до консольних застосунків C#",
        "intro": [
          "Розблокуйте потужність логіки у консольних застосунках C#. Дізнайтесь, як додати логіку та прийняття рішень до свого коду, що дозволить застосункам робити динамічний вибір та реагувати на різні сценарії."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Робота з даними змінних в консольних застосунках C#",
        "intro": [
          "Дізнайтесь більше про дані змінних у консольних застосунках C#. Приборкайте можливість зберігати та маніпулювати різними типами даних, серед яких числа й текст, ознайомившись з основними поняттями змінних та обробки даних."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Створення методів в консольних застосунках C#",
        "intro": [
          "Перенесіть власні консольні застосунки C# на новий рівень, опанувавши мистецтво створення методів. Дізнайтесь, як організувати та модуляризувати свій код, зробивши його слухнянішим та ефективнішим."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Налагодження консольних застосунків C#",
        "intro": [
          "Вдоскональте свої навички з усунення неполадок у консольних застосунках C#. Отримайте можливість визначити та розв’язати проблеми у своєму коді, забезпечуючи безперебійну роботу програм та бажані результати."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Екзамен з сертифікації «Основи C# з Microsoft»",
        "intro": [
          "Використайте набуті знання, щоб скласти екзамен та отримати сертифікацію «Основи C# з Microsoft»"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Майбутній Python",
    "intro": ["заповнювач"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Вивчіть Python, створивши гру «Блекджек»",
        "intro": ["Вивчіть Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Майбутній проєкт з Python",
        "intro": ["заповнювач"]
      }
    }
  },
  "a2-english-for-developers": {
    "title": "Англійська мова рівня A2 для розробників (бета-версія)",
    "intro": [
      "In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the A2 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.",
      "The first half of the curriculum will help you get comfortable with English grammar and usage. It will give you tons of hands-on practice. You'll learn basics like introducing yourself, making small talk, and discussing your work.",
      "In the second half, you'll practice vocabulary specific to software development. You'll learn how to describe code, discuss tech trends, and participate in stand-up meetings.",
      "This entire A2-level curriculum includes 105 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting."
    ],
    "blocks": {
      "learn-greetings-in-your-first-day-at-the-office": {
        "title": "Дізнайтесь про привітання в офісі першого робочого дня",
        "intro": [
          "In this first course, you'll learn common expressions for situations you may encounter on your first day at work. You'll learn about introductions, getting to know people, asking for lunch recommendations, and getting an access card from security."
        ]
      },
      "learn-introductions-in-an-online-team-meeting": {
        "title": "Дізнайтесь про знайомство на онлайн-зустрічі",
        "intro": [
          "In this course, you'll learn how to give a personal introduction. You'll also learn how to state your profession, and share your goals in group meetings."
        ]
      },
      "learn-conversation-starters-in-the-break-room": {
        "title": "Дізнайтесь про початок розмови в кімнаті відпочинку",
        "intro": [
          "In this course, you'll learn how to start a conversation in casual settings. You'll also learn how to talk about your hobbies and personality traits. You'll even learn how to ask about places around the town."
        ]
      },
      "learn-how-to-talk-about-a-typical-workday-and-tasks": {
        "title": "Дізнайтесь, як говорити про типовий робочий день та завдання",
        "intro": ["Learn about a typical workday."]
      },
      "learn-how-to-discuss-your-morning-or-evening-routine": {
        "title": "Дізнайтесь, як обговорювати ранкову або вечірню рутину",
        "intro": ["Learn about routines."]
      },
      "learn-how-to-describe-your-current-project": {
        "title": "Дізнайтесь, як описувати поточний проєкт",
        "intro": ["Learn about projects."]
      },
      "learn-how-to-ask-and-share-about-educational-and-professional-background": {
        "title": "Дізнайтесь, як запитувати та розповідати про навчання і досвід роботи",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-hobbies-and-interests": {
        "title": "Дізнайтесь, як говорити про хобі та інтереси",
        "intro": ["", ""]
      },
      "learn-how-to-discuss-roles-and-responsibilies": {
        "title": "Дізнайтесь, як обговорювати посади та обов’язки",
        "intro": ["", ""]
      },
      "learn-how-to-have-a-conversation-about-preferences-and-motivations": {
        "title": "Дізнайтесь, як говорити про вподобання та вмотивованість",
        "intro": ["", ""]
      },
      "learn-how-to-discuss-popular-trends-in-technology": {
        "title": "Дізнайтесь, як обговорювати технологічні тренди",
        "intro": ["", ""]
      },
      "learn-how-to-clarify-information-in-different-interactions": {
        "title": "Дізнайтесь, як уточнити інформацію в різних ситуаціях",
        "intro": ["", ""]
      },
      "learn-how-to-use-basic-programming-vocabulary-in-conversations": {
        "title": "Дізнайтесь, як використовувати базові слова з програмування",
        "intro": ["", ""]
      },
      "learn-how-to-use-code-related-concepts-and-terms": {
        "title": "Дізнайтесь, як використовувати поняття та терміни з програмування",
        "intro": ["", ""]
      },
      "learn-how-to-discuss-tech-trends-and-updates": {
        "title": "Дізнайтесь, як обговорювати технологічні тренди та оновлення",
        "intro": ["", ""]
      },
      "learn-how-to-help-a-coworker-troubleshoot-on-github": {
        "title": "Дізнайтесь, як допомогти співпрацівнику розв’язати проблему на GitHub",
        "intro": ["", ""]
      },
      "learn-how-to-share-your-progress-in-weekly-stand-up-meetings": {
        "title": "Дізнайтесь, як ділитись своїм прогресом на щотижневій зустрічі",
        "intro": ["", ""]
      },
      "learn-how-to-ask-for-clarification-on-code-understanding": {
        "title": "Дізнайтесь, як просити роз’яснення коду",
        "intro": ["", ""]
      },
      "learn-how-to-document-code-for-a-project": {
        "title": "Дізнайтесь, як документувати код проєкту",
        "intro": ["", ""]
      },
      "learn-how-to-read-and-understand-code-documentation": {
        "title": "Дізнайтесь, як читати та розуміти документацію",
        "intro": ["", ""]
      },
      "learn-how-to-analyze-code-documentation": {
        "title": "Дізнайтесь, як аналізувати документацію",
        "intro": ["", ""]
      },
      "learn-how-to-follow-basic-email-convention": {
        "title": "Дізнайтесь, як дотримуватись базової конвенції е-пошти",
        "intro": ["", ""]
      },
      "learn-how-to-share-progress-and-accomplishments": {
        "title": "Дізнайтесь, як ділитись прогресом та досягненнями",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-updates-and-plans-for-tasks-and-projects": {
        "title": "Дізнайтесь, як говорити про оновлення та плани щодо завдань і проєктів",
        "intro": ["", ""]
      },
      "learn-how-to-express-agreement-or-disagreement": {
        "title": "Дізнайтесь, як погоджуватись та не погоджуватись",
        "intro": ["", ""]
      },
      "learn-how-to-offer-technical-support-and-guidance": {
        "title": "Дізнайтесь, як надавати технічну підтримку та супровід",
        "intro": ["", ""]
      },
      "learn-how-to-request-and-receive-guidance": {
        "title": "Дізнайтесь, як запитувати та отримувати супровід",
        "intro": ["", ""]
      },
      "learn-how-to-provide-explanations-when-helping-others": {
        "title": "Дізнайтесь, як надавати пояснення при допомозі іншим",
        "intro": ["", ""]
      }
    }
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Level up your creative problem solving skills with these free programming tasks from the classic Rosetta Code library.",
      "These challenges can prove to be difficult, but they will push your algorithm logic to new heights.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Attribute: Rosetta Code</a>"
    ],
    "blocks": {
      "rosetta-code-challenges": {
        "title": "Rosetta Code Challenges",
        "intro": ["These are the challenges for Rosetta Code."]
      }
    }
  },
  "example-certification": {
    "title": "Зразкова сертифікація",
    "intro": ["заповнювач"],
    "blocks": {
      "example-certification-exam": {
        "title": "Екзамен зі зразкової сертифікації",
        "intro": ["заповнювач"]
      }
    }
  },
  "misc-text": {
    "certification": "Сертифікація «{{cert}}»",
    "browse-other": "Перегляньте інші безоплатні сертифікації\n(ми рекомендуємо виконувати їх послідовно)",
    "courses": "Курси",
    "steps": "Кроки",
    "expand": "Розгорнути курс",
    "collapse": "Згорнути курс",
    "legacy-header": "Застарілі курси",
    "legacy-desc": "Ці курси більше не входять до сертифікацій, але вони досі доступні для навчання.",
    "legacy-go-back": "Перейдіть до поточної версії навчальної програми.",
    "course-maintenance": "Ці курси знаходяться на технічному обслуговуванні. Якщо вони не працюють, див. як запустити їх локально на <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "Ваш прогрес не буде збережений в обліковому записі freeCodeCamp при локальному запуску.",
    "go-back-to-learn": "Поверніться до стабільної версії навчальної програми.",
    "read-database-cert-article": "Будь ласка, прочитайте повідомлення на форумі, перш ніж продовжити.",
    "enable-cookies": "Увімкніть сторонні файли cookie перед початком роботи.",
    "english-only": "Курси в цьому розділі доступні лише англійською мовою. Наразі ми можемо перекладати лише заголовки й вступи, а не самі уроки."
  }
}
