{
  "responsive-web-design": {
    "title": "Адаптивний вебдизайн",
    "intro": [
      "У цьому сертифікаті \"Адаптивний вебдизайн\" ви вивчите мови, які розробники використовують для створення вебсторінок: HTML (мова розмітки гіпертексту) для змісту, і CSS (Каскадні таблиці стилів) для дизайну.",
      "Спочатку ви створите застосунок із фотографіями котів, аби вивчити основи HTML та CSS. Пізніше ви опануєте сучасні методи, такі як змінні CSS, завдяки створенню пінгвіна, а також створите вебформу, щоб опанувати практики покращення доступності.",
      "Ви також дізнаєтеся, як конструювати вебсайти, які відповідають різним розмірам екранів створивши Twitter Card за допомогою Flexbox, а ще складний макет блогу з CSS Grid."
    ],
    "note": "Примітка: деякі розширення браузера (як блокувальники реклами та темні режими) можуть втручатися в тести. Якщо ви зіткнулися з подібними проблемами, ми рекомендуємо вимкнути розширення, які змінюють вміст або макет сторінок під час виконання курсу.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "Основи HTML та HTML5",
        "intro": [
          "HTML — це мова розмітки, яка використовує спеціальний синтаксис або примітки, для опису структури вебсторінки чи браузера. Елементи HTML зазвичай відкривають та закривають теги, що охоплюють вміст та надають йому значення. Наприклад, різні елементи можуть описати текст як заголовок, абзац або елемент списку.",
          "У цьому курсі ви створите застосунок із фотографіями котів, щоб опанувати застосування деяких з найпоширеніших елементів HTML (головних блоків будь-якої вебсторінки)."
        ]
      },
      "basic-css": {
        "title": "Основи CSS",
        "intro": [
          "CSS, або Каскадні таблиці стилів, повідомляють браузеру як показати текст та інший вміст, який ви написали в HTML. За допомогою CSS ви можете регулювати колір, шрифт, розмір, відстань і багато інших аспектів елементів HTML.",
          "І зараз, коли ви описали структуру вашого фото-додатка, стилізуйте його за допомогою CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Прикладний візуальний дизайн",
        "intro": [
          "Візуальний дизайн - це поєднання типографії, кольорознавства, графіки, анімації, макетів сторінок і багато чого іншого, аби допомогти вам передати ваше унікальне повідомлення.",
          "У цьому курсі ви навчитеся застосовувати усі ці елементи візуального дизайну для своїх вебсайтів."
        ]
      },
      "applied-accessibility": {
        "title": "Доступність для людей з обмеженими можливостями",
        "intro": [
          "У процесі розробки вебсайтів, спеціальні можливості посилаються на вміст сайту та ІК (інтерфейс користувача), який широка аудиторія зможе розпізнати, з яким зможе взаємодіяти та за допомогою якого зможе зорієнтуватися на сайті. У цю аудиторія також входять люди із зоровими, слуховими, руховими та когнітивними розладами.",
          "У цьому курсі ви дізнаєтеся найкращі практики для створення вебсайтів, які доступні кожному."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Принципи Адаптивного вебдизайну",
        "intro": [
          "Підключитися до мережі можна з багатьох пристроїв усіх форм і розмірів. Адаптивний вебдизайн - це проєктування гнучких вебсайтів, які пристосовуються до різних розмірів, орієнтацій та розширення екранів.",
          "У цьому курсі ви дізнаєтеся як використовувати CSS, аби ваші вебсайти мали гарний вигляд, незалежно від того, на якому пристрої вони відтворені."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox - це потужний режим розмітки, який підтримується практично на всіх пристроях і який було введено з останньою версією CSS, CSS3. За допомогою flexbox набагато легше відцентровувати елементи сторінки та створювати функціональні інтерфейси користувачів, які автоматично зменшуються та розширяються.",
          "У цьому курсі ви дізнаєтеся про складові flexbox та функціональної розмітки, коли створюватимете Twitter card."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "CSS grid - це новіший режим розмітки, за допомогою якого можна легко створювати складну адаптивну композицію. Він перетворює елемент HTML у сітку і допомагає розмістити дочірні елементи будь-де на екрані.",
          "У цьому курсі ви вивчите основи CSS Grid, створюючи різні складні композиції, в тому числі макет блогу."
        ]
      },
      "responsive-web-design-projects": {
        "title": "Проєкти Адаптивного вебдизайну",
        "intro": [
          "Настав час скористатися отриманими навичками на практиці. Під час роботи над проєктами, ви зможете застосувати всі навички, правила і поняття, які ви нещодавно вивчили, такі як: HTML, CSS, Візуальний дизайн, Застосування для людей з обеженими можливостями та інше.",
          "Завершіть 5 проєктів з вебпрограмування, що розташовані нижче, аби отримати свій сертифікат з адаптивного вебдизайну."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Responsive Web Design (Beta)",
    "intro": [
      "In this Responsive Web Design Certification, you'll learn the languages that developers use to build webpages: HTML (Hypertext Markup Language) for content, and CSS (Cascading Style Sheets) for design.",
      "First, you'll build a cat photo app to learn the basics of HTML and CSS. Later, you'll learn modern techniques like CSS variables by building a penguin, and best practices for accessibility by building a web form.",
      "Finally, you'll learn how to make webpages that respond to different screen sizes by building a Twitter card with Flexbox, and a complex blog layout with CSS Grid."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and dark mode extensions can interfere with the tests. If you face issues, we recommend disabling extensions that modify the content or layout of pages, while taking the course.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Tribute Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a tribute page for a subject of your choosing, fictional or real."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Personal Portfolio Webpage",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build your own personal portfolio page."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Product Landing Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a product landing page to market a product of your choice."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Survey Form",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a survey form to collect data from your users."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Technical Documentation Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a technical documentation page to serve as instruction or reference for a topic."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Learn HTML by Building a Cat Photo App",
        "intro": [
          "HTML tags give a webpage its structure. You can use HTML tags to add photos, buttons, and other elements to your webpage.",
          "In this course, you'll learn the most common HTML tags by building your own cat photo app."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Learn Basic CSS by Building a Cafe Menu",
        "intro": [
          "CSS tells the browser how to display your webpage. You can use CSS to set the color, font, size, and other aspects of HTML elements.",
          "In this course, you'll learn CSS by designing a menu page for a cafe webpage."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Learn the CSS Box Model by Building a Rothko Painting",
        "intro": [
          "Every HTML element is its own box – with its own spacing and a border. This is called the Box Model.",
          "In this course, you'll use CSS and the Box Model to create your own Rothko-style rectangular art pieces."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Learn CSS Variables by Building a City Skyline",
        "intro": [
          "CSS variables help you organize your styles and reuse them.",
          "In this course, you'll build a city skyline. You'll learn how to configure CSS variables so you can reuse them whenever you want."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Learn HTML Forms by Building a Registration Form",
        "intro": [
          "You can use HTML forms to collect information from people who visit your webpage.",
          "In this course, you'll learn HTML forms by building a signup page. You'll learn how to control what types of data people can type into your form, and some new CSS tools for styling your page."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Learn Accessibility by Building a Quiz",
        "intro": [
          "Accessibility is making your webpage easy for all people to use – even people with disabilities.",
          "In this course, you'll build a quiz webpage. You'll learn accessibility tools such as keyboard shortcuts, ARIA attributes, and design best practices."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Learn Intermediate CSS by Building a Picasso Painting",
        "intro": [
          "In this course, you'll use learn some intermediate CSS techniques by coding your own Picasso painting webpage. You'll learn about SVG icons, CSS positioning, and review other CSS skills you've learned."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Learn Responsive Web Design by Building a Piano",
        "intro": [
          "Responsive Design tells your webpage how it should look on different-sized screens.",
          "In this course, you'll use CSS and Responsive Design to code a piano. You'll also learn more about media queries and pseudo selectors."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Learn CSS Flexbox by Building a Photo Gallery",
        "intro": [
          "Flexbox helps you design your webpage so that it looks good on any screen size.",
          "In this course, you'll use Flexbox to build a responsive photo gallery webpage."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Learn CSS Grid by Building a Magazine",
        "intro": [
          "CSS Grid gives you control over the rows and columns of your webpage design.",
          "In this course, you'll build a magazine article. You'll learn how to use CSS Grid, including concepts like grid rows and grid columns."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Learn Typography by Building a Nutrition Label",
        "intro": [
          "Typography is the art of styling your text to be easily readable and suit its purpose.",
          "In this course, you'll use typography to build a nutrition label webpage. You'll learn how to style text, adjust line height, and position your text using CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Learn CSS Transforms by Building a Penguin",
        "intro": [
          "You can transform HTML elements to create appealing designs that draw your reader's eye. You can use transforms to rotate elements, scale them, and more.",
          "In this course, you'll build a penguin. You'll use CSS transforms to position and resize the parts of your penguin, create a background, and animate your work."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Learn CSS Animation by Building a Ferris Wheel",
        "intro": [
          "You can use CSS animation to draw attention to specific sections of your webpage and make it more engaging.",
          "In this course, you'll build a Ferris wheel. You'll learn how to use CSS to animate elements, transform them, and adjust their speed."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Learn More About CSS Pseudo Selectors By Building A Balance Sheet",
        "intro": [
          "You can use CSS pseudo selectors to change specific HTML elements.",
          "In this course, you'll build a balance sheet using pseudo selectors. You'll learn how to change the style of an element when you hover over it with your mouse, and trigger other events on your webpage."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Learn CSS Colors by Building a Set of Colored Markers",
        "intro": [
          "Selecting the correct colors for your webpage can greatly improve the aesthetic appeal to your readers.",
          "In this course, you'll build a set of colored markers. You'll learn different ways to set color values and how to pair colors with each other."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Алгоритми JavaScript та Структури даних",
    "intro": [
      "Якщо HTML і CSS відповідають за вміст і стилізацію сторінки, то JavaScript робить її інтерактивно. У довідці \"Алгоритм JavaScript та Структури Даних\" ви вивчите основи JavaScript, включно зі змінними, масивами, об'єктами, циклами та функціями.",
      "Як тільки ви вивчите основи, ви почнете застосовувати ці знання, створюючи алгоритми, щоб уміло маніпулювати рядками, факторизувати числа, і навіть зможете обчислити орбіту Міжнародної Космічної Станції.",
      "Крім того, ви також вивчите два важливих стилі або парадигми в програмуванні: Об'єктозорієнтоване програмування (ООП) і Функційне програмування (ФП)."
    ],
    "note": "Примітка: Деякі розширення браузера, такі як блокувальники реклами та скриптів можуть заважати тестам. Якщо ж ви зіштовхнулися з проблемами, ми рекомендуємо вимкнути розширення, які змінюють або блокують вміст сторінок під час проходження курсу.",
    "blocks": {
      "basic-javascript": {
        "title": "Основи JavaScript",
        "intro": [
          "JavaScript — це скриптова мова, яка використовується для того, аби зробити вебсайти інтерактивними. Це одна з основних технологій в мережі (разом з HTML та CSS), яка підтримується всіма сучасними браузерами.",
          "У цьому курсі ви вивчите головні поняття програмування в JavaScript. Ви почнете з простих структур даних, таких як числа та рядки. Далі ви почнете роботу з масивами, об'єктами, функціями, циклами, умовними конструкціями (if/else) тощо."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, або ES — це стандартизована версія JavaScript. Оскільки більшість браузерів дотримуються цих стандартів, умови ECMAScript і JavaScript є взаємозамінними.",
          "Більша частина JavaScript (про яку ви вже дізналися) була в ES5 (ECMAScript 5), який утвердили у 2009 році. Поки ви все ще маєте можливість писати програми в ES5, JavaScript постійно розвивається і там щорічно вводяться нові функції.",
          "У ES6, який випустили у 2015 році, додали багато нових потужних функцій до цієї мови. У курсі ви вивчите ці нові особливості, такі як функції arrow (стрілки), деструкція, класи, проміси та модулі."
        ]
      },
      "regular-expressions": {
        "title": "Регулярні вирази",
        "intro": [
          "Регулярні вирази (відомі як \"regex\" або \"regexp\") — шаблони, які допомагають програмістам поєднувати, шукати та замінювати текст. Регулярні вирази дуже важливі, але їх важко читати, оскільки у них використовуються спеціальні символи для створення складніших, гнучкіших поєднань.",
          "У цьому курсі ви дізнаєтеся як використовувати спеціальні символи, групи захоплення, позитивний та негативний огляди та інші техніки, аби текст відповідав бажаному."
        ]
      },
      "debugging": {
        "title": "Налагодження програм",
        "intro": [
          "Налагодження програм — це процес перевірки коду на наявність помилок та їх виправлення.",
          "Помилки в коді, як правило, розподіляють на три категорії: синтаксичні, які заважають вашій програмі працювати; помилки середовища виконання, коли ваш код поводиться непередбачувано; або логічні, коли ваш код не виконує свою функцію.",
          "У цьому курсі ви дізнаєтеся як використовувати консоль JavaScript, аби налагодити програми та уникнути розповсюджених помилок."
        ]
      },
      "basic-data-structures": {
        "title": "Основи структур даних",
        "intro": [
          "Багатьома способами можна зберегти дані та отримати до них доступ. Ви вже знаєте деякі загальні структури даних JavaScript - масиви та об'єкти.",
          "У цьому курсі Основ структур даних ви дізнаєтеся більше про різницю між масивами та об'єктами, та в яких ситуаціях вони використовуються. Ви також дізнаєтеся як використовувати корисні JS методи, такі як <code>splice()</code> і <code>Object.keys()</code> аби отримати доступ до даних та маніпулювати ними."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Основи написання алгоритмів",
        "intro": [
          "Алгоритм — це ряд покрокових інструкцій, які описують як щось робити.",
          "Написання успішного алгоритму допомагає розбити задачу на менші частини та гарно подумати над тим, як вирішити кожну частину за допомогою коду.",
          "У цьому курсі ви вивчите основи алгоритмічного мислення, пишучи алгоритми, які роблять усе - від перетворення температур до користування складними 2D масивами."
        ]
      },
      "object-oriented-programming": {
        "title": "Об'єктозорієнтоване програмування",
        "intro": [
          "ООП, або Об'єктозорієнтоване програмування - це один з основних підходів до процесу розробки програмного забезпечення. В ООП об'єкти й класи впорядковують код для опису речей і того, що вони роблять.",
          "У цьому курсі ви вивчите основні принципи ООП в JavaScript, включаючи <code>this</code> ключове слово, прототипи ланцюгів, конструктори та наслідування."
        ]
      },
      "functional-programming": {
        "title": "Функційне програмування",
        "intro": [
          "Функційне програмування це ще один популярний підхід до розробки програмного забезпечення. У функційному програмуванні код впорядкований у менші, прості функції, які можна об'єднувати для створення складних програм.",
          "У цьому курсі ви вивчите основні поняття функційного програмування, включаючи чисті функції, як уникнути мутацій і як писати чистіший код за допомогою методів, таких як <code>.map()</code> і <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Написання алгоритмів середньої складності",
        "intro": [
          "Тепер, коли ви знаєте основи алгоритмічного мислення, разом з ООП та функційним програмуванням, перевірте свої вміння у написанні алгоритмів середньої складності."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "Проєкти з Алгоритмами JavaScript та Структурами даних",
        "intro": [
          "Тепер настав час випробувати свої навички роботи з JavaScript на практиці. Ці проєкти подібні до тестів з написання алгоритмів, які ви вже робили, але складніші.",
          "Виконайте ці 5 проєктів JavaScript, аби отримати сертифікат \"Алгоритми JavaScript та Структури даних\"."
        ]
      },
      "basic-javascript-rpg-game": {
        "title": "Основи JavaScript в RPG іграх",
        "intro": [
          "",
          ""
        ]
      },
      "intermediate-javascript-calorie-counter": {
        "title": "Лічильник калорій за допомогою JavaScript середньої складності",
        "intro": [
          "",
          ""
        ]
      },
      "functional-programming-spreadsheet": {
        "title": "Таблиця функційного програмування",
        "intro": [
          "",
          ""
        ]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Бібліотеки фронтенд (Front End)",
    "intro": [
      "Тепер, коли ви вже знайомі з HTML, CSS та JavaScript, піднімімо ваш рівень навичок, вивчаючи декілька найбільш популярних бібліотек верстки в галузі.",
      "У курсі \"Бібліотеки фронтенд\" ви навчитеся швидко стилізувати ваш сайт за допомогою Bootstrap. Також ви навчитеся покращувати ваші CSS стилі та розширювати їх за допомогою Sass.",
      "Згодом ви розробите кошик для покупок та інші застосунки, щоб навчитися створювати потужні односторінкові застосунки (SPAs) з React та Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap — це фронтенд каркас створений для проєктування адаптивних вебсторінок та застосунків. Для веброзробки цей фреймворк використовує принцип Mobile First, включає попередньо інтегровані стилі та класи CSS і деякі розширення JavaScript.",
          "Під час цього курсу ви навчитеся створювати адаптивні вебсайти за допомогою Bootstrap та використовувати готові шаблони для стилізації кнопок, зображень, форм, навігації та інших поширених елементів."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery — одна з найпопулярніших у світі бібліотек JavaScript.",
          "До її запуску у 2006 році, кожний браузер використовував JavaScript по своєму. jQuery спростила роботу з JavaScript для користувачів, а також забезпечила кросбраузерність створених кодів.",
          "Під час цього курсу ви навчитеся використовувати jQuery для виділення, вилучення, копіювання та редагування різних елементів на сторінці."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, або \"Syntactically Awesome StyleSheets\" — це мовне розширення CSS, що містить функції, яких немає у базовому CSS, і тим самим допомагає спростити створення таблиць стилів для ваших проєктів.",
          "У цьому курсі ви навчитеся зберігати дані у змінних, вкладати CSS, створювати багаторазові стилі за допомогою міксин (Mixins), додавати умовні конструкції та цикли до ваших стилів тощо."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React — це популярна бібліотека JavaScript для створення багаторазових компонентних користувацьких інтерфейсів для вебсторінок або додатків.",
          "React поєднує HTML з функціями JavaScript, формуючи власну мову розмітки під назвою JSX. React також дозволяє легко керувати потоком даних у всьому додатку.",
          "Під час цього курсу ви навчитеся створювати різні компоненти React, керувати даними за допомогою пропсів (props), а також застосовувати різні методи життєвого циклу, такі як <code>componentDidMount</code> тощо."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "Зі збільшенням розмірів та кількості додатків, керувати спільними даними стає все складніше. Redux називають \"відкритою JS бібліотекою призначеною для управління станом програм JavaScript\", яка забезпечує належну роботу ваших програм і спрощує їхнє тестування.",
          "Хоча ви можете використовувати його з будь-якою іншою бібліотекою, ми лише коротко розповімо про Redux, а тоді об'єднаємо його з React у наступному наборі курсів.",
          "Під час цього курсу ви вивчите базову інформацію про сховища, дії, редуктори та проміжне програмне забезпечення Redux для керування даними у вашому додатку."
        ]
      },
      "react-and-redux": {
        "title": "React і Redux",
        "intro": [
          "React часто використовують разом із Redux, і не дарма. Redux і React створив один програміст, який хотів зробити процес передачі даних між компонентами простішим.",
          "Тепер коли ви вже навчились керувати загальними даними за допомогою Redux, ви можете виконувати дії й в React. На курсах React і Redux, ви навчитесь будувати компонент React і дізнаєтесь, як локально керувати станом на рівні компонента та й у цілому додатку за допомогою Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Проєкти по бібліотеках фронтенд розробки",
        "intro": [
          "Прийшов час протестувати ваші навички роботи з бібліотеками фронтенд розробки. Використовуйте Bootstrap, jQuery, Sass, React та Redux, аби створити 5 проєктів, що перевірять ваші знання з усього, що ви вивчили дотепер.",
          "Завершіть всі 5 проєктів і отримайте сертифікат по бібліотеках фронтенд розробки."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Візуалізація даних",
    "intro": [
      "Дані повсюди, але це не означає, що більшість з них без форми чи контексту.",
      "У сертифікаті \"Візуалізація даних\" ви створите діаграми, графіки та карти, що показують різні типи даних, за допомогою бібліотеки D3.js.",
      "Ви також дізнаєтесь про JSON (JavaScript Object Notation), і як працювати з даними онлайн користуючись API (Application Programing Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Візуалізація даних за допомогою D3",
        "intro": [
          "D3, або D3.js — розшифровується як \"Data Driven Documents\", а українською — \"Документи, керовані даними\". Це бібліотека JavaScript для створення функціональної та інтерактивної візуалізації даних у браузері.",
          "D3 створено для роботи з поширеними вебстандартами, а саме: HTML, CSS і SVG (масштабована векторна графіка).",
          "D3 підтримує багато різних форматів даних. Тому, використовуючи її потужні вбудовані методи, ви можете перетворити ці дані у різні діаграми, графіки та карти.",
          "У курсі \"Візуалізація даних за допомогою D3\" ви навчитеся працювати з даними, аби створювати різні діаграми, графіки, hover елементи, та інші складові частини, аби створити динамічну та принадну візуалізацію даних."
        ]
      },
      "json-apis-and-ajax": {
        "title": "JSON API та AJAX",
        "intro": [
          "Так само як інтерфейс користувача (UIs) допомагає людям користуватися програмами, так само й APIs (Application Programming Interfaces) допомагає програмам взаємодіяти між собою. APIs — це інструменти, які використовуються комп'ютерами для комунікування один з одним, і, частково, для надсилання та отримання даних.",
          "Програмісти часто використовують AJAX (Asynchronous JavaScript and XML) при роботі з APIs. AJAX належить до групи технологій, які роблять асинхронні запити до сервера для передачі даних, а потім завантажують будь-які отримані дані до сторінки. І дані, що були передані між браузером і сервером, часто мають формат JSON (JavaScript Object Notation).",
          "Цей курс навчить вас основ роботи з APIs та різними AJAX технологіями в браузері."
        ]
      },
      "data-visualization-projects": {
        "title": "Проєкти візуалізації даних",
        "intro": [
          "Тепер, коли ви дізналися як працювати з D3, APIs та AJAX технологіями, перевірте свої навички за допомогою цього тесту з 5-ма проєктами візуалізації даних.",
          "У цих проєктах вам потрібно буде отримати й проаналізувати набір даних, тоді використати D3 для створення різної візуалізації даних. Завершіть усі проєкти, аби отримати сертифікат з візуалізації даних."
        ]
      },
      "d3-dashboard": {
        "title": "Інформаційна панель D3",
        "intro": [
          "",
          ""
        ]
      }
    }
  },
  "relational-database": {
    "title": "Relational Database (Beta)",
    "intro": [
      "For these courses, you will use real developer tools and software including VS Code, PostgreSQL, and the Linux / Unix command line to complete interactive tutorials and build projects.",
      "These courses start off with basic Bash commands. Using the terminal, you will learn everything from navigating and manipulating a file system, scripting in Bash, all the way to advanced usage.",
      "Next, you will learn how to create and use a relational database with PostgreSQL, a database management system, and SQL, the language of these databases.",
      "Finally, you will learn Git, the version control system, an essential tool of every developer."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "Celestial Bodies Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a database of celestial bodies using PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Number Guessing Game",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will use Bash scripting, PostgreSQL, and Git to create a number guessing game that runs in the terminal and saves user information."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "Periodic Table Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create Bash a script to get information about chemical elements from a periodic table database."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Salon Appointment Scheduler",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create an interactive Bash program that uses PostgreSQL to track the customers and appointments for your salon."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "World Cup Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create a Bash script that enters information from World Cup games into PostgreSQL, then query the database for useful statistics."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Learn Advanced Bash by Building a Kitty Ipsum Translator",
        "intro": [
          "There's more to Bash commands than you might think.",
          "In this 140-lesson course, you will learn some more complex commands, and the details of how commands work."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Learn Bash and SQL by Building a Bike Rental Shop",
        "intro": [
          "In this 210-lesson course, you will build an interactive Bash program that stores rental information for your bike rental shop using PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Learn Bash by Building a Boilerplate",
        "intro": [
          "The terminal allows you to send text commands to your computer that can manipulate the file system, run programs, automate tasks, and much more.",
          "In this 170-lesson course, you will learn terminal commands by creating a website boilerplate using only the command line."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Learn Bash Scripting by Building Five Programs",
        "intro": [
          "Bash scripts combine terminal commands and logic into programs that can execute or automate tasks, and much more.",
          "In this 220-lesson course, you will learn more terminal commands and how to use them within Bash scripts by creating five small programs."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Learn Git by Building an SQL Reference Object",
        "intro": [
          "Git is a version control system that keeps track of all the changes you make to your codebase.",
          "In this 240-lesson course, you will learn how Git keeps track of your code by creating an object containing commonly used SQL commands."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Learn Nano by Building a Castle",
        "intro": [
          "Nano is a program that allows you to edit files right in the terminal.",
          "In this 40-lesson course, you will learn how to edit files in the terminal with Nano while building a castle."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Learn Relational Databases by Building a Mario Database",
        "intro": [
          "A relational database organizes data into tables that are linked together through relationships.",
          "In this 165-lesson course, you will learn the basics of a relational database by creating a PostgreSQL database filled with video game characters."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Learn SQL by Building a Student Database: Part 1",
        "intro": [
          "SQL, or Structured Query Language, is the language for communicating with a relational database.",
          "In this 140-lesson course, you will create a Bash script that uses SQL to enter information about your computer science students into PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Learn SQL by Building a Student Database: Part 2",
        "intro": [
          "SQL join commands are used to combine information from multiple tables in a relational database",
          "In this 140-lesson course, you will complete your student database while diving deeper into SQL commands."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Бекенд розробка та API",
    "intro": [
      "До цього моменту ви використовували JavaScript тільки для фронтенду, аби зробити вебсторінку інтерактивнішою, чи розв'язати завдання з алгоритмами, або створити односторінкові застосунки (SPA). Але JavaScript можна використовувати й в бекенд, або на сервері, для створення цілих вебзастосунків.",
      "Сьогодні один із найпопулярніших способів створення застосунків — це за допомогою мікросервісів, маленьких модульних застосунків, які разом формують єдине ціле.",
      "У курсі \"Бекенд розробка та API\" ви навчитеся писати бекенд програми за допомогою Node.js і npm (Node Package Manager). Також, ви створите вебзастосунок за допомогою фреймворку Express та мікросервіс для пошуку людей (People Finder) за допомогою MongoDB і Mongoose library."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Керування пакетами NPM",
        "intro": [
          "npm (Node Package Manager) — це інструмент командного рядка для встановлення, створення та поширення пакетів JavaScript-коду написаного для Node.js. На npm знаходяться багато пакетів з відкритим вихідним кодом, тому спершу ретельно їх вивчіть, щоб вам не довелося виправляти помилки під час роботи з даними чи отримання даних з API.",
          "У цьому курсі ви вивчите основи використання npm, включаючи роботу із <code>package.json</code> та керування вашими встановленими залежностями."
        ]
      },
      "basic-node-and-express": {
        "title": "Основи Node та Express",
        "intro": [
          "Node.js — це середовище виконання JavaScript, що дозволяє розробникам писати бекенд (серверні) програми в JavaScript. Node.js має кілька вбудованих модулів, — маленьких, незалежних програм — які допомагають з цим. Деякі з основних модулів містять HTTP, який працює на зразок сервера, і файлову систему — модуль для читання і редагування файлів.",
          "В останній групі курсів ви навчилися встановлювати та керувати пакетами npm, які є скупченнями менших модулів. Ці пакети можуть допомогти вам створити більші, складніші застосунки.",
          "Express — це спрощений фреймворк вебзастосунків та один з найбільш популярних пакетів на npm. Express значно полегшує створення сервера та керування маршрутизацією вашого застосунку, яке відповідає за такі речі як перенаправлення людей до потрібної сторінки, коли вони відвідують певну кінцеву точку, таку як <pre>/blog</pre>.",
          "У цьому курсі ви дізнаєтесь основи Node та Express, включаючи те, як створювати сервер, обслуговувати різні файли та обробляти різні запити з браузера."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB і Mongoose",
        "intro": [
          "MongoDB це програма бази даних, яка зберігає JSON документи(чи записи), які ви можете використати у своєму застосунку. На відміну від SQL, іншого типу бази даних, Mongo це нереляційна, або \"NoSQL\" база даних. Це означає, що Mongo зберігає усі збірні дані в межах одного запису, замість того, щоб тримати їх у багатьох попередньо налаштованих таблицях, як у базі даних SQL.",
          "Moongoose це популярний пакет npm, який часто встановлюють разом із Mongo. З Moongoose ви можете використовувати прості об'єкти JavaScript замість JSON, що полегшує роботу із Mongo. Він також дозволяє створити нарис документів під назвою \"схеми\", щоб ви ненароком не зберегли хибний тип даних та потім не спричинили помилок.",
          "На курсах MongoDB та Mongoose, ви вивчите основи роботи із постійними даними, враховуючи налаштування моделі, збереження, видалення та пошук документів у базі даних."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Бекенд розробка та проєкти API",
        "intro": [
          "Раніше ви уже мали справу з API, але тепер, коли ви знайомі із nmp, Node, Express, Mongo DB та Mongoose, прийшов час створити щось власне. Застосуйте усі отримані знання, щоб створити 5 окремих мікросерверів, які є меншими застосунками з обмеженими можливостями.",
          "Створивши їх, ви матимете 5 крутих API мікросерверів, якими можна похвалитися перед друзями, рідними чи потенційними роботодавцями. О, а ще новенька бекенд розробка та сертифікати API."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Забезпечення якості",
    "intro": [
      "Оскільки ваші програми чи вебзастосунки стають складнішими, ви захочете протестувати їх, щоб переконатися, що нові зміни не порушують їх початкових функцій.",
      "У межах сертифікації \"Забезпечення якості\" ви дізнаєтесь, як писати тести з Chai, щоб переконатись, що ваші застосунки працюють так, як ви очікуєте.",
      "Потім ви створите застосунок чату, щоб вивчити розширені концепції Node та Express. Ви також будете використовувати Pug як шаблонізатор, Passport для автентифікації та Socket.io для комунікування в режимі реального часу між сервером та підключеними клієнтами."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Забезпечення якості та тестування з Chai",
        "intro": [
          "Chai - це бібліотека тестування JavaScript, яка допомагає вам переконатись, що ваша програма все ще поводиться так, як ви очікуєте, після внесення змін до коду.",
          "Використовуючи Chai, ви зможете писати тести, які описують ваші програмні вимоги, та бачити чи ваш застосунок відповідає їм.",
          "У цьому курсі ви дізнаєтесь про припущення, глибоку рівність, правдивість, тестування API та інші основи тестування програм JavaScript."
        ]
      },
      "advanced-node-and-express": {
        "title": "Просунутий Node та Express",
        "intro": [
          "Настав час глибоко зануритися у Node.js та Express.js, створивши застосунок чату із системою входу.",
          "Щоб безпечно впровадити систему входу, вам потрібно буде дізнатися про автентифікацію. Це акт перевірки особи або процесу.",
          "У цьому курсі ви дізнаєтесь, як використовувати Passport для управління автентифікацією, Pug для створення шаблонів багаторазового використання для швидкого створення інтерфейсу та веб-сокети для комунікування в реальному часі між клієнтами та сервером."
        ]
      },
      "quality-assurance-projects": {
        "title": "Проєкти забезпечення якості",
        "intro": [
          "Тепер, коли ви добре розбираєтесь у фронт енд та бек енд, настав час застосувати всі навички та концепції, які ви вивчили до цього моменту. Ви створите 5 різних веб-застосунків і напишете тести для кожного, щоб переконатися чи вони працюють і обробляють всі можливі сценарії (edge cases).",
          "Після завершення цих проєктів із забезпечення якості у вас буде ще 5 проєктів, а також нова сертифікація, якою можна похвалитись у портфоліо."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Наукові обчислення за допомогою Python",
    "intro": [
      "Python - одна з найпопулярніших, гнучких мов програмування на сьогодні. Ви можете використовувати її для всього - від базових скриптів до машинного навчання.",
      "У сертифікації про наукові обчислення з Python ви дізнаєтесь основи Python, такі як змінні, цикли, умовні переходи та функції. Тоді ви швидко перейдете до складних структур даних, роботи з мережами, реляційних баз даних та візуалізації даних."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python для всіх",
        "intro": [
          "Python для всіх - це безкоштовна серія відеокурсів, яка вчить основам використання Python 3.",
          "Курси були створені доктором Чарльзом Северансом (також відомим як Dr. Chuck). Він є професором школи інформації університету Мічигану, де викладає різні технологічні курси, включаючи програмування, дизайн баз даних та веброзробку."
        ]
      },
      "scientific-computing-with-python-projects": {
        "title": "Наукові обчислення за допомогою Python проєктів",
        "intro": [
          "Час перевірити свої навички роботи з Python. Завершивши ці проєкти, ви продемонструєте, що володієте хорошими фундаментальними знаннями Python і маєте право на сертифікацію з наукових обчислень з Python."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Аналіз даних за допомогою Python",
    "intro": [
      "Аналіз даних існує вже давно. Але ще кілька років тому розробники практикували його за допомогою дорогих інструментів із закритим кодом, таких як Tableau. Але нещодавно Python, SQL та інші відкриті бібліотеки назавжди змінили аналіз даних.",
      "У сертифікації \"Аналіз даних за допомогою Python\" ви дізнаєтесь про основи аналізу даних за допомогою Python. Наприкінці цієї сертифікації ви будете знати, як читати дані з таких джерел, як CSV та SQL, і як використовувати бібліотеки, такі як Numpy, Pandas, Matplotlib та Seaborn для обробки та візуалізації даних."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Аналіз даних за допомогою Python",
        "intro": [
          "У цих комплексних відеокурсах, створених Сантьяго Басульто, ви дізнаєтесь про весь процес аналізу даних. Ви будете зчитувати дані з різних джерел (CSV, SQL, Excel), обробляти ці дані за допомогою NumPy та Pandas і візуалізувати їх за допомогою Matplotlib та Seaborn,",
          "Крім того, ми включили детальний курс по Jupyter Notebook та короткий довідник з Python, щоб оновити ваші навички програмування."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Вивчіть основи бібліотеки NumPy у наступному відеокурсі, створеному Кейтом Галлі.",
          "У цьому курсі ви дізнаєтесь, як працює NumPy і як він порівнюється із вбудованими списками Python. Ви також дізнаєтесь, як писати код з NumPy, індексувати, змінювати форму, застосовувати статистику та багато іншого."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Проєкт Аналіз даних за допомогою Python",
        "intro": [
          "Існує багато способів аналізу даних за допомогою Python. Завершивши ці проєкти, ви продемонструєте, що володієте хорошими фундаментальними знаннями аналізу даних, використовуючи Python.",
          "Завершіть всі проєкти, щоб отримати сертифікат з аналізу даних, використовуючи Python."
        ]
      }
    }
  },
  "information-security": {
    "title": "Інформаційна безпека",
    "intro": [
      "Завдяки всьому, що ми робимо в Інтернеті, величезна кількість конфіденційної інформації знаходиться в зоні ризику: електронні адреси, паролі, номери телефонів тощо.",
      "Завдяки сертифікації із інформаційної безпеки ви створите безпечний веб-застосунок за допомогою HelmetJS, щоб вивчити основи захисту інформації людей в Інтернеті.",
      "Ви також створите TCP-клієнт, а також Nmap і сканер портів у Python. Це допоможе вам вивчити основи тесту на проникнення — важливого компоненту надійної інформаційної безпеки."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Інформаційна безпека за допомогою HelmetJS",
        "intro": [
          "Цей курс програмування зосереджений на HelmetJS, типі проміжного програмного забезпечення для застосунків на основі Express, яке автоматично встановлює заголовки HTTP. Таким чином, він може запобігти випадковому передаванню конфіденційної інформації між сервером та клієнтом.",
          "Завершення цих курсів допоможе вам зрозуміти, як захистити свій сайт від зловмисної поведінки."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python для тесту на проникнення (penetration testing)",
        "intro": [
          "Ці відеокурси навчать вас тесту на проникнення за допомогою Python. Також відомий як пен тест (pen test), тест на проникнення — це змодельована атака на систему, задля перевірки її на вразливі місця.",
          "У цьому курсі ви дізнаєтеся про сокети, створите TCP сервер та клієнт, створите Nmap сканер і інші інструменти та техніки, які пен тестувальники використовують щоденно."
        ]
      },
      "information-security-projects": {
        "title": "Проєкти інформаційної безпеки",
        "intro": [
          "Настав час перевірити ваші навички з інформаційної безпеки на практиці. Ці проєкти дадуть вам шанс застосувати всі набуті вміння, вивчені правила та поняття з інформаційної безпеки.",
          "Коли ви закінчите, у вас буде достатньо проєктів з інформаційної безпеки за плечима, разом з сертифікатом, який ви зможете показати вашим друзям, сім'ї та роботодавцям."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Машинне навчання з Python",
    "intro": [
      "Машинне навчання має багато практичних застосунків, які ви можете використовувати у своїх проєктах чи роботі.",
      "У сертифікаті \"Машинне навчання з Python\" ви використовуватимете фреймворк TensorFlow, аби створити декілька нейронних мереж і вивчити складніші техніки, такі як обробка природної мови й навчання з підкріпленням.",
      "Також ви зануритеся у нейронні мережі та вивчите правила, за якими працюють глибокі, рекурентні та згорткові нейронні мережі."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "Tensorflow — це фреймворк з відкритим вихідним кодом, що полегшує використання машинного навчання та нейронних мереж.",
          "Наступний відеокурс був створений Тімом Рущіцею, який має сайт \"Tech With Tim\". Він допоможе вам зрозуміти TensorFlow і деякі з його потужних можливостей."
        ]
      },
      "how-neural-networks-work": {
        "title": "Як працюють нейронні мережі",
        "intro": [
          "Нейронні мережі лежать в основі того, що ми зараз називаємо штучним інтелектом. Але їх, як правило, було складно зрозуміти. Особливо початківцям у галузі машинного навчання.",
          "Навіть якщо ви вперше зіштовхуєтеся з нейронними мережами, ці відеокурси Брендона Рорера навчать вас орієнтуватися у їхніх поняттях та підрахунках."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Проєкти машинного навчання з Python",
        "intro": [
          "Машинне навчання може бути дуже корисним. Завершивши ці безплатні складні проєкти з програмування, ви покажете, що маєте базові знання з машинного навчання й отримаєте сертифікат \"Машинне навчання з Python\"."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Підготовка до співбесіди по кодуванню",
    "intro": [
      "Шукаєте безплатні вправи з кодування, щоб підготуватися до наступної співбесіди? Ми уже про це подбали.",
      "Цей розділ містить сотні завдань з програмування, які перевіряють ваші знання алгоритмів, структур даних і математики. Тут також є декілька проєктів, які ви можете використати для зміцнення своїх навичок або просто додати до свого портфоліо."
    ],
    "note": "",
    "blocks": {
      "algorithms": {
        "title": "Алгоритми",
        "intro": [
          "Ці вправи з безоплатного програмування навчать вас загальних алгоритмів, з якими ви скоріш за все зіткнетеся в житті. Це чудова можливість вдосконалити як логіку, так і програмувальні навички.",
          "Подібні алгоритми часто використовують на співбесідах, щоб перевірити навички кандидатів. Ми чітко пояснимо, як саме функціонують різноманітні алгоритми, щоб ви могли підібрати рішення до кожного."
        ]
      },
      "data-structures": {
        "title": "Структура даних",
        "intro": [
          "Ці безплатні курси програмування спрямовані на те, щоб допомогти вам у роботі з численними структурами даних, з якими ви ще не стикалися.",
          "Під час роботи з цими курсами, ви вивчите кожний тип структур даних та реалізуєте алгоритми, щоб зрозуміти їх краще."
        ]
      },
      "take-home-projects": {
        "title": "Проєкти на самостійне опрацювання",
        "intro": [
          "Люди завжди нервують на співбесідах з програмування. Іноді, замість інтерв'ю, кандидатам можуть запропонувати створити проєкт вдома. Співбесіди такого типу часто передбачають виконання великого обсягу роботи, однак якнайкраще показують роботодавцям ваші здібності.",
          "Попрактикуйтеся створювати запропоновані нами проєкти. Не поспішайте, добре над ними попрацюйте та додайте до свого резюме чи портфоліо, щоб вразити потенційних роботодавців."
        ]
      },
      "rosetta-code": {
        "title": "Rosetta Code",
        "intro": [
          "Розвиньте свої навички творчого підходу до розв'язання проблем за допомогою завдань з базової бібліотеки Rosetta Code.",
          "Ці завдання можуть виявитися важкими, але вони підштовхнуть ваше логічне мислення до нових висот."
        ]
      },
      "project-euler": {
        "title": "Проєкт Ейлер",
        "intro": [
          "Зробіть ці завдання з програмування з архівів проєкту Ейлер. Вони удосконалять ваші алгоритмічні та математичні знання.",
          "Тут є завдання різної складності, а для багатьох здобуття досвіду полягає в індуктивному методі навчання. Тобто, вирішення одного завдання прояснить нову концепцію та дозволить вирішити раніше незрозумілу задачу. Чи під силу вам вирішити кожну?"
        ]
      }
    }
  },
  "misc-text": {
    "certification": "{{cert}} сертифікат",
    "browse-other": "Перегляньте інші безплатні сертифікати\n(ми рекомендуємо робити це послідовно)",
    "courses": "Курси",
    "steps": "Кроки",
    "expand": "Expand course",
    "collapse": "Collapse course",
    "legacy-header": "Legacy Courses",
    "legacy-desc": "These courses are no longer part of the certification path, but are still available for you to further your learning.",
    "viewing-upcoming-change": "You are looking at a beta page. ",
    "go-back-to-learn": "Go back to the stable version of the curriculum."
  }
}
