{
  "name": "Gear up for Success",
  "order": 4,
  "time": "20 minutes",
  "challenges": [
    {
      "id": "560add65cb82ac38a17513c2",
      "title": "Browse Camper News",
      "description": [
        [
          "http://i.imgur.com/YNwsMXM.gif",
          "A gif showing how you can access our Camper News page and click the \"upvote\" button to upvote a story.",
          "Click the \"News\" button in your upper right hand corner. <br>You can browse links on Camper News and upvote the ones that you enjoy.",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "nameEs": "Navega por las Noticias Campistas",
      "descriptionEs": [
        [
          "http://i.imgur.com/YNwsMXM.gif",
          "Un gif mostrando como acceder a nuestra página de Noticias Campistas y pulsar el botón \"voto a favor\" para votar por una historia.",
          "Pulsa el botón de \"Noticias\" en tu esquina superior derecha. <br>Puedes navegar mediante los enlaces en Noticias Campistas y votar por aquellas que disfrutes.",
          ""
        ]
      ]
    },
    {
      "id": "560add65cb82ac38a17513c1",
      "title": "Reference our Wiki",
      "description": [
        [
          "http://i.imgur.com/4GO4zcI.gif",
          "A gif showing how you can click the \"Wiki\" button in your upper-right corner to access the wiki.",
          "Click the \"Wiki\" button in your upper right hand corner. <br>Our community has contributed lots of useful information to this searchable wiki.",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "nameEs": "Referencía nuestra Wiki",
      "descriptionEs": [
        [
          "http://i.imgur.com/4GO4zcI.gif",
          "Un gif mostrando como puedes pulsar el botón de \"Wiki\" en tu esquina superior derecha para acceder a la wiki.",
          "Pulsa el botón de \"Wiki\" en tu esquina superior derecha. <br>Nuestra comunidad ha contribuido información bastante útil en esta wiki.",
          ""
        ]
      ]
    },
    {
      "id": "570add8ccb82ac38a17513c3",
      "title": "Join our LinkedIn Alumni Network",
      "description": [
        [
          "http://i.imgur.com/vJyiXzU.gif",
          "A gif showing how you can click the link below and fill in the necessary fields to add your Free Code Camp studies to your LinkedIn profile.",
          "LinkedIn recognizes Free Code Camp as a university. You can gain access to our large alumni network by adding Free Code Camp to your LinkedIn profile's education section. <br>Set your graduation date as next year. <br>For \"Degree\", type \"Full Stack Web Development Certification\". <br>For \"Field of study\", type \"Computer Software Engineering\". <br>Then click \"Save Changes\".",
          "https://www.linkedin.com/profile/edit-education?school=Free+Code+Camp"
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "nameEs": "Únete a nuestra red de alumnos en LinkedIn",
      "descriptionEs": [
        [
          "http://i.imgur.com/vJyiXzU.gif",
          "Un gif mostrando como puedes pulsar el enlace que está más adelante y llenar todos los campos necesarios para agregar los estudios de Free Code Camp a tu perfil de LinkedIn",
          "LinkedIn reconoce a Free Code Camp como una universidad. Puedes obtener acceso a nuestra larga red de alumnos agregando Free Code Camp a la sección de educación de tu LinkedIn. <br>Define tu fecha de graduación para el siguiente año. <br> En el campo \"Grado\", escribe \"Certificación de Desarrollo Web Full Stack\". <br> En \"Campo de estudio\", escribe \"Ingeniería de Software\". <br>Después pulsa \"Guardar Cambios\".",
          "https://www.linkedin.com/profile/edit-education?school=Free+Code+Camp"
        ]
      ]
    },
    {
      "id": "560add8ccb81ac38a17513c4",
      "title": "Commit to a Goal and a Nonprofit",
      "description": [
        [
          "http://i.imgur.com/Og1ifsn.gif",
          "A gif showing how you can commit to a goal for your Free Code Camp studies and pledge a monthly donation to a nonprofit to give you external motivation to reach that goal.",
          "You can set a goal and pledge to donate to a nonprofit each month until you achieve that goal. <br>This will give you external motivation in your quest to learn to code, as well as an opportunity to help nonprofits right away. <br>Choose your goal, then choose a monthly donation. When you click \"commit\", the nonprofit's donation page will open in a new tab. <br>This is completely optional, and you can change your commitment or stop it at any time.",
          "/commit"
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "nameEs": "Comprométete con una meta y con una organización sin fines de lucro",
      "descriptionEs": [
        [
          "http://i.imgur.com/Og1ifsn.gif",
          "Un gif mostrando como te puedes comprometer con una meta para tus estudios de Free Code Camp y prometer una donación mensual a una organización sin fines de lucro para darte motivación externa de alcanzar esa meta.",
          "Puedes poner una meta y prometer donar mensualmente a una organización sin fines de lucro hasta que alcances tu meta. <br>Esto te dará motivación externa en tu aventura de aprender a programar, así como una oportunidad para ayudar inmediatamente a organizaciones sin fines de lucro. <br>Elige tu meta, después elige tu donativo mensual. Cuando pulses en \"comprometerse\", la página de donación de la organización sin fines de lucro se abrirá en una nueva pestaña. <br>Esto es completamente opcional, y puedes cambiar tu compromiso o detenerlo en cualquier momento.",
          "/comprometerse"
        ]
      ]
    }
  ]
}
