{
  "responsive-web-design": {
    "title": "Desafíos de Diseño Web Responsivo de Legacy",
    "intro": [
      "En esta Certificación de Diseño Web Adaptativo, aprenderás los lenguajes que los desarrolladores utilizan para construir páginas web: HTML (lenguaje de marcado de hipertexto) para el contenido, y CSS (Hojas de estilo en cascada) para el diseño.",
      "Primero, crearás una aplicación de fotos de gatos para aprender los conceptos básicos de HTML y CSS. Más adelante, aprenderá técnicas modernas como variables CSS mediante la construcción de un pingüino, y las mejores prácticas para la accesibilidad mediante la construcción de un formulario web.",
      "Finalmente, aprenderás cómo hacer páginas web que respondan a diferentes tamaños de pantalla construyendo una tarjeta de Twitter con Flexbox, y un diseño complejo de blog con CSS Grid."
    ],
    "note": "Nota: Algunas extensiones del navegador, como bloqueadores de anuncios o extensiones de modo oscuro pueden interferir con las pruebas. Si tienes algun problema, te recomendamos deshabilitar las extensiones que modifiquen el contenido de la página, mientras tomas el curso."
  },
  "2022/responsive-web-design": {
    "title": "Diseño Web Responsivo",
    "intro": [
      "En esta certificación de Diseño Web Adaptativo, aprenderás los lenguajes que los desarrolladores usan para construir páginas web: HTML (Lenguaje de Marcado de Hipertexto) para el contenido, y CSS (hojas de estilo en cascada) para el diseño.",
      "Primero, crearás una aplicación de fotos de gatos para aprender los conceptos básicos de HTML y CSS. Más adelante, aprenderás técnicas modernas como variables CSS, mediante la construcción de un pingüino, y las mejores prácticas para la accesibilidad mediante la construcción de un sitio de cuestionarios.",
      "Por último, aprenderás cómo hacer páginas web que respondan a diferentes tamaños de pantalla, mediante la construcción de una galería de fotos con Flexbox, y un diseño de artículos de revista con CSS Grid."
    ],
    "note": "Nota: Algunas extensiones del navegador, como bloqueadores de anuncios o extensiones de modo oscuro pueden interferir con las pruebas. Si tienes algun problema, te recomendamos deshabilitar las extensiones que modifiquen el contenido de la página, mientras tomas el curso."
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Algortimos JavaScript y Estructuras de Datos",
    "intro": [
      "Mientras HTML y CSS controlan el contenido y el estilo de una página, JavaScript se utiliza para hacerlo interactivo. En la certificación Algoritmos de JavaScript y Estructuras de Datos, aprenderás los fundamentos de JavaScript incluyendo variables, arreglos, objetos, bucles y funciones.",
      "Una vez que tengas los fundamentos, aplicarás ese conocimiento creando algoritmos para manipular cadenas, factorizar números e incluso calcular la órbita de la Estación Espacial Internacional.",
      "A lo largo del camino, también aprenderás dos estilos o paradigmas importantes de programación: la Programación Orientada a Objetos (OOP), y la Programación Funcional (FP)."
    ],
    "note": "Nota: Algunas extensiones del navegador, como bloqueadores de anuncios o bloqueadores de scripts pueden interferir con las pruebas. Si se te presentan problemas, te recomendamos deshabilitar las extensiones que modifiquen o bloqueen el contenido de la página, mientras tomas el curso."
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "Algoritmos y estructuras de datos de JavaScript",
    "intro": [
      "Los desarrolladores usan HTML y CSS para controlar el contenido y estilo de una página. También usan JavaScript para hacer interactiva la página.",
      "En esta certificación de Algoritmos de JavaScript y Estructura de Datos, aprenderas los fundamentos de JavaScript, como variables, arreglos, objetos, bucles, funciones, DOM y mucho más.",
      "También aprenderás sobre Programación Orientada a Objetos (POO), Programación Funcional, pensamiento algorítmico, cómo trabajar con el almacenamiento local y cómo extraer datos usando una API."
    ],
    "note": "Nota: Algunas extensiones de tu navegador, como bloqueadores de ventanas y bloqueadores de comandos pueden interferir con los ejercicios. Si tienes problemas, te recomendamos deshabilitar las extensiones que modifican o bloquean el contenido de las páginas mientras estés tomando el curso."
  },
  "front-end-development-libraries": {
    "title": "Librerías de desarrollo de la interfaz",
    "intro": [
      "Ahora que estás familiarizado con HTML, CSS y JavaScript, mejora tus habilidades aprendiendo algunas de las librerías de interfaz más populares en la industria.",
      "En la certificación de bibliotecas de desarrollo front-end, aprenderá cómo diseñar su sitio rápidamente con Bootstrap. También aprenderá cómo agregar lógica a sus estilos CSS y extenderlos con Sass.",
      "Después, construirás un carrito de compras y otras aplicaciones para aprender a crear poderosas aplicaciones de página única (SPAs) con React y Redux."
    ],
    "note": ""
  },
  "data-visualization": {
    "title": "Visualización de Datos",
    "intro": [
      "Los datos están a nuestro alrededor, pero no significan mucho si no tienen forma o contexto.",
      "En la certificación Visualización de Datos, construirás diagramas, gráficos, y mapas para presentar diferentes tipos de datos utilizando la biblioteca D3.js.",
      "También aprenderás acerca de JSON (JavaScript Object Notation), y cómo trabajar con datos en línea usando un API (Application Programing Interface)."
    ],
    "note": ""
  },
  "relational-database": {
    "title": "Base de datos Relacionales",
    "intro": [
      "Para estos cursos, usarás herramientas reales de desarrollador y software incluyendo código VS, PostgreSQL, y la línea de comandos Linux / Unix para completar tutoriales interactivos y construir proyectos.",
      "Estos cursos empiezan con comandos básicos de Base. Utilizando la terminal, aprenderá todo, desde navegar y manipular un sistema de archivos, programar en Bash, hasta el uso avanzado.",
      "A continuación, aprenderá cómo crear y utilizar una base de datos relacional con PostgreSQL, un sistema de gestión de bases de datos, y SQL, el idioma de estas bases de datos.",
      "Por ultimo, aprenderás Git, el sistema de control de version, una herramienta esencial de cada desarrollador."
    ]
  },
  "back-end-development-and-apis": {
    "title": "Desarrollo Back End y APIs",
    "intro": [
      "Hasta este punto, solo has usado JavaScript en la parte de front-end para agregar interactividad a una página, resolver los desafíos de algoritmos o construir un SPA. Pero JavaScript también se puede utilizar en el back-end, o servidor, para construir aplicaciones web completas.",
      "Hoy en día, una de las formas populares para construir aplicaciones es a través de microservicios, que son pequeñas aplicaciones modulares que trabajan juntas para formar una aplicación más grande.",
      "En la Certificación Desarrollo de Back End y APIs, aprenderás cómo escribir aplicaciones de back-end con Node.js y npm (Node Package Manager). También construirás aplicaciones web con el framework Express, y un microservicio \"People Finder\" con MongoDB y la biblioteca Mongoose."
    ],
    "note": ""
  },
  "quality-assurance": {
    "title": "Control de Calidad",
    "intro": [
      "A medida que tus programas o aplicaciones web se vuelven más complejos, querrás probarlos para asegurarte de que los nuevos cambios no rompan su funcionalidad original.",
      "En la certificación de control de calidad, aprenderás a escribir pruebas con Chai para asegurarte de que tus aplicaciones funcionan como esperas.",
      "Luego construirás una aplicación de chat para aprender conceptos avanzados de Node y Express. También usarás Pug como motor de plantillas, Passport para autenticación y Socket.io para la comunicación en tiempo real entre el servidor y los clientes conectados."
    ],
    "note": ""
  },
  "scientific-computing-with-python": {
    "title": "Computación científica con Python",
    "intro": [
      "El programa de computación científica con Python te brindará las habilidades para analizar y manipular datos utilizando Python, un lenguaje de programación potente y versátil. Aprenderás conceptos clave como estructuras de datos, algoritmos, programación orientada a objetos y cómo realizar cálculos complejos utilizando una variedad de herramientas.",
      "Este curso guia te guiará hacia los fundamentos de la computación cientifica, incluyendo las estructuras de datos y algoritmos."
    ],
    "note": ""
  },
  "data-analysis-with-python": {
    "title": "Análisis de Datos con Python",
    "intro": [
      "El análisis de datos ha existido durante mucho tiempo. Pero hasta hace apenas pocos años, los desarrolladores lo practicaban utilizando herramientas costosas de código cerrado como Tableau. Sin embargo recientemente, Python, SQL y otras librerías abiertas han cambiado el Análisis de Datos para siempre.",
      "En la Certificación de Análisis de Datos con Python, aprenderás los fundamentos del análisis de datos con Python. Al terminar la certificación, sabrás como leer datos de fuentes como CSV y SQL, y como usar librerías tales como Numpy, Pandas, Matplotlib y Seaborn para procesar y visualizar datos."
    ],
    "note": ""
  },
  "information-security": {
    "title": "Seguridad de la Información",
    "intro": [
      "Con todo lo que hacemos en línea, hay una gran cantidad de información sensible en riesgo: direcciones de correo electrónico, contraseñas, números de teléfono y mucho más.",
      "Con la Certificación de Seguridad de Información, construirás aplicaciones web seguras con HelmetJS para aprender los fundamentos de la protección de la información en línea de la gente.",
      "También construirás un cliente TCP, y un escáner de puertos y Nmap con Python. Esto te ayudará a aprender los fundamentos de las pruebas de penetración - un componente importante para la buena seguridad de la información."
    ],
    "note": ""
  },
  "machine-learning-with-python": {
    "title": "Aprendizaje Automático con Python",
    "intro": [
      "Machine learning tiene muchas aplicaciones prácticas que puedes utilizar en tus proyectos o en tu trabajo.",
      "En la certificación de Machine Learning con Python, usarás el framework TensorFlow para construir varias redes neuronales y explorar técnicas más avanzadas como: el procesamiento de lenguaje natural y el aprendizaje por refuerzo.",
      "También te sumergirás en redes neuronales y aprenderás los principios detrás de cómo funcionan las redes neuronales profundas, recurrentes y convolucionales."
    ],
    "note": ""
  },
  "college-algebra-with-python": {
    "title": "Algebra universitaria con Python",
    "intro": [
      "Este curso está diseñado como un semestre de academia. Consiste de videos intructivos, con Google Colaboratory para seguir interactivamente, asignaturas y proyectos competitivos.",
      "A medida que pasas por cada parte de este curso en secuencia, ganarás una comprensión completa de Álgebra y cómo escribir código de Python para resolver problemas de Álgebra.",
      "A lo largo de este curso, también construirá su propio Algebra Colab que podrá utilizar como su calculadora personalizada. Este curso (y el código que escribas aquí) te dará la base para una comprensión más profunda de matemáticas y ciencias de datos."
    ],
    "note": ""
  },
  "python-for-everybody": {
    "title": "Python Heredado para Todos",
    "intro": [
      "Python es uno de los mas populares, y flexible lenguajes de programación hoy en día. Tu puedes usar este para cualquier secuencia de comandos básica en aprendizaje automático."
    ],
    "note": ""
  },
  "coding-interview-prep": {
    "title": "Preparación de Entrevistas de Programación",
    "intro": [
      "Si está buscando ejercicios gratuitos de programación para prepararse para tu próxima entrevista de trabajo, aquí los tenemos.",
      "Esta sección contiene docenas de desafíos de codificación que ponen a prueba tus conocimientos de algoritmos, estructuras de datos y matemáticas. También incluye una serie de proyectos para llevar a casa que puedes utilizar para fortalecer tus habilidades o agregar a tu portafolio.",
      "Este trabajo incorpora material de <a href=\"https://www.wikipedia.org/\" target=\"_blank\">Wikipedia</a>, que se encuentra bajo la licencia <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\" target=\"_blank\">Creative Commons Attribution-ShareAlike License \"4,0\"</a>. El contenido original puede haber sido modificado y adaptado. Para ver la versión inalterada y obtener más detalles, consulte la página original en <a href=\"https://www.wikipedia.org/\" target\"_blank\">Wikipedia</a>."
    ]
  },
  "the-odin-project": {
    "title": "El Proyecto Odin: Remix de freeCodeCamp",
    "intro": [
      "El Proyecto Odin fue creado en 2013 por un solitario desarrollador, Erik Trautman. A través de los años, ha surgido una comunidad de código abierto para mantener y ampliar el proyecto.",
      "freeCodeCamp ha ampliado el plan de estudios para el código abierto y hacer que se ejecute de forma interactiva en el navegador, con pruebas para evaluar tu código y garantizar que hayas comprendido los conceptos clave.",
      "Si tu quieres la experiencia original de toda la configuración del Proyecto Odin para ejecutarlo dentro de tu computadora local, tu puedes verificar el Proyecto Odin original en <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>sitio web del Proyecto Odin</a>. Un abrazo gracias a la comunidad de El Proyecto Odin por continuar este valioso recurso de aprendizaje para desarrolladores alrededor de todo el mundo.",
      "This course is unofficial, and not endorsed by The Odin Project. Changes to The Odin Project curriculum content have been made, and all instructional material for this course is licensed under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; El Proyecto Odin</a>",
      "This course includes content from <a href='https://javascript.info/' target='_blank' rel='noopener noreferrer nofollow'>JavaScript.info</a>, which is licensed under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>."
    ]
  },
  "project-euler": {
    "title": "Proyecto Euler",
    "intro": [
      "Completa los siguientes desafíos de programación de los masivos archivos del Project Euler. Estos fortalecerán tus conocimientos de algoritmos y matemáticas.",
      "Estos problemas varían en dificultad y, para muchos, la experiencia es el aprendizaje inductivo en cadena. Es decir, resolviendo un problema, le expondrá a un nuevo concepto que le permitirá emprender un problema previamente inaccesible. ¿Pueden terminar todos?"
    ]
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "Free Foundational C# with Microsoft Certification",
    "intro": [
      "Este curso ofrece una introducción completa a la programación en C#, abarcando sus conceptos básicos, sintaxis y aplicación práctica en el desarrollo de software.",
      "A través de ejercicios prácticos y proyectos, aprenderá los fundamentos de C#, incluyendo variables, tipos de datos, estructuras de control y principios de programación orientados a objetos.",
      "Al terminar este curso, habras ganado las habilidades prácticas y el conocimiento necesario para construir aplicaciones en C# con confianza."
    ],
    "note": "Cada sección de abajo tiene un trofeo asociado con él que debes ganar en la plataforma Microsoft Learn. Después de ganar cada trofeo, necesitas verificarlos en freeCodeCamp. Una vez que los hayas hecho, puedes calificar para el examen de certificación."
  },
  "a2-english-for-developers": {
    "title": "A2 English for Developers (Beta) Certification",
    "intro": [
      "En este plan de estudios de inglés para desarrolladores, aprenderá los conceptos básicos de la comunicación en inglés. Esto seguirá el nivel A2 del Marco Común Europeo de Referencia (MCER). Y nos hemos centrado en vocabulario que es particularmente útil para los desarrolladores.",
      "La primera mitad del plan de estudios te ayudará a sentirte cómodo con la gramática y el uso del inglés. Te brindará toneladas de práctica en tus manos. Aprenderá conceptos básicos de como presentarse, entablar una pequeña charla y discutir sobre tu trabajo.",
      "En la segunda mitad, practicarás vocabulario específico para el desarrollo de software. Aprenderás a describir código, discutir tendencias tecnológicas y participar en reuniones de pie.",
      "Todo este plan de estudios de nivel A2 incluye 105 diálogos diferentes. Cada uno está diseñado para desarrollar su vocabulario y aumentar su confianza al hablar en un entorno tecnológico profesional."
    ]
  },
  "b1-english-for-developers": {
    "title": "B1 English for Developers (Beta) Certification",
    "intro": [
      "En este programa de inglés para desarrolladores, aprenderás los conceptos básicos de la comunicación en inglés. Seguirás el nivel B1 del Marco Común Europeo de Referencia (MCER). Y nos hemos centrado en el vocabulario que resulta especialmente útil para los desarrolladores.",
      "Te ayudará a fortalecer tus habilidades básicas mientras introduces gramática y usos más complejos. Aprenderás a describir lugares y cosas, compartir experiencias pasadas y usar con confianza tiempos verbales como presente perfecto y futuro. También se incluyen estrategias prácticas de comunicación, como gestionar conversaciones, expresar opiniones y generar acuerdos o desacuerdos en discusiones.",
      "También te concentrarás en aplicar estas habilidades en entornos profesionales y técnicos. Practicarás vocabulario y frases esenciales para los desarrolladores, como describir códigos, participar en reuniones de pie y analizar tendencias tecnológicas. Los temas avanzados incluyen condicionales, estructuras comparativas y gestión de conversaciones, para que puedas prepararte para interacciones del mundo real en la industria tecnológica.",
      "Este programa completo de nivel B1 incluye 73 diálogos diferentes. Cada uno está diseñado para ampliar tu vocabulario y aumentar tu confianza al hablar en un entorno tecnológico profesional."
    ]
  },
  "rosetta-code": {
    "title": "Código Roseta",
    "intro": [
      "Sube de nivel tus habilidades de resolucion de problemas con estas tareas de programación gratuitas desde la clasica libreria de Codigo Roseta.",
      "Estos desafíos pueden resultar difíciles, pero ellos empujarán tu lógica de algoritmos a nuevas alturas.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Attribute: Código Roseta</a>"
    ]
  },
  "full-stack-developer": {
    "title": "Plan de estudio de desarrollador certificado Full Stack",
    "intro": [
      "Este curso ofrece un camino integral para convertirse en un desarrollador Full Stack certificado, cubriendo todas las tecnologías esenciales necesarias para crear aplicaciones web modernas y escalables de principio a fin.",
      "A través de una combinación de lecciones interactivas, ejercicios de codificación y proyectos del mundo real, dominarás el desarrollo frontend y backend. Trabajarás con HTML, CSS y JavaScript para crear interfaces de usuario responsivas, explorarás React y TypeScript para aplicaciones web avanzadas y aprenderás a administrar datos con bases de datos relacionales. Y en el backend, usarás Git, Npm, Node.js y Python para crear soluciones potentes del lado del servidor.",
      "Al finalizar este curso, tendrás las habilidades prácticas y la experiencia para desarrollar con confianza aplicaciones web completas, preparándote para una carrera exitosa como desarrollador Full Stack.",
      "This certification will take you a substantial amount of time and effort to complete. If you start now, you may be ready to start the remaining material and final exam when we launch it in the coming months."
    ],
    "chapters": {
      "html": "HTML",
      "css": "CSS",
      "javascript": "JavaScript",
      "frontend-libraries": "Librerias Front End",
      "relational-databases": "Bases de datos relacionales",
      "backend-javascript": "JavaScript de back-end",
      "python": "Python",
      "career": "Career"
    },
    "modules": {
      "basic-html": "HTML básico",
      "semantic-html": "Semántica de HTML",
      "html-forms-and-tables": "Formularios y tablas",
      "html-and-accessibility": "Accesibilidad",
      "review-html": "Revisión de HTML",
      "exam-html": "Examen de HTML",
      "computer-basics": "Conceptos básicos de informática",
      "basic-css": "CSS básico",
      "design-for-developers": "Diseño",
      "absolute-and-relative-units": "Unidades absolutas y relativas",
      "pseudo-classes-and-elements": "Pseudoclases y elementos",
      "css-colors": "Colores",
      "styling-forms": "Formas de estilo",
      "css-box-model": "El modelo de caja",
      "css-flexbox": "Flexbox",
      "css-typography": "Typography",
      "css-and-accessibility": "Accessibility",
      "attribute-selectors": "Attribute Selectors",
      "css-positioning": "Positioning",
      "responsive-design": "Responsive Design",
      "css-variables": "Variables",
      "css-grid": "Grid",
      "css-animations": "Animations",
      "review-css": "CSS Review",
      "exam-css": "CSS Exam",
      "code-editors": "Code Editors",
      "javascript-variables-and-strings": "Variables and Strings",
      "javascript-booleans-and-numbers": "Booleans and Numbers",
      "javascript-functions": "Functions",
      "javascript-arrays": "Arrays",
      "javascript-objects": "Objects",
      "javascript-loops": "Loops",
      "review-javascript-fundamentals": "JavaScript Fundamentals Review",
      "higher-order-functions-and-callbacks": "Higher Order Functions and Callbacks",
      "dom-manipulation-and-events": "DOM Manipulation and Events",
      "js-a11y": "JavaScript and Accessibility",
      "debugging-javascript": "Debugging",
      "basic-regex": "Basic Regex",
      "form-validation": "Form Validation",
      "javascript-dates": "Dates",
      "audio-and-video-events": "Audio and Video Events",
      "maps-and-sets": "Maps and Sets",
      "localstorage-and-crud-operations": "localStorage and CRUD Operations",
      "classes-and-the-this-keyword": "Classes",
      "recursion": "Recursion",
      "functional-programming": "Functional Programming",
      "asynchronous-javascript": "Asynchronous JavaScript",
      "review-javascript": "JavaScript Review",
      "exam-javascript": "JavaScript Exam",
      "react-fundamentals": "React Fundamentals",
      "react-state-hooks-and-routing": "React State, Hooks, and Routing",
      "performance": "Performance",
      "testing": "Testing",
      "css-libraries-and-frameworks": "CSS Libraries and Frameworks",
      "data-visualization": "Data Visualization and D3",
      "typescript-fundamentals": "TypeScript Fundamentals",
      "review-front-end-libraries": "Front End Libraries Review",
      "exam-front-end-libraries": "Front End Libraries Exam",
      "python-basics": "Python Basics",
      "python-loops-and-sequences": "Loops and Sequences",
      "python-dictionaries-and-sets": "Dictionaries and Sets",
      "python-error-handling": "Error Handling",
      "python-classes-and-objects": "Classes and Objects",
      "python-object-oriented-programming": "Object-Oriented Programming (OOP)",
      "python-linear-data-structures": "Linear Data Structures",
      "python-algorithms": "Algorithms",
      "python-graphs-and-trees": "Graphs and Trees",
      "python-dynamic-programming": "Dynamic Programming",
      "review-python": "Python Review",
      "exam-python": "Python Exam",
      "bash-fundamentals": "Bash Fundamentals",
      "sql-and-postgresql": "SQL and PostgreSQL",
      "bash-scripting": "Bash Scripting",
      "sql-and-bash": "SQL and Bash",
      "git": "Git",
      "review-relational-databases": "Relational Databases Review",
      "exam-relational-databases": "Relational Databases Exam",
      "introduction-to-nodejs": "Introduction to Node.js",
      "nodejs-core-libraries": "Node.js Core Libraries",
      "node-package-manager": "Node Package Manager",
      "http-and-the-web-standards-model": "HTTP and the Web Standards Model",
      "rest-api-and-web-services": "REST API and Web Services",
      "introduction-to-express": "Introduction to Express",
      "express-middleware": "Express Middleware",
      "error-handling-in-express": "Error Handling in Express",
      "websockets": "WebSockets",
      "node-and-sql": "Node and SQL",
      "security-and-privacy": "Security and Privacy",
      "authentication": "Authentication",
      "tooling-and-deployment": "Tooling and Deployment",
      "how-to-get-a-developer-job": "How to Get a Developer Job",
      "capstone-project": "Capstone Project",
      "certified-full-stack-developer-exam": "Certified Full Stack Developer Exam"
    },
    "module-intros": {
      "data-visualization": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will be introduced to data visualization and learn how to work with the D3 library."
        ]
      },
      "typescript-fundamentals": {
        "note": "Coming Fall 2025",
        "intro": [
          "In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz."
        ]
      },
      "python-classes-and-objects": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-object-oriented-programming": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-linear-data-structures": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-algorithms": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-graphs-and-trees": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-dynamic-programming": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge."
        ]
      },
      "bash-fundamentals": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge."
        ]
      },
      "sql-and-postgresql": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "bash-scripting": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz."
        ]
      },
      "sql-and-bash": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz."
        ]
      },
      "git": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz."
        ]
      },
      "introduction-to-nodejs": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz."
        ]
      },
      "nodejs-core-libraries": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz."
        ]
      },
      "node-package-manager": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz."
        ]
      },
      "http-and-the-web-standards-model": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz."
        ]
      },
      "rest-api-and-web-services": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge."
        ]
      },
      "introduction-to-express": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz."
        ]
      },
      "express-middleware": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz."
        ]
      },
      "error-handling-in-express": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz."
        ]
      },
      "websockets": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz."
        ]
      },
      "node-and-sql": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge."
        ]
      },
      "security-and-privacy": {
        "note": "Coming Fall 2025",
        "intro": [
          "In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge."
        ]
      },
      "authentication": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz."
        ]
      },
      "tooling-and-deployment": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge."
        ]
      },
      "how-to-get-a-developer-job": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more."
        ]
      },
      "capstone-project": {
        "note": "Coming Late 2026",
        "intro": [
          "This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification."
        ]
      },
      "certified-full-stack-developer-exam": {
        "note": "Coming Late 2026",
        "intro": [
          "This will be a 90 question exam testing what you have learned throughout this certification."
        ]
      }
    }
  },
  "javascript-v9": {
    "title": "JavaScript Certification",
    "intro": [
      "This course teaches you core JavaScript programming concepts such as working with variables, functions, objects, arrays, and control flow. You'll also learn how to manipulate the DOM, handle events, and apply techniques like asynchronous programming, functional programming, and accessibility best practices.",
      "To qualify for the exam, you must complete the following projects:",
      "- Build a Markdown to HTML Converter",
      "- Build a Drum Machine",
      "- Build a Voting System",
      "- Build a Bank Account Management Program",
      "- Build a Weather App",
      "Pass the exam to earn your JavaScript Certification."
    ],
    "chapters": {
      "javascript": "JavaScript"
    },
    "modules": {
      "javascript-variables-and-strings": "Variables and Strings",
      "javascript-booleans-and-numbers": "Booleans and Numbers",
      "javascript-functions": "Functions",
      "javascript-arrays": "Arrays",
      "javascript-objects": "Objects",
      "javascript-loops": "Loops",
      "review-javascript-fundamentals": "JavaScript Fundamentals Review",
      "higher-order-functions-and-callbacks": "Higher Order Functions and Callbacks",
      "dom-manipulation-and-events": "DOM Manipulation and Events",
      "js-a11y": "JavaScript and Accessibility",
      "debugging-javascript": "Debugging",
      "basic-regex": "Basic Regex",
      "lab-markdown-to-html-converter": "Build a Markdown to HTML Converter",
      "form-validation": "Form Validation",
      "javascript-dates": "Dates",
      "audio-and-video-events": "Audio and Video Events",
      "lab-drum-machine": "Build a Drum Machine",
      "maps-and-sets": "Maps and Sets",
      "lab-voting-system": "Build a Voting System",
      "localstorage-and-crud-operations": "localStorage and CRUD Operations",
      "classes-and-the-this-keyword": "Classes",
      "lab-bank-account-manager": "Build a Bank Account Management Program",
      "recursion": "Recursion",
      "functional-programming": "Functional Programming",
      "asynchronous-javascript": "Asynchronous JavaScript",
      "lab-weather-app": "Build a Weather App",
      "review-javascript": "JavaScript Review",
      "javascript-certification-exam": "JavaScript Certification Exam"
    }
  },
  "front-end-development-libraries-v9": {
    "title": "Front End Development Libraries Certification",
    "intro": [
      "This course teaches you the libraries that developers use to build webpages: React, TypeScript, and more.",
      "To earn your Front End Development Libraries Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Front End Development Libraries Certification exam."
    ],
    "chapters": {
      "front-end-development-libraries": "Front End Development Libraries"
    },
    "modules": {
      "front-end-development-libraries-certification-exam": "Front End Development Libraries Certification Exam"
    }
  },
  "python-v9": {
    "title": "Python Certification",
    "intro": [
      "This course teaches you the fundamentals of Python programming.",
      "To earn your Python Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Python Certification exam."
    ],
    "chapters": {
      "python": "Python"
    },
    "modules": {
      "python-certification-exam": "Python Certification Exam"
    }
  },
  "relational-databases-v9": {
    "title": "Relational Databases Certification",
    "intro": [
      "This course teaches you the fundamentals of relational databases.",
      "To earn your Relational Databases Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Relational Databases Certification exam."
    ],
    "chapters": {
      "relational-databases": "Relational Databases"
    },
    "modules": {
      "relational-databases-certification-exam": "Relational Databases Certification Exam"
    }
  },
  "back-end-development-and-apis-v9": {
    "title": "Back End Development and APIs Certification",
    "intro": [
      "This course teaches you the fundamentals of back end development and APIs.",
      "To earn your Back End Development and APIs Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Back End Development and APIs Certification exam."
    ],
    "chapters": {
      "back-end-development-and-apis": "Back End Development and APIs"
    },
    "modules": {
      "back-end-development-and-apis-certification-exam": "Back End Development and APIs Certification Exam"
    }
  },
  "a1-professional-spanish": {
    "title": "A1 Professional Spanish Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"],
    "chapters": {
      "es-a1-chapter-welcome-to-a1-professional-spanish": "Welcome to A1 Professional Spanish",
      "es-a1-chapter-letters-and-sounds": "Letters and Sounds",
      "es-a1-chapter-greetings-and-introductions": "Greetings and Introductions"
    },
    "modules": {
      "es-a1-module-introduction-and-certification-overview": "Introduction and Certification Overview",
      "es-a1-module-alphabet-accents-and-punctuation": "Alphabet, Accents, and Punctuation",
      "es-a1-module-greetings-and-farewells": "Greetings and Farewells",
      "es-a1-module-introducing-yourself": "Introducing Yourself",
      "es-a1-module-first-questions": "First Questions"
    },
    "module-intros": {
      "es-a1-module-introduction-and-certification-overview": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-alphabet-accents-and-punctuation": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-greetings-and-farewells": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-introducing-yourself": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-first-questions": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      }
    }
  },
  "responsive-web-design-v9": {
    "title": "Responsive Web Design Certification",
    "intro": [
      "This course teaches the fundamentals of HTML and CSS, including modern layout, design, accessibility, and responsive web development. You'll build practical projects and gain the skills to create professional, user-friendly webpages.",
      "To qualify for the exam, you must complete the following projects:",
      "- Build a Survey Form",
      "- Build a Page of Playing Cards",
      "- Build a Book Inventory App",
      "- Build a Technical Documentation Page",
      "- Build a Product Landing Page",
      "Pass the exam to earn your Responsive Web Design Certification."
    ],
    "chapters": {
      "html": "HTML",
      "css": "CSS",
      "responsive-web-design-certification-exam": "Responsive Web Design Certification Exam"
    },
    "modules": {
      "basic-html": "Basic HTML",
      "semantic-html": "Semantic HTML",
      "html-forms-and-tables": "Forms and Tables",
      "html-and-accessibility": "Accessibility",
      "review-html": "HTML Review",
      "computer-basics": "Computer Basics",
      "basic-css": "Basic CSS",
      "design-for-developers": "Design",
      "absolute-and-relative-units": "Absolute and Relative Units",
      "pseudo-classes-and-elements": "Pseudo Classes and Elements",
      "css-colors": "Colors",
      "styling-forms": "Styling Forms",
      "css-box-model": "The Box Model",
      "css-flexbox": "Flexbox",
      "css-typography": "Typography",
      "css-and-accessibility": "Accessibility",
      "attribute-selectors": "Attribute Selectors",
      "css-positioning": "Positioning",
      "responsive-design": "Responsive Design",
      "css-variables": "Variables",
      "css-grid": "Grid",
      "css-animations": "Animations",
      "review-css": "CSS Review",
      "lab-survey-form": "Build a Survey Form",
      "lab-page-of-playing-cards": "Build a Page of Playing Cards",
      "lab-book-inventory-app": "Build a Book Inventory App",
      "lab-technical-documentation-page": "Build a Technical Documentation Page",
      "lab-product-landing-page": "Build a Product Landing Page",
      "responsive-web-design-certification-exam": "Responsive Web Design Certification Exam"
    }
  },
  "a2-professional-spanish": {
    "title": "A2 Professional Spanish Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"]
  },
  "a2-professional-chinese": {
    "title": "A2 Professional Chinese Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"]
  },
  "a1-professional-chinese": {
    "title": "A1 Professional Chinese Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"]
  },
  "basic-html": {
    "title": "Basic HTML",
    "summary": [
      "Learn how to build simple webpages using HTML tags to add text, images, and links."
    ],
    "intro": ["Larger intro for the superblock page."]
  },
  "semantic-html": {
    "title": "Semantic HTML",
    "summary": [
      "Discover how to write cleaner, more meaningful HTML using semantic tags that improve structure, accessibility, and SEO."
    ],
    "intro": ["Larger intro for the superblock page."]
  },
  "dev-playground": {
    "title": "Dev Playground",
    "intro": ["Playground for creating and testing challenges"]
  },
  "full-stack-open": {
    "title": "Full Stack Open",
    "intro": ["A good intro is to be added here."],
    "chapters": {
      "part-0": "Fundamentals of Web Apps",
      "part-1": "Introduction to React",
      "part-2": "Communicating with Servers",
      "part-3": "Programming a Server with NodeJS and Express",
      "part-4": "Testing Express Servers, User Administration",
      "part-5": "Testing React Apps",
      "part-6": "Advanced State Management",
      "part-7": "React router, custom hooks, styling app with CSS and webpack",
      "part-8": "GraphQL",
      "part-9": "TypeScript",
      "part-10": "React Native",
      "part-11": "CI/CD",
      "part-12": "Containers",
      "part-13": "Using Relational Databases"
    },
    "modules": {
      "basic-html": "Basic HTML"
    },
    "module-intros": {
      "basic-html": {
        "title": "Basic HTML",
        "intro": [
          "Learn how to build simple webpages using HTML tags to add text, images, and links."
        ]
      }
    }
  },
  "daily-coding-challenge": {
    "title": "Daily Coding Challenge"
  },
  "misc-text": {
    "browse-other": "Browse our other free certifications",
    "courses": "Cursos",
    "steps": "Pasos",
    "expand": "Expandir cursos",
    "collapse": "Contraer curso",
    "legacy-header": "Cursos Antiguos",
    "legacy-desc": "Estos cursos ya no forman parte de la ruta de certificación, pero todavía están disponibles para tu aprendizaje.",
    "legacy-go-back": "Ve a la versión actual del plan de estudios.",
    "course-maintenance": "Estos cursos están en mantenimiento. Si no funcionan, puede aprender a ejecutarlos localmente en <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "course-disabling-soon": "La versión del navegador de estos cursos se desactivará temporalmente y sus máquinas virtuales se eliminarán. Cualquier progreso en tus máquinas virtuales se perderá. Si tienes cualquier archivo que quieras de ellos, deberías guardarlo en tu ordenador.Disculpamos cualquier inconveniente. Esperamos disponer de una versión mejorada de estos cursos en las próximas semanas.",
    "course-disabled": "Estos cursos no están disponibles temporalmente para ejecutarse en el navegador. Disculpa por cualquier inconveniente. Puedes aprender a ejecutarlos localmente<0> https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. Esperamos tener una versión mejorada del navegador pronto.",
    "run-locally": "Por ahora, recomendamos ejecutar los cursos localmente en tu ordenador. Puedes aprender cómo en <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databasases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "Su progreso no se guardará en su cuenta de FreeCodeCamp cuando los ejecute localmente.",
    "go-back-to-learn": "Volver a la versión estable del currículum.",
    "read-database-cert-article": "Por favor, lea este post del foro antes de continuar.",
    "enable-cookies": "Debes habilitar las cookies de terceros antes de comenzar.",
    "english-only": "Los cursos de esta sección solo están disponibles en inglés. Solo podemos traducir los títulos y las introducciones en este momento, no las lecciones en sí mismas.",
    "exam-english-only": "Por favor, tenga en cuenta que actualmente el examen de certificación sólo está disponible en Inglés. El resto de los cursos están disponibles en algunos idiomas."
  }
}
