{
  "responsive-web-design": {
    "title": "Diseño Web Responsivo",
    "intro": [
      "En esta Certificación de Diseño Web Responsivo, aprenderás los lenguajes que los desarrolladores utilizan para construir páginas web: HTML (lenguaje de marcado de hipertexto) para el contenido, y CSS (Hojas de estilo en cascada) para el diseño.",
      "Primero, crearás una aplicación de fotos de gatos para aprender los conceptos básicos de HTML y CSS. Más adelante, aprenderá técnicas modernas como variables CSS mediante la construcción de un pingüino, y las mejores prácticas para la accesibilidad mediante la construcción de un formulario web.",
      "Finalmente, aprenderás cómo hacer páginas web que respondan a diferentes tamaños de pantalla construyendo una tarjeta de Twitter con Flexbox, y un diseño complejo de blog con CSS Grid."
    ],
    "note": "Nota: Algunas extensiones del navegador, como bloqueadores de anuncios o extensiones de modo oscuro pueden interferir con las pruebas. Si tienes algun problema, te recomendamos deshabilitar las extensiones que modifiquen el contenido de la página, mientras tomas el curso.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "HTML básico y HTML5",
        "intro": [
          "HTML es un lenguaje de marcado que usa una sintaxis o notación especial para describir la estructura de una página web al navegador. Los elementos HTML generalmente tienen etiquetas de apertura y cierre que rodean y dan sentido al contenido. Por ejemplo, diferentes elementos pueden describir el texto como un título, párrafo o elemento de lista.",
          "En este curso, crearás una aplicación de fotos para gatos para aprender algunos de los elementos HTML más comunes, los bloques básicos de cualquier página web."
        ]
      },
      "basic-css": {
        "title": "CSS básico",
        "intro": [
          "CSS, u hojas de estilo en cascada (Cascading Style Sheets), informa al navegador cómo mostrar el texto y otros contenidos que escribas en HTML. Con CSS, puedes controlar el color, fuente, tamaño, espaciado y muchos otros aspectos de los elementos HTML.",
          "Ahora que has descrito la estructura de tu aplicación de fotos para gatos, dale algo de estilo con CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Diseño visual aplicado",
        "intro": [
          "El diseño visual es una combinación de tipografía, teoría del color, gráficos, animación, diseño de página y más para ayudar a entregar tu mensaje único.",
          "En este curso, aprenderás cómo aplicar estos diferentes elementos de diseño visual a tus páginas web."
        ]
      },
      "applied-accessibility": {
        "title": "Accesibilidad aplicada",
        "intro": [
          "En el desarrollo web, la accesibilidad se refiere al contenido web y a una interfaz de usuario que puede ser entendida, navegada e interactuada por una amplia audiencia. Esto incluye a personas con discapacidades visuales, auditivas, móviles o cognitivas.",
          "En este curso, aprenderás las prácticas recomendadas para crear páginas web que sean accesibles para todos."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Principios de diseño web responsivo",
        "intro": [
          "Hay muchos dispositivos que pueden acceder a la web, y vienen en todas las formas y tamaños. El diseño web responsivo es la práctica de diseñar sitios web flexibles que pueden responder a diferentes tamaños de pantalla, orientaciones y resoluciones.",
          "En este curso, aprenderás a usar CSS para que tus páginas web luzcan bien, sin importar en qué dispositivo se vean."
        ]
      },
      "css-flexbox": {
        "title": "CSS flexbox",
        "intro": [
          "Flexbox es un método de diseño potente y bien soportado que se introdujo con la última versión de CSS, CSS3. Con flexbox, es fácil centrar elementos en la página y crear interfaces de usuario dinámicas que se reducen y se expanden automáticamente.",
          "En este curso, aprenderás los fundamentos de flexbox y diseños dinámicos mediante la construcción de una tarjeta de Twitter."
        ]
      },
      "css-grid": {
        "title": "CSS grid",
        "intro": [
          "La cuadrícula (grid) CSS es un estándar reciente que facilita la creación de diseños complejos y responsivos. Funciona convirtiendo un elemento HTML en una cuadrícula y te permite colocar elementos secundarios en cualquier lugar dentro ella.",
          "En este curso, aprenderá los fundamentos de la cuadrícula (grid) CSS construyendo diferentes diseños complejos, incluido un blog."
        ]
      },
      "responsive-web-design-projects": {
        "title": "Proyectos de diseño web responsivo",
        "intro": [
          "Es hora de poner tus habilidades recién aprendidas a funcionar. Al trabajar en estos proyectos, tendrás la oportunidad de aplicar todas las habilidades, principios y conceptos que has aprendido hasta ahora: HTML, CSS, diseño visual, accesibilidad y más.",
          "Completa los cinco proyectos de programación web de abajo para obtener tu certificación de diseño web responsivo."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Diseño Web Responsivo (Beta)",
    "intro": [
      "En esta certificación de Diseño Web Responsivo, aprenderás los lenguajes que los desarrolladores usan para construir páginas web: HTML (Lenguaje de Marcado de Hipertexto) para el contenido, y CSS (hojas de estilo en cascada) para el diseño.",
      "Primero, crearás una aplicación de fotos de gatos para aprender los conceptos básicos de HTML y CSS. Más adelante, aprenderás técnicas modernas como variables CSS mediante la construcción de un pingüino, y las mejores prácticas para la accesibilidad mediante la construcción de un formulario web.",
      "Finally, you'll learn how to make webpages that respond to different screen sizes by building a Twitter card with Flexbox, and a complex blog layout with CSS Grid."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and dark mode extensions can interfere with the tests. If you face issues, we recommend disabling extensions that modify the content or layout of pages, while taking the course.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Tribute Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a tribute page for a subject of your choosing, fictional or real."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Personal Portfolio Webpage",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build your own personal portfolio page."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Product Landing Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a product landing page to market a product of your choice."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Survey Form",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a survey form to collect data from your users."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Technical Documentation Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a technical documentation page to serve as instruction or reference for a topic."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Learn HTML by Building a Cat Photo App",
        "intro": [
          "HTML tags give a webpage its structure. You can use HTML tags to add photos, buttons, and other elements to your webpage.",
          "In this course, you'll learn the most common HTML tags by building your own cat photo app."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Learn Basic CSS by Building a Cafe Menu",
        "intro": [
          "CSS tells the browser how to display your webpage. You can use CSS to set the color, font, size, and other aspects of HTML elements.",
          "In this course, you'll learn CSS by designing a menu page for a cafe webpage."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Learn the CSS Box Model by Building a Rothko Painting",
        "intro": [
          "Every HTML element is its own box – with its own spacing and a border. This is called the Box Model.",
          "In this course, you'll use CSS and the Box Model to create your own Rothko-style rectangular art pieces."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Learn CSS Variables by Building a City Skyline",
        "intro": [
          "CSS variables help you organize your styles and reuse them.",
          "In this course, you'll build a city skyline. You'll learn how to configure CSS variables so you can reuse them whenever you want."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Learn HTML Forms by Building a Registration Form",
        "intro": [
          "You can use HTML forms to collect information from people who visit your webpage.",
          "In this course, you'll learn HTML forms by building a signup page. You'll learn how to control what types of data people can type into your form, and some new CSS tools for styling your page."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Learn Accessibility by Building a Quiz",
        "intro": [
          "Accessibility is making your webpage easy for all people to use – even people with disabilities.",
          "In this course, you'll build a quiz webpage. You'll learn accessibility tools such as keyboard shortcuts, ARIA attributes, and design best practices."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Learn Intermediate CSS by Building a Picasso Painting",
        "intro": [
          "In this course, you'll use learn some intermediate CSS techniques by coding your own Picasso painting webpage. You'll learn about SVG icons, CSS positioning, and review other CSS skills you've learned."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Learn Responsive Web Design by Building a Piano",
        "intro": [
          "Responsive Design tells your webpage how it should look on different-sized screens.",
          "In this course, you'll use CSS and Responsive Design to code a piano. You'll also learn more about media queries and pseudo selectors."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Learn CSS Flexbox by Building a Photo Gallery",
        "intro": [
          "Flexbox helps you design your webpage so that it looks good on any screen size.",
          "In this course, you'll use Flexbox to build a responsive photo gallery webpage."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Learn CSS Grid by Building a Magazine",
        "intro": [
          "CSS Grid gives you control over the rows and columns of your webpage design.",
          "In this course, you'll build a magazine article. You'll learn how to use CSS Grid, including concepts like grid rows and grid columns."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Learn Typography by Building a Nutrition Label",
        "intro": [
          "Typography is the art of styling your text to be easily readable and suit its purpose.",
          "In this course, you'll use typography to build a nutrition label webpage. You'll learn how to style text, adjust line height, and position your text using CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Learn CSS Transforms by Building a Penguin",
        "intro": [
          "You can transform HTML elements to create appealing designs that draw your reader's eye. You can use transforms to rotate elements, scale them, and more.",
          "In this course, you'll build a penguin. You'll use CSS transforms to position and resize the parts of your penguin, create a background, and animate your work."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Learn CSS Animation by Building a Ferris Wheel",
        "intro": [
          "You can use CSS animation to draw attention to specific sections of your webpage and make it more engaging.",
          "In this course, you'll build a Ferris wheel. You'll learn how to use CSS to animate elements, transform them, and adjust their speed."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Learn More About CSS Pseudo Selectors By Building A Balance Sheet",
        "intro": [
          "You can use CSS pseudo selectors to change specific HTML elements.",
          "In this course, you'll build a balance sheet using pseudo selectors. You'll learn how to change the style of an element when you hover over it with your mouse, and trigger other events on your webpage."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Learn CSS Colors by Building a Set of Colored Markers",
        "intro": [
          "Selecting the correct colors for your webpage can greatly improve the aesthetic appeal to your readers.",
          "In this course, you'll build a set of colored markers. You'll learn different ways to set color values and how to pair colors with each other."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Algoritmos de JavaScript y Estructuras de Datos",
    "intro": [
      "Mientras HTML y CSS controlan el contenido y el estilo de una página, JavaScript se utiliza para hacerlo interactivo. En la certificación Algoritmos de JavaScript y Estructuras de Datos, aprenderás los fundamentos de JavaScript incluyendo variables, arreglos, objetos, bucles y funciones.",
      "Una vez que tengas los fundamentos, aplicarás ese conocimiento creando algoritmos para manipular cadenas, factorizar números e incluso calcular la órbita de la Estación Espacial Internacional.",
      "A lo largo del camino, también aprenderás dos estilos o paradigmas importantes de programación: la Programación Orientada a Objetos (OOP), y la Programación Funcional (FP)."
    ],
    "note": "Nota: Algunas extensiones del navegador, como bloqueadores de anuncios o bloqueadores de scripts pueden interferir con las pruebas. Si se te presentan problemas, te recomendamos deshabilitar las extensiones que modifiquen o bloqueen el contenido de la página, mientras tomas el curso.",
    "blocks": {
      "basic-javascript": {
        "title": "JavaScript básico",
        "intro": [
          "JavaScript es un lenguaje de scripting que puedes utilizar para hacer que las páginas web sean interactivas. Es una de las principales tecnologías de la web, junto con HTML y CSS, y es soportada por todos los navegadores modernos.",
          "En este curso, aprenderás conceptos fundamentales de programación en JavaScript. Empezarás con estructuras básicas de datos como números y cadenas. Luego aprenderás a trabajar con arreglos, objetos, funciones, bucles, declaraciones if/else y más."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, o ES, es una versión estandarizada de JavaScript. Debido a que todos los principales navegadores siguen esta especificación, los términos ECMAScript y JavaScript son intercambiables.",
          "La mayoría del JavaScript que has aprendido hasta este punto estaba en ES5 (ECMAScript 5), el cual fue finalizado en 2009. Aunque puedes seguir escribiendo programas en ES5, JavaScript está evolucionando siempre, y cada año se lanzan nuevas funcionalidades.",
          "ES6, lanzado en 2015, agrego muchas nuevas y potentes características al lenguaje. En este curso, aprenderás estas nuevas características, incluyendo let y const, funciones flecha, clases, promesas, y módulos."
        ]
      },
      "regular-expressions": {
        "title": "Expresiones regulares",
        "intro": [
          "Expresiones regulares, a veces acortadas a \"regex\" o \"regexp\", son patrones que ayudan a los programadores a encontrar, buscar, y reemplazar texto. Las expresiones regulares son muy potentes, pero pueden ser difícil de leer porque usan caracteres especiales para hacer coincidencias más complejas y flexibles.",
          "En este curso, aprenderás como usar caracteres especiales, grupos de captura, miradas positivas y negativas, así como otras técnicas para hacer coincidir cualquier texto que quieras."
        ]
      },
      "debugging": {
        "title": "Depuración",
        "intro": [
          "La depuración es el proceso de revisar tu código, encontrando cualquier problema, y arreglándolo.",
          "Los problemas en el código generalmente vienen en tres formas: errores de sintaxis que impiden que tu programa se ejecute, errores de tiempo de ejecución donde tu código tiene un comportamiento inesperado, o errores lógicos donde tu código no hace lo que pretendes.",
          "En este curso, aprenderás como usar la consola de JavaScript para depurar programas y prevenir errores comunes antes de que ocurran."
        ]
      },
      "basic-data-structures": {
        "title": "Estructuras de datos básicas",
        "intro": [
          "Los datos pueden almacenarse y accederse de muchas maneras. Ya conoces algunas estructuras de datos comunes en JavaScript: los arreglos y los objetos.",
          "En este curso de estructuras de datos básicas, aprenderás más acerca de las diferencias entre arreglos y objetos, y cuál usar en diferentes situaciones. También aprenderás como usar métodos útiles de JavaScript como <code>splice()</code> y <code>Object.keys()</code> para acceder y manipular datos."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Programación de algoritmos básicos",
        "intro": [
          "Un algoritmo es una serie de instrucciones paso a paso que describen cómo hacer algo.",
          "Para escribir un algoritmo eficaz, ayuda el dividir un problema en partes más pequeñas y pensar cuidadosamente cómo resolver cada parte con código.",
          "En este curso, aprenderás los fundamentos del pensamiento algorítmico mediante la escritura de algoritmos que hacen de todo, desde la conversión de temperaturas hasta el manejo de arreglos 2D complejos."
        ]
      },
      "object-oriented-programming": {
        "title": "Programación orientada a objetos",
        "intro": [
          "OOP, o programación orientada a objetos, es uno de los principales enfoques del proceso de desarrollo de software. En OOP, los objetos y las clases son utilizadas para organizar código y para describir lo que pueden hacer.",
          "En este curso, aprenderás los principios básicos de OOP en JavaScript incluyendo la palabra clave <code>this</code>, cadenas prototipo, constructores, y herencias."
        ]
      },
      "functional-programming": {
        "title": "Programación funcional",
        "intro": [
          "La programación funcional es otro enfoque común en el desarrollo de software. En programación funcional, el código está organizado en funciones más pequeñas y básicas que se pueden combinar para construir programas de mayor complejidad.",
          "En este curso, aprenderás los conceptos básicos de programación funcional incluyendo funciones puras, cómo evitar mutaciones, y cómo escribir código más limpio con métodos como <code>.map()</code> y <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Programación de algoritmos intermedios",
        "intro": [
          "Ahora que conoces los conceptos básicos del pensamiento algorítmico, junto con la OOP y la programación funcional, prueba tus habilidades con los desafíos de programación de algoritmos intermedios."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "Algoritmos de JavaScript y proyectos de estructuras de datos",
        "intro": [
          "¡Ha llegado el momento de poner tus habilidades de JavaScript a prueba! Estos proyectos son muy similares a los desafíos algorítmicos que has hecho antes, pero más difíciles.",
          "Completa estos 5 proyectos de JavaScript para obtener la certificación algoritmos de JavaScript y estructuras de datos."
        ]
      },
      "basic-javascript-rpg-game": {
        "title": "Juego RPG básico en JavaScript",
        "intro": [
          "",
          ""
        ]
      },
      "intermediate-javascript-calorie-counter": {
        "title": "Intermedio JavaScript contador de calorías",
        "intro": [
          "",
          ""
        ]
      },
      "functional-programming-spreadsheet": {
        "title": "Hoja de cálculo de programación funcional",
        "intro": [
          "",
          ""
        ]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Librerías de desarrollo de la interfaz",
    "intro": [
      "Ahora que estás familiarizado con HTML, CSS y JavaScript, mejora tus habilidades aprendiendo algunas de las librerías de interfaz más populares en la industria.",
      "En la certificación de librerías de la interfaz, aprenderás a darle estilo a tu sitio rápidamente con Bootstrap. También aprenderás cómo añadir lógica a tus estilos CSS y extenderlos con Sass.",
      "Después, construirás un carrito de compras y otras aplicaciones para aprender a crear poderosas aplicaciones de página única (SPAs) con React y Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap es un framework de la interfaz utilizado para diseñar páginas y aplicaciones web. Tiene un enfoque de desarrollo web centrado en los dispositivos móviles e incluye estilos y clases CSS pre-configurados, además de algunas funciones de JavaScript.",
          "En este curso, aprenderás cómo crear sitios web responsivos con Bootstrap, y utilizarás sus clases incluidas para estilizar botones, imágenes, formularios, navegación y otros elementos."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery es una de las librerías de JavaScript más utilizadas en el mundo.",
          "En 2006, cuando se lanzó, los principales navegadores manejaban JavaScript de forma ligeramente diferente. jQuery simplificó el proceso de escribir JavaScript del lado del cliente, y también garantizó que tu código funcionara de la misma manera en todos los navegadores.",
          "En este curso, aprenderás a usar jQuery para seleccionar, eliminar, copiar y modificar diferentes elementos de la página."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, o \"Syntactically Awesome StyleSheets\", es una extensión del lenguaje CSS. Añade características que no están disponibles en el CSS básico, lo que facilita la simplificación y el mantenimiento de las hojas de estilo de tus proyectos.",
          "En este curso de Sass, aprenderás cómo almacenar datos en variables, anidar CSS, crear estilos reutilizables con mixins, añadir lógica y bucles a tus estilos, y más."
        ]
      },
      "react": {
        "title": "React js",
        "intro": [
          "React es una librería muy popular de JavaScript para construir interfaces de usuario reutilizables controladas por componentes, para páginas web o aplicaciones.",
          "React combina HTML con la funcionalidad de JavaScript para crear su propio lenguaje de marcado llamado JSX. Además, facilita la administración del flujo de datos a través de la aplicación.",
          "En este curso, aprenderás cómo crear diferentes componentes de React, administrar las propiedades de estado de los datos, usar diferentes métodos de ciclo de vida como <code>componentDidMount</code> y mucho más."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "A medida que las aplicaciones crecen en tamaño y alcance, la gestión de datos compartidos se vuelve mucho más difícil. Redux se define como un \"contenedor de estado predecible para aplicaciones de JavaScript\" que ayuda a asegurar que tus aplicaciones funcionen de manera predecible, y sean más fáciles de probar.",
          "Aunque puedes usar Redux con cualquier librería de vistas, aquí introducimos Redux antes de combinarlo con React en los siguientes capítulos del curso.",
          "En este curso, aprenderás los fundamentos de almacenamiento en Redux, así como de las acciones, reductores e intermediarios para administrar datos a lo largo de tu aplicación."
        ]
      },
      "react-and-redux": {
        "title": "React y Redux",
        "intro": [
          "React y Redux se mencionan a menudo juntos, y con razón. El desarrollador que creó Redux era un desarrollador de React que quería hacer más fácil compartir datos a través de diferentes componentes.",
          "Ahora que sabes cómo administrar el flujo de datos compartidos con Redux, es hora de combinar ese conocimiento con React. En los cursos de React y Redux, construirás un componente de React y aprenderás cómo administrar el estado localmente a un nivel de componentes, y a lo largo de toda la aplicación con Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Proyectos de librerías de desarrollo de la interfaz",
        "intro": [
          "Es hora de poner a prueba tus habilidades con las librerías de desarrollo de la interfaz. Usa Bootstrap, jQuery, Sass, React, y Redux para construir 5 proyectos que probarán todo lo que has aprendido hasta este punto.",
          "Completa los 5 proyectos y obtendrás la certificación librerías de desarrollo de la interfaz."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Visualización de Datos",
    "intro": [
      "Los datos están a nuestro alrededor, pero no significan mucho si no tienen forma o contexto.",
      "En la certificación Visualización de Datos, construirás diagramas, gráficos, y mapas para presentar diferentes tipos de datos utilizando la biblioteca D3.js.",
      "También aprenderás acerca de JSON (JavaScript Object Notation), y cómo trabajar con datos en línea usando un API (Application Programing Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Visualización de datos con D3",
        "intro": [
          "D3, o D3.js, significa documentos basados en datos. Es una biblioteca JavaScript para crear visualizaciones de datos dinámicas e interactivas en el navegador.",
          "D3 está construido para trabajar con estándares web comunes – a saber, HTML, CSS y gráficos vectoriales escalables (SVG).",
          "D3 soporta muchos tipos diferentes de formatos de datos de entrada. Luego, usando sus potentes métodos incorporados, puedes transformar esos datos en diferentes diagramas, gráficos y mapas.",
          "En los cursos de Visualización de Datos con D3, aprenderás a trabajar con datos para crear diferentes tablas, gráficos, elementos flotantes y otros elementos para crear visualizaciones de datos dinámicas y atractivas."
        ]
      },
      "json-apis-and-ajax": {
        "title": "APIs JSON y AJAX",
        "intro": [
          "De forma similar a la que las interfaces de usuario \"UI\" ayudan a la gente a usar programas, las APIs (Interfaces de Programación de Aplicación) ayudan a los programas a interactuar con otros programas. Las APIs son herramientas que los ordenadores utilizan para comunicarse entre sí, en parte para enviar y recibir datos.",
          "Los programadores a menudo usan AJAX (Asynchronous JavaScript y XML) cuando trabajan con APIs. AJAX se refiere a un grupo de tecnologías que hacen peticiones asíncronas a un servidor para transferir datos, y luego cargar cualquier dato devuelto en la página. Y los datos transferidos entre el navegador y el servidor suelen estar en un formato llamado JSON (JavaScript Object Notation).",
          "Este curso te enseñará lo básico sobre trabajar con APIs y diferentes tecnologías AJAX en el navegador."
        ]
      },
      "data-visualization-projects": {
        "title": "Proyectos de visualización de datos",
        "intro": [
          "Ahora que has aprendido a trabajar con las tecnologías D3, APIs y AJAX, pon a prueba tus habilidades con estos 5 proyectos de visualización de datos.",
          "En estos proyectos, necesitarás obtener datos y analizar un conjunto de datos y después usar D3 para crear diferentes visualizaciones de datos. Termínalos todos para obtener tu certificación de visualización de datos."
        ]
      },
      "d3-dashboard": {
        "title": "Panel D3",
        "intro": [
          "",
          ""
        ]
      }
    }
  },
  "relational-database": {
    "title": "Relational Database (Beta)",
    "intro": [
      "For these courses, you will use real developer tools and software including VS Code, PostgreSQL, and the Linux / Unix command line to complete interactive tutorials and build projects.",
      "These courses start off with basic Bash commands. Using the terminal, you will learn everything from navigating and manipulating a file system, scripting in Bash, all the way to advanced usage.",
      "Next, you will learn how to create and use a relational database with PostgreSQL, a database management system, and SQL, the language of these databases.",
      "Finally, you will learn Git, the version control system, an essential tool of every developer."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "Celestial Bodies Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a database of celestial bodies using PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Number Guessing Game",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will use Bash scripting, PostgreSQL, and Git to create a number guessing game that runs in the terminal and saves user information."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "Periodic Table Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create Bash a script to get information about chemical elements from a periodic table database."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Salon Appointment Scheduler",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create an interactive Bash program that uses PostgreSQL to track the customers and appointments for your salon."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "World Cup Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create a Bash script that enters information from World Cup games into PostgreSQL, then query the database for useful statistics."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Learn Advanced Bash by Building a Kitty Ipsum Translator",
        "intro": [
          "There's more to Bash commands than you might think.",
          "In this 140-lesson course, you will learn some more complex commands, and the details of how commands work."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Learn Bash and SQL by Building a Bike Rental Shop",
        "intro": [
          "In this 210-lesson course, you will build an interactive Bash program that stores rental information for your bike rental shop using PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Learn Bash by Building a Boilerplate",
        "intro": [
          "The terminal allows you to send text commands to your computer that can manipulate the file system, run programs, automate tasks, and much more.",
          "In this 170-lesson course, you will learn terminal commands by creating a website boilerplate using only the command line."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Learn Bash Scripting by Building Five Programs",
        "intro": [
          "Bash scripts combine terminal commands and logic into programs that can execute or automate tasks, and much more.",
          "In this 220-lesson course, you will learn more terminal commands and how to use them within Bash scripts by creating five small programs."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Learn Git by Building an SQL Reference Object",
        "intro": [
          "Git is a version control system that keeps track of all the changes you make to your codebase.",
          "In this 240-lesson course, you will learn how Git keeps track of your code by creating an object containing commonly used SQL commands."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Learn Nano by Building a Castle",
        "intro": [
          "Nano is a program that allows you to edit files right in the terminal.",
          "In this 40-lesson course, you will learn how to edit files in the terminal with Nano while building a castle."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Learn Relational Databases by Building a Mario Database",
        "intro": [
          "A relational database organizes data into tables that are linked together through relationships.",
          "In this 165-lesson course, you will learn the basics of a relational database by creating a PostgreSQL database filled with video game characters."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Learn SQL by Building a Student Database: Part 1",
        "intro": [
          "SQL, or Structured Query Language, is the language for communicating with a relational database.",
          "In this 140-lesson course, you will create a Bash script that uses SQL to enter information about your computer science students into PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Learn SQL by Building a Student Database: Part 2",
        "intro": [
          "SQL join commands are used to combine information from multiple tables in a relational database",
          "In this 140-lesson course, you will complete your student database while diving deeper into SQL commands."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Desarrollo Back End y APIs",
    "intro": [
      "Hasta este punto, solo has usado JavaScript en la parte de front-end para agregar interactividad a una página, resolver los desafíos de algoritmos o construir un SPA. Pero JavaScript también se puede utilizar en el back-end, o servidor, para construir aplicaciones web completas.",
      "Hoy en día, una de las formas populares para construir aplicaciones es a través de microservicios, que son pequeñas aplicaciones modulares que trabajan juntas para formar una aplicación más grande.",
      "En la Certificación Desarrollo de Back End y APIs, aprenderás cómo escribir aplicaciones de back-end con Node.js y npm (Node Package Manager). También construirás aplicaciones web con el framework Express, y un microservicio \"People Finder\" con MongoDB y la biblioteca Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Gestión de paquetes con NPM",
        "intro": [
          "npm (Gestor de Paquetes de Nodos), es una herramienta de línea de comandos para instalar, crear y compartir paquetes de código JavaScript escritos para Node.js. Hay muchos paquetes de código abierto disponibles en npm, así que antes de iniciar un proyecto, tómate algo de tiempo para explorar los diferentes paquetes, para que no termines reinventando la rueda para cosas comunes como trabajar con fechas y obtener datos de una API.",
          "En este curso, aprenderás los conceptos básicos del uso de npm, incluyendo cómo trabajar con el <code>package.json</code> y cómo administrar las dependencias instaladas."
        ]
      },
      "basic-node-and-express": {
        "title": "Node y Express Basico",
        "intro": [
          "Node.js es un entorno de ejecución de JavaScript que permite a desarrolladores escribir programas de backend (lado del servidor) en JavaScript. Node.js viene con muchos módulos integrados — pequeños programas independientes — que ayudan en esto. Algunos de los módulos principales incluyen HTTP, que actúa como un servidor, y sistema de archivos, un módulo para leer y modificar archivos.",
          "En el último conjunto de cursos aprendiste a instalar y administrar paquetes desde npm, que son colecciones de módulos más pequeños. Estos paquetes pueden ayudarte a construir aplicaciones más grandes y complejas.",
          "Express es un framework de aplicaciones web ligero y es uno de los paquetes más populares de npm. Express hace mucho más fácil crear un servidor y manejar la ruta de tu aplicación, el cual maneja cosas como dirigir gente a la página correcta cuando visitan un determinado endpoint como <pre>/blog</pre>.",
          "En este curso, aprenderás los fundamentos de Node y Express, incluyendo cómo crear un servidor, servir diferentes archivos y gestionar diferentes peticiones desde el navegador."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB y Mongoose",
        "intro": [
          "MongoDB es una aplicación de base de datos que almacena documentos (o registros) JSON que puedes utilizar en tu aplicación. A diferencia de SQL, otro tipo de base de datos, Mongo es una base de datos no relacional o \"NoSQL\". Esto significa que Mongo almacena todos los datos asociados dentro de un registro, en lugar de almacenarlos en varias tablas predefinidas como en una base de datos SQL.",
          "Mongoose es un popular paquete npm que a menudo se instala junto con Mongo. Con Mongoose, puedes utilizar objetos de JavaScript simples en lugar de JSON, lo que hace más fácil trabajar con Mongo. Además, te permite crear plantillas para tus documentos llamados esquemas, para que no guarde accidentalmente el tipo equivocado de datos y cause errores más tarde.",
          "En los cursos de MongoDB y Mongoose, aprenderás los fundamentos para trabajar con datos persistentes, incluyendo cómo configurar un modelo, guardar, eliminar y encontrar documentos en la base de datos."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Desarrollo Back End y Proyectos APIs",
        "intro": [
          "Ya has trabajado con APIs antes, pero ahora que sabes utilizar npm, Node, Express, MongoDB y Mongoose, es momento de construir la tuya. Haz uso de todo lo que aprendiste hasta ahora para crear 5 microservicios diferentes, los cuales son aplicaciones más pequeñas con ámbito limitado.",
          "Después de crearlas, tendrás 5 interesantes APIs de microservicios que puedes mostrar a amigos, familiares y potenciales empleadores. Oh, y también tendrás una nueva y brillante certificación en Desarrollo de Back End y APIs."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Control de Calidad",
    "intro": [
      "A medida que tus programas o aplicaciones web se vuelven más complejos, querrás probarlos para asegurarte de que los nuevos cambios no rompan su funcionalidad original.",
      "En la certificación de control de calidad, aprenderás a escribir pruebas con Chai para asegurarte de que tus aplicaciones funcionan como esperas.",
      "Luego construirás una aplicación de chat para aprender conceptos avanzados de Node y Express. También usarás Pug como motor de plantillas, Passport para autenticación y Socket.io para la comunicación en tiempo real entre el servidor y los clientes conectados."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Control de calidad y pruebas con Chai",
        "intro": [
          "Chai es una librería de pruebas de JavaScript que te ayuda a confirmar que tu programa todavía se comporta de la manera que esperas después de realizar cambios en tu código.",
          "Usando Chai, puedes escribir pruebas que describan los requisitos de tu programa y ver si tu programa los cumple.",
          "En este curso, aprenderá sobre aserciones, igualdad profunda, veracidad, pruebas de APIs y otros fundamentos para probar aplicaciones JavaScript."
        ]
      },
      "advanced-node-and-express": {
        "title": "Node y Express avanzados",
        "intro": [
          "Ahora es el momento de sumergirse en Node.js y Express.js construyendo una aplicación de chat con un sistema de inicio de sesión.",
          "Para implementar el sistema de inicio de sesión de forma segura, necesitarás aprender acerca de autenticación. Este es el acto de verificar la identidad de una persona o proceso.",
          "En este curso, aprenderás cómo utilizar Passport para administrar la autenticación, Pug para crear plantillas reutilizables para construir rápidamente el front end, y web sockets para comunicación en tiempo real entre los clientes y el servidor."
        ]
      },
      "quality-assurance-projects": {
        "title": "Proyectos de control de calidad",
        "intro": [
          "Ahora que estas versado tanto en el front end como en el back end, es tiempo de aplicar todas tus nuevas habilidades y los conceptos que has aprendido hasta el momento. Construirás 5 aplicaciones web diferentes y escribirás pruebas para cada una de ellas, para estar seguro de que funcionarán y que tus aplicaciones pueden manejar diferentes casos extremos.",
          "Después de completar estos proyectos de Control de Calidad, tendrás 5 proyectos más en tu currículum, y una nueva certificación para mostrar en tu portafolio."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Cálculo Científico con Python",
    "intro": [
      "Hoy en día, Python es uno de los lenguajes de programación más populares y flexibles. Puedes usarlo para todo, desde programas básicos hasta machine learning.",
      "En la certificación de Cálculo Científico con Python, aprenderás los fundamentos de Python tales como: variables, bucles, condicionales, y funciones. Luego, avanzarás rápidamente por estructura de datos complejas, redes, base de datos relacionales y visualización de datos."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python para todos",
        "intro": [
          "Python para todos, es una serie de videocursos gratuitos, que enseña los conceptos básicos del uso de Python 3.",
          "Los cursos fueron creados por el Dr. Charles Severance (también conocido como Dr. Chuck). El es un Profesor de Clínica en la Escuela de Información de la Universidad de Michigan, donde él enseña varios cursos orientados a tecnología, diseño de bases de datos y desarrollo web."
        ]
      },
      "scientific-computing-with-python-projects": {
        "title": "Proyectos de cálculo científico con Python",
        "intro": [
          "Es momento de poner a prueba tus habilidades con Python. Al completar estos proyectos, demostrarás que tienes el conocimiento fundamental de Python y que calificas para la Certificación de cálculo científico con Python."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Análisis de Datos con Python",
    "intro": [
      "El análisis de datos ha existido durante mucho tiempo. Pero hasta hace apenas pocos años, los desarrolladores lo practicaban utilizando herramientas costosas de código cerrado como Tableau. Sin embargo recientemente, Python, SQL y otras librerías abiertas han cambiado el Análisis de Datos para siempre.",
      "En la Certificación de Análisis de Datos con Python, aprenderás los fundamentos del análisis de datos con Python. Al terminar la certificación, sabrás como leer datos de fuentes como CSV y SQL, y como usar librerías tales como Numpy, Pandas, Matplotlib y Seaborn para procesar y visualizar datos."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Análisis de datos con Python",
        "intro": [
          "En esta serie de video cursos, creados por Santiago Basulto, aprenderás todo el proceso de análisis de datos. Leerás datos de múltiples fuentes (CSV, SQL, Excel), procesarás los datos usando NumPy, Pandas y los visualizarás usando Matplotlib y Seaborn,",
          "Además, hemos incluido un curso completo de Jupyter Notebook, y una referencia rápida de Python para actualizar tus habilidades de programación."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Aprende los fundamentos de la librería NumPy en el siguiente video curso creado por Keith Galli.",
          "En este curso aprenderás como trabaja NumPy y como se compara con las listas integradas en Python. Aprenderás también como escribir código con NumPy, indexación, remodelar, estadística aplicada y mucho más."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Proyectos de análisis de datos con Python",
        "intro": [
          "Hay muchas formas de analizar datos con Python. Al completar estos proyectos, demostrarás que tienes los conocimientos fundamentales del análisis de datos con Python.",
          "Termina todos los proyectos para reclamar tu Certificación de Análisis de Datos con Python."
        ]
      }
    }
  },
  "information-security": {
    "title": "Seguridad de la Información",
    "intro": [
      "Con todo lo que hacemos en línea, hay una gran cantidad de información sensible en riesgo: direcciones de correo electrónico, contraseñas, números de teléfono y mucho más.",
      "Con la Certificación de Seguridad de Información, construirás aplicaciones web seguras con HelmetJS para aprender los fundamentos de la protección de la información en línea de la gente.",
      "You'll also build a TCP client, and an Nmap and port scanner in Python. This will help you learn the basics of penetration testing — an important component of good information security."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Information Security with HelmetJS",
        "intro": [
          "This programming course focuses on HelmetJS, a type of middleware for Express-based applications that automatically sets HTTP headers. This way it can prevent sensitive information from unintentionally being passed between the server and client.",
          "Completing the courses below will help you understand how to protect your website from malicious behavior."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python for Penetration Testing",
        "intro": [
          "These video courses teach you penetration testing with Python. Also known as a pen test, penetration testing is a simulated attack against a system to check for vulnerabilities.",
          "In this course, you'll learn about sockets, create a TCP server and client, build an Nmap scanner, and other tools and techniques that pen testers use daily."
        ]
      },
      "information-security-projects": {
        "title": "Information Security Projects",
        "intro": [
          "Now it’s time to put your new information security skills to work. These projects will give you a chance to apply the infosec skills, principles, and concepts you've learned.",
          "When you are done, you will have plenty of information security projects under your belt, along with a certification that you can show off to friends, family, and employers."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Aprendizaje Automático con Python",
    "intro": [
      "Machine learning has many practical applications that you can use in your projects or on the job.",
      "In the Machine Learning with Python Certification, you'll use the TensorFlow framework to build several neural networks and explore more advanced techniques like natural language processing and reinforcement learning.",
      "You'll also dive into neural networks, and learn the principles behind how deep, recurrent, and convolutional neural networks work."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "TensorFlow is an open source framework that makes machine learning and neural networking easier to use.",
          "The following video course was created by Tim Ruscica, also known as “Tech With Tim”. It will help you to understand TensorFlow and some of its powerful capabilities."
        ]
      },
      "how-neural-networks-work": {
        "title": "How Neural Networks Work",
        "intro": [
          "Neural networks are at the core of what we call artificial intelligence today. But historically they've been hard to understand. Especially for beginners in the machine learning field.",
          "Even if you are completely new to neural networks, these video courses by Brandon Rohrer will get you comfortable with the concepts and the math behind them."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Machine Learning with Python Projects",
        "intro": [
          "Machine learning has many practical applications. By completing these free and challenging coding projects, you will demonstrate that you have a good foundational knowledge of machine learning, and qualify for your Machine Learning with Python certification."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Preparación de Entrevistas de Programación",
    "intro": [
      "If you're looking for free coding exercises to prepare for your next job interview, we've got you covered.",
      "This section contains hundreds of coding challenges that test your knowledge of algorithms, data structures, and mathematics. It also has a number of take-home projects you can use to strengthen your skills, or add to your portfolio."
    ],
    "note": "",
    "blocks": {
      "algorithms": {
        "title": "Algorithms",
        "intro": [
          "These free programming exercises will teach you about some common algorithms that you will likely encounter in real life. They are a great opportunity to improve your logic and programming skills.",
          "These algorithms are frequently used in job interviews to test a candidate's skills. We'll give you clear and concise explanations of how these different algorithms work so you can implement a solution for each one."
        ]
      },
      "data-structures": {
        "title": "Data Structures",
        "intro": [
          "These free programming courses are meant to help you deal with large and complex data structures that you may not yet be familiar with.",
          "Working through the courses below, you will learn about each type of data structure, and implement algorithms to reinforce your understanding of them."
        ]
      },
      "take-home-projects": {
        "title": "Take Home Projects",
        "intro": [
          "Programming interviews have always been stressful. Job applicants are sometimes given a take home project to be completed outside of the interview. These types of interviews usually require a lot of work, but they're a great way for employers to see how you might perform on the job.",
          "Build the bonus coding projects below for extra practice. Take your time, make them great, and put them on your resume or portfolio to show potential employers."
        ]
      },
      "rosetta-code": {
        "title": "Rosetta Code",
        "intro": [
          "Sube tu nivel de habilidad de resolución creativa de problemas con estas tareas de programación gratis de la clásica librería de Rosetta Code.",
          "Estos desafíos pueden resultar difíciles, pero empujarán tu lógica de algoritmos a nuevas alturas."
        ]
      },
      "project-euler": {
        "title": "Project Euler",
        "intro": [
          "Complete the programming challenges below, from the massive Project Euler archives. These will harden your algorithm and mathematics knowledge.",
          "These problems range in difficulty and, for many, the experience is inductive chain learning. That is, by solving one problem, it will expose you to a new concept that allows you to undertake a previously inaccessible problem. Can you finish them all?"
        ]
      }
    }
  },
  "misc-text": {
    "certification": "Certificación de {{cert}}",
    "browse-other": "Navega por nuestras otras certificaciones gratuitas\n(recomendamos hacerlo en orden)",
    "courses": "Cursos",
    "steps": "Steps",
    "expand": "Expand course",
    "collapse": "Collapse course",
    "legacy-header": "Legacy Courses",
    "legacy-desc": "These courses are no longer part of the certification path, but are still available for you to further your learning.",
    "viewing-upcoming-change": "You are looking at a beta page. ",
    "go-back-to-learn": "Go back to the stable version of the curriculum."
  }
}
