{
  "responsive-web-design": {
    "title": "Legacy Responsive Web Design Challenges",
    "intro": [
      "En esta Certificación de Diseño Web Adaptativo, aprenderás los lenguajes que los desarrolladores utilizan para construir páginas web: HTML (lenguaje de marcado de hipertexto) para el contenido, y CSS (Hojas de estilo en cascada) para el diseño.",
      "Primero, crearás una aplicación de fotos de gatos para aprender los conceptos básicos de HTML y CSS. Más adelante, aprenderá técnicas modernas como variables CSS mediante la construcción de un pingüino, y las mejores prácticas para la accesibilidad mediante la construcción de un formulario web.",
      "Finalmente, aprenderás cómo hacer páginas web que respondan a diferentes tamaños de pantalla construyendo una tarjeta de Twitter con Flexbox, y un diseño complejo de blog con CSS Grid."
    ],
    "note": "Nota: Algunas extensiones del navegador, como bloqueadores de anuncios o extensiones de modo oscuro pueden interferir con las pruebas. Si tienes algun problema, te recomendamos deshabilitar las extensiones que modifiquen el contenido de la página, mientras tomas el curso.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "HTML básico y HTML5",
        "intro": [
          "HTML es un lenguaje de marcado que usa una sintaxis o notación especial para describir la estructura de una página web al navegador. Los elementos HTML generalmente tienen etiquetas de apertura y cierre que rodean y dan sentido al contenido. Por ejemplo, diferentes elementos pueden describir el texto como un título, párrafo o elemento de lista.",
          "En este curso, crearás una aplicación de fotos para gatos para aprender algunos de los elementos HTML más comunes, los bloques básicos de cualquier página web."
        ]
      },
      "basic-css": {
        "title": "CSS básico",
        "intro": [
          "CSS, u hojas de estilo en cascada (Cascading Style Sheets), informa al navegador cómo mostrar el texto y otros contenidos que escribas en HTML. Con CSS, puedes controlar el color, fuente, tamaño, espaciado y muchos otros aspectos de los elementos HTML.",
          "Ahora que has descrito la estructura de tu aplicación de fotos para gatos, dale algo de estilo con CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Diseño visual aplicado",
        "intro": [
          "El diseño visual es una combinación de tipografía, teoría del color, gráficos, animación, diseño de página y más para ayudar a entregar tu mensaje único.",
          "En este curso, aprenderás cómo aplicar estos diferentes elementos de diseño visual a tus páginas web."
        ]
      },
      "applied-accessibility": {
        "title": "Accesibilidad aplicada",
        "intro": [
          "En el desarrollo web, la accesibilidad se refiere al contenido web y a una interfaz de usuario que puede ser entendida, navegada e interactuada por una amplia audiencia. Esto incluye a personas con discapacidades visuales, auditivas, móviles o cognitivas.",
          "En este curso, aprenderás las prácticas recomendadas para crear páginas web que sean accesibles para todos."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Principios de diseño web adaptativo",
        "intro": [
          "Hay muchos dispositivos que pueden acceder a la web, y vienen en todas las formas y tamaños. El diseño web adaptativo es la práctica de diseñar sitios web flexibles que pueden responder a diferentes tamaños de pantalla, orientaciones y resoluciones.",
          "En este curso, aprenderás a usar CSS para que tus páginas web luzcan bien, sin importar en qué dispositivo se vean."
        ]
      },
      "css-flexbox": {
        "title": "CSS flexbox",
        "intro": [
          "Flexbox es un método de diseño potente y bien soportado que se introdujo con la última versión de CSS, CSS3. Con flexbox, es fácil centrar elementos en la página y crear interfaces de usuario dinámicas que se reducen y se expanden automáticamente.",
          "En este curso, aprenderás los fundamentos de flexbox y diseños dinámicos mediante la construcción de una tarjeta de Twitter."
        ]
      },
      "css-grid": {
        "title": "CSS grid",
        "intro": [
          "La cuadrícula (grid) CSS es un estándar reciente que facilita la creación de diseños complejos y responsivos. Funciona convirtiendo un elemento HTML en una cuadrícula y te permite colocar elementos secundarios en cualquier lugar dentro ella.",
          "En este curso, aprenderá los fundamentos de la cuadrícula (grid) CSS construyendo diferentes diseños complejos, incluido un blog."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Diseño Web Responsivo",
    "intro": [
      "En esta certificación de Diseño Web Adaptativo, aprenderás los lenguajes que los desarrolladores usan para construir páginas web: HTML (Lenguaje de Marcado de Hipertexto) para el contenido, y CSS (hojas de estilo en cascada) para el diseño.",
      "Primero, crearás una aplicación de fotos de gatos para aprender los conceptos básicos de HTML y CSS. Más adelante, aprenderás técnicas modernas como variables CSS, mediante la construcción de un pingüino, y las mejores prácticas para la accesibilidad mediante la construcción de un sitio de cuestionarios.",
      "Por último, aprenderás cómo hacer páginas web que respondan a diferentes tamaños de pantalla, mediante la construcción de una galería de fotos con Flexbox, y un diseño de artículos de revista con CSS Grid."
    ],
    "note": "Nota: Algunas extensiones del navegador, como bloqueadores de anuncios o extensiones de modo oscuro pueden interferir con las pruebas. Si tienes algun problema, te recomendamos deshabilitar las extensiones que modifiquen el contenido de la página, mientras tomas el curso.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Página del homenaje",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, construirás una página de homenaje para un tema de tu elección, ficción o real."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Página web del Portafolio personal",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, construirá su propia página de portafolio personal."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Landing Page del producto",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, usted construirá una página de inicio de producto para comercializar un producto de su elección."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Encuesta",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, construirá un formulario de encuesta para recopilar datos de sus usuarios."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Página de documentación técnica",
        "intro": [
          "Este es uno de los proyectos requeridos para obtener la certificación.",
          "En este proyecto, construirás una página de documentación técnica que sirva de instrucción o de referencia para un tema."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Aprende HTML construyendo una aplicación de fotos de gatos",
        "intro": [
          "Las etiquetas HTML dan a la página su estructura. Puedes usar etiquetas HTML para añadir fotos, botones, y otros elementos en tu página.",
          "En este curso, aprenderás las etiquetas HTML más comunes por medio de la construcción de tu propia aplicación para fotos de gatos."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Aprende CSS básico construyendo un menú de cafetería",
        "intro": [
          "CSS le dice al navegador cómo presentar tu página web. Puedes usar CSS para definir el color, fuente, tamaño, y otros aspectos de los elementos HTML.",
          "En este curso, aprenderás CSS diseñando una página para el menú de la página web de un café."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Aprende el Modelo de Cajas de CSS construyendo una pintura de Rothko",
        "intro": [
          "Cada elemento HTML es su propia caja – con su propio espaciado y borde. A esto se le llama Modelo de Caja.",
          "En este curso, utilizarás CSS y el Modelo de Cajas para crear tus propias piezas de arte rectangulares al estilo de Rothko."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Aprende variables CSS construyendo un horizonte de la ciudad",
        "intro": [
          "Las variables de CSS te ayudan a organizar tus estilos y a reorganizarlos.",
          "En este curso, construirás un horizonte de ciudad. Aprenderás cómo configurar variables de CSS de forma que puedas reusarlas cuando quieras."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Aprende formularios HTML construyendo un formulario de registro",
        "intro": [
          "Puedes hacer uso de formularios HTML para recopilar información de las personas que visitan tu página web.",
          "En este curso, aprenderás formularios de HTML construyendo una página de registro. Aprenderás cómo controlar qué tipo de datos pueden colocarse en tu formulario, y herramientas nuevas de CSS para cambiar el diseño de tu página."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Aprende accesibilidad construyendo un cuestionario",
        "intro": [
          "Accesibilidad es hacer que tu página web sea sencilla de usar para todas las personas, incluyendo a aquellas con discapacidades.",
          "En este curso, construirás una página web de cuestionarios. Aprenderás herramientas de accesibilidad como atajos de teclado, atributos ARIA y mejores prácticas de diseño."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Aprende CSS intermedio construyendo una Pintura Picasso",
        "intro": [
          "En este curso, aprenderás a usar algunas técnicas intermedias de CSS codificando tu propia página web de pintura de Picasso. Aprenderá sobre los iconos SVG, la posición CSS y revisará otras habilidades CSS que haya aprendido."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Aprende diseño web adaptativo construyendo un piano",
        "intro": [
          "El diseño adaptativo indica a tu página web cómo debe verse en pantallas de distintos tamaños.",
          "En este curso, usarás CSS y Diseño Adaptativo para programar un piano. También aprenderás más sobre las consultas de medios y pseudoselectores."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Aprende CSS Flexbox construyendo una galería de fotos",
        "intro": [
          "Flexbox te ayuda a diseñar tu página web para que se vea bien en cualquier tamaño de pantalla.",
          "En este curso, usarás Flexbox para crear una página web de una galería de fotos adaptativa."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Aprende la cuadrícula de CSS construyendo una revista",
        "intro": [
          "CSS Grid le brinda control sobre las filas y columnas del diseño de su página web.",
          "En este curso, construirás un artículo de revista. Aprenderás como usar CSS Grid, incluidos los conceptos como filas de cuadrícula y columnas de cuadrícula."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Aprende tipografía construyendo una etiqueta de nutrición",
        "intro": [
          "La tipografía es el arte de diseñar tu texto haciéndolo de fácil lectura y adaptado a su propósito.",
          "En este curso, usarás tipografía para compilar una página web de etiqueta. Aprenderás cómo estilizar el texto, ajustar altura de línea y la posición de tu texto usando CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Aprende CSS Transforms construyéndo un pingüino",
        "intro": [
          "Puedes transformar elementos HTML para crear diseños atractivos que atraigan la atención de tu lector. Puedes utilizar las transformaciones para girar elementos, escalarlos y mucho más.",
          "En este curso, construirás un pingüino. Utilizarás transformaciones CSS para posicionar y cambiar el tamaño de las partes de tu pingüino, crearás un fondo y animarás tu trabajo."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Aprende a animar con CSS construyendo una noria",
        "intro": [
          "Puedes utilizar la animación CSS para llamar la atención sobre secciones específicas de tu página web y hacerla más atractiva.",
          "En este curso, construirás una noria. Aprenderás a utilizar CSS para animar elementos, transformarlos y ajustar su velocidad."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Aprenda más sobre los pseudo selectores CSS construyendo un balance financiero",
        "intro": [
          "Puede utilizar pseudoselectores CSS para cambiar elementos HTML específicos.",
          "En este curso, construirás un balance usando pseudo selectores. Aprenderás a cambiar el estilo de un elemento al pasar el ratón por encima y a activar otros eventos en tu página web."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Aprenda los colores de CSS construyendo un conjunto de marcadores de colores",
        "intro": [
          "Seleccionar los colores correctos para tu página web puede mejorar enormemente el atractivo estético para tus lectores.",
          "En este curso, construirás un conjunto de marcadores de color. Aprenderás diferentes maneras de establecer valores de color y cómo combinar colores entre sí."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Learn Intermediate CSS by Building a Cat Painting",
        "intro": ["", ""]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Algoritmos de JavaScript y Estructuras de Datos",
    "intro": [
      "Mientras HTML y CSS controlan el contenido y el estilo de una página, JavaScript se utiliza para hacerlo interactivo. En la certificación Algoritmos de JavaScript y Estructuras de Datos, aprenderás los fundamentos de JavaScript incluyendo variables, arreglos, objetos, bucles y funciones.",
      "Una vez que tengas los fundamentos, aplicarás ese conocimiento creando algoritmos para manipular cadenas, factorizar números e incluso calcular la órbita de la Estación Espacial Internacional.",
      "A lo largo del camino, también aprenderás dos estilos o paradigmas importantes de programación: la Programación Orientada a Objetos (OOP), y la Programación Funcional (FP)."
    ],
    "note": "Nota: Algunas extensiones del navegador, como bloqueadores de anuncios o bloqueadores de scripts pueden interferir con las pruebas. Si se te presentan problemas, te recomendamos deshabilitar las extensiones que modifiquen o bloqueen el contenido de la página, mientras tomas el curso.",
    "blocks": {
      "basic-javascript": {
        "title": "JavaScript básico",
        "intro": [
          "JavaScript es un lenguaje de scripting que puedes utilizar para hacer que las páginas web sean interactivas. Es una de las principales tecnologías de la web, junto con HTML y CSS, y es soportada por todos los navegadores modernos.",
          "En este curso, aprenderás conceptos fundamentales de programación en JavaScript. Empezarás con estructuras básicas de datos como números y cadenas. Luego aprenderás a trabajar con arreglos, objetos, funciones, bucles, declaraciones if/else y más."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, o ES, es una versión estandarizada de JavaScript. Debido a que todos los principales navegadores siguen esta especificación, los términos ECMAScript y JavaScript son intercambiables.",
          "La mayoría del JavaScript que has aprendido hasta este punto estaba en ES5 (ECMAScript 5), el cual fue finalizado en 2009. Aunque puedes seguir escribiendo programas en ES5, JavaScript está evolucionando siempre, y cada año se lanzan nuevas funcionalidades.",
          "ES6, lanzado en 2015, agrego muchas nuevas y potentes características al lenguaje. En este curso, aprenderás estas nuevas características, incluyendo let y const, funciones flecha, clases, promesas, y módulos."
        ]
      },
      "regular-expressions": {
        "title": "Expresiones regulares",
        "intro": [
          "Expresiones regulares, a veces acortadas a \"regex\" o \"regexp\", son patrones que ayudan a los programadores a encontrar, buscar, y reemplazar texto. Las expresiones regulares son muy potentes, pero pueden ser difícil de leer porque usan caracteres especiales para hacer coincidencias más complejas y flexibles.",
          "En este curso, aprenderás como usar caracteres especiales, grupos de captura, miradas positivas y negativas, así como otras técnicas para hacer coincidir cualquier texto que quieras."
        ]
      },
      "debugging": {
        "title": "Depuración",
        "intro": [
          "La depuración es el proceso de revisar tu código, encontrando cualquier problema, y arreglándolo.",
          "Los problemas en el código generalmente vienen en tres formas: errores de sintaxis que impiden que tu programa se ejecute, errores de tiempo de ejecución donde tu código tiene un comportamiento inesperado, o errores lógicos donde tu código no hace lo que pretendes.",
          "En este curso, aprenderás como usar la consola de JavaScript para depurar programas y prevenir errores comunes antes de que ocurran."
        ]
      },
      "basic-data-structures": {
        "title": "Estructuras de datos básicas",
        "intro": [
          "Los datos pueden almacenarse y accederse de muchas maneras. Ya conoces algunas estructuras de datos comunes en JavaScript: los arreglos y los objetos.",
          "En este curso de estructuras de datos básicas, aprenderás más acerca de las diferencias entre arreglos y objetos, y cuál usar en diferentes situaciones. También aprenderás como usar métodos útiles de JavaScript como <code>splice()</code> y <code>Object.keys()</code> para acceder y manipular datos."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Programación de algoritmos básicos",
        "intro": [
          "Un algoritmo es una serie de instrucciones paso a paso que describen cómo hacer algo.",
          "Para escribir un algoritmo eficaz, ayuda el dividir un problema en partes más pequeñas y pensar cuidadosamente cómo resolver cada parte con código.",
          "En este curso, aprenderás los fundamentos del pensamiento algorítmico mediante la escritura de algoritmos que hacen de todo, desde la conversión de temperaturas hasta el manejo de arreglos 2D complejos."
        ]
      },
      "object-oriented-programming": {
        "title": "Programación orientada a objetos",
        "intro": [
          "OOP, o programación orientada a objetos, es uno de los principales enfoques del proceso de desarrollo de software. En OOP, los objetos y las clases son utilizadas para organizar código y para describir lo que pueden hacer.",
          "En este curso, aprenderás los principios básicos de OOP en JavaScript incluyendo la palabra clave <code>this</code>, cadenas prototipo, constructores, y herencias."
        ]
      },
      "functional-programming": {
        "title": "Programación funcional",
        "intro": [
          "La programación funcional es otro enfoque común en el desarrollo de software. En programación funcional, el código está organizado en funciones más pequeñas y básicas que se pueden combinar para construir programas de mayor complejidad.",
          "En este curso, aprenderás los conceptos básicos de programación funcional incluyendo funciones puras, cómo evitar mutaciones, y cómo escribir código más limpio con métodos como <code>.map()</code> y <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Programación de algoritmos intermedios",
        "intro": [
          "Ahora que conoces los conceptos básicos del pensamiento algorítmico, junto con la OOP y la programación funcional, prueba tus habilidades con los desafíos de programación de algoritmos intermedios."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "Algoritmos de JavaScript y proyectos de estructuras de datos",
        "intro": [
          "¡Ha llegado el momento de poner tus habilidades de JavaScript a prueba! Estos proyectos son muy similares a los desafíos algorítmicos que has hecho antes, pero más difíciles.",
          "Completa estos 5 proyectos de JavaScript para obtener la certificación algoritmos de JavaScript y estructuras de datos."
        ]
      }
    }
  },
  "2022/javascript-algorithms-and-data-structures": {
    "title": "Algoritmos de JavaScript y estructuras de datos (beta)",
    "intro": ["marcador de posición", "marcador de posición"],
    "note": "",
    "blocks": {
      "build-a-caesars-cipher-project": {
        "title": "Construye un proyecto de cifrado cesar",
        "intro": ["", ""]
      },
      "build-a-cash-register-project": {
        "title": "Construye un proyecto de caja registradora",
        "intro": ["", ""]
      },
      "build-a-palindrome-checker-project": {
        "title": "Construye un proyecto de comprobación de palíndromos",
        "intro": ["", ""]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Construye un proyecto de conversión de números romanos",
        "intro": ["", ""]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Construye un proyecto validador de números de teléfono",
        "intro": ["", ""]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Aprende JavaScript básico construyendo un juego de rol",
        "intro": ["", ""]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Aprende a validar formularios construyendo un contador de calorías",
        "intro": ["", ""]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Aprende programación funcional construyendo una hoja de cálculo",
        "intro": ["", ""]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Aprende métodos en JavaScript moderno para crear tarjetas de equipos de fútbol",
        "intro": ["", ""]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Aprende los Métodos de Arreglo Avanzados construyendo una Calculadora de Estadísticas",
        "intro": ["", ""]
      },
      "learn-data-structures-by-building-a-shopping-cart": {
        "title": "Aprenda estructuras de datos construyendo un carrito de compras",
        "intro": ["", ""]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Aprender Fetch y Promesas construyendo una página de autores de fCC",
        "intro": ["", ""]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Aprenda expresiones regulares mediante la creación de un filtro de spam",
        "intro": ["", ""]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Aprende el pensamiento algorítmico básico construyendo un ordenador de números",
        "intro": ["", ""]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Librerías de desarrollo de la interfaz",
    "intro": [
      "Ahora que estás familiarizado con HTML, CSS y JavaScript, mejora tus habilidades aprendiendo algunas de las librerías de interfaz más populares en la industria.",
      "En la certificación de bibliotecas de desarrollo front-end, aprenderá cómo diseñar su sitio rápidamente con Bootstrap. También aprenderá cómo agregar lógica a sus estilos CSS y extenderlos con Sass.",
      "Después, construirás un carrito de compras y otras aplicaciones para aprender a crear poderosas aplicaciones de página única (SPAs) con React y Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap es un framework front end que se utiliza para diseñar páginas y aplicaciones web adaptativas. Tiene un enfoque de desarrollo web e incluye estilos y clases CSS predefinidos, además de algunas funcionalidades de JavaScript.",
          "En este curso, aprenderás cómo crear sitios web adaptativos con Bootstrap, y utilizarás sus clases incluidas para estilizar botones, imágenes, formularios, navegación y otros elementos."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery es una de las librerías de JavaScript más utilizadas en el mundo.",
          "En 2006, cuando se lanzó, los principales navegadores manejaban JavaScript de forma ligeramente diferente. jQuery simplificó el proceso de escribir JavaScript del lado del cliente, y también garantizó que tu código funcionara de la misma manera en todos los navegadores.",
          "En este curso, aprenderás a usar jQuery para seleccionar, eliminar, copiar y modificar diferentes elementos de la página."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, o \"Syntactically Awesome StyleSheets\", es una extensión del lenguaje CSS. Añade características que no están disponibles en el CSS básico, lo que facilita la simplificación y el mantenimiento de las hojas de estilo de tus proyectos.",
          "En este curso de Sass, aprenderás cómo almacenar datos en variables, anidar CSS, crear estilos reutilizables con mixins, añadir lógica y bucles a tus estilos, y más."
        ]
      },
      "react": {
        "title": "React js",
        "intro": [
          "React es una librería muy popular de JavaScript para construir interfaces de usuario reutilizables controladas por componentes, para páginas web o aplicaciones.",
          "React combina HTML con la funcionalidad de JavaScript para crear su propio lenguaje de marcado llamado JSX. Además, facilita la administración del flujo de datos a través de la aplicación.",
          "En este curso, aprenderás cómo crear diferentes componentes de React, administrar las propiedades de estado de los datos, usar diferentes métodos de ciclo de vida como <code>componentDidMount</code> y mucho más."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "A medida que las aplicaciones crecen en tamaño y alcance, la gestión de datos compartidos se vuelve mucho más difícil. Redux se define como un \"contenedor de estado predecible para aplicaciones de JavaScript\" que ayuda a asegurar que tus aplicaciones funcionen de manera predecible, y sean más fáciles de probar.",
          "Aunque puedes usar Redux con cualquier librería de vistas, aquí introducimos Redux antes de combinarlo con React en los siguientes capítulos del curso.",
          "En este curso, aprenderás los fundamentos de almacenamiento en Redux, así como de las acciones, reductores e intermediarios para administrar datos a lo largo de tu aplicación."
        ]
      },
      "react-and-redux": {
        "title": "React y Redux",
        "intro": [
          "React y Redux se mencionan a menudo juntos, y con razón. El desarrollador que creó Redux era un desarrollador de React que quería hacer más fácil compartir datos a través de diferentes componentes.",
          "Ahora que sabes cómo administrar el flujo de datos compartidos con Redux, es hora de combinar ese conocimiento con React. En los cursos de React y Redux, construirás un componente de React y aprenderás cómo administrar el estado localmente a un nivel de componentes, y a lo largo de toda la aplicación con Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Proyectos de librerías de desarrollo de la interfaz",
        "intro": [
          "Es hora de poner a prueba tus habilidades con las librerías de desarrollo de la interfaz. Usa Bootstrap, jQuery, Sass, React, y Redux para construir 5 proyectos que probarán todo lo que has aprendido hasta este punto.",
          "Completa los 5 proyectos y obtendrás la certificación librerías de desarrollo de la interfaz."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Visualización de Datos",
    "intro": [
      "Los datos están a nuestro alrededor, pero no significan mucho si no tienen forma o contexto.",
      "En la certificación Visualización de Datos, construirás diagramas, gráficos, y mapas para presentar diferentes tipos de datos utilizando la biblioteca D3.js.",
      "También aprenderás acerca de JSON (JavaScript Object Notation), y cómo trabajar con datos en línea usando un API (Application Programing Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Visualización de datos con D3",
        "intro": [
          "D3, o D3.js, significa documentos basados en datos. Es una biblioteca JavaScript para crear visualizaciones de datos dinámicas e interactivas en el navegador.",
          "D3 está construido para trabajar con estándares web comunes – a saber, HTML, CSS y gráficos vectoriales escalables (SVG).",
          "D3 soporta muchos tipos diferentes de formatos de datos de entrada. Luego, usando sus potentes métodos incorporados, puedes transformar esos datos en diferentes diagramas, gráficos y mapas.",
          "En los cursos de Visualización de Datos con D3, aprenderás a trabajar con datos para crear diferentes tablas, gráficos, elementos flotantes y otros elementos para crear visualizaciones de datos dinámicas y atractivas."
        ]
      },
      "json-apis-and-ajax": {
        "title": "APIs JSON y AJAX",
        "intro": [
          "De forma similar a la que las interfaces de usuario \"UI\" ayudan a la gente a usar programas, las APIs (Interfaces de Programación de Aplicación) ayudan a los programas a interactuar con otros programas. Las APIs son herramientas que los ordenadores utilizan para comunicarse entre sí, en parte para enviar y recibir datos.",
          "Los programadores a menudo usan AJAX (Asynchronous JavaScript y XML) cuando trabajan con APIs. AJAX se refiere a un grupo de tecnologías que hacen peticiones asíncronas a un servidor para transferir datos, y luego cargar cualquier dato devuelto en la página. Y los datos transferidos entre el navegador y el servidor suelen estar en un formato llamado JSON (JavaScript Object Notation).",
          "Este curso te enseñará lo básico sobre trabajar con APIs y diferentes tecnologías AJAX en el navegador."
        ]
      },
      "data-visualization-projects": {
        "title": "Proyectos de visualización de datos",
        "intro": [
          "Ahora que has aprendido a trabajar con las tecnologías D3, APIs y AJAX, pon a prueba tus habilidades con estos 5 proyectos de visualización de datos.",
          "En estos proyectos, necesitarás obtener datos y analizar un conjunto de datos y después usar D3 para crear diferentes visualizaciones de datos. Termínalos todos para obtener tu certificación de visualización de datos."
        ]
      },
      "d3-dashboard": {
        "title": "Panel D3",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Base de datos Relacionales",
    "intro": [
      "Para estos cursos, usarás herramientas reales de desarrollador y software incluyendo código VS, PostgreSQL, y la línea de comandos Linux / Unix para completar tutoriales interactivos y construir proyectos.",
      "Estos cursos empiezan con comandos básicos de Base. Utilizando la terminal, aprenderá todo, desde navegar y manipular un sistema de archivos, programar en Bash, hasta el uso avanzado.",
      "A continuación, aprenderá cómo crear y utilizar una base de datos relacional con PostgreSQL, un sistema de gestión de bases de datos, y SQL, el idioma de estas bases de datos.",
      "Por ultimo, aprenderás Git, el sistema de control de version, una herramienta esencial de cada desarrollador."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "Base de datos de cuerpos celestes",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, construirás una base de datos de cuerpos celestes usando PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Juego de adivinanzas de números",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, usarás el script Bash, PostgreSQL, y Git para crear un juego de adivinación de números que se ejecuta en la terminal y guarda información del usuario."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "Base de datos de la Tabla Periódica",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, crearás  Bash un script para obtener información sobre elementos químicos de una base de datos de tabla periódica."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Planificador de citas de salón",
        "intro": [
          "Este es uno de los proyectos necesarios para ganar su certificación.",
          "Para este proyecto, crearás un programa Bash interactivo que utilice PostgreSQL para rastrear los clientes y citas de su salón."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "Base de datos de la Copa del Mundo",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, crearás un script Bash que ingrese información de los juegos de la Copa del Mundo en PostgreSQL, luego consultarás la base de datos para obtener estadísticas útiles."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Aprende Bash Avanzado construyendo un traductor de Kitty Ipsum",
        "intro": [
          "Hay más comandos de Bash de lo que se podría pensar.",
          "En este curso de 140 lecciones, aprenderás algunos comandos más complejos, y los detalles de cómo funcionan los comandos."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Aprende Bash y SQL construyendo una tienda de alquiler de bicicletas",
        "intro": [
          "En este curso de 210 lecciones, construirás un programa interactivo de Bash que almacena información de alquiler para tu tienda de alquiler de bicicletas usando PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Aprende Bash Construyendo una Plantilla",
        "intro": [
          "La terminal le permite enviar comandos de texto a su computadora que pueden manipular el sistema de archivos, ejecutar programas, automatizar tareas y mucho más.",
          "En este curso de 170 lecciones, aprenderá los comandos del terminal creando un boilerplate del sitio web usando sólo la línea de comandos."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Aprende Bash Scripting construyendo cinco programas",
        "intro": [
          "Los scripts Bash combinan comandos de terminal y lógica en programas que pueden ejecutar o automatizar tareas, y mucho más.",
          "En este curso de 220 lecciones, aprenderá más comandos de terminal y cómo usarlos dentro de scripts de Bash creando cinco programas pequeños."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Aprende Git construyendo un objeto de referencia SQL",
        "intro": [
          "Git es un sistema de control de versiones que mantiene un seguimiento de todos los cambios que realiza en su código base.",
          "En este curso de 240 lecciones, aprenderá cómo Git realiza un seguimiento de su código creando un objeto que contiene comandos SQL comúnmente utilizados."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Aprende Nano construyendo un castillo",
        "intro": [
          "Nano es un programa que te permite editar archivos directamente en la terminal.",
          "En este curso de 40 lecciones, aprenderás cómo editar archivos en la terminal con Nano mientras construyes un castillo."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Aprende bases de datos relacionales construyendo una base de datos Mario",
        "intro": [
          "Una base de datos relacional organiza datos en tablas que están enlazadas a través de relaciones.",
          "En este curso de 165 lecciones, aprenderá los fundamentos de una base de datos relacional creando una base de datos PostgreSQL llena de caracteres de videojuego."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Aprender SQL construyendo una base de datos de estudiantes: Parte 1",
        "intro": [
          "SQL, o Query Language, es el lenguaje para comunicarse con una base de datos relacional.",
          "En este curso de 140 lecciones, creará un script Bash que utilice SQL para introducir información sobre sus estudiantes de informática en PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Aprender SQL construyendo una base de datos de estudiantes: Parte 2",
        "intro": [
          "Los comandos SQL join se utilizan para combinar información de múltiples tablas en una base de datos relacional",
          "En este curso de 140 lecciones, completará su base de datos de estudiantes mientras se sumerge más en comandos SQL."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Desarrollo Back End y APIs",
    "intro": [
      "Hasta este punto, solo has usado JavaScript en la parte de front-end para agregar interactividad a una página, resolver los desafíos de algoritmos o construir un SPA. Pero JavaScript también se puede utilizar en el back-end, o servidor, para construir aplicaciones web completas.",
      "Hoy en día, una de las formas populares para construir aplicaciones es a través de microservicios, que son pequeñas aplicaciones modulares que trabajan juntas para formar una aplicación más grande.",
      "En la Certificación Desarrollo de Back End y APIs, aprenderás cómo escribir aplicaciones de back-end con Node.js y npm (Node Package Manager). También construirás aplicaciones web con el framework Express, y un microservicio \"People Finder\" con MongoDB y la biblioteca Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Gestión de paquetes con NPM",
        "intro": [
          "npm (Gestor de Paquetes de Nodos), es una herramienta de línea de comandos para instalar, crear y compartir paquetes de código JavaScript escritos para Node.js. Hay muchos paquetes de código abierto disponibles en npm, así que antes de iniciar un proyecto, tómate algo de tiempo para explorar los diferentes paquetes, para que no termines reinventando la rueda para cosas comunes como trabajar con fechas y obtener datos de una API.",
          "En este curso, aprenderás los conceptos básicos del uso de npm, incluyendo cómo trabajar con el <code>package.json</code> y cómo administrar las dependencias instaladas."
        ]
      },
      "basic-node-and-express": {
        "title": "Node y Express Basico",
        "intro": [
          "Node.js es un entorno de ejecución de JavaScript que permite a desarrolladores escribir programas de backend (lado del servidor) en JavaScript. Node.js viene con muchos módulos integrados — pequeños programas independientes — que ayudan en esto. Algunos de los módulos principales incluyen HTTP, que actúa como un servidor, y sistema de archivos, un módulo para leer y modificar archivos.",
          "En el último conjunto de cursos aprendiste a instalar y administrar paquetes desde npm, que son colecciones de módulos más pequeños. Estos paquetes pueden ayudarte a construir aplicaciones más grandes y complejas.",
          "Express es un framework para aplicaciones web y es uno de los paquetes más populares en npm. Express logra que crear un servidor y manejar el enrutamiento de tu aplicación sea mucho más fácil, ya que realiza cosas como redirigir a las personas a la página correcta cuando visitan un endpoint como <pre>/blog</pre>.",
          "En este curso, aprenderás los fundamentos de Node y Express, incluyendo cómo crear un servidor, servir diferentes archivos y gestionar diferentes peticiones desde el navegador."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB y Mongoose",
        "intro": [
          "MongoDB es una aplicación de base de datos que almacena documentos JSON (o registros) que puede usar en su aplicación. A diferencia de SQL, otro tipo de base de datos, MongoDB es una base de datos no relacional o \"NoSQL\". Esto significa que MongoDB almacena todos los datos asociados dentro de un registro, en lugar de almacenarlos en muchas tablas preestablecidas como en una base de datos SQL.",
          "Mongoose es un paquete npm popular para interactuar con MongoDB. Con Mongoose, puede usar objetos de JavaScript sin formato en lugar de JSON, lo que facilita el trabajo con MongoDB. Además, le permite crear planos para sus documentos llamados esquemas, para que no guarde accidentalmente el tipo de datos incorrecto y provoque errores más adelante.",
          "En los cursos de MongoDB y Mongoose, aprenderás los fundamentos para trabajar con datos persistentes, incluyendo cómo configurar un modelo, guardar, eliminar y encontrar documentos en la base de datos."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Desarrollo Back End y Proyectos APIs",
        "intro": [
          "Ya has trabajado con APIs antes, pero ahora que sabes utilizar npm, Node, Express, MongoDB y Mongoose, es momento de construir la tuya. Haz uso de todo lo que aprendiste hasta ahora para crear 5 microservicios diferentes, los cuales son aplicaciones más pequeñas con ámbito limitado.",
          "Después de crearlas, tendrás 5 interesantes APIs de microservicios que puedes mostrar a amigos, familiares y potenciales empleadores. Oh, y también tendrás una nueva y brillante certificación en Desarrollo de Back End y APIs."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Control de Calidad",
    "intro": [
      "A medida que tus programas o aplicaciones web se vuelven más complejos, querrás probarlos para asegurarte de que los nuevos cambios no rompan su funcionalidad original.",
      "En la certificación de control de calidad, aprenderás a escribir pruebas con Chai para asegurarte de que tus aplicaciones funcionan como esperas.",
      "Luego construirás una aplicación de chat para aprender conceptos avanzados de Node y Express. También usarás Pug como motor de plantillas, Passport para autenticación y Socket.io para la comunicación en tiempo real entre el servidor y los clientes conectados."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Control de calidad y pruebas con Chai",
        "intro": [
          "Chai es una librería de pruebas de JavaScript que te ayuda a confirmar que tu programa todavía se comporta de la manera que esperas después de realizar cambios en tu código.",
          "Usando Chai, puedes escribir pruebas que describan los requisitos de tu programa y ver si tu programa los cumple.",
          "En este curso, aprenderá sobre aserciones, igualdad profunda, veracidad, pruebas de APIs y otros fundamentos para probar aplicaciones JavaScript."
        ]
      },
      "advanced-node-and-express": {
        "title": "Node y Express avanzados",
        "intro": [
          "Ahora es el momento de sumergirse en Node.js y Express.js construyendo una aplicación de chat con un sistema de inicio de sesión.",
          "Para implementar el sistema de inicio de sesión de forma segura, necesitarás aprender acerca de autenticación. Este es el acto de verificar la identidad de una persona o proceso.",
          "En este curso, aprenderás cómo utilizar Passport para administrar la autenticación, Pug para crear plantillas reutilizables para construir rápidamente el front end, y web sockets para comunicación en tiempo real entre los clientes y el servidor."
        ]
      },
      "quality-assurance-projects": {
        "title": "Proyectos de control de calidad",
        "intro": [
          "Ahora que estas versado tanto en el front end como en el back end, es tiempo de aplicar todas tus nuevas habilidades y los conceptos que has aprendido hasta el momento. Construirás 5 aplicaciones web diferentes y escribirás pruebas para cada una de ellas, para estar seguro de que funcionarán y que tus aplicaciones pueden manejar diferentes casos extremos.",
          "Después de completar estos proyectos de Control de Calidad, tendrás 5 proyectos más en tu currículum, y una nueva certificación para mostrar en tu portafolio."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Cálculo Científico con Python",
    "intro": [
      "Hoy en día, Python es uno de los lenguajes de programación más populares y flexibles. Puedes usarlo para todo, desde programas básicos hasta machine learning.",
      "En la certificación de Cálculo Científico con Python, aprenderás los fundamentos de Python tales como: variables, bucles, condicionales, y funciones. Luego, avanzarás rápidamente por estructura de datos complejas, redes, base de datos relacionales y visualización de datos."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python para todos",
        "intro": [
          "Python para todos, es una serie de videocursos gratuitos, que enseña los conceptos básicos del uso de Python 3.",
          "Los cursos fueron creados por el Dr. Charles Severance (también conocido como Dr. Chuck). El es un Profesor de Clínica en la Escuela de Información de la Universidad de Michigan, donde él enseña varios cursos orientados a tecnología, diseño de bases de datos y desarrollo web."
        ]
      },
      "scientific-computing-with-python-projects": {
        "title": "Proyectos de cálculo científico con Python",
        "intro": [
          "Es momento de poner a prueba tus habilidades con Python. Al completar estos proyectos, demostrarás que tienes el conocimiento fundamental de Python y que calificas para la Certificación de cálculo científico con Python."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Análisis de Datos con Python",
    "intro": [
      "El análisis de datos ha existido durante mucho tiempo. Pero hasta hace apenas pocos años, los desarrolladores lo practicaban utilizando herramientas costosas de código cerrado como Tableau. Sin embargo recientemente, Python, SQL y otras librerías abiertas han cambiado el Análisis de Datos para siempre.",
      "En la Certificación de Análisis de Datos con Python, aprenderás los fundamentos del análisis de datos con Python. Al terminar la certificación, sabrás como leer datos de fuentes como CSV y SQL, y como usar librerías tales como Numpy, Pandas, Matplotlib y Seaborn para procesar y visualizar datos."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Análisis de datos con Python",
        "intro": [
          "En esta serie de video cursos, creados por Santiago Basulto, aprenderás todo el proceso de análisis de datos. Leerás datos de múltiples fuentes (CSV, SQL, Excel), procesarás los datos usando NumPy, Pandas y los visualizarás usando Matplotlib y Seaborn,",
          "Además, hemos incluido un curso completo de Jupyter Notebook, y una referencia rápida de Python para actualizar tus habilidades de programación."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Aprende los fundamentos de la librería NumPy en el siguiente video curso creado por Keith Galli.",
          "En este curso aprenderás como trabaja NumPy y como se compara con las listas integradas en Python. Aprenderás también como escribir código con NumPy, indexación, remodelar, estadística aplicada y mucho más."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Proyectos de análisis de datos con Python",
        "intro": [
          "Hay muchas formas de analizar datos con Python. Al completar estos proyectos, demostrarás que tienes los conocimientos fundamentales del análisis de datos con Python.",
          "Termina todos los proyectos para reclamar tu Certificación de Análisis de Datos con Python."
        ]
      }
    }
  },
  "information-security": {
    "title": "Seguridad de la Información",
    "intro": [
      "Con todo lo que hacemos en línea, hay una gran cantidad de información sensible en riesgo: direcciones de correo electrónico, contraseñas, números de teléfono y mucho más.",
      "Con la Certificación de Seguridad de Información, construirás aplicaciones web seguras con HelmetJS para aprender los fundamentos de la protección de la información en línea de la gente.",
      "También construirás un cliente TCP, y un escáner de puertos y Nmap con Python. Esto te ayudará a aprender los fundamentos de las pruebas de penetración - un componente importante para la buena seguridad de la información."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Seguridad de la Información con HelmetJS",
        "intro": [
          "Este curso de programación se enfoca en HelmetJS, un tipo de middleware para aplicaciones basadas en Express que establece automáticamente los encabezados HTTP. De esta forma, se puede prevenir que se pase información sensible entre el servidor y el cliente.",
          "Completar los siguientes cursos, te ayudará a entender como proteger tu página web de comportamiento malicioso."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python para Pruebas de Penetración",
        "intro": [
          "Estos cursos en video te enseñarán pruebas de penetración con Python. También conocidas como pen test, las pruebas de penetración son ataques simulados contra un sistema para revisar vulnerabilidades.",
          "En este curso aprenderás sobre sockets, a crear un servidor y un cliente TCP, a crear un escáner Nmap, y otras herramientas y técnicas que los probadores de penetración utilizan a diario."
        ]
      },
      "information-security-projects": {
        "title": "Proyectos de Seguridad de la Información",
        "intro": [
          "Ahora es tiempo de poner a trabajar tus nuevas habilidades en seguridad de la información. Estos proyectos te darán oportunidad de aplicar tus habilidades, principios y conceptos que has aprendido.",
          "Cuando termines, tendrás muchos proyectos de seguridad de la información en tu currículum, junto con una certificación que podrás mostrar a tus amigos, familiares y empleadores."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Aprendizaje Automático con Python",
    "intro": [
      "Machine learning tiene muchas aplicaciones prácticas que puedes utilizar en tus proyectos o en tu trabajo.",
      "En la certificación de Machine Learning con Python, usarás el framework TensorFlow para construir varias redes neuronales y explorar técnicas más avanzadas como: el procesamiento de lenguaje natural y el aprendizaje por refuerzo.",
      "También te sumergirás en redes neuronales y aprenderás los principios detrás de cómo funcionan las redes neuronales profundas, recurrentes y convolucionales."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "TensorFlow es un framework de código abierto que facilita el aprendizaje automático y el uso de redes neuronales.",
          "El siguiente video curso fue creado por Tim Ruscica, también conocido como “Tech With Tim”. Le ayudará a entender TensorFlow y algunas de sus potentes capacidades."
        ]
      },
      "how-neural-networks-work": {
        "title": "Cómo funcionan las redes neuronales",
        "intro": [
          "Las redes neuronales están en el centro de lo que hoy llamamos inteligencia artificial. Pero históricamente han sido difíciles de entender, especialmente para los principiantes en el campo de aprendizaje de máquinas.",
          "Incluso si eres completamente nuevo en las redes neuronales, estos cursos de video de Brandon Rohrer te harán sentir cómodo con los conceptos y las matemáticas detrás de ellos."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Aprendizaje automático con proyectos Python",
        "intro": [
          "El aprendizaje automático tiene muchas aplicaciones prácticas. Al completar estos proyectos de programación gratuitos y desafiantes, demostrará que tiene un buen conocimiento fundacional de aprendizaje automático, y califica para su certificación de aprendizaje automático con Python."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "Algebra universitaria con Python",
    "intro": [
      "Este curso está diseñado como un semestre de academia. Consiste de videos intructivos, con Google Colaboratory para seguir interactivamente, asignaturas y proyectos competitivos.",
      "A medida que pasas por cada parte de este curso en secuencia, ganarás una comprensión completa de Álgebra y cómo escribir código de Python para resolver problemas de Álgebra.",
      "A lo largo de este curso, también construirá su propio Algebra Colab que podrá utilizar como su calculadora personalizada. Este curso (y el código que escribas aquí) te dará la base para una comprensión más profunda de matemáticas y ciencias de datos."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Aprender ratios y porciones",
        "intro": [
          "Tu viaje comienza aquí a medida que aprendes cómo configurar un libro de notas Colab que puede ejecutar código Python. Luego, utilice el cuaderno para seguir junto con los videos para aprender ratios y proporciones usando Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Aprende cómo resolver X",
        "intro": [
          "Esta unidad se centrará en cómo resolver un número desconocido (a menudo llamado \"x\") usando el código escrito de Álgebra y Python."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Aprende Fracciones y Decimales",
        "intro": [
          "Esta unidad se centrará en convertir decimales a fracciones y porcentajes."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Aprende Funciones y Gráficos",
        "intro": ["Esta unidad te enseñará sobre las funciones matemáticas."]
      },
      "learn-linear-functions": {
        "title": "Aprende funciones lineales",
        "intro": [
          "Esta unidad le mostrará cómo desarrollar ecuaciones lineales desde dos puntos."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Aprende Factores Comunes y Raíces Cuadrados",
        "intro": [
          "En esta unidad, aprenderás a encontrar factores comunes y dividirlos. Esto será útil para simplificar fracciones y factorizar raíces cuadradas."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Calculador de múltiples funciones",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, construirá una calculadora multifuncional."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Aprende cómo graficar los sistemas de ecuaciones",
        "intro": [
          "Esta unidad se centrará en graficar dos ecuaciones en el mismo plano de coordenadas, para que se pueda ver donde se intersectan las líneas."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Aprende a resolver los sistemas de ecuaciones",
        "intro": [
          "En esta unidad, aprenderás a resolver un sistema de dos ecuaciones (con dos variables) sin gráfico. Verás cómo puedes factorizar una ecuación y resolver una determinada variable en Python. Al final de esta unidad, usted será capaz de resolver y graficar el sistema con un bloque de código."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Aprender Aplicaciones de Sistemas Lineales",
        "intro": [
          "En esta unidad, verá cómo puede utilizar el algoritmo que aprendió hasta ahora para resolver problemas del mundo real."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Aprende ecuaciones cuadráticas",
        "intro": [
          "Esta unidad irá más allá de las ecuaciones lineales, para trabajar con exponentes y gráficas parabolas. Aprenderás cómo encontrar puntos clave en las parabolas y cómo resolver ecuaciones cuadráticas."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Calculadora de gráficos",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, se construirá una calculadora de gráficos."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Aprende Gráficos y Polinomios de Padres",
        "intro": [
          "Esta unidad le mostrará muchos tipos diferentes de gráficos \"padres\", los patrones básicos que componen gráficos más complicados. Los polinomios son expresiones matemáticas con \"múltiples cosas\" - las ecuaciones más complicadas que se construyen con patrones básicos. Verás cómo se ven estos gráficos, cómo modificarlos y cómo hacerlo todo con código Python."
        ]
      },
      "build-three-math-games-project": {
        "title": "Tres juegos de matemáticas",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, construirás tres juegos de matemática."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Aprender aplicaciones de negocios de la álgebra universitaria",
        "intro": [
          "Esta unidad le mostrará cómo aplicar sus habilidades de resolución y gráfica para encontrar costos, ingresos y ganancias. Escribirás código para desarrollar una función de demanda desde dos puntos. Verán cómo el precio afecta al gráfico de beneficios y cómo todas estas ecuaciones se relacionan entre sí."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Aprende Interés Simple y Compuesto",
        "intro": [
          "Esta unidad le mostrará cómo calcular los intereses, los pagos de préstamos y el valor estimado de las inversiones. Verás la fórmula matemática y convertirla en código. Debido a que estas fórmulas tienden a ser complicadas, apreciarás tener el código donde puedes modificar unos pocos valores."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Aprender Exponentes y Logaritmos",
        "intro": [
          "Esta unidad le mostrará cómo los exponentes y logaritmos son funciones inversas, y cómo puede utilizar estas funciones en varias aplicaciones."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Calculador Financiero",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, construirá una calculadora financiera."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "Algebra universitaria con Python: Conclusión",
        "intro": [
          "Esta será la última unidad en este curso. Veamos cómo puedes conectar tu conocimiento de matemáticas y Python con datos externos."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Explorador gráfico de datos",
        "intro": [
          "Este es uno de los proyectos necesarios para obtener su certificación.",
          "Para este proyecto, construirá una calculadora financiera."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Preparación de Entrevistas de Programación",
    "intro": [
      "Si está buscando ejercicios gratuitos de programación para prepararse para tu próxima entrevista de trabajo, aquí los tenemos.",
      "Esta sección contiene cientos de desafíos de programación que prueban su conocimiento de algoritmos, estructuras de datos y matemáticas. También tiene una serie de proyectos para llevarse a casa que puede utilizar para fortalecer sus habilidades, o añadir a su portafolio."
    ],
    "note": "El proyecto Euler se ha movido a su propio curso. Vuelve al plan de estudios para ver la lista de cursos que ofrecemos.",
    "blocks": {
      "algorithms": {
        "title": "Algoritmos",
        "intro": [
          "Estos ejercicios de programación gratuita le enseñarán algunos algoritmos comunes que probablemente encontrará en la vida real. Son una gran oportunidad para mejorar su lógica y habilidades de programación.",
          "Estos algoritmos se utilizan frecuentemente en entrevistas de trabajo para probar las habilidades de un candidato. Le daremos explicaciones claras y concisas de cómo funcionan estos diferentes algoritmos para que pueda implementar una solución para cada uno."
        ]
      },
      "data-structures": {
        "title": "Estructuras de datos",
        "intro": [
          "Estos cursos de programación gratuita están pensados para ayudarle a manejar estructuras de datos grandes y complejas con las que todavía no esté familiarizado.",
          "Realizando los cursos siguientes, aprenderás sobre cada tipo de estructura de datos, e implementarás algoritmos para reforzar tu entendimiento de ellos."
        ]
      },
      "take-home-projects": {
        "title": "Proyectos Domiciliarios",
        "intro": [
          "Las entrevistas de programación siempre han sido estresantes. A los solicitantes de empleo a veces se les da un proyecto para llevarse a casa y completarlo fuera de la entrevista. Este tipo de entrevistas normalmente requieren mucho trabajo, pero son una manera genial para que los empleadores vean como podrías desempeñarte en el trabajo.",
          "Construye los proyectos extra, para más práctica. Tómate tu tiempo, hazlos geniales, ponlos en tu currículum o portfolio para mostrarlos a tus posibles empleadores."
        ]
      },
      "rosetta-code": {
        "title": "Rosetta Code",
        "intro": [
          "Sube tu nivel de habilidad de resolución creativa de problemas con estas tareas de programación gratis de la clásica librería de Rosetta Code.",
          "Estos desafíos pueden resultar difíciles, pero empujarán tu lógica de algoritmos a nuevas alturas.",
          "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Atributo: Código Rosetta</a>"
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "El proyecto Odin",
    "intro": [
      "El Proyecto Odin es uno de esos recursos \"Lo que me gustado tener cuando estaba aprendiendo\". ",
      "No todo el mundo tiene acceso a una educación en Ciencias de la Computación o a los fondos para asistir a una escuela intensiva de programación y ninguno de esos fondos es adecuado para todos.",
      "Este proyecto está diseñado para llenar el vacío para las personas que intentan hackear por sí solas pero que todavía quieren una educación de alta calidad."
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Aprender fundamentos de HTML",
        "intro": ["Una descripción debe ser determinada"]
      },
      "top-working-with-text": {
        "title": "Working with Text",
        "intro": ["A description is to be determined"]
      },
      "top-links-and-images": {
        "title": "Links and Images",
        "intro": ["A description is to be determined"]
      },
      "top-build-a-recipe-project": {
        "title": "Aprende fundaciones HTML construyendo una página de receta",
        "intro": ["Una descripción debe ser determinada"]
      },
      "top-learn-css-foundations": {
        "title": "Aprenda fundamentos en CSS",
        "intro": ["Una descripción por determinar"]
      },
      "top-learn-css-foundations-projects": {
        "title": "Aprenda Fundamentos de Proyectos en CSS",
        "intro": ["Una descripción por determinar"]
      },
      "top-learn-css-specificity": {
        "title": "Aprende Especificidad en CSS",
        "intro": ["Una descripción debe ser determinada"]
      },
      "top-the-box-model": {
        "title": "Learn the Box Model",
        "intro": ["Una descripción por determinar"]
      }
    }
  },
  "project-euler": {
    "title": "Proyecto Euler",
    "intro": [
      "Completa los siguientes desafíos de programación de los masivos archivos del Project Euler. Estos fortalecerán tus conocimientos de algoritmos y matemáticas.",
      "Estos problemas varían en dificultad y, para muchos, la experiencia es el aprendizaje inductivo en cadena. Es decir, resolviendo un problema, le expondrá a un nuevo concepto que le permitirá emprender un problema previamente inaccesible. ¿Pueden terminar todos?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Proyectos Euler del 1 a 100",
        "intro": [
          "En este primer conjunto de desafíos, utilizarás conceptos matemáticos como la secuencia de Fibonacci, teoría de números primos, y combinatorios para escribir algoritmos eficientes para resolver estos problemas."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Proyectos Euler del 101 a 200",
        "intro": [
          "En este conjunto de desafíos, basarás las habilidades que aprendiste en la primera parte del curso y usarás conceptos más avanzados como el cálculo del vector, La pirámide, y el algoritmo RSA para resolver estos problemas de forma eficiente."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Proyectos Euler del 201 a 300",
        "intro": [
          "En este conjunto de desafíos, continuarás construyendo sobre las habilidades que aprendiste anteriormente y usarás conceptos como el teorema binomial, Números de estancamiento, y la secuencia de Collatz para desarrollar aún más tus habilidades de matemáticas y resolución de problemas."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Proyectos Euler del 301 a 400",
        "intro": [
          "Aquí continuarás exprimiendo tus habilidades matemáticas y algorítmicas mientras usas conceptos como teoría de juegos combinatorios, las operaciones bitwise y la secuencia autodescriptiva de Golomb para desarrollar soluciones eficientes a estos problemas."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Proyecto Euler Problemas 401 a 480",
        "intro": [
          "En este último conjunto de desafíos, necesitarás aprovechar todo lo que aprendiste hasta este punto y utilizar conceptos avanzados como divisores unitarios, la rutina de Kaprekar y mucho más para resolver estos problemas complejos."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "C# básico con Microsoft",
    "intro": [
      "Este curso ofrece una introducción completa a la programación en C#, abarcando sus conceptos básicos, sintaxis y aplicación práctica en el desarrollo de software.",
      "A través de ejercicios prácticos y proyectos, aprenderá los fundamentos de C#, incluyendo variables, tipos de datos, estructuras de control y principios de programación orientados a objetos.",
      "Al terminar este curso, habras ganado las habilidades prácticas y el conocimiento necesario para aprovechar C#, construyendo aplicaciones robustas y escalables con confianza"
    ],
    "note": "Nota: Debes completar el desafío de trofeos en cada una de las siguientes secciones para calificar para el examen de certificación.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Escribe tu primer código usando C#",
        "intro": [
          "Comienza tu viaje aprendiendo a escribir tu primer codigo usando C#. Desarrolla una base sólida mientras exploras los fundamentos y el sintaxis del lenguaje, establecido el escenario para tus aventuras de programación."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Crea y Ejecuta Aplicaciones de Consola Simples en C#",
        "intro": [
          "Domina el arte de crear y ejecutar aplicaciones simples de consola en C#. Sumérgete en el mundo de programación basada en la consola, donde ganaras experiencia práctica ejecutando tu codigo y viéndolo en acción."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Añadir Logica a Aplicaciones de Consola en C#",
        "intro": [
          "Unlock the power of logic in C# console applications. Learn how to add logic and decision-making capabilities to your code, enabling your applications to make dynamic choices and respond intelligently to different scenarios."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Work with Variable Data in C# Console Applications",
        "intro": [
          "Discover the versatility of variable data in C# console applications. Harness the ability to store and manipulate different types of data, such as numbers and text, as you delve into the essential concepts of variables and data handling."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Create Methods in C# Console Applications",
        "intro": [
          "Take your C# console applications to the next level by mastering the art of creating methods. Learn how to organize and modularize your code, making it more manageable, reusable, and efficient."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Debug C# Console Applications",
        "intro": [
          "Sharpen your troubleshooting skills as you dive into the world of debugging C# console applications. Gain the ability to identify and fix issues in your code, ensuring your applications run smoothly and deliver the desired results."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Foundational C# with Microsoft Certification Exam",
        "intro": [
          "Utiliza lo que has aprendido para aprobar el examen y obtener tu Certificación Fundacional de C# con Microsoft"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Upcoming Python",
    "intro": ["placeholder"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Learn Python by Building a Blackjack Game",
        "intro": ["Learn Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Upcoming Python Project",
        "intro": ["placeholder"]
      }
    }
  },
  "example-certification": {
    "title": "Ejemplo de certificación",
    "intro": ["marcador de posición"],
    "blocks": {
      "example-certification-exam": {
        "title": "Ejemplo de examen de certificación",
        "intro": ["marcador de posición"]
      }
    }
  },
  "misc-text": {
    "certification": "Certificación de {{cert}}",
    "browse-other": "Navega por nuestras otras certificaciones gratuitas\n(recomendamos hacerlo en orden)",
    "courses": "Cursos",
    "steps": "Pasos",
    "expand": "Expandir cursos",
    "collapse": "Contraer curso",
    "legacy-header": "Cursos Antiguos",
    "legacy-desc": "Estos cursos ya no forman parte de la ruta de certificación, pero todavía están disponibles para tu aprendizaje.",
    "legacy-go-back": "Ve a la versión actual del plan de estudios.",
    "course-maintenance": "Estos cursos están en mantenimiento. Si no funcionan, puede aprender a ejecutarlos localmente en <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "Su progreso no se guardará en su cuenta de FreeCodeCamp cuando los ejecute localmente.",
    "go-back-to-learn": "Volver a la versión estable del currículum.",
    "read-database-cert-article": "Por favor, lea este post del foro antes de continuar.",
    "enable-cookies": "Debes habilitar las cookies de terceros antes de comenzar.",
    "english-only": "Los cursos de esta sección solo están disponibles en inglés. Solo podemos traducir los títulos y las introducciones en este momento, no las lecciones en sí mismas."
  }
}
