{
  "msg-1": "Se produjo un error al actualizar su cuenta. Por favor revisa e intenta de nuevo",
  "msg-2": "Hemos actualizado sus preferencias",
  "msg-3": "El formato de correo electrónico no es válido",
  "msg-4": "currentChallengeId no es un ID de desafío válido",
  "msg-5": "El tema no es válido",
  "msg-6": "Tema ya establecido",
  "msg-7": "¡Tu tema ha sido actualizado!",
  "msg-8": "El nombre de usuario ya está asociado a esta cuenta",
  "msg-9": "El nombre de usuario ya está asociado a una cuenta diferente",
  "msg-10": "Hemos actualizado su nombre de usuario a {{username}}",
  "msg-11": "No pudimos cerrar la sesión. Vuelve a intentarlo en un momento.",
  "msg=12": "El correo electrónico codificado en el enlace tiene un formato incorrecto",
  "msg-13": "Vaya, algo no está bien, solicite un enlace nuevo para iniciar sesión / registrarse",
  "msg-14": "Parece que el enlace en el que hizo clic ha caducado. Solicite un enlace nuevo para iniciar sesión.",
  "msg-15": "¡Éxito! Ha iniciado sesión en su cuenta. ¡Feliz codificación!",
  "msg-16": "Nos estamos alejando de la autenticación social por razones de privacidad. La próxima vez, le recomendamos que utilice su dirección de correo electrónico: {{email}} para iniciar sesión.",
  "msg-17": "Necesitamos su nombre para poder incluirlo en su certificación. Agregue su nombre a la configuración de su cuenta y haga clic en el botón Guardar. Entonces podemos emitir su certificación.",
  "msg-18": "Parece que no ha completado los pasos necesarios. Complete los proyectos requeridos para reclamar la certificación {{name}}.",
  "msg-19": "Parece que ya reclamó la certificación {{name}}",
  "msg-20": "@{{username}}, reclamó con éxito la certificación {{name}}. ¡Felicitaciones en nombre del equipo de freeCodeCamp.org!",
  "msg-21": "Se produjo un error con la verificación de {{name}}. Vuelve a intentarlo. Si continúa recibiendo este error, puede enviar un mensaje a support@freeCodeCamp.org para obtener ayuda.",
  "msg-22": "Error al reclamar {{certName}}",
  "msg-23": "No pudimos encontrar un usuario con el nombre de usuario \"{{username}}\"",
  "msg-24": "Este usuario debe agregar su nombre a su cuenta para que otros puedan ver su certificación.",
  "msg-25": "Este usuario no es elegible para las certificaciones de freeCodeCamp.org en este momento.",
  "msg-26": "{{username}} ha optado por hacer que su cartera sea privada. Deberán hacer pública su cartera para que otros puedan ver su certificación.",
  "msg-27": "{{username}} ha optado por hacer que sus certificaciones sean privadas. Deberán hacer públicas sus certificaciones para que otros puedan verlas.",
  "msg-28": "{{username}} aún no está de acuerdo con nuestro compromiso de honestidad académica.",
  "msg-29": "Parece que el usuario {{username}} no está {{cert}} certificado por",
  "msg-30": "Eso no parece ser un envío de desafío válido",
  "msg-31": "No ha proporcionado los enlaces válidos para que inspeccionemos su trabajo.",
  "msg-32": "No se encontró ninguna cuenta social",
  "msg-33": "Cuenta social no válida",
  "msg-34": "No hay cuenta de {{website}} asociada",
  "msg-35": "Has desvinculado correctamente tu {{website}}",
  "msg-36": "Compruebe si ha proporcionado un nombre de usuario y un informe",
  "msg-37": "Se envió un informe al equipo con {{email}} en copia",
  "settings": {
    "username": {
      "invalid": "Nombre de usuario contiene caracteres no válidos",
      "too-short": "El nombre de usuario es demasiado corto",
      "reserved": "El nombre de usuario contiene un código reservado"
    }
  }
}
