{
  "hyek8f": "24,44 em Celsius",
  "rscjup": "26 em Celsius",
  "am2xch": "Uma lista de frases que representam as tarefas a fazer:",
  "6rztdg": "Adicione um registro aqui",
  "to1vwe": "Adicione os métodos handleChange() e submitMessage() aqui",
  "31b7ey": "Adicione o código acima desta linha",
  "c24by8": "Adicione o código abaixo desta linha",
  "jbrt8k": "Adicione a m-ésima linha em newArray",
  "zkh12d": "Depois de passar no experimento do desafio com myString e ver como o agrupamento funciona",
  "mobihi": "Atribua 5 a oopsGlobal aqui",
  "v3ups9": "Chame scale com um argumento aqui",
  "iw4a3a": "Caso 1: o destino não tem filhos",
  "463xp8": "Caso 2: o destino tem um filho",
  "u3inrm": "Caso 3: o destino tem dois filhos",
  "axnbgg": "Altere o código acima desta linha",
  "i2kck7": "Altere o código abaixo desta linha",
  "dlbobn": "Altere esta linha",
  "v127zb": "Verifique os dois consoles para ver a diferença. O console do freeCodeCamp deve ter impresso a variável duas vezes, uma vez para cada teste deste desafio. O console do navegador só deve imprimir a variável uma vez porque você a limpou primeiro.",
  "ejm0ql": "Fechar a terceira aba na janela de vídeo e entrar",
  "iwch6t": "Complete o método abaixo e implemente os outros da mesma forma",
  "hihhyz": "Complete a declaração de retorno:",
  "sdxti5": "Contar os filhos do destino a serem excluídos",
  "wfw6sc": "Criar uma escala x e y",
  "sjw6f4": "Criar a escala aqui",
  "nupsh2": "Cria um array 2-D com m linhas e n colunas de zeros",
  "xfjb3s": "Declare a variável myGlobal abaixo desta linha",
  "htpjk7": "Defina uma constante para os tipos de ação de decremento",
  "tfzdsp": "Defina uma constante para os tipos de ação de incremento",
  "zh20mi": "Defina ADD, addMessage(), messageReducer() e a store aqui:",
  "43qs4c": "Defina um criador de ação para decrementar",
  "nen3qo": "Defina um criador de ação para incrementar",
  "0cwyam": "Defina um criador de ação aqui:",
  "fq0wsg": "Defina uma ação aqui:",
  "tegkqa": "Defina o componente do Container aqui:",
  "b5oihn": "Defina o redutor do contador que incrementará ou decrementará o estado com base na ação que ele recebe",
  "91y4pd": "Defina a store do Redux aqui, passando para ela os redutores",
  "eie1vk": "Defina o redutor raiz aqui",
  "5s7nnl": "Defina a store aqui:",
  "34qe2q": "O dicionário terá os itens do nosso conjunto",
  "2c1wra": "Despache a ação dos dados recebidos aqui",
  "923cpg": "Despache a ação de solicitação aqui",
  "picsyf": "Despache a ação aqui:",
  "ysjr1s": "Exibir o código",
  "kjd1am": "Não mude o estado aqui ou os testes vão falhar",
  "5tx4ow": "Sites de entretenimento",
  "9yu58b": "Exemplo de listas de inventário",
  "ciddtb": "Encontre o valor de destino e seu pai",
  "ixx548": "Corrija o código abaixo para que ele seja avaliado como verdadeiro",
  "6mbhjj": "Exemplo: Redux.createStore()",
  "jshtzq": "Função que retorna uma string representando uma xícara de chá preto",
  "cw1ghf": "Função que retorna uma string representando uma xícara de chá verde",
  "iuccln": "Gera um array preenchido aleatoriamente",
  "bm2mop": "Obtém as abas após a aba",
  "kchz5k": "Obtém as abas antes da aba",
  "bfd23c": "Dada uma função (representando o tipo de chá) e o número de xícaras necessárias, a função\na seguir retorna um array de strings (cada uma representa uma xícara de um tipo específico de chá).",
  "ead98i": "Variável global de contagem:",
  "7zf0i2": "Junte-as",
  "5j2l88": "Vamos criar três janelas no navegador",
  "e843r9": "Vamos abrir uma nova aba por enquanto",
  "5fvehh": "myVar não está definida fora do myLocalScope",
  "qn720a": "Agora, adicione console.clear() antes de seu console.log() para limpar o console do navegador e passar nos testes.",
  "j86mef": "Agora, realize a abertura e o fechamento da aba, assim como outras operações",
  "mk7rvy": "Agora, remova a linha de log do console para passar no teste",
  "n7vm1s": "Altere apenas o código acima desta linha",
  "cvh4x7": "Altere apenas o código abaixo desta linha",
  "lvmnm7": "Abra uma nova aba para memes de gato",
  "avpx79": "Abra o console do navegador.",
  "0b5ps6": "Preenchimento entre o limite do SVG e o gráfico",
  "uemoej": "Coloca um número n de zeros na linha atual para criar as colunas",
  "lm86nf": "Coloca a linha atual, que agora contém n zeros, no array",
  "qscelx": "Os métodos do Redux estão disponíveis a partir de um objeto do Redux",
  "atqiig": "Exiba um elemento input, um button e um ul a partir desta linha",
  "yq81wg": "Exiba um Provedor abaixo desta linha",
  "kxio9j": "responseFromServer está definido como falso para representar uma resposta sem sucesso de um servidor",
  "alh6pw": "responseFromServer está definido como verdadeiro para representar uma resposta de sucesso de um servidor",
  "1cfidd": "responseFromServer representa uma resposta de um servidor",
  "96tntk": "Retorna 30",
  "58a5g7": "Executar e verificar o console",
  "71bus9": "Execute os testes para ver a diferença entre os dois consoles.",
  "7wp46n": "Definição na escala Fahrenheit",
  "oefvg5": "Configuração",
  "mnt4d3": "Deve exibir 'carrot'",
  "fhe9m4": "Sites sociais",
  "za434b": "Gráfico de barras empilhadas de treinamento semanal",
  "7c1fv9": "O gráfico de barras empilhadas vai ficar aqui",
  "r44ovx": "tabs é um array de títulos de cada site aberto na janela",
  "cl8peb": "array de teste:",
  "1xi3cv": "A variável global",
  "3gc01a": "O arquivo main.scss",
  "14kfog": "Este é o nosso método de interseção",
  "d1shtt": "Este é o nosso método de união",
  "pqq6sy": "Este método vai adicionar um elemento ao conjunto",
  "nd2oxy": "Este método vai verificar a presença de um elemento e retornar verdadeiro ou falso",
  "ocm81t": "Este método vai remover um elemento de um conjunto",
  "or9p5p": "Este método vai retornar todos os valores no conjunto",
  "g1608f": "Este método vai retornar o tamanho do conjunto",
  "bheu99": "Isto vai manter o conjunto",
  "x1djjr": "Use console.clear() na próxima linha para limpar o console do navegador.",
  "22ta95": "Use console.log() para imprimir a variável de saída.",
  "owgrP6": "Use as classes ACIMA desta linha",
  "oszrtn": "Use as classes ABAIXO desta linha",
  "w43c7l": "Usar s = [2, 5, 7] seria inválido",
  "pgckoj": "Atribuições de variável",
  "2xiqvv": "Declarações de variável",
  "2sx8zg": "Mantemos um registro do array dentro do objeto",
  "xmjfd8": "Quando você fecha uma aba",
  "es69h6": "Quando você junta duas janelas em apenas uma",
  "fho5t5": "Quando você abre uma nova aba no final",
  "00kcrm": "retorna verdadeiro",
  "sxpg2a": "Sua caixa de correio, unidade e outros locais de trabalho",
  "n4f332": "TAREFA: use um tipo diferente de laço"
}
