{
  "responsive-web-design": {
    "title": "Legacy Responsive Web Design Challenges",
    "intro": [
      "In this Responsive Web Design Certification, you'll learn the languages that developers use to build webpages: HTML (Hypertext Markup Language) for content, and CSS (Cascading Style Sheets) for design.",
      "First, you'll build a cat photo app to learn the basics of HTML and CSS. Later, you'll learn modern techniques like CSS variables by building a penguin, and best practices for accessibility by building a web form.",
      "Finally, you'll learn how to make webpages that respond to different screen sizes by building a Twitter card with Flexbox, and a complex blog layout with CSS Grid."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and dark mode extensions can interfere with the tests. If you face issues, we recommend disabling extensions that modify the content or layout of pages, while taking the course.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "Basic HTML and HTML5",
        "intro": [
          "HTML is a markup language that uses a special syntax or notation to describe the structure of a webpage to the browser. HTML elements usually have opening and closing tags that surround and give meaning to content. For example, different elements can describe text as a heading, paragraph, or list item.",
          "In this course, you'll build a cat photo app to learn some of the most common HTML elements — the building blocks of any webpage."
        ]
      },
      "basic-css": {
        "title": "Basic CSS",
        "intro": [
          "CSS, or Cascading Style Sheets, tell the browser how to display the text and other content that you write in HTML. With CSS, you can control the color, font, size, spacing, and many other aspects of HTML elements.",
          "Now that you've described the structure of your cat photo app, give it some style with CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Applied Visual Design",
        "intro": [
          "Visual design is a combination of typography, color theory, graphics, animation, page layout, and more to help deliver your unique message.",
          "In this course, you'll learn how to apply these different elements of visual design to your webpages."
        ]
      },
      "applied-accessibility": {
        "title": "Applied Accessibility",
        "intro": [
          "In web development, accessibility refers to web content and a UI (user interface) that can be understood, navigated, and interacted with by a broad audience. This includes people with visual, auditory, mobility, or cognitive disabilities.",
          "In this course, you'll learn best practices for building webpages that are accessible to everyone."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Responsive Web Design Principles",
        "intro": [
          "There are many devices that can access the web, and they come in all shapes and sizes. Responsive web design is the practice of designing flexible websites that can respond to different screen sizes, orientations, and resolutions.",
          "In this course, you'll learn how to use CSS to make your webpages look good, no matter what device they're viewed on."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox is a powerful, well-supported layout method that was introduced with the latest version of CSS, CSS3. With flexbox, it's easy to center elements on the page and create dynamic user interfaces that shrink and expand automatically.",
          "In this course, you'll learn the fundamentals of flexbox and dynamic layouts by building a Twitter card."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "The CSS grid is a newer standard that makes it easy to build complex responsive layouts. It works by turning an HTML element into a grid, and lets you place child elements anywhere within.",
          "In this course, you'll learn the fundamentals of CSS grid by building different complex layouts, including a blog."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Responsive Web Design",
    "intro": [
      "In this Responsive Web Design Certification, you'll learn the languages that developers use to build webpages: HTML (Hypertext Markup Language) for content, and CSS (Cascading Style Sheets) for design.",
      "First, you'll build a cat photo app to learn the basics of HTML and CSS. Later, you'll learn modern techniques like CSS variables by building a penguin, and best practices for accessibility by building a quiz site.",
      "Finally, you'll learn how to make webpages that respond to different screen sizes by building a photo gallery with Flexbox, and a magazine article layout with CSS Grid."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and dark mode extensions can interfere with the tests. If you face issues, we recommend disabling extensions that modify the content or layout of pages, while taking the course.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Tribute Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a tribute page for a subject of your choosing, fictional or real."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Personal Portfolio Webpage",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build your own personal portfolio page."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Product Landing Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a product landing page to market a product of your choice."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Survey Form",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a survey form to collect data from your users."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Technical Documentation Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a technical documentation page to serve as instruction or reference for a topic."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Learn HTML by Building a Cat Photo App",
        "intro": [
          "HTML tags give a webpage its structure. You can use HTML tags to add photos, buttons, and other elements to your webpage.",
          "In this course, you'll learn the most common HTML tags by building your own cat photo app."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Learn Basic CSS by Building a Cafe Menu",
        "intro": [
          "CSS tells the browser how to display your webpage. You can use CSS to set the color, font, size, and other aspects of HTML elements.",
          "In this course, you'll learn CSS by designing a menu page for a cafe webpage."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Learn the CSS Box Model by Building a Rothko Painting",
        "intro": [
          "Every HTML element is its own box – with its own spacing and a border. This is called the Box Model.",
          "In this course, you'll use CSS and the Box Model to create your own Rothko-style rectangular art pieces."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Learn CSS Variables by Building a City Skyline",
        "intro": [
          "CSS variables help you organize your styles and reuse them.",
          "In this course, you'll build a city skyline. You'll learn how to configure CSS variables so you can reuse them whenever you want."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Learn HTML Forms by Building a Registration Form",
        "intro": [
          "You can use HTML forms to collect information from people who visit your webpage.",
          "In this course, you'll learn HTML forms by building a signup page. You'll learn how to control what types of data people can type into your form, and some new CSS tools for styling your page."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Learn Accessibility by Building a Quiz",
        "intro": [
          "Accessibility is making your webpage easy for all people to use – even people with disabilities.",
          "In this course, you'll build a quiz webpage. You'll learn accessibility tools such as keyboard shortcuts, ARIA attributes, and design best practices."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Learn Intermediate CSS by Building a Picasso Painting",
        "intro": [
          "In this course, you'll learn how to use some intermediate CSS techniques by coding your own Picasso painting webpage. You'll learn about SVG icons, CSS positioning, and review other CSS skills you've learned."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Learn Responsive Web Design by Building a Piano",
        "intro": [
          "Responsive Design tells your webpage how it should look on different-sized screens.",
          "In this course, you'll use CSS and Responsive Design to code a piano. You'll also learn more about media queries and pseudo selectors."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Learn CSS Flexbox by Building a Photo Gallery",
        "intro": [
          "Flexbox helps you design your webpage so that it looks good on any screen size.",
          "In this course, you'll use Flexbox to build a responsive photo gallery webpage."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Learn CSS Grid by Building a Magazine",
        "intro": [
          "CSS Grid gives you control over the rows and columns of your webpage design.",
          "In this course, you'll build a magazine article. You'll learn how to use CSS Grid, including concepts like grid rows and grid columns."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Learn Typography by Building a Nutrition Label",
        "intro": [
          "Typography is the art of styling your text to be easily readable and suit its purpose.",
          "In this course, you'll use typography to build a nutrition label webpage. You'll learn how to style text, adjust line height, and position your text using CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Learn CSS Transforms by Building a Penguin",
        "intro": [
          "You can transform HTML elements to create appealing designs that draw your reader's eye. You can use transforms to rotate elements, scale them, and more.",
          "In this course, you'll build a penguin. You'll use CSS transforms to position and resize the parts of your penguin, create a background, and animate your work."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Learn CSS Animation by Building a Ferris Wheel",
        "intro": [
          "You can use CSS animation to draw attention to specific sections of your webpage and make it more engaging.",
          "In this course, you'll build a Ferris wheel. You'll learn how to use CSS to animate elements, transform them, and adjust their speed."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Learn More About CSS Pseudo Selectors By Building A Balance Sheet",
        "intro": [
          "You can use CSS pseudo selectors to change specific HTML elements.",
          "In this course, you'll build a balance sheet using pseudo selectors. You'll learn how to change the style of an element when you hover over it with your mouse, and trigger other events on your webpage."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Learn CSS Colors by Building a Set of Colored Markers",
        "intro": [
          "Selecting the correct colors for your webpage can greatly improve the aesthetic appeal to your readers.",
          "In this course, you'll build a set of colored markers. You'll learn different ways to set color values and how to pair colors with each other."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Learn Intermediate CSS by Building a Cat Painting",
        "intro": ["", ""]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "JavaScript Algorithms and Data Structures",
    "intro": [
      "While HTML and CSS control the content and styling of a page, JavaScript is used to make it interactive. In the JavaScript Algorithm and Data Structures Certification, you'll learn the fundamentals of JavaScript including variables, arrays, objects, loops, and functions.",
      "Once you have the fundamentals down, you'll apply that knowledge by creating algorithms to manipulate strings, factorialize numbers, and even calculate the orbit of the International Space Station.",
      "Along the way, you'll also learn two important programming styles or paradigms: Object Oriented Programming (OOP) and Functional Programming (FP)."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and script-blockers can interfere with the tests. If you face issues, we recommend disabling extensions that modify or block the content of pages while taking the course.",
    "blocks": {
      "basic-javascript": {
        "title": "Basic JavaScript",
        "intro": [
          "JavaScript is a scripting language you can use to make web pages interactive. It is one of the core technologies of the web, along with HTML and CSS, and is supported by all modern browsers.",
          "In this course, you'll learn fundamental programming concepts in JavaScript. You'll start with basic data structures like numbers and strings. Then you'll learn to work with arrays, objects, functions, loops, if/else statements, and more."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, or ES, is a standardized version of JavaScript. Because all major browsers follow this specification, the terms ECMAScript and JavaScript are interchangeable.",
          "Most of the JavaScript you've learned up to this point was in ES5 (ECMAScript 5), which was finalized in 2009. While you can still write programs in ES5, JavaScript is constantly evolving, and new features are released every year.",
          "ES6, released in 2015, added many powerful new features to the language. In this course, you'll learn these new features, including arrow functions, destructuring, classes, promises, and modules."
        ]
      },
      "regular-expressions": {
        "title": "Regular Expressions",
        "intro": [
          "Regular expressions, often shortened to \"regex\" or \"regexp\", are patterns that help programmers match, search, and replace text. Regular expressions are very powerful, but can be hard to read because they use special characters to make more complex, flexible matches.",
          "In this course, you'll learn how to use special characters, capture groups, positive and negative lookaheads, and other techniques to match any text you want."
        ]
      },
      "debugging": {
        "title": "Debugging",
        "intro": [
          "Debugging is the process of going through your code, finding any issues, and fixing them.",
          "Issues in code generally come in three forms: syntax errors that prevent your program from running, runtime errors where your code has unexpected behavior, or logical errors where your code doesn't do what you intended.",
          "In this course, you'll learn how to use the JavaScript console to debug programs and prevent common issues before they happen."
        ]
      },
      "basic-data-structures": {
        "title": "Basic Data Structures",
        "intro": [
          "Data can be stored and accessed in many ways. You already know some common JavaScript data structures — arrays and objects.",
          "In this Basic Data Structures course, you'll learn more about the differences between arrays and objects, and which to use in different situations. You'll also learn how to use helpful JS methods like <code>splice()</code> and <code>Object.keys()</code> to access and manipulate data."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Basic Algorithm Scripting",
        "intro": [
          "An algorithm is a series of step-by-step instructions that describe how to do something.",
          "To write an effective algorithm, it helps to break a problem down into smaller parts and think carefully about how to solve each part with code.",
          "In this course, you'll learn the fundamentals of algorithmic thinking by writing algorithms that do everything from converting temperatures to handling complex 2D arrays."
        ]
      },
      "object-oriented-programming": {
        "title": "Object Oriented Programming",
        "intro": [
          "OOP, or Object Oriented Programming, is one of the major approaches to the software development process. In OOP, objects and classes organize code to describe things and what they can do.",
          "In this course, you'll learn the basic principles of OOP in JavaScript, including the <code>this</code> keyword, prototype chains, constructors, and inheritance."
        ]
      },
      "functional-programming": {
        "title": "Functional Programming",
        "intro": [
          "Functional Programming is another popular approach to software development. In Functional Programming, code is organized into smaller, basic functions that can be combined to build complex programs.",
          "In this course, you'll learn the core concepts of Functional Programming including pure functions, how to avoid mutations, and how to write cleaner code with methods like <code>.map()</code> and <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Intermediate Algorithm Scripting",
        "intro": [
          "Now that you know the basics of algorithmic thinking, along with OOP and Functional Programming, test your skills with the Intermediate Algorithm Scripting challenges."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "JavaScript Algorithms and Data Structures Projects",
        "intro": [
          "This is it — time to put your new JavaScript skills to work. These projects are similar to the algorithm scripting challenges you've done before – just much more difficult.",
          "Complete these 5 JavaScript projects to earn the JavaScript Algorithms and Data Structures certification."
        ]
      }
    }
  },
  "2022/javascript-algorithms-and-data-structures": {
    "title": "JavaScript Algorithms and Data Structures (Beta)",
    "intro": ["placeholder", "placeholder"],
    "note": "",
    "blocks": {
      "build-a-caesars-cipher-project": {
        "title": "Build a Caesars Cipher Project",
        "intro": ["", ""]
      },
      "build-a-cash-register-project": {
        "title": "Build a Cash Register Project",
        "intro": ["", ""]
      },
      "build-a-palindrome-checker-project": {
        "title": "Build a Palindrome Checker Project",
        "intro": ["", ""]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Build a Roman Numeral Converter Project",
        "intro": ["", ""]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Build a Telephone Number Validator Project",
        "intro": ["", ""]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Learn Basic JavaScript by Building a Role Playing Game",
        "intro": ["", ""]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Learn Form Validation by Building a Calorie Counter",
        "intro": ["", ""]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Learn Functional Programming by Building a Spreadsheet",
        "intro": ["", ""]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Learn Modern JavaScript Methods By Building Football Team Cards",
        "intro": ["", ""]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Learn Advanced Array Methods by Building a Statistics Calculator",
        "intro": ["", ""]
      },
      "learn-data-structures-by-building-a-shopping-cart": {
        "title": "Learn Data Structures By Building A Shopping Cart",
        "intro": ["", ""]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Learn Fetch and Promises By Building an fCC Authors Page",
        "intro": ["", ""]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Learn Regular Expressions by Building a Spam Filter",
        "intro": ["", ""]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Learn Basic Algorithmic Thinking by Building a Number Sorter",
        "intro": ["", ""]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Front End Development Libraries",
    "intro": [
      "Now that you're familiar with HTML, CSS, and JavaScript, level up your skills by learning some of the most popular front end libraries in the industry.",
      "In the Front End Development Libraries Certification, you'll learn how to style your site quickly with Bootstrap. You'll also learn how to add logic to your CSS styles and extend them with Sass.",
      "Later, you'll build a shopping cart and other applications to learn how to create powerful Single Page Applications (SPAs) with React and Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap is a front end framework used to design responsive web pages and applications. It takes a mobile-first approach to web development, and includes pre-built CSS styles and classes, plus some JavaScript functionality.",
          "In this course, you'll learn how to build responsive websites with Bootstrap, and use its included classes to style buttons, images, forms, navigation, and other common elements."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery is one of the most widely used JavaScript libraries in the world.",
          "In 2006 when it was released, all major browsers handled JavaScript slightly differently. jQuery simplified the process of writing client-side JavaScript, and also ensured that your code worked the same way in all browsers.",
          "In this course, you'll learn how to use jQuery to select, remove, clone, and modify different elements on the page."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, or \"Syntactically Awesome StyleSheets\", is a language extension of CSS. It adds features that aren't available in basic CSS, which make it easier for you to simplify and maintain the style sheets for your projects.",
          "In this Sass course, you'll learn how to store data in variables, nest CSS, create reusable styles with mixins, add logic and loops to your styles, and more."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React is a popular JavaScript library for building reusable, component-driven user interfaces for web pages or applications.",
          "React combines HTML with JavaScript functionality into its own markup language called JSX. React also makes it easy to manage the flow of data throughout the application.",
          "In this course, you'll learn how to create different React components, manage data in the form of state props, use different lifecycle methods like <code>componentDidMount</code>, and much more."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "As applications grow in size and scope, managing shared data becomes much more difficult. Redux is defined as a \"predictable state container for JavaScript apps\" that helps ensure your apps work predictably, and are easier to test.",
          "While you can use Redux with any view library, we introduce Redux here before combining it with React in the next set of courses.",
          "In this course, you'll learn the fundamentals of Redux stores, actions, reducers and middleware to manage data throughout your application."
        ]
      },
      "react-and-redux": {
        "title": "React and Redux",
        "intro": [
          "React and Redux are often mentioned together, and with good reason. The developer who created Redux was a React developer who wanted to make it easier to share data across different components.",
          "Now that you know how to manage the flow of shared data with Redux, it's time to combine that knowledge with React. In the React and Redux courses, you'll build a React component and learn how to manage state locally at the component level, and throughout the entire application with Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Front End Development Libraries Projects",
        "intro": [
          "It's time to put your front end development libraries skills to the test. Use Bootstrap, jQuery, Sass, React, and Redux to build 5 projects that will test everything you've learned up to this point.",
          "Complete all 5 projects, and you'll earn the Front End Development Libraries certification."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Data Visualization",
    "intro": [
      "Data is all around us, but it doesn't mean much without shape or context.",
      "In the Data Visualization Certification, you'll build charts, graphs, and maps to present different types of data with the D3.js library.",
      "You'll also learn about JSON (JavaScript Object Notation), and how to work with data online using an API (Application Programming Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Data Visualization with D3",
        "intro": [
          "D3, or D3.js, stands for Data Driven Documents. It's a JavaScript library for creating dynamic and interactive data visualizations in the browser.",
          "D3 is built to work with common web standards – namely HTML, CSS, and Scalable Vector Graphics (SVG).",
          "D3 supports many different kinds of input data formats. Then, using its powerful built-in methods, you can transform those data into different charts, graphs, and maps.",
          "In the Data Visualization with D3 courses, you'll learn how to work with data to create different charts, graphs, hover elements, and other ingredients to create dynamic and attractive data visualizations."
        ]
      },
      "json-apis-and-ajax": {
        "title": "JSON APIs and AJAX",
        "intro": [
          "Similar to how UIs help people use programs, APIs (Application Programming Interfaces) help programs interact with other programs. APIs are tools that computers use to communicate with one another, in part to send and receive data.",
          "Programmers often use AJAX (Asynchronous JavaScript and XML) when working with APIs. AJAX refers to a group of technologies that make asynchronous requests to a server to transfer data, then load any returned data into the page. And the data transferred between the browser and server is often in a format called JSON (JavaScript Object Notation).",
          "This course will teach you the basics about working with APIs and different AJAX technologies in the browser."
        ]
      },
      "data-visualization-projects": {
        "title": "Data Visualization Projects",
        "intro": [
          "Now that you learned how to work with D3, APIs, and AJAX technologies, put your skills to the test with these 5 Data Visualization projects.",
          "In these projects, you'll need to fetch data and parse a dataset, then use D3 to create different data visualizations. Finish them all to earn your Data Visualization certification."
        ]
      },
      "d3-dashboard": {
        "title": "D3 Dashboard",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Relational Database",
    "intro": [
      "For these courses, you will use real developer tools and software including VS Code, PostgreSQL, and the Linux / Unix command line to complete interactive tutorials and build projects.",
      "These courses start off with basic Bash commands. Using the terminal, you will learn everything from navigating and manipulating a file system, scripting in Bash, all the way to advanced usage.",
      "Next, you will learn how to create and use a relational database with PostgreSQL, a database management system, and SQL, the language of these databases.",
      "Finally, you will learn Git, the version control system, an essential tool of every developer."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "Celestial Bodies Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a database of celestial bodies using PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Number Guessing Game",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will use Bash scripting, PostgreSQL, and Git to create a number guessing game that runs in the terminal and saves user information."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "Periodic Table Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create Bash a script to get information about chemical elements from a periodic table database."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Salon Appointment Scheduler",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create an interactive Bash program that uses PostgreSQL to track the customers and appointments for your salon."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "World Cup Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create a Bash script that enters information from World Cup games into PostgreSQL, then query the database for useful statistics."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Learn Advanced Bash by Building a Kitty Ipsum Translator",
        "intro": [
          "There's more to Bash commands than you might think.",
          "In this 140-lesson course, you will learn some more complex commands, and the details of how commands work."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Learn Bash and SQL by Building a Bike Rental Shop",
        "intro": [
          "In this 210-lesson course, you will build an interactive Bash program that stores rental information for your bike rental shop using PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Learn Bash by Building a Boilerplate",
        "intro": [
          "The terminal allows you to send text commands to your computer that can manipulate the file system, run programs, automate tasks, and much more.",
          "In this 170-lesson course, you will learn terminal commands by creating a website boilerplate using only the command line."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Learn Bash Scripting by Building Five Programs",
        "intro": [
          "Bash scripts combine terminal commands and logic into programs that can execute or automate tasks, and much more.",
          "In this 220-lesson course, you will learn more terminal commands and how to use them within Bash scripts by creating five small programs."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Learn Git by Building an SQL Reference Object",
        "intro": [
          "Git is a version control system that keeps track of all the changes you make to your codebase.",
          "In this 240-lesson course, you will learn how Git keeps track of your code by creating an object containing commonly used SQL commands."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Learn Nano by Building a Castle",
        "intro": [
          "Nano is a program that allows you to edit files right in the terminal.",
          "In this 40-lesson course, you will learn how to edit files in the terminal with Nano while building a castle."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Learn Relational Databases by Building a Mario Database",
        "intro": [
          "A relational database organizes data into tables that are linked together through relationships.",
          "In this 165-lesson course, you will learn the basics of a relational database by creating a PostgreSQL database filled with video game characters."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Learn SQL by Building a Student Database: Part 1",
        "intro": [
          "SQL, or Structured Query Language, is the language for communicating with a relational database.",
          "In this 140-lesson course, you will create a Bash script that uses SQL to enter information about your computer science students into PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Learn SQL by Building a Student Database: Part 2",
        "intro": [
          "SQL join commands are used to combine information from multiple tables in a relational database",
          "In this 140-lesson course, you will complete your student database while diving deeper into SQL commands."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Back End Development and APIs",
    "intro": [
      "Until this point, you've only used JavaScript on the front end to add interactivity to a page, solve algorithm challenges, or build an SPA. But JavaScript can also be used on the back end, or server, to build entire web applications.",
      "Today, one of the popular ways to build applications is through microservices, which are small, modular applications that work together to form a larger whole.",
      "In the Back End Development and APIs Certification, you'll learn how to write back end apps with Node.js and npm. You'll also build web applications with the Express framework, and build a People Finder microservice with MongoDB and the Mongoose library."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Managing Packages with NPM",
        "intro": [
          "npm (Node Package Manager), is a command line tool to install, create, and share packages of JavaScript code written for Node.js. There are many open source packages available on npm, so before starting a project, take some time to explore so you don't end up recreating the wheel for things like working with dates or fetching data from an API.",
          "In this course, you'll learn the basics of using npm, including how to work with the <code>package.json</code> and how to manage your installed dependencies."
        ]
      },
      "basic-node-and-express": {
        "title": "Basic Node and Express",
        "intro": [
          "Node.js is a JavaScript runtime that allows developers to write backend (server-side) programs in JavaScript. Node.js comes with a handful of built-in modules — small, independent programs — that help with this. Some of the core modules include HTTP, which acts like a server, and File System, a module to read and modify files.",
          "In the last set of courses you learned to install and manage packages from npm, which are collections of smaller modules. These packages can help you build larger, more complex applications.",
          "Express is a lightweight web application framework, and is one of the most popular packages on npm. Express makes it much easier to create a server and handle routing for your application, which handles things like directing people to the correct page when they visit a certain endpoint like <pre>/blog</pre>.",
          "In this course, you'll learn the basics of Node and Express including how to create a server, serve different files, and handle different requests from the browser."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB and Mongoose",
        "intro": [
          "MongoDB is a database application that stores JSON documents (or records) that you can use in your application. Unlike SQL, another type of database, MongoDB is a non-relational or \"NoSQL\" database. This means MongoDB stores all associated data within one record, instead of storing it across many preset tables as in a SQL database.",
          "Mongoose is a popular npm package for interacting with MongoDB. With Mongoose, you can use plain JavaScript objects instead of JSON, which makes it easier to work with MongoDB. Also, it allows you to create blueprints for your documents called schemas, so you don't accidentally save the wrong type of data and cause bugs later.",
          "In the MongoDB and Mongoose courses, you'll learn the fundamentals of working with persistent data including how to set up a model, and save, delete, and find documents in the database."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Back End Development and APIs Projects",
        "intro": [
          "You've worked with APIs before, but now that you know npm, Node, Express, MongoDB, and Mongoose, it's time to build your own. Draw on everything you've learned up to this point to create 5 different microservices, which are smaller applications that are limited in scope.",
          "After creating these, you'll have 5 cool microservice APIs you can show off to friends, family, and potential employers. Oh, and you'll have a shiny new Back End Development and APIs Certification, too."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Quality Assurance",
    "intro": [
      "As your programs or web applications become more complex, you'll want to test them to make sure that new changes don't break their original functionality.",
      "In the Quality Assurance Certification, you'll learn how to write tests with Chai to ensure your applications work the way you expect them to.",
      "Then you'll build a chat application to learn advanced Node and Express concepts. You'll also use Pug as a template engine, Passport for authentication, and Socket.io for real-time communication between the server and connected clients."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Quality Assurance and Testing with Chai",
        "intro": [
          "Chai is a JavaScript testing library that helps you confirm that your program still behaves the way you expect it to after you make changes to your code.",
          "Using Chai, you can write tests that describe your program's requirements and see if your program meets them.",
          "In this course, you'll learn about assertions, deep equality, truthiness, testing APIs, and other fundamentals for testing JavaScript applications."
        ]
      },
      "advanced-node-and-express": {
        "title": "Advanced Node and Express",
        "intro": [
          "Now it's time to take a deep dive into Node.js and Express.js by building a chat application with a sign-in system.",
          "To implement the sign-in system safely, you'll need to learn about authentication. This is the act of verifying the identity of a person or process.",
          "In this course, you'll learn how to use Passport to manage authentication, Pug to create reusable templates for quickly building the front end, and web sockets for real-time communication between the clients and server."
        ]
      },
      "quality-assurance-projects": {
        "title": "Quality Assurance Projects",
        "intro": [
          "Now that you're well versed in both the front end and back end, it's time to apply all the skills and concepts you've learned up to this point. You'll build 5 different web applications, and write tests for each one to make sure they're working and can handle different edge cases.",
          "After completing these Quality Assurance projects, you'll have 5 more projects under your belt, and a new certification to show off on your portfolio."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Scientific Computing with Python",
    "intro": [
      "Python is one of the most popular, flexible programming languages today. You can use it for everything from basic scripting to machine learning.",
      "In the Scientific Computing with Python Certification, you'll learn Python fundamentals like variables, loops, conditionals, and functions. Then you'll quickly ramp up to complex data structures, networking, relational databases, and data visualization."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python for Everybody",
        "intro": [
          "Python for everybody is a free video course series that teaches the basics of using Python 3.",
          "The courses were created by Dr. Charles Severance (also known as Dr. Chuck). He is a Clinical Professor at the University of Michigan School of Information, where he teaches various technology-oriented courses including programming, database design, and web development."
        ]
      },
      "scientific-computing-with-python-projects": {
        "title": "Scientific Computing with Python Projects",
        "intro": [
          "Time to put your Python skills to the test. By completing these projects, you will demonstrate that you have a good foundational knowledge of Python and qualify for the Scientific Computing with Python Certification."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Data Analysis with Python",
    "intro": [
      "Data Analysis has been around for a long time. But up until a few years ago, developers practiced it using expensive, closed-source tools like Tableau. But recently, Python, SQL, and other open libraries have changed Data Analysis forever.",
      "In the Data Analysis with Python Certification, you'll learn the fundamentals of data analysis with Python. By the end of this certification, you'll know how to read data from sources like CSVs and SQL, and how to use libraries like Numpy, Pandas, Matplotlib, and Seaborn to process and visualize data."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Data Analysis with Python",
        "intro": [
          "In these comprehensive video courses, created by Santiago Basulto, you will learn the whole process of data analysis. You'll be reading data from multiple sources (CSV, SQL, Excel), process that data using NumPy and Pandas, and visualize it using Matplotlib and Seaborn,",
          "Additionally, we've included a thorough Jupyter Notebook course, and a quick Python reference to refresh your programming skills."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Learn the basics of the NumPy library in the following video course created by Keith Galli.",
          "In this course, you'll learn how NumPy works and how it compares to Python's built-in lists. You'll also learn how to write code with NumPy, indexing, reshaping, applied statistics, and much more."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Data Analysis with Python Projects",
        "intro": [
          "There are many ways to analyze data with Python. By completing these projects, you will demonstrate that you have a good foundational knowledge of data analysis with Python.",
          "Finish them all to claim your Data Analysis with Python certification."
        ]
      }
    }
  },
  "information-security": {
    "title": "Information Security",
    "intro": [
      "With everything we do online, there's a vast amount of sensitive information at risk: email addresses, passwords, phone numbers, and much more.",
      "With the Information Security Certification, you'll build a secure web app with HelmetJS to learn the fundamentals of protecting people's information online.",
      "You'll also build a TCP client, and an Nmap and port scanner in Python. This will help you learn the basics of penetration testing — an important component of good information security."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Information Security with HelmetJS",
        "intro": [
          "This programming course focuses on HelmetJS, a type of middleware for Express-based applications that automatically sets HTTP headers. This way it can prevent sensitive information from unintentionally being passed between the server and client.",
          "Completing the courses below will help you understand how to protect your website from malicious behavior."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python for Penetration Testing",
        "intro": [
          "These video courses teach you penetration testing with Python. Also known as a pen test, penetration testing is a simulated attack against a system to check for vulnerabilities.",
          "In this course, you'll learn about sockets, create a TCP server and client, build an Nmap scanner, and other tools and techniques that pen testers use daily."
        ]
      },
      "information-security-projects": {
        "title": "Information Security Projects",
        "intro": [
          "Now it’s time to put your new information security skills to work. These projects will give you a chance to apply the infosec skills, principles, and concepts you've learned.",
          "When you are done, you will have plenty of information security projects under your belt, along with a certification that you can show off to friends, family, and employers."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Machine Learning with Python",
    "intro": [
      "Machine learning has many practical applications that you can use in your projects or on the job.",
      "In the Machine Learning with Python Certification, you'll use the TensorFlow framework to build several neural networks and explore more advanced techniques like natural language processing and reinforcement learning.",
      "You'll also dive into neural networks, and learn the principles behind how deep, recurrent, and convolutional neural networks work."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "TensorFlow is an open source framework that makes machine learning and neural networking easier to use.",
          "The following video course was created by Tim Ruscica, also known as “Tech With Tim”. It will help you to understand TensorFlow and some of its powerful capabilities."
        ]
      },
      "how-neural-networks-work": {
        "title": "How Neural Networks Work",
        "intro": [
          "Neural networks are at the core of what we call artificial intelligence today. But historically they've been hard to understand. Especially for beginners in the machine learning field.",
          "Even if you are completely new to neural networks, these video courses by Brandon Rohrer will get you comfortable with the concepts and the math behind them."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Machine Learning with Python Projects",
        "intro": [
          "Machine learning has many practical applications. By completing these free and challenging coding projects, you will demonstrate that you have a good foundational knowledge of machine learning, and qualify for your Machine Learning with Python certification."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "College Algebra with Python",
    "intro": [
      "This course is designed as a one-semester college course. It consists of instructional videos, with Google Colaboratory notebooks to follow along interactively, assignments, and challenging projects.",
      "As you go through each part of this course in sequence, you will gain a full understanding of Algebra and how to write Python code to solve Algebra problems.",
      "Throughout this course, you will also build your own Algebra Colab notebook that you will be able to use as your custom calculator. This course (and the code you write here) will give you the foundation for a deeper math and data science understanding."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Learn Ratios and Proportions",
        "intro": [
          "Your journey begins here as you learn how to set up a Colab Notebook that can run Python code. Then, use the notebook to follow along with the videos to learn ratios and proportions using Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Learn How to Solve for X",
        "intro": [
          "This unit will focus on how to solve for an unknown number (often referred to as \"x\") using written Algebra and Python code."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Learn Fractions and Decimals",
        "intro": [
          "This unit will focus on converting decimals to fractions and percents."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Learn Functions and Graphing",
        "intro": ["This unit will teach you about math functions."]
      },
      "learn-linear-functions": {
        "title": "Learn Linear Functions",
        "intro": [
          "This unit will show you how to develop linear equations from two points."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Learn Common Factors and Square Roots",
        "intro": [
          "In this unit, you will learn how to find common factors and divide them out. This will be useful when simplifying fractions and factoring square roots."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Multi-Function Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a multi-function calculator."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Learn How to Graph Systems of Equations",
        "intro": [
          "This unit will focus on graphing two equations on the same coordinate plane, so that you can see where the lines intersect."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Learn How to Solve Systems of Equations",
        "intro": [
          "In this unit, you will learn how to solve a system of two equations (with two variables) without graphing. You will see how you can factor an equation and solve for a certain variable in Python. By the end of this unit, you will be able to solve and graph the system with one block of code."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Learn Applications of Linear Systems",
        "intro": [
          "In this unit, you will see how you can use the algebra you learned so far to solve real world problems."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Learn Quadratic Equations",
        "intro": [
          "This unit will go beyond linear equations, to work with exponents and graph parabolas. You will learn how to find key points in parabolas and how to solve quadratic equations."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Graphing Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a graphing calculator."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Learn Parent Graphs and Polynomials",
        "intro": [
          "This unit will show you many different types of \"parent\" graphs, the basic patterns that make up more complicated graphs. Polynomials are mathematical expressions with \"multiple things\" - the more complicated equations that are built with basic patterns. You will see what these graphs look like, how to modify them, and how to do this all with Python code."
        ]
      },
      "build-three-math-games-project": {
        "title": "Three Math Games",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build three math games."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Learn Business Applications of College Algebra",
        "intro": [
          "This unit will show you how to apply your solving and graphing skills to find cost, revenue, and profit. You will write code to develop a demand function from two points. You will see how price affects the profit graph and how all of these equations relate to each other."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Learn Simple and Compound Interest",
        "intro": [
          "This unit will show you how to calculate interest, loan payments, and the estimated value of investments. You will see the math formula and turn that into code. Because these formulas tend to get complicated, you will appreciate having the code where you can just modify a few values."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Learn Exponents and Logarithms",
        "intro": [
          "This unit will show you how exponents and logarithms are inverse functions, and how you can use these functions in various applications."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Financial Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a financial calculator."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "College Algebra with Python: Conclusion",
        "intro": [
          "This will be the last unit in this course. Let's look at how you can connect your Math and Python knowledge with external data."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Data Graph Explorer",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a data graph explorer."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Coding Interview Prep",
    "intro": [
      "If you're looking for free coding exercises to prepare for your next job interview, we've got you covered.",
      "This section contains hundreds of coding challenges that test your knowledge of algorithms, data structures, and mathematics. It also has a number of take-home projects you can use to strengthen your skills, or add to your portfolio."
    ],
    "note": "The Project Euler Project has been moved to it's own course. Go back to curriculum to see the list of courses we offer.",
    "blocks": {
      "algorithms": {
        "title": "Algorithms",
        "intro": [
          "These free programming exercises will teach you about some common algorithms that you will likely encounter in real life. They are a great opportunity to improve your logic and programming skills.",
          "These algorithms are frequently used in job interviews to test a candidate's skills. We'll give you clear and concise explanations of how these different algorithms work so you can implement a solution for each one."
        ]
      },
      "data-structures": {
        "title": "Data Structures",
        "intro": [
          "These free programming courses are meant to help you deal with large and complex data structures that you may not yet be familiar with.",
          "Working through the courses below, you will learn about each type of data structure, and implement algorithms to reinforce your understanding of them."
        ]
      },
      "take-home-projects": {
        "title": "Take Home Projects",
        "intro": [
          "Programming interviews have always been stressful. Job applicants are sometimes given a take home project to be completed outside of the interview. These types of interviews usually require a lot of work, but they're a great way for employers to see how you might perform on the job.",
          "Build the bonus coding projects below for extra practice. Take your time, make them great, and put them on your resume or portfolio to show potential employers."
        ]
      },
      "rosetta-code": {
        "title": "Rosetta Code",
        "intro": [
          "Level up your creative problem solving skills with these free programming tasks from the classic Rosetta Code library.",
          "These challenges can prove to be difficult, but they will push your algorithm logic to new heights.",
          "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Attribute: Rosetta Code</a>"
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "The Odin Project",
    "intro": [
      "The Odin Project is one of those \"What I wish I had when I was learning\" resources. ",
      "Not everyone has access to a computer science education or the funds to attend an intensive coding school and neither of those is right for everyone anyway.",
      "This project is designed to fill in the gap for people who are trying to hack it on their own but still want a high quality education."
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Learn HTML Foundations",
        "intro": ["A description is to be determined"]
      },
      "top-working-with-text": {
        "title": "Working with Text",
        "intro": ["A description is to be determined"]
      },
      "top-links-and-images": {
        "title": "Links and Images",
        "intro": ["A description is to be determined"]
      },
      "top-build-a-recipe-project": {
        "title": "Learn HTML Foundations by Building a Recipe Page",
        "intro": ["A description is to be determined"]
      },
      "top-learn-css-foundations": {
        "title": "Learn CSS Foundations",
        "intro": ["A description is to be determined"]
      },
      "top-learn-css-foundations-projects": {
        "title": "Learn CSS Foundations Projects",
        "intro": ["A description is to be determined"]
      },
      "top-learn-css-specificity": {
        "title": "Learn CSS Specificity",
        "intro": ["A description is to be determined"]
      },
      "top-the-box-model": {
        "title": "Learn the Box Model",
        "intro": ["A description is to be determined"]
      }
    }
  },
  "project-euler": {
    "title": "Project Euler",
    "intro": [
      "Complete the programming challenges below, from the massive Project Euler archives. These will harden your algorithm and mathematics knowledge.",
      "These problems range in difficulty and, for many, the experience is inductive chain learning. That is, by solving one problem, it will expose you to a new concept that allows you to undertake a previously inaccessible problem. Can you finish them all?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Project Euler Problems 1 to 100",
        "intro": [
          "In this first set of challenges, you will use mathematical concepts like the Fibonacci sequence, prime number theory, and combinatorics to write efficient algorithms to solve these problems."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Project Euler Problems 101 to 200",
        "intro": [
          "In this set of challenges, you'll build upon the skills you learned in the first part of the course and use more advanced concepts like vector computation, Pascal's pyramid, and the RSA algorithm to solve these problems efficiently."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Project Euler Problems 201 to 300",
        "intro": [
          "In this set of challenges, you'll continue to build upon the skills you learned earlier and use concepts like the binomial theorem, Hamming numbers, and the Collatz sequence to further develop your math and problem solving skills."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Project Euler Problems 301 to 400",
        "intro": [
          "Here you will continue to flex your mathematical and algorithmic skills as you use concepts such as combinatorial game theory, bitwise operations, and Golomb's self-describing sequence to develop efficient solutions to these problems."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Project Euler Problems 401 to 480",
        "intro": [
          "In this final set of challenges, you will need draw upon everything you learned up to this point and use advanced concepts like unitary divisors, the Kaprekar routine, and much more to solve these complex problems."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "Foundational C# with Microsoft",
    "intro": [
      "This course offers a comprehensive introduction to C# programming, covering its core concepts, syntax, and practical application in software development.",
      "Through hands-on exercises and projects, you will learn the fundamentals of C#, including variables, data types, control structures, and object-oriented programming principles.",
      "By the end of this course, you will have gained the practical skills and knowledge needed to confidently leverage C# for building robust and scalable applications"
    ],
    "note": "Note: You must complete the trophy challenge in each section below to qualify for the certification exam.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Write Your First Code Using C#",
        "intro": [
          "Begin your journey by learning to write your first code using C#. Develop a strong foundation as you explore the fundamentals and syntax of the language, setting the stage for your programming adventures."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Create and Run Simple C# Console Applications",
        "intro": [
          "Master the art of creating and running simple C# console applications. Dive into the world of console-based programming, where you will gain hands-on experience executing your code and seeing it in action."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Add Logic to C# Console Applications",
        "intro": [
          "Unlock the power of logic in C# console applications. Learn how to add logic and decision-making capabilities to your code, enabling your applications to make dynamic choices and respond intelligently to different scenarios."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Work with Variable Data in C# Console Applications",
        "intro": [
          "Discover the versatility of variable data in C# console applications. Harness the ability to store and manipulate different types of data, such as numbers and text, as you delve into the essential concepts of variables and data handling."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Create Methods in C# Console Applications",
        "intro": [
          "Take your C# console applications to the next level by mastering the art of creating methods. Learn how to organize and modularize your code, making it more manageable, reusable, and efficient."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Debug C# Console Applications",
        "intro": [
          "Sharpen your troubleshooting skills as you dive into the world of debugging C# console applications. Gain the ability to identify and fix issues in your code, ensuring your applications run smoothly and deliver the desired results."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Foundational C# with Microsoft Certification Exam",
        "intro": [
          "Use what you've learned to pass the exam to earn your Foundational C# with Microsoft Certification"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Upcoming Python",
    "intro": ["placeholder"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Learn Python by Building a Blackjack Game",
        "intro": ["Learn Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Upcoming Python Project",
        "intro": ["placeholder"]
      }
    }
  },
  "example-certification": {
    "title": "Example Certification",
    "intro": ["placeholder"],
    "blocks": {
      "example-certification-exam": {
        "title": "Example Certification Exam",
        "intro": ["placeholder"]
      }
    }
  },
  "misc-text": {
    "certification": "{{cert}} Certification",
    "browse-other": "Browse our other free certifications\n(we recommend doing these in order)",
    "courses": "Courses",
    "steps": "Steps",
    "expand": "Expand course",
    "collapse": "Collapse course",
    "legacy-header": "Legacy Courses",
    "legacy-desc": "These courses are no longer part of the certification path, but are still available for you to further your learning.",
    "legacy-go-back": "Go to the current version of the curriculum.",
    "course-maintenance": "These courses are undergoing maintenance. If they are not working, you can learn how to run them locally at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "Your progress will not be saved to your freeCodeCamp account when running them locally.",
    "go-back-to-learn": "Go back to the stable version of the curriculum.",
    "read-database-cert-article": "Please read this forum post before proceeding.",
    "enable-cookies": "You must enable third-party cookies before starting.",
    "english-only": "The courses in this section are only available in English. We are only able to translate the titles and introductions at the moment, not the lessons themselves."
  }
}
