[
  {
      "id": "responsive-web-design",
      "title": "Responsive Web Design",
      "intro": [
        "In this Responsive Web Design Certification, you'll learn the languages that developers use to build webpages: HTML (Hypertext Markup Language) for content, and CSS (Cascading Style Sheets) for design.",
        "First, you'll build a cat photo app to learn the basics of HTML and CSS. Later, you'll learn modern techniques like CSS variables by building a penguin, and best practices for accessibility by building a web form.",
        "Finally, you'll learn how to make webpages that respond to different screen sizes by building a Twitter card with Flexbox, and a complex blog layout with CSS Grid."
      ],
      "blocks": {
        "basic-html-and-html5": {
          "title": "Basic HTML and HTML5",
          "intro": [
            "HTML is a markup language that uses a special syntax or notation to describe the structure of a webpage to the browser. HTML elements usually have opening and closing tags that surround and give meaning to content. For example, different elements can describe text as a heading, paragraph, or list item.",
            "In this course, you'll build a cat photo app to learn some of the most common HTML elements — the building blocks of any webpage."
          ]
        },
        "basic-css": {
          "title": "Basic CSS",
          "intro": [
            "CSS, or Cascading Style Sheets, tell the browser how to display the text and other content that you write in HTML. With CSS, you can control the color, font, size, spacing, and many other aspects of HTML elements.",
            "Now that you've described the structure of your cat photo app, give it some style with CSS."
          ]
        },
        "applied-visual-design": {
          "title": "Applied Visual Design",
          "intro": [
            "Visual design is a combination of typography, color theory, graphics, animation, page layout, and more to help deliver your unique message.",
            "In this course, you'll learn how to apply these different elements of visual design to your webpages."
          ]
        },
        "applied-accessibility": {
          "title": "Applied Accessibility",
          "intro": [
            "In web development, accessibility refers to web content and a UI (user interface) that can be understood, navigated, and interacted with by a broad audience. This includes people with visual, auditory, mobility, or cognitive disabilities.",
            "In this course, you'll learn best practices for building webpages that are accessible to everyone."
          ]
        },
        "responsive-web-design-principles": {
          "title": "Responsive Web Design Principles",
          "intro": [
            "There are many devices that can access the web, and they come in all shapes and sizes. Responsive web design is the practice of designing flexible websites that can respond to different screen sizes, orientations, and resolutions.",
            "In this course, you'll learn how to use CSS to make your webpages look good, no matter what device they're viewed on."
          ]
        },
        "css-flexbox": {
          "title": "CSS Flexbox",
          "intro": [
            "Flexbox is a powerful, well-supported layout method that was introduced with the latest version of CSS, CSS3. With flexbox, it's easy to center elements on the page and create dynamic user interfaces that shrink and expand automatically.",
            "In this course, you'll learn the fundamentals of flexbox and dynamic layouts by building a Twitter card."
          ]
        },
        "css-grid": {
          "title": "CSS Grid",
          "intro": [
            "The CSS grid is a newer standard that makes it easy to build complex responsive layouts. It works by turning an HTML element into a grid, and lets you place child elements anywhere within.",
            "In this course, you'll learn the fundamentals of CSS grid by building different complex layouts, including a blog."
          ]
        },
        "responsive-web-design-projects": {
          "title": "Responsive Web Design Projects",
          "intro": [
            "Time to put your newly learnt skills to work. By working on these projects, you will get a chance to apply all of the skills, principles, and concepts you have learned so far: HTML, CSS, Visual Design, Accessibility, and more.",
            "Complete the five web programming projects below to earn your Responsive Web Design certification."
          ]
        },
        "basic-html-cat-photo-app": {
          "title": "Basic HTML Cat Photo App",
          "intro": ["", ""]
        },
        "basic-css-cafe-menu": {
          "title": "Basic CSS Cafe Menu",
          "intro": ["", ""]
        },
        "css-variables-skyline": {
          "title": "CSS Variables Skyline",
          "intro": ["", ""]
        }
      }
  }
]