{
  "responsive-web-design": {
    "title": "Legacy Responsive Web Design Challenges",
    "intro": [
      "In this Responsive Web Design Certification, you'll learn the languages that developers use to build webpages: HTML (Hypertext Markup Language) for content, and CSS (Cascading Style Sheets) for design.",
      "First, you'll build a cat photo app to learn the basics of HTML and CSS. Later, you'll learn modern techniques like CSS variables by building a penguin, and best practices for accessibility by building a web form.",
      "Finally, you'll learn how to make webpages that respond to different screen sizes by building a Twitter card with Flexbox, and a complex blog layout with CSS Grid."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and dark mode extensions can interfere with the tests. If you face issues, we recommend disabling extensions that modify the content or layout of pages, while taking the course.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "Basic HTML and HTML5",
        "intro": [
          "HTML is a markup language that uses a special syntax or notation to describe the structure of a webpage to the browser. HTML elements usually have opening and closing tags that surround and give meaning to content. For example, different elements can describe text as a heading, paragraph, or list item.",
          "In this course, you'll build a cat photo app to learn some of the most common HTML elements — the building blocks of any webpage."
        ]
      },
      "basic-css": {
        "title": "Basic CSS",
        "intro": [
          "CSS, or Cascading Style Sheets, tell the browser how to display the text and other content that you write in HTML. With CSS, you can control the color, font, size, spacing, and many other aspects of HTML elements.",
          "Now that you've described the structure of your cat photo app, give it some style with CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Applied Visual Design",
        "intro": [
          "Visual design is a combination of typography, color theory, graphics, animation, page layout, and more to help deliver your unique message.",
          "In this course, you'll learn how to apply these different elements of visual design to your webpages."
        ]
      },
      "applied-accessibility": {
        "title": "Applied Accessibility",
        "intro": [
          "In web development, accessibility refers to web content and a UI (user interface) that can be understood, navigated, and interacted with by a broad audience. This includes people with visual, auditory, mobility, or cognitive disabilities.",
          "In this course, you'll learn best practices for building webpages that are accessible to everyone."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Responsive Web Design Principles",
        "intro": [
          "There are many devices that can access the web, and they come in all shapes and sizes. Responsive web design is the practice of designing flexible websites that can respond to different screen sizes, orientations, and resolutions.",
          "In this course, you'll learn how to use CSS to make your webpages look good, no matter what device they're viewed on."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox is a powerful, well-supported layout method that was introduced with the latest version of CSS, CSS3. With flexbox, it's easy to center elements on the page and create dynamic user interfaces that shrink and expand automatically.",
          "In this course, you'll learn the fundamentals of flexbox and dynamic layouts by building a Twitter card."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "The CSS grid is a newer standard that makes it easy to build complex responsive layouts. It works by turning an HTML element into a grid, and lets you place child elements anywhere within.",
          "In this course, you'll learn the fundamentals of CSS grid by building different complex layouts, including a blog."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Responsive Web Design",
    "intro": [
      "In this Responsive Web Design Certification, you'll learn the languages that developers use to build webpages: HTML (Hypertext Markup Language) for content, and CSS (Cascading Style Sheets) for design.",
      "First, you'll build a cat photo app to learn the basics of HTML and CSS. Later, you'll learn modern techniques like CSS variables by building a penguin, and best practices for accessibility by building a quiz site.",
      "Finally, you'll learn how to make webpages that respond to different screen sizes by building a photo gallery with Flexbox, and a magazine article layout with CSS Grid."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and dark mode extensions can interfere with the tests. If you face issues, we recommend disabling extensions that modify the content or layout of pages, while taking the course.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Tribute Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a tribute page for a subject of your choosing, fictional or real."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Personal Portfolio Webpage",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build your own personal portfolio page."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Product Landing Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a product landing page to market a product of your choice."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Survey Form",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a survey form to collect data from your users."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Technical Documentation Page",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a technical documentation page to serve as instruction or reference for a topic."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Learn HTML by Building a Cat Photo App",
        "intro": [
          "HTML tags give a webpage its structure. You can use HTML tags to add photos, buttons, and other elements to your webpage.",
          "In this course, you'll learn the most common HTML tags by building your own cat photo app."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Learn Basic CSS by Building a Cafe Menu",
        "intro": [
          "CSS tells the browser how to display your webpage. You can use CSS to set the color, font, size, and other aspects of HTML elements.",
          "In this course, you'll learn CSS by designing a menu page for a cafe webpage."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Learn the CSS Box Model by Building a Rothko Painting",
        "intro": [
          "Every HTML element is its own box – with its own spacing and a border. This is called the Box Model.",
          "In this course, you'll use CSS and the Box Model to create your own Rothko-style rectangular art pieces."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Learn CSS Variables by Building a City Skyline",
        "intro": [
          "CSS variables help you organize your styles and reuse them.",
          "In this course, you'll build a city skyline. You'll learn how to configure CSS variables so you can reuse them whenever you want."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Learn HTML Forms by Building a Registration Form",
        "intro": [
          "You can use HTML forms to collect information from people who visit your webpage.",
          "In this course, you'll learn HTML forms by building a signup page. You'll learn how to control what types of data people can type into your form, and some new CSS tools for styling your page."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Learn Accessibility by Building a Quiz",
        "intro": [
          "Accessibility is making your webpage easy for all people to use – even people with disabilities.",
          "In this course, you'll build a quiz webpage. You'll learn accessibility tools such as keyboard shortcuts, ARIA attributes, and design best practices."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Learn Intermediate CSS by Building a Picasso Painting",
        "intro": [
          "In this course, you'll learn how to use some intermediate CSS techniques by coding your own Picasso painting webpage. You'll learn about SVG icons, CSS positioning, and review other CSS skills you've learned."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Learn Responsive Web Design by Building a Piano",
        "intro": [
          "Responsive Design tells your webpage how it should look on different-sized screens.",
          "In this course, you'll use CSS and Responsive Design to code a piano. You'll also learn more about media queries and pseudo selectors."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Learn CSS Flexbox by Building a Photo Gallery",
        "intro": [
          "Flexbox helps you design your webpage so that it looks good on any screen size.",
          "In this course, you'll use Flexbox to build a responsive photo gallery webpage."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Learn CSS Grid by Building a Magazine",
        "intro": [
          "CSS Grid gives you control over the rows and columns of your webpage design.",
          "In this course, you'll build a magazine article. You'll learn how to use CSS Grid, including concepts like grid rows and grid columns."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Learn Typography by Building a Nutrition Label",
        "intro": [
          "Typography is the art of styling your text to be easily readable and suit its purpose.",
          "In this course, you'll use typography to build a nutrition label webpage. You'll learn how to style text, adjust line height, and position your text using CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Learn CSS Transforms by Building a Penguin",
        "intro": [
          "You can transform HTML elements to create appealing designs that draw your reader's eye. You can use transforms to rotate elements, scale them, and more.",
          "In this course, you'll build a penguin. You'll use CSS transforms to position and resize the parts of your penguin, create a background, and animate your work."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Learn CSS Animation by Building a Ferris Wheel",
        "intro": [
          "You can use CSS animation to draw attention to specific sections of your webpage and make it more engaging.",
          "In this course, you'll build a Ferris wheel. You'll learn how to use CSS to animate elements, transform them, and adjust their speed."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Learn More About CSS Pseudo Selectors by Building A Balance Sheet",
        "intro": [
          "You can use CSS pseudo selectors to change specific HTML elements.",
          "In this course, you'll build a balance sheet using pseudo selectors. You'll learn how to change the style of an element when you hover over it with your mouse, and trigger other events on your webpage."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Learn CSS Colors by Building a Set of Colored Markers",
        "intro": [
          "Selecting the correct colors for your webpage can greatly improve the aesthetic appeal to your readers.",
          "In this course, you'll build a set of colored markers. You'll learn different ways to set color values and how to pair colors with each other."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Learn Intermediate CSS by Building a Cat Painting",
        "intro": [
          "Mastering CSS positioning is essential for creating visually appealing and responsive web layouts",
          "In this course, you will build a cat painting. You'll learn about how to work with absolute positioning, the z-index property, and the transform property."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Legacy JavaScript Algorithms and Data Structures",
    "intro": [
      "While HTML and CSS control the content and styling of a page, JavaScript is used to make it interactive. In the JavaScript Algorithm and Data Structures Certification, you'll learn the fundamentals of JavaScript including variables, arrays, objects, loops, and functions.",
      "Once you have the fundamentals down, you'll apply that knowledge by creating algorithms to manipulate strings, factorialize numbers, and even calculate the orbit of the International Space Station.",
      "Along the way, you'll also learn two important programming styles or paradigms: Object Oriented Programming (OOP) and Functional Programming (FP)."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and script-blockers can interfere with the tests. If you face issues, we recommend disabling extensions that modify or block the content of pages while taking the course.",
    "blocks": {
      "basic-javascript": {
        "title": "Basic JavaScript",
        "intro": [
          "JavaScript is a scripting language you can use to make web pages interactive. It is one of the core technologies of the web, along with HTML and CSS, and is supported by all modern browsers.",
          "In this course, you'll learn fundamental programming concepts in JavaScript. You'll start with basic data structures like numbers and strings. Then you'll learn to work with arrays, objects, functions, loops, if/else statements, and more."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript, or ES, is a standardized version of JavaScript. Because all major browsers follow this specification, the terms ECMAScript and JavaScript are interchangeable.",
          "Most of the JavaScript you've learned up to this point was in ES5 (ECMAScript 5), which was finalized in 2009. While you can still write programs in ES5, JavaScript is constantly evolving, and new features are released every year.",
          "ES6, released in 2015, added many powerful new features to the language. In this course, you'll learn these new features, including arrow functions, destructuring, classes, promises, and modules."
        ]
      },
      "regular-expressions": {
        "title": "Regular Expressions",
        "intro": [
          "Regular expressions, often shortened to \"regex\" or \"regexp\", are patterns that help programmers match, search, and replace text. Regular expressions are very powerful, but can be hard to read because they use special characters to make more complex, flexible matches.",
          "In this course, you'll learn how to use special characters, capture groups, positive and negative lookaheads, and other techniques to match any text you want."
        ]
      },
      "debugging": {
        "title": "Debugging",
        "intro": [
          "Debugging is the process of going through your code, finding any issues, and fixing them.",
          "Issues in code generally come in three forms: syntax errors that prevent your program from running, runtime errors where your code has unexpected behavior, or logical errors where your code doesn't do what you intended.",
          "In this course, you'll learn how to use the JavaScript console to debug programs and prevent common issues before they happen."
        ]
      },
      "basic-data-structures": {
        "title": "Basic Data Structures",
        "intro": [
          "Data can be stored and accessed in many ways. You already know some common JavaScript data structures — arrays and objects.",
          "In this Basic Data Structures course, you'll learn more about the differences between arrays and objects, and which to use in different situations. You'll also learn how to use helpful JS methods like <code>splice()</code> and <code>Object.keys()</code> to access and manipulate data."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Basic Algorithm Scripting",
        "intro": [
          "An algorithm is a series of step-by-step instructions that describe how to do something.",
          "To write an effective algorithm, it helps to break a problem down into smaller parts and think carefully about how to solve each part with code.",
          "In this course, you'll learn the fundamentals of algorithmic thinking by writing algorithms that do everything from converting temperatures to handling complex 2D arrays."
        ]
      },
      "object-oriented-programming": {
        "title": "Object Oriented Programming",
        "intro": [
          "OOP, or Object Oriented Programming, is one of the major approaches to the software development process. In OOP, objects and classes organize code to describe things and what they can do.",
          "In this course, you'll learn the basic principles of OOP in JavaScript, including the <code>this</code> keyword, prototype chains, constructors, and inheritance."
        ]
      },
      "functional-programming": {
        "title": "Functional Programming",
        "intro": [
          "Functional Programming is another popular approach to software development. In Functional Programming, code is organized into smaller, basic functions that can be combined to build complex programs.",
          "In this course, you'll learn the core concepts of Functional Programming including pure functions, how to avoid mutations, and how to write cleaner code with methods like <code>.map()</code> and <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Intermediate Algorithm Scripting",
        "intro": [
          "Now that you know the basics of algorithmic thinking, along with OOP and Functional Programming, test your skills with the Intermediate Algorithm Scripting challenges."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "JavaScript Algorithms and Data Structures Projects",
        "intro": [
          "This is it — time to put your new JavaScript skills to work. These projects are similar to the algorithm scripting challenges you've done before – just much more difficult.",
          "Complete these 5 JavaScript projects to earn the JavaScript Algorithms and Data Structures certification."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "JavaScript Algorithms and Data Structures (Beta)",
    "intro": [
      "Developers use HTML and CSS to control the content and styling of a page. And they use JavaScript to make that page interactive.",
      "In this JavaScript Algorithm and Data Structures Certification, you'll learn the JavaScript fundamentals like variables, arrays, objects, loops, functions, the DOM and more.",
      "You'll also learn about Object Oriented Programming (OOP), Functional Programming, algorithmic thinking, how to work with local storage, and how to fetch data using an API."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and script-blockers can interfere with the tests. If you face issues, we recommend disabling extensions that modify or block the content of pages while taking the course.",
    "blocks": {
      "build-a-pokemon-search-app-project": {
        "title": "Build a Pokémon Search App Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a Pokémon search app."
        ]
      },
      "build-a-cash-register-project": {
        "title": "Build a Cash Register Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you'll build a cash register web app."
        ]
      },
      "build-a-palindrome-checker-project": {
        "title": "Build a Palindrome Checker Project",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you'll build an application that checks whether a given word is a palindrome."
        ]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Build a Roman Numeral Converter Project",
        "intro": [
          "This is one of the required projects to claim your certification.",
          "For this project, you'll build an application that converts integers to Roman numerals."
        ]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Build a Telephone Number Validator Project",
        "intro": [
          "This is one of the required projects to claim your certification.",
          "For this project, you'll build an application that checks if a number is a valid United States phone number."
        ]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Learn Basic JavaScript by Building a Role Playing Game",
        "intro": [
          "JavaScript is a powerful scripting language that you can use to make web pages interactive. It's one of the core technologies of the web, along with HTML and CSS. All modern browsers support JavaScript.",
          "In this practice project, you'll learn fundamental programming concepts in JavaScript by coding your own Role Playing Game. You'll learn how to work with arrays, strings, objects, functions, loops, <code>if/else</code> statements, and more."
        ]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Learn Form Validation by Building a Calorie Counter",
        "intro": [
          "Sometimes when you're coding a web application, you'll need to be able to accept input from a user. In this calorie counter project, you'll learn how to validate user input, perform calculations based on that input, and dynamically update your interface to display the results.",
          "In this practice project, you'll learn basic regular expressions, template literals, the <code>addEventListener()</code> method, and more."
        ]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Learn Functional Programming by Building a Spreadsheet",
        "intro": [
          "Functional Programming is a popular approach to software development. In Functional Programming, developers organize code into smaller functions, then combine those functions to build complex programs.",
          "In this spreadsheet application project, you'll learn about parsing and evaluating mathematical expressions, implementing spreadsheet functions, handling cell references, and creating interactive web interfaces. You'll learn how to dynamically update the page based on user input.",
          "This project will cover concepts like the <code>map()</code>, <code>find()</code>, and <code>includes()</code> methods and the <code>parseInt()</code> function."
        ]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Learn Modern JavaScript Methods by Building Football Team Cards",
        "intro": [
          "One common aspect of building web applications: processing datasets, and then outputting information to the screen. In this sports team cards project, you'll learn how to work with DOM manipulation, object destructuring, event handling, and data filtering.",
          "This project will cover concepts like, default parameters, <code>Object.freeze()</code>, and reinforce your knowledge of the <code>switch</code> statement and <code>map()</code> method."
        ]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Learn Advanced Array Methods by Building a Statistics Calculator",
        "intro": [
          "As you expand your JavaScript skills, you'll want to get comfortable with array manipulation methods, such as <code>map()</code>, <code>reduce()</code>, and <code>filter()</code>.",
          "In this statistics calculator project, you'll gain experience with handling user input, DOM manipulation, and method chaining. You'll get practice by performing statistical calculations like mean, median, mode, variance, and standard deviation."
        ]
      },
      "learn-basic-oop-by-building-a-shopping-cart": {
        "title": "Learn Basic OOP by Building a Shopping Cart",
        "intro": [
          "OOP, or Object Oriented Programming, is one of the major approaches to the software development process. In OOP, developers use objects and classes to structure their code.",
          "In this shopping cart project, you'll learn how to define classes and use them. You'll create class instances and implement methods for data manipulation.",
          "This project will cover concepts like the ternary operator, the spread operator, the <code>this</code> keyword, and more."
        ]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Learn Fetch and Promises by Building an fCC Authors Page",
        "intro": [
          "One common aspect of web development is learning how to fetch data from an external API, then work with asynchronous JavaScript.",
          "This freeCodeCamp authors page project will show you how to use the fetch method, then dynamically update the DOM to display the fetched data.",
          "This project will also teach you how to paginate your data so you can load results in batches."
        ]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Learn Regular Expressions by Building a Spam Filter",
        "intro": [
          "Regular expressions, often shortened to \"regex\" or \"regexp\", are patterns that help programmers match, search, and replace text. Regular expressions are powerful, but can be difficult to understand because they use so many special characters.",
          "In this spam filter project, you'll learn about capture groups, positive lookaheads, negative lookaheads, and other techniques to match any text you want."
        ]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Learn Basic Algorithmic Thinking by Building a Number Sorter",
        "intro": [
          "In computer science, there are fundamental sorting algorithms that all developers should learn. In this number sorter project, you'll learn how to implement and visualize different sorting algorithms like bubble sort, selection sort, and insertion sort – all with JavaScript.",
          "This project will help you understand the fundamental concepts behind these algorithms, and how you can apply them to sort numerical data in web applications."
        ]
      },
      "review-algorithmic-thinking-by-building-a-dice-game": {
        "title": "Review Algorithmic Thinking by Building a Dice Game",
        "intro": [
          "Algorithmic thinking involves the ability to break down complex problems into a sequence of well-defined, step-by-step instructions.",
          "In this Dice game project, you’ll learn how to manage game state, implement game logic for rolling dice, keeping score, and applying rules for various combinations.",
          "This project covers concepts such as event handling, array manipulation, conditional logic, and updating the user interface dynamically based on game state."
        ]
      },
      "learn-intermediate-oop-by-building-a-platformer-game": {
        "title": "Learn Intermediate OOP by Building a Platformer Game",
        "intro": [
          "Coding a game is a great way to grasp fundamental programming principles, while also creating an interactive gaming experience.",
          "In this platformer game project, you'll continue to learn about classes, objects, inheritance, and encapsulation. You'll also learn how to design and organize game elements efficiently and gain insights into problem-solving and code reusability."
        ]
      },
      "learn-localstorage-by-building-a-todo-app": {
        "title": "Learn localStorage by Building a Todo App",
        "intro": [
          "Local storage is a web browser feature that lets web applications store key-value pairs persistently within a user's browser. This allows web apps to save data during one session, then retrieve it in a later page session.",
          "In this TODO application, you'll learn how to handle form inputs, manage local storage, perform CRUD (Create, Read, Update, Delete) operations on tasks, implement event listeners, and toggle UI elements."
        ]
      },
      "learn-the-date-object-by-building-a-date-formatter": {
        "title": "Learn the Date Object by Building a Date Formatter",
        "intro": [
          "Working with dates in JavaScript can be challenging. You have to navigate various methods, formats, and time zones. In this project, you'll learn how to work with the JavaScript Date object, including its methods and properties. You'll also learn how to correctly format dates.",
          "This project will cover concepts such as the <code>getDate()</code>, <code>getMonth()</code>, and <code>getFullYear()</code> methods."
        ]
      },
      "learn-asynchronous-programming-by-building-an-fcc-forum-leaderboard": {
        "title": "Learn Asynchronous Programming by Building an fCC Forum Leaderboard",
        "intro": [
          "JavaScript is an asynchronous programming language. And this project will help you gain proficiency in asynchronous concepts. You'll code your own freeCodeCamp forum leaderboard.",
          "This project will cover the Fetch API, promises, Async/Await, and the try..catch statement."
        ]
      },
      "learn-basic-string-and-array-methods-by-building-a-music-player": {
        "title": "Learn Basic String and Array Methods by Building a Music Player",
        "intro": [
          "Now let's learn some essential string and array methods like the <code>find()</code>, <code>forEach()</code>, <code>map()</code>, and <code>join()</code>. These methods are crucial for developing dynamic web applications.",
          "In this project, you'll code a basic MP3 player using HTML, CSS, and JavaScript. The project covers fundamental concepts such as handling audio playback, managing a playlist, implementing play, pause, next, previous, and shuffle functionalities. You'll even learn how to dynamically update your user interface based on the current song."
        ]
      },
      "learn-recursion-by-building-a-decimal-to-binary-converter": {
        "title": "Learn Recursion by Building a Decimal to Binary Converter",
        "intro": [
          "Recursion is a programming concept where a function calls itself. This can reduce a complex problem into simpler sub-problems, until they become straightforward to solve.",
          "In this project, you’ll build a decimal-to-binary converter using JavaScript. You’ll learn the fundamental concepts of recursion, explore the call stack, and build out a visual representation of the recursion process through an animation."
        ]
      },
      "learn-introductory-javascript-by-building-a-pyramid-generator": {
        "title": "Learn Introductory JavaScript by Building a Pyramid Generator",
        "intro": [
          "JavaScript is a powerful scripting language that you can use to make web pages interactive. It's one of the core technologies of the web, along with HTML and CSS. All modern browsers support JavaScript.",
          "In this practice project, you'll learn fundamental programming concepts in JavaScript by coding your own Pyramid Generator. You'll learn how to work with arrays, strings, functions, loops, <code>if/else</code> statements, and more."
        ]
      },
      "review-js-fundamentals-by-building-a-gradebook-app": {
        "title": "Review JavaScript Fundamentals by Building a Gradebook App",
        "intro": [
          "In this mini project, you will get to review JavaScript fundamentals like functions, variables, conditionals and more by building a gradebook app.",
          "This will give you an opportunity to solve small problems and get a better understanding of the basics."
        ]
      },
      "learn-basic-debugging-by-building-a-random-background-color-changer": {
        "title": "Learn Basic Debugging by Building a Random Background Color Changer",
        "intro": [
          "Debugging is the process of going through your code, finding any issues, and fixing them.",
          "In this project, you will help CamperBot build a random background color changer and help them find and fix errors."
        ]
      },
      "review-dom-manipulation-by-building-a-rock-paper-scissors-game": {
        "title": "Review DOM Manipulation by Building a Rock, Paper, Scissors Game",
        "intro": [
          "In the previous projects you learned how to work with basic DOM manipulation. Now it is time to review what you have learned by building a Rock, Paper, Scissors game.",
          "In this mini project, you will review conditionals, functions, <code>getElementById</code>, and more. This project will give you an opportunity to solve small problems and get a better understanding of the basics."
        ]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Front End Development Libraries",
    "intro": [
      "Now that you're familiar with HTML, CSS, and JavaScript, level up your skills by learning some of the most popular front end libraries in the industry.",
      "In the Front End Development Libraries Certification, you'll learn how to style your site quickly with Bootstrap. You'll also learn how to add logic to your CSS styles and extend them with Sass.",
      "Later, you'll build a shopping cart and other applications to learn how to create powerful Single Page Applications (SPAs) with React and Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap is a front end framework used to design responsive web pages and applications. It takes a mobile-first approach to web development, and includes pre-built CSS styles and classes, plus some JavaScript functionality.",
          "In this course, you'll learn how to build responsive websites with Bootstrap, and use its included classes to style buttons, images, forms, navigation, and other common elements."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery is one of the most widely used JavaScript libraries in the world.",
          "In 2006 when it was released, all major browsers handled JavaScript slightly differently. jQuery simplified the process of writing client-side JavaScript, and also ensured that your code worked the same way in all browsers.",
          "In this course, you'll learn how to use jQuery to select, remove, clone, and modify different elements on the page."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, or \"Syntactically Awesome StyleSheets\", is a language extension of CSS. It adds features that aren't available in basic CSS, which make it easier for you to simplify and maintain the style sheets for your projects.",
          "In this Sass course, you'll learn how to store data in variables, nest CSS, create reusable styles with mixins, add logic and loops to your styles, and more."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React is a popular JavaScript library for building reusable, component-driven user interfaces for web pages or applications.",
          "React combines HTML with JavaScript functionality into its own markup language called JSX. React also makes it easy to manage the flow of data throughout the application.",
          "In this course, you'll learn how to create different React components, manage data in the form of state props, use different lifecycle methods like <code>componentDidMount</code>, and much more."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "As applications grow in size and scope, managing shared data becomes much more difficult. Redux is defined as a \"predictable state container for JavaScript apps\" that helps ensure your apps work predictably, and are easier to test.",
          "While you can use Redux with any view library, we introduce Redux here before combining it with React in the next set of courses.",
          "In this course, you'll learn the fundamentals of Redux stores, actions, reducers and middleware to manage data throughout your application."
        ]
      },
      "react-and-redux": {
        "title": "React and Redux",
        "intro": [
          "React and Redux are often mentioned together, and with good reason. The developer who created Redux was a React developer who wanted to make it easier to share data across different components.",
          "Now that you know how to manage the flow of shared data with Redux, it's time to combine that knowledge with React. In the React and Redux courses, you'll build a React component and learn how to manage state locally at the component level, and throughout the entire application with Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Front End Development Libraries Projects",
        "intro": [
          "It's time to put your front end development libraries skills to the test. Use Bootstrap, jQuery, Sass, React, and Redux to build 5 projects that will test everything you've learned up to this point.",
          "Complete all 5 projects, and you'll earn the Front End Development Libraries certification."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Data Visualization",
    "intro": [
      "Data is all around us, but it doesn't mean much without shape or context.",
      "In the Data Visualization Certification, you'll build charts, graphs, and maps to present different types of data with the D3.js library.",
      "You'll also learn about JSON (JavaScript Object Notation), and how to work with data online using an API (Application Programming Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Data Visualization with D3",
        "intro": [
          "D3, or D3.js, stands for Data Driven Documents. It's a JavaScript library for creating dynamic and interactive data visualizations in the browser.",
          "D3 is built to work with common web standards – namely HTML, CSS, and Scalable Vector Graphics (SVG).",
          "D3 supports many different kinds of input data formats. Then, using its powerful built-in methods, you can transform those data into different charts, graphs, and maps.",
          "In the Data Visualization with D3 courses, you'll learn how to work with data to create different charts, graphs, hover elements, and other ingredients to create dynamic and attractive data visualizations."
        ]
      },
      "json-apis-and-ajax": {
        "title": "JSON APIs and AJAX",
        "intro": [
          "Similar to how UIs help people use programs, APIs (Application Programming Interfaces) help programs interact with other programs. APIs are tools that computers use to communicate with one another, in part to send and receive data.",
          "Programmers often use AJAX (Asynchronous JavaScript and XML) when working with APIs. AJAX refers to a group of technologies that make asynchronous requests to a server to transfer data, then load any returned data into the page. And the data transferred between the browser and server is often in a format called JSON (JavaScript Object Notation).",
          "This course will teach you the basics about working with APIs and different AJAX technologies in the browser."
        ]
      },
      "data-visualization-projects": {
        "title": "Data Visualization Projects",
        "intro": [
          "Now that you learned how to work with D3, APIs, and AJAX technologies, put your skills to the test with these 5 Data Visualization projects.",
          "In these projects, you'll need to fetch data and parse a dataset, then use D3 to create different data visualizations. Finish them all to earn your Data Visualization certification."
        ]
      },
      "d3-dashboard": { "title": "D3 Dashboard", "intro": ["", ""] }
    }
  },
  "relational-database": {
    "title": "Relational Database",
    "intro": [
      "For these courses, you will use real developer tools and software including VS Code, PostgreSQL, and the Linux / Unix command line to complete interactive tutorials and build projects.",
      "These courses start off with basic Bash commands. Using the terminal, you will learn everything from navigating and manipulating a file system, scripting in Bash, all the way to advanced usage.",
      "Next, you will learn how to create and use a relational database with PostgreSQL, a database management system, and SQL, the language of these databases.",
      "Finally, you will learn Git, the version control system, an essential tool of every developer."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "Celestial Bodies Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a database of celestial bodies using PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Number Guessing Game",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will use Bash scripting, PostgreSQL, and Git to create a number guessing game that runs in the terminal and saves user information."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "Periodic Table Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create a Bash script to get information about chemical elements from a periodic table database."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Salon Appointment Scheduler",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create an interactive Bash program that uses PostgreSQL to track the customers and appointments for your salon."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "World Cup Database",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will create a Bash script that enters information from World Cup games into PostgreSQL, then query the database for useful statistics."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Learn Advanced Bash by Building a Kitty Ipsum Translator",
        "intro": [
          "There's more to Bash commands than you might think.",
          "In this 140-lesson course, you will learn some more complex commands, and the details of how commands work."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Learn Bash and SQL by Building a Bike Rental Shop",
        "intro": [
          "In this 210-lesson course, you will build an interactive Bash program that stores rental information for your bike rental shop using PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Learn Bash by Building a Boilerplate",
        "intro": [
          "The terminal allows you to send text commands to your computer that can manipulate the file system, run programs, automate tasks, and much more.",
          "In this 170-lesson course, you will learn terminal commands by creating a website boilerplate using only the command line."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Learn Bash Scripting by Building Five Programs",
        "intro": [
          "Bash scripts combine terminal commands and logic into programs that can execute or automate tasks, and much more.",
          "In this 220-lesson course, you will learn more terminal commands and how to use them within Bash scripts by creating five small programs."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Learn Git by Building an SQL Reference Object",
        "intro": [
          "Git is a version control system that keeps track of all the changes you make to your codebase.",
          "In this 240-lesson course, you will learn how Git keeps track of your code by creating an object containing commonly used SQL commands."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Learn Nano by Building a Castle",
        "intro": [
          "Nano is a program that allows you to edit files right in the terminal.",
          "In this 40-lesson course, you will learn how to edit files in the terminal with Nano while building a castle."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Learn Relational Databases by Building a Mario Database",
        "intro": [
          "A relational database organizes data into tables that are linked together through relationships.",
          "In this 165-lesson course, you will learn the basics of a relational database by creating a PostgreSQL database filled with video game characters."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Learn SQL by Building a Student Database: Part 1",
        "intro": [
          "SQL, or Structured Query Language, is the language for communicating with a relational database.",
          "In this 140-lesson course, you will create a Bash script that uses SQL to enter information about your computer science students into PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Learn SQL by Building a Student Database: Part 2",
        "intro": [
          "SQL join commands are used to combine information from multiple tables in a relational database",
          "In this 140-lesson course, you will complete your student database while diving deeper into SQL commands."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Back End Development and APIs",
    "intro": [
      "Until this point, you've only used JavaScript on the front end to add interactivity to a page, solve algorithm challenges, or build an SPA. But JavaScript can also be used on the back end, or server, to build entire web applications.",
      "Today, one of the popular ways to build applications is through microservices, which are small, modular applications that work together to form a larger whole.",
      "In the Back End Development and APIs Certification, you'll learn how to write back end apps with Node.js and npm. You'll also build web applications with the Express framework, and build a People Finder microservice with MongoDB and the Mongoose library."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Managing Packages with NPM",
        "intro": [
          "npm (Node Package Manager), is a command line tool to install, create, and share packages of JavaScript code written for Node.js. There are many open source packages available on npm, so before starting a project, take some time to explore so you don't end up recreating the wheel for things like working with dates or fetching data from an API.",
          "In this course, you'll learn the basics of using npm, including how to work with the <code>package.json</code> and how to manage your installed dependencies."
        ]
      },
      "basic-node-and-express": {
        "title": "Basic Node and Express",
        "intro": [
          "Node.js is a JavaScript runtime that allows developers to write backend (server-side) programs in JavaScript. Node.js comes with a handful of built-in modules — small, independent programs — that help with this. Some of the core modules include HTTP, which acts like a server, and File System, a module to read and modify files.",
          "In the last set of courses you learned to install and manage packages from npm, which are collections of smaller modules. These packages can help you build larger, more complex applications.",
          "Express is a lightweight web application framework, and is one of the most popular packages on npm. Express makes it much easier to create a server and handle routing for your application, which handles things like directing people to the correct page when they visit a certain endpoint like <pre>/blog</pre>.",
          "In this course, you'll learn the basics of Node and Express including how to create a server, serve different files, and handle different requests from the browser."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB and Mongoose",
        "intro": [
          "MongoDB is a database application that stores JSON documents (or records) that you can use in your application. Unlike SQL, another type of database, MongoDB is a non-relational or \"NoSQL\" database. This means MongoDB stores all associated data within one record, instead of storing it across many preset tables as in a SQL database.",
          "Mongoose is a popular npm package for interacting with MongoDB. With Mongoose, you can use plain JavaScript objects instead of JSON, which makes it easier to work with MongoDB. Also, it allows you to create blueprints for your documents called schemas, so you don't accidentally save the wrong type of data and cause bugs later.",
          "In the MongoDB and Mongoose courses, you'll learn the fundamentals of working with persistent data including how to set up a model, and save, delete, and find documents in the database."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Back End Development and APIs Projects",
        "intro": [
          "You've worked with APIs before, but now that you know npm, Node, Express, MongoDB, and Mongoose, it's time to build your own. Draw on everything you've learned up to this point to create 5 different microservices, which are smaller applications that are limited in scope.",
          "After creating these, you'll have 5 cool microservice APIs you can show off to friends, family, and potential employers. Oh, and you'll have a shiny new Back End Development and APIs Certification, too."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Quality Assurance",
    "intro": [
      "As your programs or web applications become more complex, you'll want to test them to make sure that new changes don't break their original functionality.",
      "In the Quality Assurance Certification, you'll learn how to write tests with Chai to ensure your applications work the way you expect them to.",
      "Then you'll build a chat application to learn advanced Node and Express concepts. You'll also use Pug as a template engine, Passport for authentication, and Socket.io for real-time communication between the server and connected clients."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Quality Assurance and Testing with Chai",
        "intro": [
          "Chai is a JavaScript testing library that helps you confirm that your program still behaves the way you expect it to after you make changes to your code.",
          "Using Chai, you can write tests that describe your program's requirements and see if your program meets them.",
          "In this course, you'll learn about assertions, deep equality, truthiness, testing APIs, and other fundamentals for testing JavaScript applications."
        ]
      },
      "advanced-node-and-express": {
        "title": "Advanced Node and Express",
        "intro": [
          "Now it's time to take a deep dive into Node.js and Express.js by building a chat application with a sign-in system.",
          "To implement the sign-in system safely, you'll need to learn about authentication. This is the act of verifying the identity of a person or process.",
          "In this course, you'll learn how to use Passport to manage authentication, Pug to create reusable templates for quickly building the front end, and web sockets for real-time communication between the clients and server."
        ]
      },
      "quality-assurance-projects": {
        "title": "Quality Assurance Projects",
        "intro": [
          "Now that you're well versed in both the front end and back end, it's time to apply all the skills and concepts you've learned up to this point. You'll build 5 different web applications, and write tests for each one to make sure they're working and can handle different edge cases.",
          "After completing these Quality Assurance projects, you'll have 5 more projects under your belt, and a new certification to show off on your portfolio."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Scientific Computing with Python (Beta)",
    "intro": [
      "The Scientific Computing with Python (Beta) curriculum will equip you with the skills to analyze and manipulate data using Python, a powerful and versatile programming language. You'll learn key concepts like data structures, algorithm, Object Oriented Programming, and how to perform complex calculations using a variety of tools.",
      "This comprehensive course will guide you through the fundamentals of scientific computing, including data structures, and algorithms."
    ],
    "note": "",
    "blocks": {
      "learn-string-manipulation-by-building-a-cipher": {
        "title": "Learn String Manipulation by Building a Cipher",
        "intro": [
          "Python is a powerful and popular programming language widely used for data science, data visualization, web development, game development, machine learning and more.",
          "In this project, you'll learn fundamental programming concepts in Python, such as variables, functions, loops, and conditional statements. You'll use these to code your first programs."
        ]
      },
      "learn-how-to-work-with-numbers-and-strings-by-implementing-the-luhn-algorithm": {
        "title": "Learn How to Work with Numbers and Strings by Implementing the Luhn Algorithm",
        "intro": [
          "The Luhn Algorithm is widely used for error-checking in various applications, such as verifying credit card numbers.",
          "By building this project, you'll gain experience working with numerical computations and string manipulation."
        ]
      },
      "learn-list-comprehension-by-building-a-case-converter-program": {
        "title": "Learn Python List Comprehension by Building a Case Converter Program",
        "intro": [
          "List Comprehension is a way to construct a new Python list from an iterable types: lists, tuples, and strings. All without using a for loop or the `.append()` list method.",
          "In this project, you'll write a program that takes a string formatted in Camel Case or Pascal Case, then converts it into Snake Case.",
          "The project has two phases: first you'll use a for loop to implement the program. Then you'll learn how to use List Comprehension instead of a loop to achieve the same results."
        ]
      },
      "learn-regular-expressions-by-building-a-password-generator": {
        "title": "Learn Regular Expressions by Building a Password Generator",
        "intro": [
          "A Python module is a file that contains a set of statements and definitions that you can use in your code.",
          "In this project, you'll learn how to import modules from the Python standard library. You'll also learn how to use Regular Expressions by building your own password generator program."
        ]
      },
      "learn-algorithm-design-by-building-a-shortest-path-algorithm": {
        "title": "Learn Algorithm Design by Building a Shortest Path Algorithm",
        "intro": [
          "Algorithms are step-by-step procedures that developers use to perform calculations and solve computational problems.",
          "In this project, you'll learn how to use functions, loops, conditional statements, and dictionary comprehensions to implement a Shortest Path algorithm."
        ]
      },
      "learn-recursion-by-solving-the-tower-of-hanoi-puzzle": {
        "title": "Learn Recursion by Solving the Tower of Hanoi Puzzle",
        "intro": [
          "Recursion is a programming approach that allows you to solve complicated computational problems with just a little code.",
          "In this project, you'll start with a loop-based approach to solving the tower of Hanoi mathematical puzzle. Then you'll learn how to implement a recursive solution."
        ]
      },
      "learn-data-structures-by-building-the-merge-sort-algorithm": {
        "title": "Learn Data Structures by Building the Merge Sort Algorithm",
        "intro": [
          "The Merge Sort Algorithm is a sorting algorithm based on the divide and conquer principle.",
          "In this project, you'll learn how to interact with data structures by sorting a list of random numbers using the Merge Sort Algorithm."
        ]
      },
      "learn-classes-and-objects-by-building-a-sudoku-solver": {
        "title": "Learn Classes and Objects by Building a Sudoku Solver",
        "intro": [
          "Classes and objects are important programming concepts. These Object-Oriented Programming tools help developers to achieve code modularity, abstraction, and readability. And they promote reusability.",
          "In this Sudoku Solver project, you'll learn how to use classes and objects to build a Sudoku grid and to solve a Sudoku puzzle."
        ]
      },
      "learn-tree-traversal-by-building-a-binary-search-tree": {
        "title": "Learn Tree Traversal by Building a Binary Search Tree",
        "intro": [
          "A Binary Search Tree (BST) is an common data structure where data is sorted hierarchically.",
          "In this project, you'll learn how to construct your own BST and perform an in-order traversal. You'll also learn key operations like insertion, search, and deletion."
        ]
      },
      "learn-lambda-functions-by-building-an-expense-tracker": {
        "title": "Learn Lambda Functions by Building an Expense Tracker",
        "intro": [
          "Lambda functions give you a concise way to write small, throwaway functions in your code.",
          "In this project, you'll explore the power of Lambda Functions by creating an expense tracker. Your resulting app will demonstrate how you can use Lambda Functions for efficient, streamlined operations."
        ]
      },
      "build-an-arithmetic-formatter-project": {
        "title": "Build an Arithmetic Formatter Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-time-calculator-project": {
        "title": "Build a Time Calculator Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-budget-app-project": {
        "title": "Build a Budget App Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-polygon-area-calculator-project": {
        "title": "Build a Polygon Area Calculator Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "build-a-probability-calculator-project": {
        "title": "Build a Probability Calculator Project",
        "intro": [
          "This is one of the required projects to claim your certification."
        ]
      },
      "learn-interfaces-by-building-an-equation-solver": {
        "title": "Learn Interfaces by Building an Equation Solver",
        "intro": [
          "Abstract classes enable you to define formal interfaces - objects acting as blueprints for classes.",
          "In this project, you'll discover how to implement an interface in Python while building a simple equation solver program."
        ]
      },
      "learn-special-methods-by-building-a-vector-space": {
        "title": "Learn Special Methods by Building a Vector Space",
        "intro": [
          "Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.",
          "In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space."
        ]
      },
      "learn-encapsulation-by-building-a-projectile-trajectory-calculator": {
        "title": "Learn Encapsulation by Building a Projectile Trajectory Calculator",
        "intro": [
          "Encapsulation is a core OOP principle based on writing code that limits direct access to data.",
          "In this project, you'll discover new concepts related to encapsulation, such as getters, setters, and name mangling, and you'll use them together with what you already learned to create a program that calculates a projectile trajectory."
        ]
      },
      "learn-the-bisection-method-by-finding-the-square-root-of-a-number": {
        "title": "Learn the Bisection Method by Finding the Square Root of a Number",
        "intro": [
          "Numerical methods are used to approximate solutions to mathematical problems that are difficult or impossible to solve analytically.",
          "In this project, you will explore the numerical method of bisection to find the square root of a number by iteratively narrowing down the possible range of values that contain the square root."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Data Analysis with Python",
    "intro": [
      "Data Analysis has been around for a long time. But up until a few years ago, developers practiced it using expensive, closed-source tools like Tableau. But recently, Python, SQL, and other open libraries have changed Data Analysis forever.",
      "In the Data Analysis with Python Certification, you'll learn the fundamentals of data analysis with Python. By the end of this certification, you'll know how to read data from sources like CSVs and SQL, and how to use libraries like Numpy, Pandas, Matplotlib, and Seaborn to process and visualize data."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Data Analysis with Python",
        "intro": [
          "In these comprehensive video courses, created by Santiago Basulto, you will learn the whole process of data analysis. You'll be reading data from multiple sources (CSV, SQL, Excel), process that data using NumPy and Pandas, and visualize it using Matplotlib and Seaborn,",
          "Additionally, we've included a thorough Jupyter Notebook course, and a quick Python reference to refresh your programming skills."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Learn the basics of the NumPy library in the following video course created by Keith Galli.",
          "In this course, you'll learn how NumPy works and how it compares to Python's built-in lists. You'll also learn how to write code with NumPy, indexing, reshaping, applied statistics, and much more."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Data Analysis with Python Projects",
        "intro": [
          "There are many ways to analyze data with Python. By completing these projects, you will demonstrate that you have a good foundational knowledge of data analysis with Python.",
          "Finish them all to claim your Data Analysis with Python certification."
        ]
      }
    }
  },
  "information-security": {
    "title": "Information Security",
    "intro": [
      "With everything we do online, there's a vast amount of sensitive information at risk: email addresses, passwords, phone numbers, and much more.",
      "With the Information Security Certification, you'll build a secure web app with HelmetJS to learn the fundamentals of protecting people's information online.",
      "You'll also build a TCP client, and an Nmap and port scanner in Python. This will help you learn the basics of penetration testing — an important component of good information security."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Information Security with HelmetJS",
        "intro": [
          "This programming course focuses on HelmetJS, a type of middleware for Express-based applications that automatically sets HTTP headers. This way it can prevent sensitive information from unintentionally being passed between the server and client.",
          "Completing the courses below will help you understand how to protect your website from malicious behavior."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python for Penetration Testing",
        "intro": [
          "These video courses teach you penetration testing with Python. Also known as a pen test, penetration testing is a simulated attack against a system to check for vulnerabilities.",
          "In this course, you'll learn about sockets, create a TCP server and client, build an Nmap scanner, and other tools and techniques that pen testers use daily."
        ]
      },
      "information-security-projects": {
        "title": "Information Security Projects",
        "intro": [
          "Now it’s time to put your new information security skills to work. These projects will give you a chance to apply the infosec skills, principles, and concepts you've learned.",
          "When you are done, you will have plenty of information security projects under your belt, along with a certification that you can show off to friends, family, and employers."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Machine Learning with Python",
    "intro": [
      "Machine learning has many practical applications that you can use in your projects or on the job.",
      "In the Machine Learning with Python Certification, you'll use the TensorFlow framework to build several neural networks and explore more advanced techniques like natural language processing and reinforcement learning.",
      "You'll also dive into neural networks, and learn the principles behind how deep, recurrent, and convolutional neural networks work."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "TensorFlow",
        "intro": [
          "TensorFlow is an open source framework that makes machine learning and neural networking easier to use.",
          "The following video course was created by Tim Ruscica, also known as “Tech With Tim”. It will help you to understand TensorFlow and some of its powerful capabilities."
        ]
      },
      "how-neural-networks-work": {
        "title": "How Neural Networks Work",
        "intro": [
          "Neural networks are at the core of what we call artificial intelligence today. But historically they've been hard to understand. Especially for beginners in the machine learning field.",
          "Even if you are completely new to neural networks, these video courses by Brandon Rohrer will get you comfortable with the concepts and the math behind them."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Machine Learning with Python Projects",
        "intro": [
          "Machine learning has many practical applications. By completing these free and challenging coding projects, you will demonstrate that you have a good foundational knowledge of machine learning, and qualify for your Machine Learning with Python certification."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "College Algebra with Python",
    "intro": [
      "This course is designed as a one-semester college course. It consists of instructional videos, with Google Colaboratory notebooks to follow along interactively, assignments, and challenging projects.",
      "As you go through each part of this course in sequence, you will gain a full understanding of Algebra and how to write Python code to solve Algebra problems.",
      "Throughout this course, you will also build your own Algebra Colab notebook that you will be able to use as your custom calculator. This course (and the code you write here) will give you the foundation for a deeper math and data science understanding."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Learn Ratios and Proportions",
        "intro": [
          "Your journey begins here as you learn how to set up a Colab Notebook that can run Python code. Then, use the notebook to follow along with the videos to learn ratios and proportions using Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Learn How to Solve for X",
        "intro": [
          "This unit will focus on how to solve for an unknown number (often referred to as \"x\") using written Algebra and Python code."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Learn Fractions and Decimals",
        "intro": [
          "This unit will focus on converting decimals to fractions and percents."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Learn Functions and Graphing",
        "intro": ["This unit will teach you about math functions."]
      },
      "learn-linear-functions": {
        "title": "Learn Linear Functions",
        "intro": [
          "This unit will show you how to develop linear equations from two points."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Learn Common Factors and Square Roots",
        "intro": [
          "In this unit, you will learn how to find common factors and divide them out. This will be useful when simplifying fractions and factoring square roots."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Multi-Function Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a multi-function calculator."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Learn How to Graph Systems of Equations",
        "intro": [
          "This unit will focus on graphing two equations on the same coordinate plane, so that you can see where the lines intersect."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Learn How to Solve Systems of Equations",
        "intro": [
          "In this unit, you will learn how to solve a system of two equations (with two variables) without graphing. You will see how you can factor an equation and solve for a certain variable in Python. By the end of this unit, you will be able to solve and graph the system with one block of code."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Learn Applications of Linear Systems",
        "intro": [
          "In this unit, you will see how you can use the algebra you learned so far to solve real world problems."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Learn Quadratic Equations",
        "intro": [
          "This unit will go beyond linear equations, to work with exponents and graph parabolas. You will learn how to find key points in parabolas and how to solve quadratic equations."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Graphing Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a graphing calculator."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Learn Parent Graphs and Polynomials",
        "intro": [
          "This unit will show you many different types of \"parent\" graphs, the basic patterns that make up more complicated graphs. Polynomials are mathematical expressions with \"multiple things\" - the more complicated equations that are built with basic patterns. You will see what these graphs look like, how to modify them, and how to do this all with Python code."
        ]
      },
      "build-three-math-games-project": {
        "title": "Three Math Games",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build three math games."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Learn Business Applications of College Algebra",
        "intro": [
          "This unit will show you how to apply your solving and graphing skills to find cost, revenue, and profit. You will write code to develop a demand function from two points. You will see how price affects the profit graph and how all of these equations relate to each other."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Learn Simple and Compound Interest",
        "intro": [
          "This unit will show you how to calculate interest, loan payments, and the estimated value of investments. You will see the math formula and turn that into code. Because these formulas tend to get complicated, you will appreciate having the code where you can just modify a few values."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Learn Exponents and Logarithms",
        "intro": [
          "This unit will show you how exponents and logarithms are inverse functions, and how you can use these functions in various applications."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Financial Calculator",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a financial calculator."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "College Algebra with Python: Conclusion",
        "intro": [
          "This will be the last unit in this course. Let's look at how you can connect your Math and Python knowledge with external data."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Data Graph Explorer",
        "intro": [
          "This is one of the required projects to earn your certification.",
          "For this project, you will build a data graph explorer."
        ]
      }
    }
  },
  "python-for-everybody": {
    "title": "Legacy Python for Everybody",
    "intro": [
      "Python is one of the most popular, flexible programming languages today. You can use it for everything from basic scripting to machine learning."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python for Everybody",
        "intro": [
          "Python for everybody is a free video course series that teaches the basics of using Python 3.",
          "The courses were created by Dr. Charles Severance (also known as Dr. Chuck). He is a Clinical Professor at the University of Michigan School of Information, where he teaches various technology-oriented courses including programming, database design, and web development."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Coding Interview Prep",
    "intro": [
      "If you're looking for free coding exercises to prepare for your next job interview, we've got you covered.",
      "This section contains hundreds of coding challenges that test your knowledge of algorithms, data structures, and mathematics. It also has a number of take-home projects you can use to strengthen your skills, or add to your portfolio."
    ],
    "note": "The Project Euler Project and Rosetta Code have been moved to their own courses. Go back to the curriculum to see the list of courses we offer.",
    "blocks": {
      "algorithms": {
        "title": "Algorithms",
        "intro": [
          "These free programming exercises will teach you about some common algorithms that you will likely encounter in real life. They are a great opportunity to improve your logic and programming skills.",
          "These algorithms are frequently used in job interviews to test a candidate's skills. We'll give you clear and concise explanations of how these different algorithms work so you can implement a solution for each one."
        ]
      },
      "data-structures": {
        "title": "Data Structures",
        "intro": [
          "These free programming courses are meant to help you deal with large and complex data structures that you may not yet be familiar with.",
          "Working through the courses below, you will learn about each type of data structure, and implement algorithms to reinforce your understanding of them."
        ]
      },
      "take-home-projects": {
        "title": "Take Home Projects",
        "intro": [
          "Programming interviews have always been stressful. Job applicants are sometimes given a take home project to be completed outside of the interview. These types of interviews usually require a lot of work, but they're a great way for employers to see how you might perform on the job.",
          "Build the bonus coding projects below for extra practice. Take your time, make them great, and put them on your resume or portfolio to show potential employers."
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "The Odin Project - freeCodeCamp Remix (Beta)",
    "intro": [
      "The Odin Project was created in 2013 by a lone developer, Erik Trautman. Over the years, an open source community has sprung up to maintain and expand the project.",
      "freeCodeCamp has expanded upon the open source curriculum to make it run interactively in the browser, with tests to evaluate your code and ensure you've understood key concepts.",
      "If you want the original experience of configuring all of The Odin Project to run on your local computer, you can check out the original Odin Project on <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>The Odin Project website</a>. A huge thanks to The Odin Project community for continuing to maintain this valuable learning resource for developers all around the world.",
      "This course is unofficial, and not endorsed by The Odin Project. Changes to The Odin Project curriculum content have been made, and all instructional material for this course is licenced under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; The Odin Project</a>",
      "This course includes content from <a href='javascript.info'>JavaScript.info</a>, which is licenced under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>"
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Learn HTML Foundations",
        "intro": [
          "Get a solid grasp of HTML essentials with this course. From structuring web pages to understanding semantic tags, you'll build a strong foundation for creating well-organized and accessible content on the web."
        ]
      },
      "top-working-with-text": {
        "title": "Working with Text",
        "intro": [
          "Explore the intricacies of working with text in web development. Learn about text formatting, manipulation, and presentation to enhance your skills in creating web content."
        ]
      },
      "top-links-and-images": {
        "title": "Links and Images",
        "intro": [
          "Learn how to incorporate links and images into your web projects. This course covers the fundamentals of creating links and embedding images to make your websites more interactive and visually appealing."
        ]
      },
      "top-build-a-recipe-project": {
        "title": "Learn HTML Foundations by Building a Recipe Page",
        "intro": [
          "Put your HTML skills into practice by building a recipe page. This hands-on project allows you to apply your knowledge and create a functional web page while reinforcing key concepts of HTML development."
        ]
      },
      "top-learn-css-foundations": {
        "title": "Learn CSS Foundations",
        "intro": [
          "Dive into the world of Cascading Style Sheets (CSS) and learn how to style your HTML elements. Explore styling properties, selectors, and layouts to bring your web pages to life."
        ]
      },
      "top-learn-css-foundations-projects": {
        "title": "Learn CSS Foundations Projects",
        "intro": [
          "Take your CSS skills to the next level by working on practical projects. This course provides hands-on experience in applying CSS to create responsive designs for real-world scenarios."
        ]
      },
      "top-learn-css-specificity": {
        "title": "Learn CSS Specificity",
        "intro": [
          "Learn CSS specificity and gain a better understanding of how styles are applied to HTML elements. This course explores the nuances of CSS rules and helps you write efficient and targeted styles for your web pages."
        ]
      },
      "top-the-box-model": {
        "title": "Learn the Box Model",
        "intro": [
          "Learn the CSS box model with this course. Understand how elements are rendered on the web, and learn to manipulate spacing, borders, and padding to achieve your desired layout and design."
        ]
      },
      "top-introduction-to-flexbox": {
        "title": "Introduction to Flexbox",
        "intro": [
          "Discover the power of Flexbox, a layout model that simplifies the design of flexible and responsive web layouts. Learn how to create dynamic and adaptive page structures with ease."
        ]
      },
      "top-learn-block-and-inline": {
        "title": "Learn the difference between Block and Inline",
        "intro": [
          "Explore the distinctions between block and inline elements in HTML and CSS. This course provides insights into how these display types affect layout and behavior, empowering you to make informed design decisions."
        ]
      },
      "top-learn-variables-and-operators": {
        "title": "Learn Variables and Operators",
        "intro": [
          "Get started with JavaScript by learning about variables and operators. This course covers the fundamentals of JavaScript programming, including data types, operators, and variable declarations."
        ]
      },
      "top-learn-data-types-and-conditionals": {
        "title": "Learn Data Types and Conditionals",
        "intro": ["Learn about data types and conditionals in JavaScript."]
      },
      "top-learn-function-basics": {
        "title": "Learn Function Basics",
        "intro": ["Learn about functions in JavaScript."]
      },
      "top-basic-function-projects": {
        "title": "Basic Function Projects",
        "intro": [
          "Put your JavaScript skills to the test by building basic functions."
        ]
      },
      "top-learn-arrays-and-loops": {
        "title": "Learn Arrays and Loops",
        "intro": ["Learn about arrays and loops in JavaScript."]
      },
      "top-learn-to-solve-problems-and-understand-errors": {
        "title": "Learn to Solve Problems and Understand Errors",
        "intro": [
          "Learn how to solve problems and understand errors in JavaScript."
        ]
      },
      "top-build-a-rock-paper-scissors-game": {
        "title": "Build a Rock Paper Scissor Game",
        "intro": [
          "Put your JavaScript skills to the test by building a Rock Paper Scissors game."
        ]
      }
    }
  },
  "project-euler": {
    "title": "Project Euler",
    "intro": [
      "Complete the programming challenges below, from the massive Project Euler archives. These will harden your algorithm and mathematics knowledge.",
      "These problems range in difficulty and, for many, the experience is inductive chain learning. That is, by solving one problem, it will expose you to a new concept that allows you to undertake a previously inaccessible problem. Can you finish them all?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Project Euler Problems 1 to 100",
        "intro": [
          "In this first set of challenges, you will use mathematical concepts like the Fibonacci sequence, prime number theory, and combinatorics to write efficient algorithms to solve these problems."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Project Euler Problems 101 to 200",
        "intro": [
          "In this set of challenges, you'll build upon the skills you learned in the first part of the course and use more advanced concepts like vector computation, Pascal's pyramid, and the RSA algorithm to solve these problems efficiently."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Project Euler Problems 201 to 300",
        "intro": [
          "In this set of challenges, you'll continue to build upon the skills you learned earlier and use concepts like the binomial theorem, Hamming numbers, and the Collatz sequence to further develop your math and problem solving skills."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Project Euler Problems 301 to 400",
        "intro": [
          "Here you will continue to flex your mathematical and algorithmic skills as you use concepts such as combinatorial game theory, bitwise operations, and Golomb's self-describing sequence to develop efficient solutions to these problems."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Project Euler Problems 401 to 480",
        "intro": [
          "In this final set of challenges, you will need draw upon everything you learned up to this point and use advanced concepts like unitary divisors, the Kaprekar routine, and much more to solve these complex problems."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "(New) Foundational C# with Microsoft",
    "intro": [
      "This course offers a comprehensive introduction to C# programming, covering its core concepts, syntax, and practical application in software development.",
      "Through hands-on exercises and projects, you will learn the fundamentals of C#, including variables, data types, control structures, and object-oriented programming principles.",
      "By the end of this course, you will have gained the practical skills and knowledge needed to confidently leverage C# for building applications."
    ],
    "note": "Each section below has a trophy associated with it that you must earn on the Microsoft Learn platform. After earning each trophy, you need to verify them on freeCodeCamp. Once you have done those, you can qualify for the certification exam.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Write Your First Code Using C#",
        "intro": [
          "Begin your journey by learning to write your first code using C#. Develop a strong foundation as you explore the fundamentals and syntax of the language, setting the stage for your programming adventures."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Create and Run Simple C# Console Applications",
        "intro": [
          "Master the art of creating and running simple C# console applications. Dive into the world of console-based programming, where you will gain hands-on experience executing your code and seeing it in action."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Add Logic to C# Console Applications",
        "intro": [
          "Unlock the power of logic in C# console applications. Learn how to add logic and decision-making capabilities to your code, enabling your applications to make dynamic choices and respond intelligently to different scenarios."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Work with Variable Data in C# Console Applications",
        "intro": [
          "Discover the versatility of variable data in C# console applications. Harness the ability to store and manipulate different types of data, such as numbers and text, as you delve into the essential concepts of variables and data handling."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Create Methods in C# Console Applications",
        "intro": [
          "Take your C# console applications to the next level by mastering the art of creating methods. Learn how to organize and modularize your code, making it more manageable, reusable, and efficient."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Debug C# Console Applications",
        "intro": [
          "Sharpen your troubleshooting skills as you dive into the world of debugging C# console applications. Gain the ability to identify and fix issues in your code, ensuring your applications run smoothly and deliver the desired results."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Foundational C# with Microsoft Certification Exam",
        "intro": [
          "Use what you've learned to pass the exam to earn your Foundational C# with Microsoft Certification"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Upcoming Python",
    "intro": ["placeholder"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Learn Python by Building a Blackjack Game",
        "intro": ["Learn Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Upcoming Python Project",
        "intro": ["placeholder"]
      }
    }
  },
  "a2-english-for-developers": {
    "title": "A2 English for Developers (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": [
      "In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the A2 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.",
      "The first half of the curriculum will help you get comfortable with English grammar and usage. It will give you tons of hands-on practice. You'll learn basics like introducing yourself, making small talk, and discussing your work.",
      "In the second half, you'll practice vocabulary specific to software development. You'll learn how to describe code, discuss tech trends, and participate in stand-up meetings.",
      "This entire A2-level curriculum includes 105 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting."
    ],
    "blocks": {
      "learn-greetings-in-your-first-day-at-the-office": {
        "title": "Learn Greetings in your First Day at the Office",
        "intro": [
          "In this first course, you'll learn common expressions for situations you may encounter on your first day at work. You'll learn about introductions, getting to know people, asking for lunch recommendations, and getting an access card from security."
        ]
      },
      "learn-introductions-in-an-online-team-meeting": {
        "title": "Learn Introductions in an Online Team Meeting",
        "intro": [
          "In this course, you'll learn how to give a personal introduction. You'll also learn how to state your profession, and share your goals in group meetings."
        ]
      },
      "learn-conversation-starters-in-the-break-room": {
        "title": "Learn Conversation Starters in the Break Room",
        "intro": [
          "In this course, you'll learn how to start a conversation in casual settings. You'll also learn how to talk about your hobbies and personality traits. You'll even learn how to ask about places around the town."
        ]
      },
      "learn-how-to-talk-about-a-typical-workday-and-tasks": {
        "title": "Learn How to Talk About a Typical Workday and Tasks",
        "intro": [
          "In this course, you'll learn how to talk about your workday and the tasks that you perform in the workplace and how to share them with others. It mainly focuses on the structures used for describing your activities and task-related vocabulary."
        ]
      },
      "learn-how-to-discuss-your-morning-or-evening-routine": {
        "title": "Learn How to Discuss Your Morning or Evening Routine",
        "intro": [
          "In this course, you'll learn how to talk about details of your routine and share them with someone else. It mainly focuses on the structures used for declaring routine actions and related vocabulary."
        ]
      },
      "learn-how-to-describe-your-current-project": {
        "title": "Learn How to Describe Your Current Project",
        "intro": [
          "In this course, you'll learn how to talk about the projects that you are involved in and how to inform others of what you are doing in these projects. It mainly focuses on the structures used for informing it and on the related vocabulary."
        ]
      },
      "learn-how-to-ask-and-share-about-educational-and-professional-background": {
        "title": "Learn How to Ask and Share About Educational and Professional Background",
        "intro": [
          "In this course, you'll learn how to ask about another person's educational and professional backgrounds and you'll learn how to share information about your background as well."
        ]
      },
      "learn-how-to-talk-about-hobbies-and-interests": {
        "title": "Learn How to Talk About Hobbies and Interests",
        "intro": [
          "In this course, you'll learn different ways to talk about hobbies and things that interest you. You'll also learn how to ask about other people's hobbies and how to invite them to join you in these activities."
        ]
      },
      "learn-how-to-discuss-roles-and-responsibilies": {
        "title": "Learn How to Discuss Roles and Responsibilities",
        "intro": [
          "In this course, you'll discuss people's roles and responsibilities in a company and out of it. You'll discover how to ask about these roles and responsibilities and how to share information about you related to the topic."
        ]
      },
      "learn-how-to-have-a-conversation-about-preferences-and-motivations": {
        "title": "Learn How to Have a Conversation About Preferences and Motivations",
        "intro": [
          "In this course, you'll learn how to ask about what motivates people in their personal and professional lives, answer questions related to your motivations, and discuss about people's preferences."
        ]
      },
      "learn-how-to-discuss-popular-trends-in-technology": {
        "title": "Learn How to Discuss Popular Trends in Technology",
        "intro": [
          "In this course, you'll learn how to discuss about things that everybody's talking about in technology these days."
        ]
      },
      "learn-how-to-clarify-information-in-different-interactions": {
        "title": "Learn How to Clarify Information in Different Interactions",
        "intro": [
          "In this course, you'll learn how to check to see if the information you had is correct and how to ask for clarification when something is not clear to you."
        ]
      },
      "learn-how-to-use-basic-programming-vocabulary-in-conversations": {
        "title": "Learn How to Use Basic Programming Vocabulary in Conversations",
        "intro": [
          "This course will present basic vocabulary related to programming. You'll learn how to ask questions related to basic programming concepts."
        ]
      },
      "learn-how-to-use-code-related-concepts-and-terms": {
        "title": "Learn How to Use Code-related Concepts and Terms",
        "intro": [
          "In this course, you will be introduced to terms related to coding and learn how to use them in conversation."
        ]
      },
      "learn-how-to-discuss-tech-trends-and-updates": {
        "title": "Learn How to Discuss Tech Trends and Updates",
        "intro": [
          "In this course, you will be introduced to some recent trends in the world of technology and learn how to discuss them in English."
        ]
      },
      "learn-how-to-help-a-coworker-troubleshoot-on-github": {
        "title": "Learn How to Help a Coworker Troubleshoot on GitHub",
        "intro": [
          "In this course, you will learn expression related to how to ask for help from a coworker as well as how to offer them some assistance."
        ]
      },
      "learn-how-to-share-your-progress-in-weekly-stand-up-meetings": {
        "title": "Learn How to Share Your Progress in Weekly Stand-up Meetings",
        "intro": [
          "This course will show you how to talk about your projects in terms of what you have already done and what you are currently doing in them."
        ]
      },
      "learn-how-to-ask-for-clarification-on-code-understanding": {
        "title": "Learn How to Ask for Clarification on Code Understanding",
        "intro": [
          "In this course, you will see how you can ask questions to clarify things which are not very clear to you in a code."
        ]
      },
      "learn-how-to-document-code-for-a-project": {
        "title": "Learn How to Document Code for a Project",
        "intro": [
          "This course will show you expressions related to what to do when documenting code."
        ]
      },
      "learn-how-to-read-and-understand-code-documentation": {
        "title": "Learn How to Read and Understand Code Documentation",
        "intro": [
          "This course will present more expressions related to code documentation and bring tips on how to understand it."
        ]
      },
      "learn-how-to-analyze-code-documentation": {
        "title": "Learn How to Analyze Code Documentation",
        "intro": [
          "In this course, you will see some ideas to help you to approach documentation and analyze it in simple terms."
        ]
      },
      "learn-how-to-share-progress-and-accomplishments": {
        "title": "Learn How to Share Progress and Accomplishments",
        "intro": [
          "In this course, you will learn how to share your progress with coworkers and tell about what successes you've had in your projects."
        ]
      },
      "learn-how-to-talk-about-updates-and-plans-for-tasks-and-projects": {
        "title": "Learn How to Talk about Updates and Plans for Tasks and Projects",
        "intro": [
          "This course will show you how to speak about the most recent advancements in your projects and about your plans."
        ]
      },
      "learn-how-to-express-agreement-or-disagreement": {
        "title": "Learn How to Express Agreement or Disagreement",
        "intro": [
          "This course will introduce how to say that you agree with what another person says and to tell them politely that you do not agree with them."
        ]
      },
      "learn-how-to-offer-technical-support-and-guidance": {
        "title": "Learn How to Offer Technical Support and Guidance",
        "intro": [
          "In this course, you will see ways of offering some help in terms of technical specifics to another person."
        ]
      },
      "learn-how-to-request-and-receive-guidance": {
        "title": "Learn How to Request and Receive Guidance",
        "intro": [
          "This course will show you how to ask for assistance from a coworker when you need it."
        ]
      },
      "learn-how-to-provide-explanations-when-helping-others": {
        "title": "Learn How to Provide Explanations When Helping Others",
        "intro": [
          "This course will provide you with ways to explain things to other people while assisting them."
        ]
      }
    }
  },
  "b1-english-for-developers": {
    "title": "B1 English for Developers (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"],
    "blocks": {
      "learn-how-to-describe-places-and-events": {
        "title": "Learn How to Describe Places and Events",
        "intro": [""]
      },
      "learn-how-to-talk-about-past-experiences": {
        "title": "Learn How to Talk About Past Experiences",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-past-activities": {
        "title": "Learn How to Talk About Past Activities",
        "intro": ["", ""]
      },
      "learn-present-perfect-while-talking-about-accessibility": {
        "title": "Learn Present Perfect while Talking About Accessibility",
        "intro": ["", ""]
      },
      "learn-how-to-plan-future-events": {
        "title": "Learn How to Plan Future Events",
        "intro": ["", ""]
      },
      "learn-future-continuous-while-describing-actions": {
        "title": "Learn Future Continuous while Describing Actions",
        "intro": ["", ""]
      },
      "learn-how-to-use-conditionals": {
        "title": "Learn How to Use Conditionals",
        "intro": ["", ""]
      },
      "learn-how-to-share-feedback": {
        "title": "Learn How to Share Feedback",
        "intro": ["", ""]
      },
      "learn-how-to-share-your-opinion": {
        "title": "Learn How to Share Your Opinion",
        "intro": ["", ""]
      },
      "learn-how-to-express-agreement": {
        "title": "Learn How to Express Agreement",
        "intro": ["", ""]
      },
      "learn-how-to-express-disagreement": {
        "title": "Learn How to Express Disagreement",
        "intro": ["", ""]
      },
      "learn-how-to-express-concerns": {
        "title": "Learn How to Express Concerns",
        "intro": ["", ""]
      },
      "learn-how-to-express-decisions-based-on-comparisons": {
        "title": "Learn How to Express Decisions Based on Comparisons",
        "intro": ["", ""]
      },
      "learn-how-to-use-modal-verbs": {
        "title": "Learn How to Use Modal Verbs",
        "intro": ["", ""]
      },
      "learn-how-to-manage-a-conversation": {
        "title": "Learn How to Manage a Conversation",
        "intro": ["", ""]
      },
      "learn-how-to-clarify-misunderstandings": {
        "title": "Learn How to Clarify Misunderstandings",
        "intro": ["", ""]
      },
      "learn-about-speculation-and-requests": {
        "title": "Learn About Speculation and Requests",
        "intro": ["", ""]
      },
      "learn-about-adverbial-phrases": {
        "title": "Learn About Adverbial Phrases",
        "intro": ["", ""]
      },
      "learn-how-to-use-adjectives-in-conversations": {
        "title": "Learn How to Use Adjectives in Conversations",
        "intro": ["", ""]
      },
      "learn-determiners-and-advanced-use-of-articles": {
        "title": "Learn Determiners and Advanced Use of Articles",
        "intro": ["", ""]
      },
      "learn-how-to-use-reported-speech": {
        "title": "Learn How to Use Reported Speech",
        "intro": ["", ""]
      },
      "learn-how-to-use-prepositions-according-to-context": {
        "title": "Learn How to Use Prepositions According to Context",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-numbers-with-a-coworker": {
        "title": "Learn How to Talk About Numbers with a Coworker",
        "intro": ["", ""]
      },
      "learn-common-phrasal-verbs-and-idioms": {
        "title": "Learn Common Phrasal Verbs and Idioms",
        "intro": ["", ""]
      }
    }
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Level up your creative problem solving skills with these free programming tasks from the classic Rosetta Code library.",
      "These challenges can prove to be difficult, but they will push your algorithm logic to new heights.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Attribute: Rosetta Code</a>"
    ],
    "blocks": {
      "rosetta-code-challenges": {
        "title": "Rosetta Code Challenges",
        "intro": ["These are the challenges for Rosetta Code."]
      }
    }
  },
  "front-end-development": {
    "title": "Front End Development",
    "intro": ["placeholder"],
    "blocks": {
      "efpl": { "title": "0", "intro": [] },
      "xpmy": { "title": "1", "intro": [] },
      "workshop-cat-photo-app": {
        "title": "Build a Cat Photo App",
        "intro": [
          "HTML stands for HyperText Markup Language and it represents the content and structure of a web page.",
          "In this workshop, you will learn how to work with basic HTML elements such as headings, paragraphs, images, links, and lists."
        ]
      },
      "lab-recipe-page": {
        "title": "Build a Recipe Page",
        "intro": [
          "For this lab, you will create a web page of your favorite recipe."
        ]
      },
      "gwyd": { "title": "4", "intro": [] },
      "lab-travel-agency-page": {
        "title": "Build a Travel Agency Page",
        "intro": [
          "For this lab, you will create a web page of a travel agency."
        ]
      },
      "vipr": { "title": "6", "intro": [] },
      "lab-video-compilation-page": {
        "title": "Build a Video Compilation Page",
        "intro": ["For this lab, you will create a video compilation web page."]
      },
      "bzfv": { "title": "8", "intro": [] },
      "snuv": { "title": "9", "intro": [] },
      "quiz-basic-html": {
        "title": "Basic HTML Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic HTML knowledge."
        ]
      },
      "evdc": { "title": "11", "intro": [] },
      "workshop-blog-page": {
        "title": "Build a Cat Blog Page",
        "intro": [
          "In this workshop, you will learn how to build an HTML only blog page using semantic elements including the <code>main</code>, <code>nav</code>, <code>article</code> and <code>footer</code> elements."
        ]
      },
      "lab-event-hub": {
        "title": "Build an Event Hub",
        "intro": [
          "In this lab, you will build an event hub using semantic HTML."
        ]
      },
      "ijdq": { "title": "14", "intro": [] },
      "quiz-semantic-html": {
        "title": "Semantic HTML Quiz",
        "intro": [
          "Test what you've learned in this quiz of semantic HTML knowledge."
        ]
      },
      "cfgp": { "title": "16", "intro": [] },
      "workshop-hotel-feedback-form": {
        "title": "Build a Hotel Feedback Form",
        "intro": [
          "In this workshop, you will learn how to work with forms by building a Hotel Feedback Form.",
          "You will learn how to work with labels, inputs, fieldsets, legends, textareas and buttons."
        ]
      },
      "lab-survey-form": {
        "title": "Build a Survey Form",
        "intro": ["For this lab, you will create a survey form."]
      },
      "wgot": { "title": "19", "intro": [] },
      "workshop-final-exams-table": {
        "title": "Build a Final Exams Table",
        "intro": [
          "In this workshop, you will learn how to work with HTML tables by building a table of final exams."
        ]
      },
      "lab-book-catalog-table": {
        "title": "Build a Book Catalog Table",
        "intro": [
          "In this lab, you will create table filled with book information."
        ]
      },
      "rsve": { "title": "22", "intro": [] },
      "xzam": { "title": "23", "intro": [] },
      "quiz-html-tables-and-forms": {
        "title": "HTML Tables and Forms Quiz",
        "intro": [
          "Test what you've learned in this quiz of HTML tables and forms."
        ]
      },
      "ghoc": { "title": "25", "intro": [] },
      "lab-checkout-page": {
        "title": "Build a Checkout Page",
        "intro": ["In this lab, you will create an accessible checkout page."]
      },
      "fqai": { "title": "27", "intro": [] },
      "quiz-html-accessibility": {
        "title": "HTML Accessibility Quiz",
        "intro": [
          "Test what you've learned in this quiz of HTML accessibility knowledge."
        ]
      },
      "pspj": { "title": "29", "intro": [] },
      "qpra": { "title": "30", "intro": [] },
      "joim": { "title": "31", "intro": [] },
      "gvtb": { "title": "32", "intro": [] },
      "cqhu": { "title": "33", "intro": [] },
      "tmdc": { "title": "34", "intro": [] },
      "quiz-computer-basics": {
        "title": "Computer Basics Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic computer knowledge."
        ]
      },
      "dxpc": { "title": "36", "intro": [] },
      "workshop-cafe-menu": {
        "title": "Design a Cafe Menu",
        "intro": [
          "CSS tells the browser how to display your webpage. You can use CSS to set the color, font, size, and other aspects of HTML elements.",
          "In this workshop, you'll learn CSS by designing a menu page for a cafe webpage."
        ]
      },
      "lab-business-card": {
        "title": "Design a Business Card",
        "intro": [
          "In this lab, you'll create a business card and style it using CSS."
        ]
      },
      "gnuk": { "title": "39", "intro": [] },
      "zlfj": { "title": "40", "intro": [] },
      "quiz-basic-css": {
        "title": "Basic CSS Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic CSS knowledge."
        ]
      },
      "sdul": { "title": "42", "intro": [] },
      "lab-stylized-to-do-list": {
        "title": "Build a Stylized To-Do List",
        "intro": [
          "In this lab, you'll build a To-Do list and apply different styles to the links"
        ]
      },
      "humj": { "title": "44", "intro": [] },
      "pahx": { "title": "45", "intro": [] },
      "rzdx": { "title": "46", "intro": [] },
      "quiz-css-backgrounds-and-borders": {
        "title": "CSS Backgrounds and Borders Quiz",
        "intro": [
          "Test what you've learned in this quiz of backgrounds and borders in CSS."
        ]
      },
      "ljmt": { "title": "48", "intro": [] },
      "lxpk": { "title": "49", "intro": [] },
      "lzqy": { "title": "50", "intro": [] },
      "gvel": { "title": "51", "intro": [] },
      "quiz-design-fundamentals": {
        "title": "Design Fundamentals Quiz",
        "intro": [
          "Test what you've learned in this quiz of UI design fundamentals."
        ]
      },
      "bgrw": { "title": "53", "intro": [] },
      "sbnz": { "title": "54", "intro": [] },
      "lab-event-flyer-page": {
        "title": "Build an Event Flyer Page",
        "intro": [
          "In this lab, you will use absolute and relative CSS units to create an event flyer page."
        ]
      },
      "ywfm": { "title": "56", "intro": [] },
      "quiz-css-relative-and-absolute-units": {
        "title": "CSS Relative and Absolute Units Quiz",
        "intro": [
          "Test what you've learned in this quiz of relative and absolute units in CSS."
        ]
      },
      "ohhu": { "title": "58", "intro": [] },
      "syga": { "title": "59", "intro": [] },
      "lab-job-application-form": {
        "title": "Build a Job Application Form",
        "intro": [
          "In this lab you will build a job application form and style it using pseudo-classes."
        ]
      },
      "ivpx": { "title": "61", "intro": [] },
      "quiz-css-pseudo-classes": {
        "title": "CSS Pseudo-classes Quiz",
        "intro": [
          "Test what you've learned in this quiz of pseudo-classes in CSS."
        ]
      },
      "fvcj": { "title": "63", "intro": [] },
      "ogdb": { "title": "64", "intro": [] },
      "zxiy": { "title": "65", "intro": [] },
      "qpze": { "title": "66", "intro": [] },
      "quiz-css-colors": {
        "title": "CSS Colors Quiz",
        "intro": [
          "Test what you've learned in this quiz of using colors in CSS."
        ]
      },
      "jnqt": { "title": "68", "intro": [] },
      "vkei": { "title": "69", "intro": [] },
      "lab-contact-form": {
        "title": "Design a Contact Form",
        "intro": [
          "In this lab, you will design a contact form in HTML and style it using CSS."
        ]
      },
      "ipmw": { "title": "71", "intro": [] },
      "quiz-styling-forms": {
        "title": "Styling Forms Quiz",
        "intro": [
          "Test what you've learned in this quiz of how to style forms using CSS."
        ]
      },
      "qzcx": { "title": "73", "intro": [] },
      "wozq": { "title": "74", "intro": [] },
      "lab-confidential-email-page": {
        "title": "Build a Confidential Email Page",
        "intro": [
          "For this lab, you will create a web page of a confidential email using HTML and CSS."
        ]
      },
      "zter": { "title": "76", "intro": [] },
      "quiz-css-layout-and-effects": {
        "title": "CSS Layout and Effects Quiz",
        "intro": [
          "Test what you've learned in this quiz of the box model, transforms, filters, and overflow in CSS."
        ]
      },
      "tcwi": { "title": "78", "intro": [] },
      "uptf": { "title": "79", "intro": [] },
      "lab-page-of-playing-cards": {
        "title": "Build a Page of Playing Cards",
        "intro": [
          "For this lab, you will use flexbox to create a webpage of playing cards."
        ]
      },
      "kqao": { "title": "81", "intro": [] },
      "quiz-css-flexbox": {
        "title": "CSS Flexbox Quiz",
        "intro": [
          "Test what you've learned in this quiz of using flexbox in CSS."
        ]
      },
      "vqut": { "title": "83", "intro": [] },
      "ujcf": { "title": "84", "intro": [] },
      "lab-newspaper-article": {
        "title": "Build a Newspaper Article",
        "intro": [
          "In this lab, you will build a newspaper article page using HTML and CSS."
        ]
      },
      "hbme": { "title": "86", "intro": [] },
      "quiz-css-typography": {
        "title": "CSS Typography Quiz",
        "intro": ["Test what you've learned in this quiz of typography in CSS."]
      },
      "dyvj": { "title": "88", "intro": [] },
      "rjsv": { "title": "89", "intro": [] },
      "lab-tribute-page": {
        "title": "Build a Tribute Page",
        "intro": [
          "For this lab, you will build a tribute page for a subject of your choosing, fictional or real."
        ]
      },
      "fnde": { "title": "91", "intro": [] },
      "quiz-css-accessibility": {
        "title": "CSS Accessibility Quiz",
        "intro": [
          "Test what you've learned in this quiz of making your webpage accessible with CSS."
        ]
      },
      "swpl": { "title": "93", "intro": [] },
      "hcje": { "title": "94", "intro": [] },
      "lab-book-inventory-app": {
        "title": "Build a Book Inventory App",
        "intro": ["For this lab, you will create a book inventory app."]
      },
      "huyd": { "title": "96", "intro": [] },
      "quiz-css-attribute-selectors": {
        "title": "CSS Attribute Selectors Quiz",
        "intro": [
          "Test what you've learned in this quiz of using attribute selectors in CSS."
        ]
      },
      "rxzk": { "title": "98", "intro": [] },
      "xobh": { "title": "99", "intro": [] },
      "lab-house-painting": {
        "title": "Build a House Painting",
        "intro": ["For this lab, you will build a house painting using CSS."]
      },
      "rrtt": { "title": "101", "intro": [] },
      "quiz-css-positioning": {
        "title": "CSS Positioning Quiz",
        "intro": [
          "Test what you've learned in this quiz of how positioning works in CSS."
        ]
      },
      "xebj": { "title": "103", "intro": [] },
      "jkdt": { "title": "104", "intro": [] },
      "lab-technical-documentation-page": {
        "title": "Build a Technical Documentation Page",
        "intro": [
          "For this lab, you will build a technical documentation page to serve as instruction or reference for a topic."
        ]
      },
      "xcti": { "title": "106", "intro": [] },
      "quiz-responsive-web-design": {
        "title": "Responsive Web Design Quiz",
        "intro": [
          "Test what you've learned in this quiz of making your webpage responsive."
        ]
      },
      "mtbl": { "title": "108", "intro": [] },
      "vlov": { "title": "109", "intro": [] },
      "lab-availability-table": {
        "title": "Build an Availability Table",
        "intro": ["For this lab, you will create an availability table."]
      },
      "sget": { "title": "111", "intro": [] },
      "quiz-css-variables": {
        "title": "CSS Variables Quiz",
        "intro": [
          "Test what you've learned in this quiz of how using variables in CSS."
        ]
      },
      "agbl": { "title": "113", "intro": [] },
      "ogko": { "title": "114", "intro": [] },
      "harp": { "title": "115", "intro": [] },
      "nsiq": { "title": "116", "intro": [] },
      "lab-product-landing-page": {
        "title": "Build a Product Landing Page",
        "intro": [
          "For this project, you will build a product landing page to market a product of your choice."
        ]
      },
      "fdam": { "title": "118", "intro": [] },
      "quiz-css-grid": {
        "title": "CSS Grid Quiz",
        "intro": ["Test what you've learned in this quiz of using grid in CSS."]
      },
      "dorc": { "title": "120", "intro": [] },
      "adzu": { "title": "121", "intro": [] },
      "lab-moon-orbit": {
        "title": "Build a Moon Orbit",
        "intro": [
          "For this lab, you will create an animation of the moon orbiting the earth."
        ]
      },
      "lugl": { "title": "123", "intro": [] },
      "lab-personal-portfolio": {
        "title": "Build a Personal Portfolio",
        "intro": [
          "For this project, you will build your own personal portfolio page."
        ]
      },
      "lvqc": { "title": "125", "intro": [] },
      "quiz-css-animations": {
        "title": "CSS Animations Quiz",
        "intro": [
          "Test what you've learned in this quiz of using animations in CSS."
        ]
      },
      "wvjx": { "title": "127", "intro": [] },
      "uquz": { "title": "128", "intro": [] },
      "kdgd": { "title": "129", "intro": [] },
      "wryp": { "title": "130", "intro": [] },
      "workshop-greeting-bot": {
        "title": "Build a Greeting Bot",
        "intro": [
          "For this workshop, you will learn how to work with JavaScript fundamentals by building a greeting bot.",
          "You will learn about variables, <code>let</code>, <code>const</code>, <code>console.log</code> and basic string usage."
        ]
      },
      "lab-javascript-trivia-bot": {
        "title": "Build a JavaScript Trivia Bot",
        "intro": [
          "In this lab, you will practice working with JavaScript variables and strings by building a trivia bot."
        ]
      },
      "dthi": { "title": "133", "intro": [] },
      "yskn": { "title": "134", "intro": [] },
      "quiz-javascript-variables-and-data-types": {
        "title": "JavaScript Variables and Data Types Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Variables and Data Types."
        ]
      },
      "hoec": { "title": "136", "intro": [] },
      "workshop-teacher-chatbot": {
        "title": "Build a Teacher Chatbot",
        "intro": [
          "In this workshop, you will continue to learn more about JavaScript strings by building a chatbot.",
          "You will learn how to work with template literals, and the <code>indexOf</code> method."
        ]
      },
      "axgb": { "title": "138", "intro": [] },
      "rwac": { "title": "139", "intro": [] },
      "quiz-javascript-strings": {
        "title": "JavaScript Strings Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Strings."
        ]
      },
      "hxwa": { "title": "141", "intro": [] },
      "workshop-mathbot": {
        "title": "Build a Mathbot",
        "intro": [
          "In this workshop, you will review how to work with the different Math object methods by building a Mathbot."
        ]
      },
      "lab-fortune-teller": {
        "title": "Build a Fortune Teller",
        "intro": [
          "In this lab, you will build a fortune teller by randomly selecting a fortune from the avaialble fortunes."
        ]
      },
      "wfyg": { "title": "144", "intro": [] },
      "guqy": { "title": "145", "intro": [] },
      "quiz-javascript-math": {
        "title": "JavaScript Math Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Math."]
      },
      "hafd": { "title": "147", "intro": [] },
      "phko": { "title": "148", "intro": [] },
      "quiz-javascript-comparisons-and-conditionals": {
        "title": "JavaScript Comparisons and Conditionals Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Comparisons and Conditionals."
        ]
      },
      "tsdq": { "title": "150", "intro": [] },
      "workshop-calculator": {
        "title": "Build a Calculator",
        "intro": [
          "In this workshop, you will review working with functions by building a calculator."
        ]
      },
      "lab-email-masker": {
        "title": "Build an Email Masker",
        "intro": [
          "In this lab, you'll build an email masker that will take an email address and obscure it."
        ]
      },
      "lab-sentence-maker": {
        "title": "Build a Sentence Maker",
        "intro": [
          "In this lab, you will create different stories by assigning different words to different variables."
        ]
      },
      "workshop-loan-qualification-checker": {
        "title": "Build a Loan Qualification Checker",
        "intro": [
          "In this workshop, you will continue to learn how to work with conditionals by building a loan qualification checker app.",
          "You will learn more about <code>if</code> statements, and how to use comparison operators and multiple conditions in an <code>if</code> statement."
        ]
      },
      "lab-leap-year-calculator": {
        "title": "Build a Leap Year Calculator ",
        "intro": [
          "In this lab you will use conditional statements and loops to determine if a year is a leap year."
        ]
      },
      "pljo": { "title": "156", "intro": [] },
      "quiz-javascript-functions": {
        "title": "JavaScript Functions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Functions."
        ]
      },
      "mexq": { "title": "158", "intro": [] },
      "ifgn": { "title": "159", "intro": [] },
      "workshop-shopping-list": {
        "title": "Build a Shopping List",
        "intro": [
          "In this workshop, you will practice working with arrays by building a shopping list.",
          "You will review how to add and remove elements from an array using methods like <code>push</code>, <code>pop</code>, <code>shift</code>, and <code>unshift</code>."
        ]
      },
      "lab-lunch-picker-program": {
        "title": "Build a Lunch Picker Program",
        "intro": [
          "In this lab, you will review working with arrays and random numbers by building a lunch picker program."
        ]
      },
      "mokm": { "title": "161", "intro": [] },
      "froz": { "title": "162", "intro": [] },
      "quiz-javascript-arrays": {
        "title": "JavaScript Arrays Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Arrays."]
      },
      "dvnt": { "title": "164", "intro": [] },
      "ekdb": { "title": "165", "intro": [] },
      "lab-quiz-game": {
        "title": "Build a Quiz Game",
        "intro": ["For this lab, you will build a quiz game."]
      },
      "lab-factorial-calculator": {
        "title": "Build a Factorial Calculator ",
        "intro": ["In this lab, you will build a factorial calculator."]
      },
      "quiz-javascript-objects": {
        "title": "JavaScript Objects Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Objects."
        ]
      },
      "kgtw": { "title": "169", "intro": [] },
      "workshop-sentence-analyzer": {
        "title": "Build a Sentence Analyzer",
        "intro": [
          "In this workshop, you'll review working with JavaScript loops by building a sentence analyzer app."
        ]
      },
      "kcci": { "title": "171", "intro": [] },
      "puhe": { "title": "172", "intro": [] },
      "quiz-javascript-loops": {
        "title": "JavaScript Loops Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Loops."]
      },
      "hjtr": { "title": "174", "intro": [] },
      "lab-pyramid-generator": {
        "title": "Build a Pyramid Generator",
        "intro": ["In this lab you will build a pyramid generator."]
      },
      "lab-gradebook-app": {
        "title": "Build a Gradebook App",
        "intro": ["For this lab, you will create a gradebook app."]
      },
      "epfc": { "title": "177", "intro": [] },
      "lab-inventory-management-program": {
        "title": "Build an Inventory Management Program",
        "intro": [
          "For this lab, you will build an inventory management program using JavaScript."
        ]
      },
      "fbbn": { "title": "179", "intro": [] },
      "lnmg": { "title": "180", "intro": [] },
      "wead": { "title": "181", "intro": [] },
      "quiz-javascript-fundamentals": {
        "title": "JavaScript Fundamentals Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Fundamentals Quiz."
        ]
      },
      "plic": { "title": "183", "intro": [] },
      "vjmm": { "title": "184", "intro": [] },
      "bxtv": { "title": "185", "intro": [] },
      "xiqk": { "title": "186", "intro": [] },
      "quiz-javascript-higher-order-functions": {
        "title": "JavaScript Higher Order Functions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Higher Order Functions."
        ]
      },
      "esfh": { "title": "188", "intro": [] },
      "gibb": { "title": "189", "intro": [] },
      "lab-favorite-icon-toggler": {
        "title": "Build a Favorite Icon Toggler",
        "intro": [
          "In this lab, you will build a favorite icon toggler by utilizing JavaScript click events."
        ]
      },
      "fhxc": { "title": "191", "intro": [] },
      "quiz-dom-manipulation-and-click-event-with-javascript": {
        "title": "DOM Manipulation and Click Events with JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on DOM Manipulation and Click Events with JavaScript Quiz."
        ]
      },
      "ubpx": { "title": "193", "intro": [] },
      "lbyi": { "title": "194", "intro": [] },
      "lab-real-time-counter": {
        "title": "Build a Real Time Counter",
        "intro": ["In this lab, you will build a real-time character counter"]
      },
      "fmbk": { "title": "196", "intro": [] },
      "lab-lightbox-viewer": {
        "title": "Build a Lightbox Viewer",
        "intro": [
          "In this lab, you will build a lighbox viewer for viewing images in a focused mode."
        ]
      },
      "workshop-rps-game": {
        "title": "Build a Rock, Paper, Scissors Game",
        "intro": [
          "In this workshop, you will review DOM manipulation and events by building a Rock, Paper, Scissors Game."
        ]
      },
      "lab-palindrome-checker": {
        "title": "Build a Palindrome Checker",
        "intro": [
          "For this lab, you'll build an application that checks whether a given word is a palindrome."
        ]
      },
      "lab-football-team-cards": {
        "title": "Build a Set of Football Team Cards",
        "intro": [
          "One common aspect of building web applications is processing datasets and outputting information to the screen. In this project, you will use DOM manipulation, object destructuring, event handling, and data filtering to build a set of football team cards."
        ]
      },
      "iejn": { "title": "201", "intro": [] },
      "quiz-javascript-events": {
        "title": "JavaScript Events Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Events."]
      },
      "kaqq": { "title": "203", "intro": [] },
      "lab-random-background-color-changer": {
        "title": "Debug a Random Background Color Changer",
        "intro": [
          "For this lab, you will debug a random background color changer and fix the errors to make it work properly."
        ]
      },
      "ksfc": { "title": "205", "intro": [] },
      "quiz-debugging-javascript": {
        "title": "Debugging JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Debugging JavaScript."
        ]
      },
      "dqth": { "title": "207", "intro": [] },
      "ilop": { "title": "208", "intro": [] },
      "qrer": { "title": "209", "intro": [] },
      "lab-regex-sandbox": {
        "title": "Build a RegEx Sandbox",
        "intro": ["In this lab you will build a regex sandbox."]
      },
      "svsl": { "title": "211", "intro": [] },
      "quiz-javascript-regular-expressions": {
        "title": "JavaScript Regular Expressions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Regular Expressions."
        ]
      },
      "zalp": { "title": "213", "intro": [] },
      "hhvp": { "title": "214", "intro": [] },
      "egkv": { "title": "215", "intro": [] },
      "qlvw": { "title": "216", "intro": [] },
      "quiz-form-validation-with-javascript": {
        "title": "Form Validation with JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Form Validation with JavaScript."
        ]
      },
      "lupt": { "title": "218", "intro": [] },
      "lab-date-conversion": {
        "title": "Build a Date Conversion Program",
        "intro": [
          "In this lab, you will build a program to convert a date from one format to another."
        ]
      },
      "xtfk": { "title": "220", "intro": [] },
      "quiz-javascript-dates": {
        "title": "JavaScript Dates Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Dates."]
      },
      "lvts": { "title": "222", "intro": [] },
      "foal": { "title": "223", "intro": [] },
      "crzf": { "title": "224", "intro": [] },
      "xofr": { "title": "225", "intro": [] },
      "quiz-javascript-audio-and-video": {
        "title": "JavaScript Audio and Video Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Audio and Video."
        ]
      },
      "pehm": { "title": "227", "intro": [] },
      "cvsw": { "title": "228", "intro": [] },
      "lab-bookmark-manager-app": {
        "title": "Build a Bookmark Manager App",
        "intro": ["For this lab, you will build a bookmark manager app."]
      },
      "fgbp": { "title": "230", "intro": [] },
      "quiz-local-storage-and-crud": {
        "title": "Local Storage and CRUD Quiz",
        "intro": [
          "Test what you've learned in this quiz on Local Storage and CRUD."
        ]
      },
      "jbst": { "title": "232", "intro": [] },
      "peyf": { "title": "233", "intro": [] },
      "bdqj": { "title": "234", "intro": [] },
      "ndlf": { "title": "235", "intro": [] },
      "quiz-recursion": {
        "title": "Recursion Quiz",
        "intro": ["Test what you've learned in this quiz on Recursion."]
      },
      "yshh": { "title": "237", "intro": [] },
      "wyxz": { "title": "238", "intro": [] },
      "lab-quicksort-algorithm": {
        "title": "Build the Quicksort Algorithm",
        "intro": [
          "For this lab, you will implement the Quicksort algorithm using JavaScript."
        ]
      },
      "dtfv": { "title": "240", "intro": [] },
      "quiz-searching-and-sorting-algorithms": {
        "title": "Searching and Sorting Algorithms Quiz",
        "intro": [
          "Test what you've learned in this quiz on Searching and Sorting Algorithms."
        ]
      },
      "bnvw": { "title": "242", "intro": [] },
      "xkhk": { "title": "243", "intro": [] },
      "lab-roman-numeral-converter": {
        "title": "Build a Roman Numeral Converter",
        "intro": [
          "For this lab, you'll build an application that converts integers to Roman numerals."
        ]
      },
      "yaxm": { "title": "245", "intro": [] },
      "lab-telephone-number-validator": {
        "title": "Build a Telephone Number Validator",
        "intro": [
          "For this lab, you'll build an application that checks if a number is a valid United States phone number."
        ]
      },
      "lab-cash-register": {
        "title": "Build a Cash Register",
        "intro": ["For this lab, you will build a cash register."]
      },
      "udia": { "title": "248", "intro": [] },
      "quiz-javascript-problem-solving-and-algorithmic-thinking": {
        "title": "JavaScript Problem Solving and Algorithmic Thinking Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Problem Solving and Algorithmic Thinking."
        ]
      },
      "xayi": { "title": "250", "intro": [] },
      "mjbe": { "title": "251", "intro": [] },
      "byqx": { "title": "252", "intro": [] },
      "alda": { "title": "253", "intro": [] },
      "quiz-javascript-functional-programming": {
        "title": "JavaScript Functional Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Functional Programming."
        ]
      },
      "cvaf": { "title": "255", "intro": [] },
      "tdgy": { "title": "256", "intro": [] },
      "saxu": { "title": "257", "intro": [] },
      "kagw": { "title": "258", "intro": [] },
      "mbib": { "title": "259", "intro": [] },
      "oxiv": { "title": "260", "intro": [] },
      "quiz-javascript-object-oriented-programming": {
        "title": "JavaScript Object Oriented Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Object Oriented Programming."
        ]
      },
      "nixz": { "title": "262", "intro": [] },
      "lab-stack-class": {
        "title": "Build a Stack Class",
        "intro": [
          "For this lab, you will build a stack class using JavaScript."
        ]
      },
      "lab-linked-list-class": {
        "title": "Build a Linked List Class",
        "intro": [
          "For this lab, you will build a linked list class using JavaScript."
        ]
      },
      "lab-hash-table-class": {
        "title": "Build a Hash Table Class",
        "intro": ["For this lab, you will build a hash table using JavaScript."]
      },
      "muyw": { "title": "266", "intro": [] },
      "quiz-javascript-data-structures": {
        "title": "JavaScript Data Structures Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Data Structures."
        ]
      },
      "rmpy": { "title": "268", "intro": [] },
      "lab-depth-first-search": {
        "title": "Implement the Depth-First Search Algorithm",
        "intro": [
          "For this lab, you will use JavaScript to implement the Depth-First Search algorithm."
        ]
      },
      "xdyh": { "title": "270", "intro": [] },
      "quiz-graphs-and-trees": {
        "title": "Graphs and Trees Quiz",
        "intro": ["Test what you've learned in this quiz on Graphs and Trees."]
      },
      "vjgg": { "title": "272", "intro": [] },
      "lab-nth-fibonacci-number-generator": {
        "title": "Build the nth Fibonacci number generator",
        "intro": [
          "For this lab, you will implement the nth Fibonacci number generator."
        ]
      },
      "kaui": { "title": "274", "intro": [] },
      "quiz-dynamic-programming": {
        "title": "Dynamic Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on Dynamic Programming."
        ]
      },
      "sgau": { "title": "276", "intro": [] },
      "clak": { "title": "277", "intro": [] },
      "fcom": { "title": "278", "intro": [] },
      "ffpt": { "title": "279", "intro": [] },
      "lab-pokemon-search-app": {
        "title": "Build a Pokémon Search App",
        "intro": ["For this project, you will build a Pokémon search app."]
      },
      "vyzp": { "title": "281", "intro": [] },
      "quiz-asynchronous-javascript": {
        "title": "Asynchronous JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Asynchronous JavaScript."
        ]
      },
      "icdr": { "title": "283", "intro": [] },
      "zdsj": { "title": "284", "intro": [] },
      "mzae": { "title": "285", "intro": [] },
      "gjbf": { "title": "286", "intro": [] },
      "mbpv": { "title": "287", "intro": [] },
      "eeez": { "title": "288", "intro": [] },
      "quiz-web-standards": {
        "title": "Web Standards Quiz",
        "intro": ["Test what you've learned in this quiz on Web Standards."]
      },
      "khuu": { "title": "290", "intro": [] },
      "xdly": { "title": "291", "intro": [] },
      "rhhl": { "title": "292", "intro": [] },
      "trvf": { "title": "293", "intro": [] },
      "kwmg": { "title": "294", "intro": [] },
      "nodx": { "title": "295", "intro": [] },
      "erfj": { "title": "296", "intro": [] },
      "quiz-react-basics": {
        "title": "React Basics Quiz",
        "intro": ["Test what you've learned in this quiz on React Basics."]
      },
      "hfwi": { "title": "298", "intro": [] },
      "rnwr": { "title": "299", "intro": [] },
      "oeqv": { "title": "300", "intro": [] },
      "rdzk": { "title": "301", "intro": [] },
      "vtpz": { "title": "302", "intro": [] },
      "dfwl": { "title": "303", "intro": [] },
      "adzm": { "title": "304", "intro": [] },
      "quiz-react-state-and-hooks": {
        "title": "React State and Hooks Quiz",
        "intro": [
          "Test what you've learned in this quiz on React State and Hooks."
        ]
      },
      "voks": { "title": "306", "intro": [] },
      "uwum": { "title": "307", "intro": [] },
      "ukem": { "title": "308", "intro": [] },
      "sdjg": { "title": "309", "intro": [] },
      "buzx": { "title": "310", "intro": [] },
      "pexz": { "title": "311", "intro": [] },
      "prlo": { "title": "312", "intro": [] },
      "jsnd": { "title": "313", "intro": [] },
      "quiz-advanced-react": {
        "title": "Advanced React Quiz",
        "intro": ["Test what you've learned in this quiz on Advanced React."]
      },
      "tkgg": { "title": "315", "intro": [] },
      "coip": { "title": "316", "intro": [] },
      "quiz-web-performance": {
        "title": "Web Performance Quiz",
        "intro": ["Test what you've learned in this quiz on Web Performance."]
      },
      "hzab": { "title": "318", "intro": [] },
      "ggea": { "title": "319", "intro": [] },
      "vgvz": { "title": "320", "intro": [] },
      "jkfc": { "title": "321", "intro": [] },
      "quiz-typescript": {
        "title": "TypeScript Quiz",
        "intro": ["Test what you've learned in this quiz on TypeScript."]
      },
      "zhhp": { "title": "323", "intro": [] },
      "nwwd": { "title": "324", "intro": [] },
      "quiz-css-libraries-and-frameworks": {
        "title": "CSS Libraries and Frameworks Quiz",
        "intro": [
          "Test what you've learned in this quiz on CSS Libraries and Frameworks."
        ]
      },
      "gora": { "title": "326", "intro": [] },
      "vpkl": { "title": "327", "intro": [] },
      "quiz-testing": {
        "title": "Testing Quiz",
        "intro": ["Test what you've learned in this quiz on Testing."]
      },
      "lzvx": { "title": "329", "intro": [] },
      "mfwu": { "title": "330", "intro": [] },
      "dfcd": { "title": "331", "intro": [] },
      "workshop-bash-boilerplate": {
        "title": "Build a Boilerplate",
        "intro": [
          "The terminal allows you to send text commands to your computer that can manipulate the file system, run programs, automate tasks, and much more.",
          "In this 170-lesson workshop, you will learn terminal commands by creating a website boilerplate using only the command line."
        ]
      },
      "vfje": { "title": "333", "intro": [] },
      "quiz-bash-commands": {
        "title": "Bash Commands Quiz",
        "intro": ["Test what you've learned in this quiz on Bash Commands."]
      },
      "thsj": { "title": "335", "intro": [] },
      "workshop-mario-database": {
        "title": "Build a Mario Database",
        "intro": [
          "A relational database organizes data into tables that are linked together through relationships.",
          "In this 165-lesson workshop, you will learn the basics of a relational database by creating a PostgreSQL database filled with video game characters."
        ]
      },
      "lab-celestial-bodies-database": {
        "title": "Build a Celestial Bodies Database",
        "intro": [
          "For this project, you will build a database of celestial bodies using PostgreSQL."
        ]
      },
      "cvvu": { "title": "338", "intro": [] },
      "quiz-relational-database": {
        "title": "Relational Database Quiz",
        "intro": [
          "Test what you've learned in this quiz on Relational Databases."
        ]
      },
      "ynqt": { "title": "340", "intro": [] },
      "workshop-bash-five-programs": {
        "title": "Build Five Programs",
        "intro": [
          "Bash scripts combine terminal commands and logic into programs that can execute or automate tasks, and much more.",
          "In this 220-lesson workshop, you will learn more terminal commands and how to use them within Bash scripts by creating five small programs."
        ]
      },
      "hnta": { "title": "342", "intro": [] },
      "quiz-bash-scripting": {
        "title": "Bash Scripting Quiz",
        "intro": ["Test what you've learned in this quiz on Bash Scripting."]
      },
      "pegc": { "title": "344", "intro": [] },
      "workshop-sql-student-database-part-1": {
        "title": "Build a Student Database: Part 1",
        "intro": [
          "SQL, or Structured Query Language, is the language for communicating with a relational database.",
          "In this 140-lesson workshop, you will create a Bash script that uses SQL to enter information about your computer science students into PostgreSQL."
        ]
      },
      "workshop-sql-student-database-part-2": {
        "title": "Build a Student Database: Part 2",
        "intro": [
          "SQL join commands are used to combine information from multiple tables in a relational database",
          "In this 140-lesson workshop, you will complete your student database while diving deeper into SQL commands."
        ]
      },
      "lab-world-cup-database": {
        "title": "Build a World Cup Database",
        "intro": [
          "For this project, you will create a Bash script that enters information from World Cup games into PostgreSQL, then query the database for useful statistics."
        ]
      },
      "workshop-kitty-ipsum-translator": {
        "title": "Build a Kitty Ipsum Translator",
        "intro": [
          "There's more to Bash commands than you might think.",
          "In this 140-lesson workshop, you will learn some more complex commands, and the details of how commands work."
        ]
      },
      "workshop-bike-rental-shop": {
        "title": "Build a Bike Rental Shop",
        "intro": [
          "In this 210-lesson workshop, you will build an interactive Bash program that stores rental information for your bike rental shop using PostgreSQL."
        ]
      },
      "lab-salon-appointment-scheduler": {
        "title": "Build a Salon Appointment Scheduler",
        "intro": [
          "For this lab, you will create an interactive Bash program that uses PostgreSQL to track the customers and appointments for your salon."
        ]
      },
      "udfh": { "title": "351", "intro": [] },
      "quiz-bash-and-sql": {
        "title": "Bash and SQL Quiz",
        "intro": ["Test what you've learned in this quiz on Bash and SQL."]
      },
      "movb": { "title": "353", "intro": [] },
      "workshop-castle": {
        "title": "Build a Castle",
        "intro": [
          "Nano is a program that allows you to edit files right in the terminal.",
          "In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle."
        ]
      },
      "dzsr": { "title": "355", "intro": [] },
      "quiz-nano": {
        "title": "Nano Quiz",
        "intro": ["Test what you've learned in this quiz on Nano."]
      },
      "pzmc": { "title": "357", "intro": [] },
      "workshop-sql-reference-object": {
        "title": "Build an SQL Reference Object",
        "intro": [
          "Git is a version control system that keeps track of all the changes you make to your codebase.",
          "In this 240-lesson workshop, you will learn how Git keeps track of your code by creating an object containing commonly used SQL commands."
        ]
      },
      "lab-periodic-table-database": {
        "title": "Build a Periodic Table Database",
        "intro": [
          "For this lab, you will create a Bash script to get information about chemical elements from a periodic table database."
        ]
      },
      "lab-number-guessing-game": {
        "title": "Build a Number Guessing Game",
        "intro": [
          "For this lab, you will use Bash scripting, PostgreSQL, and Git to create a number guessing game that runs in the terminal and saves user information."
        ]
      },
      "nfoc": { "title": "361", "intro": [] },
      "quiz-git": {
        "title": "Git Quiz",
        "intro": ["Test what you've learned in this quiz on Git."]
      },
      "ibmn": { "title": "363", "intro": [] },
      "zpjj": { "title": "364", "intro": [] },
      "ghfk": { "title": "365", "intro": [] },
      "ugfq": { "title": "366", "intro": [] },
      "quiz-security-and-privacy": {
        "title": "Security and Privacy Quiz",
        "intro": [
          "Test what you've learned in this quiz on Security and Privacy."
        ]
      },
      "qjov": { "title": "368", "intro": [] },
      "workshop-npm-packages": {
        "title": "Managing Packages with npm",
        "intro": [
          "npm (Node Package Manager), is a command line tool to install, create, and share packages of JavaScript code written for Node.js. There are many open source packages available on npm, so before starting a project, take some time to explore so you don't end up recreating the wheel for things like working with dates or fetching data from an API.",
          "In this workshop, you'll learn the basics of using npm, including how to work with the <code>package.json</code> file and how to manage your installed dependencies."
        ]
      },
      "hjku": { "title": "370", "intro": [] },
      "workshop-node-and-express": {
        "title": "Basic Node and Express",
        "intro": [
          "Node.js is a JavaScript runtime that allows developers to write backend (server-side) programs in JavaScript. Node.js comes with a handful of built-in modules — small, independent programs — that help with this. Some of the core modules include HTTP, which acts like a server, and File System, a module to read and modify files.",
          "In the last set of courses you learned to install and manage packages from npm, which are collections of smaller modules. These packages can help you build larger, more complex applications.",
          "Express is a lightweight web application framework, and is one of the most popular packages on npm. Express makes it much easier to create a server and handle routing for your application, which handles things like directing people to the correct page when they visit a certain endpoint like <pre>/blog</pre>.",
          "In this course, you'll learn the basics of Node and Express including how to create a server, serve different files, and handle different requests from the browser."
        ]
      },
      "lab-timestamp-microservice": {
        "title": "Build a Timestamp Microservice",
        "intro": ["In this lab you will build a timestamp microservice"]
      },
      "lab-request-header-parser-microservice": {
        "title": "Build a Request Header Parser Microservice",
        "intro": [
          "In this lab, you will build a request header parser microservice"
        ]
      },
      "lab-url-shortener-microservice": {
        "title": "Build a URL Shortener Microservice",
        "intro": ["In this lab, you will build a URL Shortener Microservice"]
      },
      "lab-exercise-tracker": {
        "title": "Build an Exercise Tracker",
        "intro": ["In this lab, you will build an exercise tracker"]
      },
      "lab-file-metadata-microservice": {
        "title": "Build a File Metadata Microservice",
        "intro": ["For this lab you will build a file metadata microservice"]
      },
      "kegi": { "title": "377", "intro": [] },
      "quiz-backend-javascript": {
        "title": "Backend JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Backend JavaScript."
        ]
      },
      "vnfu": { "title": "379", "intro": [] },
      "rlli": { "title": "380", "intro": [] },
      "rjpv": { "title": "381", "intro": [] },
      "xbri": { "title": "382", "intro": [] },
      "quiz-tooling-and-deployment": {
        "title": "Tooling and Deployment Quiz",
        "intro": [
          "Test what you've learned in this quiz of tooling and deployment"
        ]
      },
      "nkjt": { "title": "384", "intro": [] },
      "pgjj": { "title": "385", "intro": [] },
      "exom": { "title": "386", "intro": [] },
      "bvqc": { "title": "387", "intro": [] },
      "xish": { "title": "388", "intro": [] },
      "front-end-development-certification-exam": {
        "title": "Front End Development Certification Exam",
        "intro": ["", ""]
      }
    }
  },
  "misc-text": {
    "certification": "{{cert}} Certification",
    "browse-other": "Browse our other free certifications\n(we recommend doing these in order)",
    "courses": "Courses",
    "steps": "Steps",
    "expand": "Expand course",
    "collapse": "Collapse course",
    "legacy-header": "Legacy Courses",
    "legacy-desc": "These courses are no longer part of the certification path, but are still available for you to further your learning.",
    "legacy-go-back": "Go to the current version of the curriculum.",
    "course-maintenance": "These courses are undergoing maintenance. If they are not working, you can learn how to run them locally at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "course-disabling-soon": "The browser version of these courses will be temporarily disabled soon and your virtual machines will be deleted. Any progress in your virtual machines will be lost. If you have any files you want from them, you should save them to your computer. We apologize for any inconvenience. We hope to have an improved browser version of these courses available again in the next few weeks.",
    "course-disabled": "These courses are temporarily unavailable to run in the browser. We apologize for any inconvenience. You can learn how to run them locally at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. We hope to have an improved browser version available again soon.",
    "run-locally": "For now, we recommend running the courses locally on your computer. You can learn how at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "Your progress will not be saved to your freeCodeCamp account when running them locally.",
    "go-back-to-learn": "Go back to the stable version of the curriculum.",
    "read-database-cert-article": "Please read this forum post before proceeding.",
    "enable-cookies": "You must enable third-party cookies before starting.",
    "english-only": "The courses in this section are only available in English. We are only able to translate the titles and introductions at the moment, not the lessons themselves.",
    "exam-english-only": "Please note that the certification exam is currently available only in English. The rest of the courses are available in some languages."
  }
}
