{
  "msg-1": "Something went wrong updating your account. Please check and try again",
  "msg-2": "We have updated your preferences",
  "msg-3": "Email format is invalid",
  "msg-4": "currentChallengeId is not a valid challenge ID",
  "msg-5": "Theme is invalid",
  "msg-6": "Theme already set",
  "msg-7": "Your theme has been updated!",
  "msg-8": "Username is already associated with this account",
  "msg-9": "Username is already associated with a different account",
  "msg-10": "We have updated your username to {{username}}",
  "msg-11": "We could not log you out, please try again in a moment",
  "msg=12": "The email encoded in the link is incorrectly formatted",
  "msg-13": "Oops, something is not right, please request a fresh link to sign in / sign up",
  "msg-14": "Looks like the link you clicked has expired, please request a fresh link, to sign in",
  "msg-15": "Success! You have signed in to your account. Happy Coding!",
  "msg-16": "We are moving away from social authentication for privacy reasons. Next time we recommend using your email address: {{email}} to sign in instead.",
  "msg-17": "We need your name so we can put it on your certification. Add your name to your account settings and click the save button. Then we can issue your certification.",
  "msg-18": "It looks like you have not completed the necessary steps. Please complete the required projects to claim the {{name}} Certification.",
  "msg-19": "It looks like you already have claimed the {{name}} Certification",
  "msg-20": "@{{username}}, you have successfully claimed the {{name}} Certification! Congratulations on behalf of the freeCodeCamp.org team!",
  "msg-21": "Something went wrong with the verification of {{name}}, please try again. If you continue to receive this error, you can send a message to support@freeCodeCamp.org to get help.",
  "msg-22": "Error claiming {{certName}}",
  "msg-23": "We could not find a user with the username \"{{username}}\"",
  "msg-24": "This user needs to add their name to their account in order for others to be able to view their certification.",
  "msg-25": "This user is not eligible for freeCodeCamp.org certifications at this time.",
  "msg-26": "{{username}} has chosen to make their portfolio private. They will need to make their portfolio public in order for others to be able to view their certification.",
  "msg-27": "{{username}} has chosen to make their certifications private. They will need to make their certifications public in order for others to be able to view them.",
  "msg-28": "{{username}} has not yet agrees to our Academic Honesty Pledge.",
  "msg-29": "It looks like user {{username}} is not {{cert}} certified",
  "msg-30": "That does not appear to be a valid challenge submission",
  "msg-31": "You have not provided the valid links for us to inspect your work.",
  "settings": {
    "username": {
      "invalid": "Username contains invalid characters",
      "too-short": "Username is too short",
      "reserved": "Username contains a reserved code"
    }
  }
}
