[
  {
    "id": "bd7158d9c436eddfaeb5bd3b",
    "name": "How can I stream my live coding sessions on Free Code Camp's Twitch.tv channel?",
    "dashedName": "how-can-i-stream-my-live-coding-sessions-on-free-code-camps-twitch-tv-channel",
    "category": "outreach",
    "description": [
      "<div class=\"col-xs-12 col-sm-10 col-sm-offset-1\">",
      "  <h3>If you're interested in coding JavaScript live in front of dozens of people on our popular <a href='http://twitch.tv/freecodecamp' target='_blank'>twitch.tv channel</a>, we'd love to have you.</h3>",
      "<p class='large-p'>Please follow these steps to get started:</p>",
      "  <p class='large-p'>",
      "    <ol>",
      "      <li class='large-li'>Follow <a href='http://www.hdpvrcapture.com/wordpress/?p=5951' target='_blank'>this tutorial</a> to set up your computer for streaming.</li>",
      "      <li class='large-li'>Contact Jason Ruekert - he's @jsonify in Gitter. He's in charge of our Twitch.tv channel. Tell him what you'd like to stream, and when you're available to stream.</li>",
      "      <li class='large-li'>Jason will pair with you using Screenhero to verify your computer is configured properly to stream.</li>",
      "    </ol>",
      "  </p>",
      "  <p class='large-p'>Be respectful of your audience. Everything you stream should be related to coding JavaScript, and should be acceptable for children. (Yes, children do sometimes watch our Twitch stream to learn to code).</p>",
      "  <p class='large-p'>While you're streaming, keep the chat room open so you can respond to questions from your viewers. If someone follows Free Code Camp on Twitch, try to thank them.</p>",
      "  <p class='large-p'>If you do a good job, we'll invite you back to stream some more. Who knows, you might become one of our regular streamers!</p>",
      "</div>"
    ]
  },
  {
    "id": "bd7158d9c446eddfaeb5bdef",
    "name": "How do Free Code Camp's Nonprofit Projects work?",
    "dashedName": "how-do-free-code-camps-nonprofit-projects-work",
    "category": "outreach",
    "description": [
      "<div class='col-xs-12 col-sm-10 col-sm-offset-1'>",
      "  <p class='large-p'>Building nonprofit projects is the main way that our campers learn full stack JavaScript and agile software development. Once you complete the Free Code Camp Waypoints, Bonfires, Ziplines and Basejumps, you'll begin this process.</p>",
      "  <h3>Starting with the end in mind</h3>",
      "  <p class='large-p'>Our goal at Free Code Camp is to help you land a job as a junior software developer (or, if you prefer, a 'pivot job' that leads your current career in a more technical direction).</p>",
      "  <p class='large-p'>You'll continue to work on nonprofit projects until you've built a sufficiently impressive portfolio and references to start your job search. Your portfolio will ultimately have three to five nonprofit projects. We estimate that the 900 hours of nonprofit projects you're going to complete, in addition to the 100 hours of challenges you've already completed, will be enough to qualify you for your first coding job. This will produce a much broader portfolio than a traditional coding bootcamp, which generally only has one or two capstone projects.</p>",
      "  <h3>Choosing your first Nonprofit Project</h3>",
      "  <p class='large-p'>We've categorized all the nonprofit projects by estimated time investment per camper: 100 hours, 200 hours, and 300 hours. These are only rough estimates.</p>",
      "  <p class='large-p'>Example: if you and the camper you're paired up with (your pair) each stated you could work 20 hours per week. If the project is a 100 hour per camper project, you should be able to complete it in about 5 weeks.</p>",
      "  <p class='large-p'>Our Nonprofit Project team will match you and your pair based on:</p>",
      "  <p class='large-p'>",
      "    <ol>",
      "      <li class='large-li'>Your estimated time commitment (10, 20 or 40 hours per week)</li>",
      "      <li class='large-li'>Your time zone</li>",
      "      <li class='large-li'>The nonprofit projects you've chosen</li>",
      "      <li class='large-li'>Prior coding experience (we'd like both campers to be able to contribute equally)</li>",
      "    </ol>",
      "  </p>",
      "  <p class='large-p'>We won't take age or gender into account. This will provide you with valuable experience in meshing with diverse teams, which is a reality of the contemporary workplace.</p>",
      "  <p class='large-p'>You'll only work on one project at a time. Once you start a nonprofit project, we'll remove you from all other nonprofit project you've expressed interest in. There's a good chance those projects will no longer be available when you finish your current project, anyway. Don't worry, though - we get new nonprofit project requests every day, so there will be plenty more projects for you to consider after you finish your current one.</p>",
      "  <h3>Finalizing the Project</h3>",
      "  <p class='large-p'>Before you can start working on the project, our team of Nonprofit Project Coordinators will go through the following process:</p>",
      "  <p class='large-p'>",
      "    <ol>",
      "      <li class='large-li'>We'll wait until there are two campers who have chosen the same project and look like they're a good match for one another based on the factors mentioned above.</li>",
      "      <li class='large-li'>We'll call the stakeholder to confirm once again that he or she agrees with our &thinsp;<a href=\"freecodecamp.com/nonprofits\">terms &thinsp;</a>and has signed our &thinsp;<a href=\"http://goo.gl/forms/0YKkd9bpcR\">Nonprofit Project Stakeholder Pledge</a>.</li>",
      "      <li class='large-li'>We'll set an initial meeting with representatives from Free Code Camp, the two campers, and the stakeholder.</li>",
      "      <li class='large-li'>If the stakeholder and both campers shows up promptly, and seem enthusiastic and professional, we'll start the project.</li>",
      "    </ol>",
      "  </p>",
      "  <p class='large-p'>This lengthy process serves an important purpose: it reduces the likelihood that any of our campers or stakeholders will waste their precious time.</p>",
      "  <h3>Nonprofit Stakeholders</h3>",
      "  <p class='large-p'>Each nonprofit project was submitted by a nonprofit. A representative from this nonprofit has agreed to serve as a \"stakeholder\" - an authorative person who understands the organization and its needs for this particular project.</p>",
      "  <p class='large-p'>Stakeholders have a deep understanding of their organizations' needs. Campers will work with them to figure out the best solutions to these needs.</p>",
      "  <p class='large-p'>When you and your pair first speak with your nonprofit stakeholder, you'll:</p>",
      "  <p class='large-p'>",
      "    <ul>",
      "      <li class='large-li'>talk at length to better understand their needs.</li>",
      "      <li class='large-li'>create a new Trello board and use it to prioritize what needs to be built.</li>",
      "      <li class='large-li'>and establish deadlines based on your weekly time commitment, and how long you think each task will take.</li>",
      "    </ul>",
      "  </p>",
      "  <p class='large-p'>It's notoriously difficult to estimate how long building software projects will take, so feel free to ask our volunteer team for help.</p>",
      "  <p class='large-p'>You'll continue to meet with your stakeholder at least twice a month in your project's Gitter or Slack channel.</p>",
      "  <p class='large-p'>You should also ask questions in your project's Gitter or Slack channel as they come up throughout the week, and your stakeholder can answer them asynchronously.</p>",
      "  <p class='large-p'>Getting \"blocked\" on a task can take away your sense of forward momentum, so be sure to proactively seek answers to any ambiguities you encounter.</p>",
      "  <p class='large-p'>Ultimately, the project will be considered complete once both the stakeholder's needs have been met, and you and your pair are happy with the project. Then you can add it to your portfolio!</p>",
      "  <h3>Working with your Pair</h3>",
      "  <p class='large-p'>You and your pair will pair program (code together on the same computer virtually) about half of the time, and work independently the other half of the time.</p>",
      "  <p class='large-p'>Here are our recommended ways of collaborating:</p>",
      "  <p class='large-p'>",
      "    <ul>",
      "      <li class='large-li'>&#8226; Gitter has robust private messaging functionality. It's the main way our team communicates, and we recommend it over email.</li>",
      "      <li class='large-li'>&#8226; Trello is great for managing projects. Work with your stakeholder to create Trello cards, and update these cards regularly as you make progress on them.</li>",
      "      <li class='large-li'>&#8226; Screenhero or Team Viewer - These are the ideal way to pair program. Tools like TMUX are good, but difficult to use. We discourage you from using screen sharing tools where only one person has control of the keyboard and mouse - that isn't real pair programming.</li>",
      "      <li class='large-li'>&#8226; Write clear and readable code, commit messages, branch names, and pull request messages.</li>",
      "    </ul>",
      "  </p>",
      "  <h3>Hosting Apps</h3>",
      "  <p class='large-p'>Unless your stakeholder has an existing modern host (AWS, Digital Ocean), you'll need to transition them over to a new platform. We believe Heroku is the best choice for a vast majority of web projects. It's free, easy to use, and has both browser and command line interfaces. It's owned by Salesforce and used by a ton of companies, so it's accountable and unlikely to go away.</p>",
      "  <p class='large-p'>If you need help convincing your stakeholder that Heroku is the ideal platform, we'll be happy to talk with them.</p>",
      "  <h3>Maintaining Apps</h3>",
      "  <p class='large-p'>Once you complete a nonprofit project, your obligation to its stakeholder is finished. Your goal is to leave behind a well documented solution that can be easily maintained by a contract JavaScript developer (or even a less-technical \"super user\").</p>",
      "  <p class='large-p'>While you will no longer need to help with feature development, we encourage you to consider helping your stakeholder with occasional patches down the road. After all, this project will be an important piece of your portfolio, and you'll want it to remain in good shape for curious future employers.</p>",
      "  <h3>Pledging to finish the project</h3>",
      "  <p class='large-p'>Your nonprofit stakeholder, your pair, and our volunteer team are all counting on you to finish your nonprofit project. If you walk away from an unfinished nonprofit project, you'll become ineligible to ever be assigned another one.</p>",
      "  <p class='large-p'>To confirm that you understand the seriousness of this commitment, we require that all campers &thinsp;<a href=\"http://goo.gl/forms/ZMn96z2QqY\">sign this pledge &thinsp;</a>before starting on their nonprofit projects.</p>",
      "  <p class='large-p'>There will likely be times of confusion or frustration. This is normal in software development. The most important thing is that you do not give up and instead persevere through these setbacks. As Steve Jobs famously said, \"Real artists ship.\" And you are going to ship one successful nonprofit project after another until you feel ready to take the next step in your promising career.</p>",
      "</div>"
    ]
  },
  {
    "id": "bd7158d9c436eddfadb5bd3e",
    "name": "How can I contribute to this guide?",
    "dashedName": "how-can-i-contribute-to-this-guide",
    "category": "outreach",
    "description": [
      "<div class=\"col-xs-12 col-sm-10 col-sm-offset-1\">",
      "  <p class='large-p'>Contributing to our field guide is a great way to establish your history on GitHub, add to your portfolio, and help other campers. If you have a question about JavaScript or programming in general that you'd like us to add to the field guide, here are two ways to get it into the guide:</p>",
      "  <p class='large-p'>",
      "    <ol>",
      "      <li class='large-li'>You can message @danraley on Gitter with your question.</li>",
      "      <li class='large-li'>You can also contribute to this field guide directly via GitHub pull request, by cloning Free Code Camp's <a href='https://github.com/FreeCodeCamp/freecodecamp'>main repository</a> and modifying <a href='https://github.com/FreeCodeCamp/freecodecamp/blob/master/seed_data/field-guides.json'>field-guides.json</a>.</li>",
      "    </ol>",
      "  </p>",
      "</div>"
    ]
  },
  {
    "id": "bd7158d9c436eddfadb5bd32",
    "name": "How can I help the Free Code Camp translation effort?",
    "dashedName": "how-can-i-help-the-free-code-camp-translation-effort",
    "category": "outreach",
    "description": [
      "<div class=\"col-xs-12 col-sm-10 col-sm-offset-1\">",
      "  <p class='h2'>Our translation effort is driven by bilingual campers like you.</h2>",
      "  <p class='large-p'>If you're able to help us, you can join our <a href='https://trello.com/b/m7zhwXka/fcc-translation' target='_blank'>Trello board</a> by sending @quincylarson your email address on Gitter.</p>",
      "</div>"
    ]
  },
  {
    "id": "bd7158d9c436eddfadb5bd31",
    "name": "What if I speak a language that Free Code Camp does not yet support?",
    "dashedName": "what-if-i-speak-a-language-that-free-code-camp-does-not-yet-support",
    "category": "outreach",
    "description": [
      "<div class=\"col-xs-12 col-sm-10 col-sm-offset-1\">",
      "  <p class='h2'>Translation is an all-or-nothing proposal.</h2>",
      "  <p class='large-p'>We won't be able to add new languages to Free Code Camp until all of our challenges are translated into that language.</p>",
      "  <p class='large-p'>In addition to translating these initially, we'll also need to maintain the translation as the challenges are gradually updated.</p>",
      "  <p class='large-p'>If you're able to help us, you can join our <a href='https://trello.com/b/m7zhwXka/fcc-translation' target='_blank'>Trello board</a> by sending @quincylarson your email address on Gitter.</p>",
      "</div>"
    ]
  }
]
