{
  "quotes": [
    {
      "quote": "Never, never, never, never, never, never give up.",
      "author": "Winston Churchill"
    },
    {
      "quote":
        "The pessimist sees difficulty in every opportunity. The optimist sees opportunity in every difficulty.",
      "author": "Winston Churchill"
    },
    {
      "quote":
        "Twenty years from now you you will be more disappointed by the things that you didn't do than by the ones you did do. So throw off the bowlines. Sail away from the safe harbor. Catch the trade winds in your sails.",
      "author": "Mark Twain"
    },
    {
      "quote": "The secret of getting ahead is getting started.",
      "author": "Mark Twain"
    },
    {
      "quote": "A person who never made a mistake never tried anything new.",
      "author": "Albert Einstein"
    },
    {
      "quote":
        "Life is like riding a bicycle. To keep your balance, you must keep moving.",
      "author": "Albert Einstein"
    },
    {
      "quote": "Nothing will work unless you do.",
      "author": "Maya Angelou"
    },
    {
      "quote":
        "The most difficult thing is the decision to act, the rest is merely tenacity.",
      "author": "Amelia Earhart"
    },
    {
      "quote":
        "The only person you are destined to become is the person you decide to be.",
      "author": "Ralph Waldo Emerson"
    },
    {
      "quote": "You must do the things you think you cannot do.",
      "author": "Eleanor Roosevelt"
    },
    {
      "quote":
        "You are never too old to set another goal, or to dream a new dream.",
      "author": "C.S. Lewis"
    },
    {
      "quote": "Believe you can and you're halfway there.",
      "author": "Theodore Roosevelt"
    },
    {
      "quote":
        "I fear not the man who has practiced 10,000 kicks once, but I fear the man who has practiced one kick 10,000 times.",
      "author": "Bruce Lee"
    },
    {
      "quote": "The way to get started is to quit talking and begin doing.",
      "author": "Walt Disney"
    },
    {
      "quote": "Don’t let yesterday take up too much of today.",
      "author": "Will Rodgers"
    },
    {
      "quote":
        "It’s not whether you get knocked down, it’s whether you get up.",
      "author": "Vince Lombardi"
    },
    {
      "quote":
        "If you are working on something that you really care about, you don’t have to be pushed. The vision pulls you.",
      "author": "Steve Jobs"
    },
    {
      "quote":
        "People who are crazy enough to think they can change the world, are the ones who do.",
      "author": "Rob Siltanen"
    },
    {
      "quote":
        "Failure will never overtake me if my determination to succeed is strong enough.",
      "author": "Og Mandino"
    },
    {
      "quote": "We may encounter many defeats, but we must not be defeated.",
      "author": "Maya Angelou"
    },
    {
      "quote":
        "Knowing is not enough; we must apply. Wishing is not enough; we must do.",
      "author": "Johann Wolfgang von Goethe"
    },
    {
      "quote": "Whether you think you can or think you can’t, you’re right.",
      "author": "Henry Ford"
    },
    {
      "quote":
        "The only limit to our realization of tomorrow, will be our doubts of today.",
      "author": "Franklin D. Roosevelt"
    },
    {
      "quote":
        "You don’t have to be great to start, but you have to start to be great.",
      "author": "Zig Ziglar"
    },
    {
      "quote": "Today’s accomplishments were yesterday’s impossibilities.",
      "author": "Robert H. Schuller"
    },
    {
      "quote": "Life is 10% what happens to you and 90% how you react to it.",
      "author": "Charles R. Swindoll"
    },
    {
      "quote":
        "Optimism is the faith that leads to achievement. Nothing can be done without hope and confidence.",
      "author": "Helen Keller"
    },
    {
      "quote": "With the new day comes new strength and new thoughts.",
      "author": "Eleanor Roosevelt"
    },
    {
      "quote": "The past cannot be changed. The future is yet in your power.",
      "author": "Confucius"
    },
    {
      "quote": "It always seems impossible until it's done.",
      "author": "Nelson Mandela"
    },
    {
      "quote":
        "You can't cross the sea merely by standing and staring at the water.",
      "author": "Rabindranath Tagore"
    },
    {
      "quote": "Quality is not an act, it is a habit.",
      "author": "Aristotle"
    },
    {
      "quote": "Without hard work, nothing grows but weeds.",
      "author": "Gordon B. Hinckley"
    },
    {
      "quote": "If you're going through hell, keep going.",
      "author": "Winston Churchill"
    },
    {
      "quote":
        "Our greatest weakness lies in giving up. The most certain way to succeed is always to try just one more time.",
      "author": "Thomas A. Edison"
    },
    {
      "quote":
        "Do the difficult things while they are easy and do the great things while they are small. A journey of a thousand miles must begin with a single step.",
      "author": "Lao Tzu"
    },
    {
      "quote": "Well done is better than well said.",
      "author": "Benjamin Franklin"
    },
    {
      "quote":
        "There is only one corner of the universe you can be certain of improving, and that's your own self.",
      "author": "Aldous Huxley"
    },
    {
      "quote": "Aim for the moon. If you miss, you may hit a star.",
      "author": "W. Clement Stone"
    },
    {
      "quote": "Start where you are. Use what you have. Do what you can.",
      "author": "Arthur Ashe"
    },
    {
      "quote": "Don't watch the clock; do what it does. Keep going.",
      "author": "Sam Levenson"
    },
    {
      "quote": "The most effective way to do it, is to do it.",
      "author": "Amelia Earhart"
    },
    {
      "quote": "By failing to prepare, you are preparing to fail.",
      "author": "Benjamin Franklin"
    },
    {
      "quote":
        "Do not wait to strike till the iron is hot; but make it hot by striking.",
      "author": "William Butler Yeats"
    },
    {
      "quote": "The harder the conflict, the more glorious the triumph.",
      "author": "Thomas Paine"
    },
    {
      "quote":
        "Opportunity does not knock, it presents itself when you beat down the door.",
      "author": "Kyle Chandler"
    },
    {
      "quote": "Perseverance is failing 19 times and succeeding the 20th.",
      "author": "Julie Andrews"
    },
    {
      "quote":
        "I attribute my success to this - I never gave or took any excuse.",
      "author": "Florence Nightingale"
    },
    {
      "quote": "Even if you fall on your face, you're still moving forward.",
      "author": "Victor Kiam"
    },
    {
      "quote":
        "You can't wait for inspiration. You have to go after it with a club.",
      "author": "Jack London"
    },
    {
      "quote":
        "Live as if you were to die tomorrow. Learn as if you were to live forever. ",
      "author": "Mahatma Gandhi"
    },
    {
      "quote": "If you don’t risk anything, you risk even more.",
      "author": "Erica Jong"
    },
    {
      "quote":
        "The work of today is the history of tomorrow, and we are its makers.",
      "author": "Juliette Gordon Low"
    },
    {
      "quote": "It is never too late to be what you might have been. ",
      "author": "Mary Anne Evans"
    },
    {
      "quote":
        "Nothing in life is to be feared, it is only to be understood. Now is the time to understand more, so that we may fear less. ",
      "author": "Marie Curie"
    },
    {
      "quote": "Life shrinks or expands in proportion with one’s courage.",
      "author": "Anaïs Nin"
    },
    {
      "quote":
        "If you’re not making mistakes, then you’re not making decisions. ",
      "author": "Catherine Cook"
    },
    {
      "quote":
        "Whether you want to uncover the secrets of the universe, or you want to pursue a career in the 21st century, basic computer programming is an essential skill to learn.",
      "author": "Stephen Hawking"
    },
    {
      "quote":
        "I've missed more than 9,000 shots during my career. I've lost almost 300 games. 26 times, I've been trusted to take the game winning shot and missed. I've failed over and over and over again in my life. And that is why I succeed.",
      "author": "Michael Jordan"
    },
    {
      "quote": "You miss 100% of the shots you don't take.",
      "author": "Wayne Gretzky"
    },
    {
      "quote":
        "The two most important days in your life are the day you are born and the day you find out why.",
      "author": "Mark Twain"
    },
    {
      "quote":
        "The most common people give up their power is by thinking they don't have any.",
      "author": "Alice Walker"
    },
    {
      "quote": "The best revenge is massive success.",
      "author": "Frank Sinatra"
    },
    {
      "quote": "Giving up is the only sure way to fail.",
      "author": "Gena Showalter"
    },
    {
      "quote":
        "I have not failed. I've just found 10,000 ways that won't work.",
      "author": "Thomas A. Edison"
    },
    {
      "quote": "What you do speaks so loudly that I cannot hear what you say.",
      "author": "Ralph Waldo Emerson"
    },
    {
      "quote": "Tough times never last, but tough people do.",
      "author": "Dr. Robert Schuller"
    },
    {
      "quote": "The best way out is always through.",
      "author": "Robert Frost"
    },
    {
      "quote": "The power of imagination makes us infinite.",
      "author": "John Muir"
    },
    {
      "quote": "Light tomorrow with today.",
      "author": "Elizabeth Barrett Browning"
    },
    {
      "quote":
        "Even if you’re on the right track, you’ll get run over if you just sit there.",
      "author": "Will Rogers"
    },
    {
      "quote": "Every strike brings me closer to the next home run.",
      "author": "Babe Ruth"
    },
    {
      "quote": "Your imagination is your preview of life’s coming attractions.",
      "author": "Albert Einstein"
    },
    {
      "quote": "The harder I work, the luckier I get.",
      "author": "Gary Player"
    },
    {
      "quote":
        "The price of anything is the amount of life you exchange for it.",
      "author": "Henry David Thoreau"
    },
    {
      "quote": "Someday is not a day of the week.",
      "author": "Denise Brennan-Nelson"
    },
    {
      "quote": "There are no short cuts to any place worth going.",
      "author": "Beverly Sills"
    },
    {
      "quote": "The best way to predict the future is to invent it.",
      "author": "Alan Kay"
    },
    {
      "quote":
        "If you have everything under control, you’re not moving fast enough.",
      "author": "Mario Andretti"
    },
    {
      "quote": "Don’t wish it were easier, wish you were better.",
      "author": "Jim Rohn"
    },
    {
      "quote":
        "Impossible is just a big word thrown around by small men who find it easier to live in the world they've been given than to explore the power they have to change it. Impossible is not a fact. It's an opinion. Impossible is not a declaration. It's a dare. Impossible is potential. Impossible is temporary. Impossible is nothing.",
      "author": "Muhammad Ali"
    },
    {
      "quote":
        "It had long since come to my attention that people of accomplishment rarely sat back and let things happen to them. They went out and happened to things.",
      "author": "Leonardo da Vinci"
    },
    {
      "quote":
        "It is not the strongest of the species that survive, nor the most intelligent, but the one most responsive to change.",
      "author": "Charles Darwin"
    },
    {
      "quote":
        "Whether you think you can, or think you can't, you're probably right.",
      "author": "Henry Ford "
    },
    {
      "quote":
        "Strength does not come from physical capacity. It comes from an indomitable will.",
      "author": "Mahatma Gandhi"
    },
    {
      "quote":
        "Those who says it cannot be done should not interrupt the person doing it.",
      "author": "Unknown"
    },
    {
      "quote":
        "It does not matter how slowly you go as long as you do not stop. ",
      "author": "Confucius"
    },
    {
      "quote": "An ant on the move does more than a dozing ox.",
      "author": "Lao Tzu"
    },
    {
      "quote":
        "Do the difficult things while they are easy and do the great things while they are small. A journey of a thousand miles must begin with a single step. ",
      "author": "Lao Tzu"
    },
    {
      "quote": "We are what we believe we are. ",
      "author": "C. S. Lewis"
    },
    {
      "quote":
        "With the possible exception of the equator, everything begins somewhere.",
      "author": "C. S. Lewis"
    },
    {
      "quote": "Arise, Awake and Stop not until the goal is reached.",
      "author": "Swami Vivekananda"
    },
    {
      "quote": "You only live once, but if you do it right, once is enough.",
      "author": "Mae West"
    },
    {
      "quote":
        "We delight in the beauty of the butterfly, but rarely admit the changes it has gone through to achieve that beauty.",
      "author": "Maya Angelou"
    },
    {
      "quote": "Sell your cleverness and buy bewilderment.",
      "author": "Rumi"
    },
    {
      "quote": "The cure for pain is in the pain.",
      "author": "Rumi"
    },
    {
      "quote": "May you live every day of your life.",
      "author": "Jonathan Swift"
    },
    {
      "quote": "Pain is inevitable. Suffering is optional.",
      "author": "Haruki Murakami"
    },
    {
      "quote": "Do one thing every day that scares you.",
      "author": "Eleanor Roosevelt"
    },
    {
      "quote":
        "Anyone who has never made a mistake has never tried anything new.",
      "author": "Albert Einstein"
    },
    {
      "quote":
        "Be not afraid of greatness. Some are born great, some achieve greatness, and others have greatness thrust upon them.",
      "author": "William Shakespeare"
    },
    {
      "quote": "Nothing is impossible, the word itself says \"I'm possible\"!",
      "author": "Audrey Hepburn"
    },
    {
      "quote":
        "There is only one thing that makes a dream impossible to achieve: the fear of failure.",
      "author": "Paulo Coelho"
    },
    {
      "quote": "Never memorize something that you can look up.",
      "author": "Albert Einstein"
    },
    {
      "quote": "Whatever you are, be a good one.",
      "author": "Abraham Lincoln"
    },
    {
      "quote":
        "In the depth of winter, I finally learned that within me there lay an invincible summer.",
      "author": "Albert Camus"
    },
    {
      "quote": "If you’re any good at all, you know you can be better.",
      "author": "Lindsay Buckingham"
    },
    {
      "quote": "Failure is the condiment that gives success its flavor.",
      "author": "Truman Capote"
    },
    {
      "quote":
        "Success is stumbling from failure to failure with no loss of enthusiasm.",
      "author": "Winston S. Churchill"
    },
    {
      "quote": "Only those who dare to fail greatly can ever achieve greatly.",
      "author": "Robert F. Kennedy"
    },
    {
      "quote": "Never confuse a single defeat with a final defeat.",
      "author": "F. Scott Fitzgerald"
    },
    {
      "quote": "Have no fear of perfection - you'll never reach it.",
      "author": "Salvador Dalí"
    },
    {
      "quote":
        "Education: the path from cocky ignorance to miserable uncertainty.",
      "author": "Mark Twain"
    },
    {
      "quote":
        "Wisdom is not a product of schooling but of the lifelong attempt to acquire it.",
      "author": "Albert Einstein"
    },
    {
      "quote": "By seeking and blundering we learn.",
      "author": "Johann Wolfgang von Goethe"
    },
    {
      "quote": "Play is the highest form of research.",
      "author": "Albert Einstein"
    },
    {
      "quote":
        "There is nothing noble in being superior to your fellow man; true nobility is being superior to your former self.",
      "author": "Ernest Hemingway"
    },
    {
      "quote": "Once we accept our limits, we go beyond them.",
      "author": "Albert Einstein"
    },
    {
      "quote": "Let us cultivate our garden.",
      "author": "Voltaire"
    },
    {
      "quote": "All we are not stares back at what we are.",
      "author": "W.H. Auden"
    },
    {
      "quote": "We first make our habits, then our habits make us.",
      "author": "John Dryden"
    },
    {
      "quote": "Everybody has talent, but ability takes hard work.",
      "author": "Michael Jordan"
    },
    {
      "quote": "We are all failures. At least the best of us are.",
      "author": "J.M. Barrie"
    },
    {
      "quote": "Never go to bed mad. Stay up and fight.",
      "author": "Phyllis Diller"
    },
    {
      "quote": "I have no special talents. I am only passionately curious.",
      "author": "Albert Einstein"
    },
    {
      "quote": "I am not young enough to know everything.",
      "author": "Oscar Wilde"
    },
    {
      "quote":
        "A life spent making mistakes is not only more honorable, but more useful than a life spent doing nothing.",
      "author": "George Bernard Shaw"
    },
    {
      "quote": "Somewhere, something incredible is waiting to be known.",
      "author": "Carl Sagan"
    },
    {
      "quote": "What matters most is how well you walk through the fire.",
      "author": "Charles Bukowski"
    },
    {
      "quote":
        "It is said that your life flashes before your eyes just before you die. That is true, it's called Life.",
      "author": "Terry Pratchet"
    },
    {
      "quote":
        "You cannot swim for new horizons until you have courage to lose sight of the shore.",
      "author": "William Faulkner"
    },
    {
      "quote":
        "I know, somehow, that only when it is dark enough can you see the stars.",
      "author": "Martin Luther King Jr."
    },
    {
      "quote": "Follow your inner moonlight; don't hide the madness.",
      "author": "Allen Ginsberg"
    },
    {
      "quote": "We know what we are, but not what we may be.",
      "author": "William Shakespeare"
    },
    {
      "quote": "The universe doesn't allow perfection.",
      "author": "Stephen Hawking"
    },
    {
      "quote": "The scariest moment is always just before you start.",
      "author": "Stephen King"
    },
    {
      "quote": "A winner is a dreamer who never gives up.",
      "author": "Nelson Mandela"
    },
    {
      "quote": "History will be kind to me for I intend to write it.",
      "author": "Winston S. Churchill"
    },
    {
      "quote":
        "There are far, far better things ahead than any we leave behind.",
      "author": "C.S. Lewis"
    },
    {
      "quote": "Forever is composed of nows.",
      "author": "Emily Dickinson"
    },
    {
      "quote": "Find what you love and let it kill you.",
      "author": "Charles Bukowski"
    },
    {
      "quote":
        "The world breaks everyone, and afterward, many are strong at the broken places.",
      "author": "Ernest Hemingway"
    },
    {
      "quote": "You will do foolish things, but do them with enthusiasm.",
      "author": "Colette"
    },
    {
      "quote": "I dream my painting and I paint my dream.",
      "author": "Vincent van Gogh"
    },
    {
      "quote": "You were born with wings, why prefer to crawl through life?",
      "author": "Rumi"
    },
    {
      "quote":
        "Forget safety. Live where you fear to live. Destroy your reputation. Be notorious.",
      "author": "Rumi"
    },
    {
      "quote":
        "Don't be satisfied with stories, how things have gone with others. Unfold your own myth.",
      "author": "Rumi"
    },
    {
      "quote":
        "If things start happening, don't worry, don't stew, just go right along and you'll start happening too.",
      "author": "Dr. Seuss"
    },
    {
      "quote":
        "Do not go gentle into that good night. Rage, rage against the dying of the light.",
      "author": "Dylan Thomas"
    },
    {
      "quote":
        "You can, you should, and if you’re brave enough to start, you will.",
      "author": "Stephen King"
    },
    {
      "quote":
        "A good traveler has no fixed plans and is not intent on arriving.",
      "author": "Lao Tzu"
    },
    {
      "quote": "Creativity is intelligence having fun.",
      "author": "Albert Einstein"
    },
    {
      "quote":
        "We can only see a short distance ahead, but we can see plenty there that needs to be done.",
      "author": "Alan Turing"
    },
    {
      "quote":
        "The Web as I envisaged it, we have not seen it yet. The future is still so much bigger than the past.",
      "author": "Tim Berners-Lee"
    },
    {
      "quote": "Computers are useless. They can only give you answers.",
      "author": "Pablo Picasso"
    },
    {
      "quote":
        "The question of whether computers can think is like the question of whether submarines can swim.",
      "author": "Edsger W. Dijkstra"
    },
    {
      "quote":
        "That's what's cool about working with computers. They don't argue, they remember everything, and they don't drink all your beer.",
      "author": "Paul Leary"
    },
    {
      "quote":
        "If the automobile had followed the same development cycle as the computer, a Rolls-Royce would today cost $100, get a million miles per gallon, and explode once a year, killing everyone inside.",
      "author": "Robert X. Cringely"
    },
    {
      "quote":
        "Computers are getting smarter all the time. Scientists tell us that soon they will be able to talk to us. (And by 'they', I mean 'computers'. I doubt scientists will ever be able to talk to us.)",
      "author": "Dave Barry"
    },
    {
      "quote":
        "I've noticed lately that the paranoid fear of computers becoming intelligent and taking over the world has almost entirely disappeared from the common culture. Near as I can tell, this coincides with the release of MS-DOS.",
      "author": "Larry DeLuca"
    },
    {
      "quote":
        "It's ridiculous to live 100 years and only be able to remember 30 million bytes. You know, less than a compact disc. The human condition is really becoming more obsolete every minute.",
      "author": "Marvin Minsky"
    },
    {
      "quote":
        "The city's central computer told you? R2D2, you know better than to trust a strange computer!",
      "author": "C3PO"
    },
    {
      "quote": "Never trust a computer you can't throw out a window.",
      "author": "Steve Wozniak"
    },
    {
      "quote": "Hardware: The parts of a computer system that can be kicked.",
      "author": "Jeff Pesis"
    },
    {
      "quote":
        "Most software today is very much like an Egyptian pyramid with millions of bricks piled on top of each other, with no structural integrity, but just done by brute force and thousands of slaves.",
      "author": "Alan Kay"
    },
    {
      "quote":
        "I've finally learned what 'upward compatible' means. It means we get to keep all our old mistakes.",
      "author": "Dennie van Tassel"
    },
    {
      "quote":
        "There are two major products that come out of Berkeley: LSD and UNIX. We don't believe this to be a coincidence.",
      "author": "Jeremy S. Anderson"
    },
    {
      "quote": "Every operating system out there is about equal… We all suck.",
      "author":
        "Microsoft senior vice president Brian Valentine describing the state of the art in OS security, 2003"
    },
    {
      "quote":
        "Microsoft has a new version out, Windows XP, which according to everybody is the 'most reliable Windows ever.' To me, this is like saying that asparagus is 'the most articulate vegetable ever.' ",
      "author": "Dave Barry"
    },
    {
      "quote": "The Internet? Is that thing still around?",
      "author": "Homer Simpson"
    },
    {
      "quote":
        "The Web is like a dominatrix. Everywhere I turn, I see little buttons ordering me to Submit.",
      "author": "Nytwind"
    },
    {
      "quote":
        "Come to think of it, there are already a million monkeys on a million typewriters, and Usenet is nothing like Shakespeare.",
      "author": "Blair Houghton"
    },
    {
      "quote":
        "The most amazing achievement of the computer software industry is its continuing cancellation of the steady and staggering gains made by the computer hardware industry.",
      "author": "Henry Petroski"
    },
    {
      "quote":
        "True innovation often comes from the small startup who is lean enough to launch a market but lacks the heft to own it.",
      "author": "Timm Martin"
    },
    {
      "quote":
        "It has been said that the great scientific disciplines are examples of giants standing on the shoulders of other giants. It has also been said that the software industry is an example of midgets standing on the toes of other midgets.",
      "author": "Alan Cooper"
    },
    {
      "quote":
        "It is not about bits, bytes and protocols, but profits, losses and margins.",
      "author": "Lou Gerstner"
    },
    {
      "quote":
        "No matter how slick the demo is in rehearsal, when you do it in front of a live audience, the probability of a flawless presentation is inversely proportional to the number of people watching, raised to the power of the amount of money involved.",
      "author": "Mark Gibbs"
    },
    {
      "quote":
        "The bulk of all patents are crap. Spending time reading them is stupid. It's up to the patent owner to do so, and to enforce them.",
      "author": "Linus Torvalds"
    },
    {
      "quote": "Controlling complexity is the essence of computer programming.",
      "author": "Brian Kernigan"
    },
    {
      "quote":
        "Complexity kills. It sucks the life out of developers, it makes products difficult to plan, build and test, it introduces security challenges, and it causes end-user and administrator frustration.",
      "author": "Ray Ozzie"
    },
    {
      "quote":
        "There are two ways of constructing a software design. One way is to make it so simple that there are obviously no deficiencies. And the other way is to make it so complicated that there are no obvious deficiencies.",
      "author": "C.A.R. Hoare"
    },
    {
      "quote":
        "The function of good software is to make the complex appear to be simple.",
      "author": "Grady Booch"
    },
    {
      "quote":
        "Just remember: you're not a 'dummy,' no matter what those computer books claim. The real dummies are the people who–though technically expert–couldn't design hardware and software that's usable by normal consumers if their lives depended upon it.",
      "author": "Walter Mossberg"
    },
    {
      "quote":
        "Software suppliers are trying to make their software packages more 'user-friendly'… Their best approach so far has been to take all the old brochures and stamp the words 'user-friendly' on the cover.",
      "author": "Bill Gates"
    },
    {
      "quote":
        "There's an old story about the person who wished his computer were as easy to use as his telephone. That wish has come true, since I no longer know how to use my telephone.",
      "author": "Bjarne Stroustrup"
    },
    {
      "quote": "Any fool can use a computer. Many do.",
      "author": "Ted Nelson"
    },
    {
      "quote":
        "There are only two industries that refer to their customers as 'users'.",
      "author": "Edward Tufte"
    },
    {
      "quote":
        "Let us not look back in anger or forward in fear, but around in awareness.",
      "author": "James Thurber"
    },
    {
      "quote":
        "It used to be expensive to make things public and cheap to make them private. Now it’s expensive to make things private and cheap to make them public.",
      "author": "Clay Shirky, Internet scholar and professor at N.Y.U."
    },
    {
      "quote": "Privacy is not for the passive.",
      "author": "Jeffrey Rosen"
    },
    {
      "quote":
        "Privacy snafus are to social networks as violence is to football. The whole point of social networks is to share stuff about people that’s interesting, just as the whole point of football is to upend the guy with the ball. Every so often, someone gets paralyzed, which prompts us to add padding to the helmets or set new rules about tackling. Then we move on.",
      "author": "Nicholas Thompson"
    },
    {
      "quote":
        "Recommended additon to the Consumer Privacy Bill of Rights: \"A right to not have your data rise up and attack you.",
      "author": "Benjamin Wittes, Brookings Institution"
    },
    {
      "quote":
        "The user's going to pick dancing pigs over security every time.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "If someone steals your password, you can change it. But if someone steals your thumbprint, you can’t get a new thumb. The failure modes are very different.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "If you reveal your secrets to the wind, you should not blame the wind for revealing them to the trees.",
      "author": "Kahlil Gibran"
    },
    {
      "quote":
        "There are no secrets better kept than the secrets that everybody guesses.",
      "author": "George Bernard Shaw"
    },
    {
      "quote":
        "Better be despised for too anxious apprehensions, than ruined by too confident security.",
      "author": "Edmund Burke"
    },
    {
      "quote":
        "The mantra of any good security engineer is: \"Security is a not a product, but a process.\" It's more than designing strong cryptography into a system; it's designing the entire system such that all security measures, including cryptography, work together.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "Politically Correct Virus: Doesn't refer to itself as a virus - instead, refers to itself as an \"electronic microorganism.",
      "author": "Mark Kaye"
    },
    {
      "quote":
        "I think computer viruses should count as life. I think it says something about human nature that the only form of life we have created so far is purely destructive. We've created life in our own image.",
      "author": "Stephen Hawking"
    },
    {
      "quote":
        "In view of all the deadly computer viruses that have been spreading lately, Weekend Update would like to remind you: when you link up to another computer, you're linking up to every computer that that computer has ever linked up to.",
      "author": "Dennis Miller"
    },
    {
      "quote":
        "Securing a computer system has traditionally been a battle of wits: the penetrator tries to find the holes, and the designer tries to close them.",
      "author": "Gosser"
    },
    {
      "quote":
        "A computer lets you make more mistakes faster than any invention in human history - with the possible exceptions of handguns and tequila.",
      "author": "Mitch Ratliff"
    },
    {
      "quote":
        "It ain’t what you don’t know that gets you into trouble. It’s what you know for sure that just ain’t so.",
      "author": "Mark Twain"
    },
    {
      "quote":
        "We should treat personal electronic data with the same care and respect as weapons-grade plutonium - it is dangerous, long-lasting and once it has leaked there's no getting it back.",
      "author": "Cory Doctorow"
    },
    {
      "quote":
        "Never say anything in an electronic message that you wouldn't want appearing, and attributed to you, in tomorrow morning's front-page headline in the New York Times.",
      "author":
        "Colonel David Russell, former head of DARPA's Information Processing Techniques Office"
    },
    {
      "quote":
        "If you give people the means to hurt you, and they do it, and you take no action except to continue giving them the means to hurt you, and they take no action except to keep hurting you, then one of the ways you can describe the situation is it isn't scaling well.",
      "author": "Paul Vixie, on NANOG"
    },
    {
      "quote":
        "Just once, why can't one of our poorly considered quick fixes work?",
      "author": "Joel Helgeson"
    },
    {
      "quote":
        "Information security's response to bitter failure, in any area of endeavour, is to try the same thing that didn't work -- only harder.",
      "author": "Marcus Ranum"
    },
    {
      "quote":
        "You are absolutely deluded, if not stupid, if you think that a worldwide collection of software engineers who can't write operating systems or applications without security holes, can then turn around and suddenly write virtualization layers without security holes.",
      "author": "Theo De Raadt"
    },
    {
      "quote":
        "In a relatively short time we've taken a system built to resist destruction by nuclear weapons and made it vulnerable to toasters.",
      "author": "Jeff Jarmoc"
    },
    {
      "quote":
        "Any sufficiently advanced bug is indistinguishable from a feature.",
      "author": "Rich Kulawiec (riffing on Arthur C. Clarke's 2nd law)"
    },
    {
      "quote":
        "If someone else can run arbitrary code on your computer, it's not YOUR computer any more.",
      "author": "Rich Kulawiec"
    },
    {
      "quote":
        "People in general are not interested in paying extra for increased safety. At the beginning seat belts cost $200 and nobody bought them.",
      "author": "Gene Spafford"
    },
    {
      "quote":
        "Securing an environment of Windows platforms from abuse - external or internal - is akin to trying to install sprinklers in a fireworks factory where smoking on the job is permitted.",
      "author":
        "Gene Spafford (in e-mail to organizers of a workshop on insider misuse)"
    },
    {
      "quote":
        "Using encryption on the Internet is the equivalent of arranging an armored car to deliver credit card information from someone living in a cardboard box to someone living on a park bench.",
      "author": "Gene Spafford"
    },
    {
      "quote":
        "Most people spend more time and energy going around problems than trying to solve them.",
      "author": "Henry Ford"
    },
    {
      "quote": "If privacy is outlawed, only outlaws will have privacy.",
      "author": "Philip Zimmermann"
    },
    {
      "quote": "Interest is a terrible thing to waste.",
      "author": "Roger Schank"
    },
    {
      "quote":
        "Men do not like to admit to even momentary imperfection. My husband forgot the code to turn off the alarm. When the police came, he wouldn't admit he'd forgotten the code... he turned himself in.",
      "author": "Rita Rudner"
    },
    {
      "quote":
        "We're sitting on four million pounds of fuel, one nuclear weapon and a thing that has two hundred thousand moving parts built by the lowest bidder.",
      "author": "\"Rockhound\" in the movie 'Armageddon'"
    },
    {
      "quote":
        "Wisdom consists in being able to distinguish among dangers and make a choice of the least harmful.",
      "author": "Niccolo Machiavelli, The Prince"
    },
    {
      "quote": "Those who do not archive the past are condemned to retype it!",
      "author": "Garfinkel and Spafford"
    },
    {
      "quote": "Security is always excessive until it's not enough.",
      "author":
        "Robbie Sinclair, Head of Security, Country Energy, NSW Australia"
    },
    {
      "quote":
        "We only need to be lucky once. You need to be lucky every time.",
      "author":
        "The IRA to Margaret Thatcher, after a failed assassination attempt."
    },
    {
      "quote":
        "The anguish of low quality lingers long after the sweetness of low cost is forgotten.",
      "author":
        "unknown, quote suggested by Peter Gregory, CISSP, CISA (Thank you!)"
    },
    {
      "quote":
        "The whole notion of passwords is based on an oxymoron. The idea is to have a random string that is easy to remember. Unfortunately, if it's easy to remember, it's something nonrandom like 'Susan.' And if it's random, like 'r7U2*Qnp,' then it's not easy to remember.",
      "author": "Bruce Schneier"
    },
    {
      "quote": "In God we trust. All others, we virus scan.",
      "author": "unknown"
    },
    {
      "quote":
        "Those of us in security are very much like heart doctors - cardiologists. Our patients know that lack of exercise, too much dietary fat, and smoking are all bad for them. But they will continue to smoke, and eat fried foods, and practice being couch potatoes until they have their infarction. Then they want a magic pill to make them better all at once, without the effort. And by the way, they claim loudly that their condition really isn't their fault -- it was genetics, or the tobacco companies, or McDonalds that was to blame. And they blame us for not taking better care of them. Does this sound familiar?",
      "author": ""
    },
    {
      "quote":
        "But it doesn't have to be this way. We can do things better. We need to stop doing business as usual and start focusing on end-to-end quality. Security needs to be built in from the start -- not slapped on after the fact.",
      "author": "Gene Spafford"
    },
    {
      "quote":
        "Relying on the government to protect your privacy is like asking a peeping tom to install your window blinds.",
      "author": "John Perry Barlow"
    },
    {
      "quote":
        "If you spend more on coffee than on IT security, you will be hacked. What's more, you deserve to be hacked.",
      "author": "White House Cybersecurity Advisor, Richard Clarke"
    },
    {
      "quote": "We have only two modes - complacency and panic.",
      "author": "James R. Schlesinger, the first U.S. Dept. of Energy secretary"
    },
    {
      "quote":
        "The methods that will most effectively minimize the ability of intruders to compromise information security are comprehensive user training and education. Enacting policies and procedures simply won't suffice. Even with oversight the policies and procedures may not be effective: my access to Motorola, Nokia, ATT, Sun depended upon the willingness of people to bypass policies and procedures that were in place for years before I compromised them successfully.",
      "author": "Kevin Mitnick"
    },
    {
      "quote": "Amateurs hack systems, professionals hack people.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "If security were all that mattered, computers would never be turned on, let alone hooked into a network with literally millions of potential intruders.",
      "author": "Dan Farmer"
    },
    {
      "quote":
        "There are risks and costs to a program of action - but they are far less than the long range cost of comfortable inaction.",
      "author": "John F. Kennedy"
    },
    {
      "quote":
        "Security used to be an inconvenience sometimes, but now it's a necessity all the time.",
      "author":
        "Martina Navratilova after the stabbing of Monica Seles by a fan of Steffi Graf, 1993"
    },
    {
      "quote":
        "We didn't install the [Code Red] patch on those DMZ systems because they were only used for development and testing.",
      "author":
        "Anonymous client, shortly after spending 48 continuous hours removing 2001's Code Red worm fro"
    },
    {
      "quote":
        "Security breaches usually entail more recovery efforts than acts of God. Unlike proverbial lightning, breaches of security can be counted on to strike twice unless the route of compromise has been shut off.",
      "author": "FedCIRC"
    },
    {
      "quote":
        "Computer security can simply be protecting your equipment and files from disgruntled employees, spies, and anything that goes bump in the night, but there is much more. Computer security helps ensure that your computers, networks, and peripherals work as expected all the time, and that your data is safe in the event of hard disk crash or a power failure resulting from an electrical storm. Computer security also makes sure no damage is done to your data and that no one is able to read it unless you want them to.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "Hardware is easy to protect: lock it in a room, chain it to a desk, or buy a spare. Information poses more of a problem. It can exist in more than one place; be transported halfway across the planet in seconds; and be stolen without your knowledge.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "People often represent the weakest link in the security chain and are chronically responsible for the failure of security systems.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "If you think technology can solve your security problems, then you don't understand the problems and you don't understand the technology.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "The only truly secure system is one that is powered off, cast in a block of concrete and sealed in a lead-lined room with armed guards.",
      "author": "Gene Spafford"
    },
    {
      "quote":
        "Microsoft made a big deal about Windows NT getting a C2 security rating. They were much less forthcoming with the fact that this rating only applied if the computer was not attached to a network and had no network card, and had its floppy drive epoxied shut, and was running on a Compaq 386. Solaris's C2 rating was just as silly.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "The man who trades freedom for security does not deserve nor will he ever receive either.",
      "author": "Benjamin Franklin"
    },
    {
      "quote":
        "We will bankrupt ourselves in the vain search for absolute security.",
      "author": "Dwight D. Eisenhower"
    },
    {
      "quote":
        "No serious commentary will say that the user has no responsibility. We all have responsibilities to lock our doors in our homes and to buckle up when we get in cars.",
      "author":
        "a spokesman for the Information Technology Association of America"
    },
    {
      "quote":
        "As security or firewall administrators, we've got basically the same concerns [as plumbers]: the size of the pipe, the contents of the pipe, making sure the correct traffic is in the correct pipes, and keeping the pipes from splitting and leaking all over the place. Of course, like plumbers, when the pipes do leak, we're the ones responsible for cleaning up the mess, and we're the ones who come up smelling awful...",
      "author": "Marcus J. Ranum"
    },
    {
      "quote":
        "When you know that you're capable of dealing with whatever comes, you have the only security the world has to offer.",
      "author": "Harry Browne"
    },
    {
      "quote":
        "One person's \"paranoia\" is another person's \"engineering redundancy\".",
      "author": "Marcus J. Ranum"
    },
    {
      "quote":
        "Security must begin at the top of an organization. It is a leadership issue, and the chief executive must set the example.",
      "author": "heard at a security conference"
    },
    {
      "quote":
        "There is no castle so strong that it cannot be overthrown by money.",
      "author": "Cicero"
    },
    {
      "quote":
        "As we know, there are known knowns. There are things we know we know. We also know there are known unknowns. That is to say we know there are some things we do not know. But there are also unknown unknowns, the ones we don't know we don't know.",
      "author": "Donald Rumsfeld"
    },
    {
      "quote":
        "Phishing is a major problem because there really is no patch for human stupidity.",
      "author": "Mike Danseglio"
    },
    {
      "quote":
        "In 2006, the attackers want to pay the rent. They don't want to write a worm that destroys your hardware. They want to assimilate your computers and use them to make money.",
      "author": "Mike Danseglio"
    },
    {
      "quote":
        "History has taught us: never underestimate the amount of money, time, and effort someone will expend to thwart a security system. It's always better to assume the worst. Assume your adversaries are better than they are. Assume science and technology will soon be able to do things they cannot yet. Give yourself a margin for error. Give yourself more security than you need today. When the unexpected happens, you'll be glad you did.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "Information is the oxygen of the modern age. It seeps through the walls topped by barbed wire, it wafts across the electrified borders.",
      "author": "Ronald Reagan"
    },
    {
      "quote":
        "I walked into this classroom full of law enforcement officers and said, \"Do you guys recognize any of these names?\" I read off a list of the names. One federal officer explained, \"Those are the names of judges in the US District Court in Seattle.\" And I said, \"Well, I have a password file here with 26 passwords cracked.\" Those federal officers about turned green.",
      "author": "Don Belling"
    },
    {
      "quote": "Sed quis custodiet ipsos custodes? [Who watches the watchers?]",
      "author": "quote contributed by Joy Walker"
    },
    {
      "quote":
        "You can't hold firewalls and intrusion detection systems accountable. You can only hold people accountable.",
      "author": "Daryl White, DOI CIO"
    },
    {
      "quote":
        "In theory, one can build provably secure systems. In theory, theory can be applied to practice but in practice, it can't.",
      "author": "M. Dacier, Eurecom Institute"
    },
    {
      "quote":
        "I personally like to think of the Internet as a parallel universe, a cyber-world as opposed to the real-world. In cyber-world people do much the same thing as in the real-world, such as chat, work, or go shopping. And, as in the real-world, there are dangers. In the real-world, we spend years as children learning about the world and all its dangers before we can safely go out on our own. This is not the case in cyber-world. People wander into cyber-world as cyber-toddlers or even cyber-infants. How can these people be expected to look after themselves in this strange new world? ... I believe that education must be the first step to computer security. Cyber-world is too complex and dangerous to jump into without understanding the dangers.",
      "author": "Jimi Loo"
    },
    {
      "quote":
        "America believes in education: the average professor earns more money in a year than a professional athlete earns in a whole week.",
      "author": "Evan Esar"
    },
    {
      "quote":
        "If computers get too powerful, we can organize them into a committee - that will do them in.",
      "author": "Bradley's Bromide"
    },
    {
      "quote": "I do not fear computers. I fear the lack of them.",
      "author": "Isaac Asimov"
    },
    {
      "quote":
        "The most likely way for the world to be destroyed, most experts agree, is by accident. That's where we come in; we're computer professionals. We cause accidents.",
      "author": "Nathaniel Borenstein"
    },
    {
      "quote": "Fear not those who argue, but those who dodge.",
      "author": "Marie Ebner von Eschenbach"
    },
    {
      "quote":
        "The Internet is like alcohol in some sense. It accentuates what you would do anyway. If you want to be a loner, you can be more alone. If you want to connect, it makes it easier to connect.",
      "author": "Esther Dyson"
    },
    {
      "quote":
        "The best way to get management excited about a disaster plan is to burn down the building across the street.",
      "author": "Dan Erwin, Security Officer, Dow Chemical Co."
    },
    {
      "quote":
        "A business will have good security if its corporate culture is correct. That depends on one thing: tone at the top. There will be no grassroots effort to overwhelm corporate neglect.",
      "author":
        "William Malik, Vice President and Research Area Director for Information Security at Gartner."
    },
    {
      "quote":
        "A good programmer is someone who always looks both ways before crossing a one-way street.",
      "author": "Doug Linder"
    },
    {
      "quote":
        "Just as drivers who share the road must also share responsibility for safety, we all now share the same global network, and thus must regard computer security as a necessary social responsibility. To me, anyone unwilling to take simple security precautions is a major, active part of the problem.",
      "author": "Fred Langa"
    },
    {
      "quote":
        "Like the death of a celebrity from a drug overdose, publicized data loss incidents remind us that we should probably do something about taking better care of our data. But we usually don't, because we quickly remind ourselves that backups are boring as h***, and that it's shark week on Discovery.",
      "author": "Nik Cubrilovic"
    },
    {
      "quote":
        "It's not good enough to have a system where everyone (using the system) must be trusted, it must also be made robust against insiders!",
      "author":
        "Robert Morris, former Chief Scientist of the US National Security Agency"
    },
    {
      "quote":
        "In 2011 RSA, a major technology company, was hacked all when an employee responded to a phishing attempt.  This is a company whose whole business was security, and fell victim to what hackers know, No matter how secure a target the user is always the weakest link.",
      "author": "Jim Guckin"
    },
    {
      "quote":
        "If your personnel do not know or understand how to maintain confidentiality of information, or how to secure it appropriately, not only do you risk having one of your most valuable business assets (information) mishandled, inappropriately used, or obtained by unauthorized persons, but you also risk being in non-compliance of a growing number of laws and regulations that require certain types of information security and privacy awareness and training activities. You also risk damaging another valuable asset, corporate reputation.",
      "author": "Rebecca Herold"
    },
    {
      "quote":
        "One of the tests of leadership is the ability to recognize a problem before it becomes an emergency.",
      "author": "Arnold Glascow"
    },
    {
      "quote":
        "The software industry is really one of the only organizations where you can knowingly build a defective product and push it out to a potential buyer and the buyer assumes all the risk.",
      "author": "Jerry Davis, CISO"
    },
    {
      "quote":
        "Never say anything on the phone that you wouldn't want your mother to hear at your trial.",
      "author": "Sydney Biddle Barrows"
    },
    {
      "quote":
        "People don't react to reality; they react to their perceptions of reality.",
      "author": "human psychology truism"
    },
    {
      "quote":
        "As any farmer will tell you, only a fool lets a fox guard the henhouse door.",
      "author": "proverb"
    },
    {
      "quote":
        "Be careful and you will save many men from the sin of robbing you.",
      "author": "Ed Howe"
    },
    {
      "quote":
        "Ways may someday be developed by which the government, without removing papers from secret drawers, can reproduce them in court, and by which it will be enabled to expose to a jury the most intimate occurrences of the home.",
      "author": "Justice Louis D. Brandeis"
    },
    {
      "quote":
        "Of all tyrannies, a tyranny exercised for the good of its victims may be the most oppressive. It may be better to live under robber barons than under omnipotent moral busybodies. The robber baron's cruelty may sometimes sleep, his cupidity may at some point be satiated; but those who torment us for our own good will torment us without end, for they do so with the approval of their consciences.",
      "author": "C. S. Lewis"
    },
    {
      "quote":
        "Men are only as good as their technical development allows them to be.",
      "author": "George Orwell"
    },
    {
      "quote":
        "No one realized that the pumps that delivered fuel to the emergency generators were electric.",
      "author":
        "Angel Feliciano, representative of Verizon explaining why Verizon's backup power failed during the August 13, 2003 blackout causing disruption to the 911 service"
    },
    {
      "quote":
        "When it comes to privacy and accountability, people always demand the former for themselves and the latter for everyone else.",
      "author": "David Brin"
    },
    {
      "quote":
        "Security in IT is like locking your house or car – it doesn't stop the bad guys,  but if it's good enough they may move on to an easier target.",
      "author": "Paul Herbka"
    },
    {
      "quote":
        "Cyberwarfare specialists cautioned this week that the Internet was effectively a \"wilderness of mirrors,\" and that attributing the source of cyberattacks and other kinds of exploitation is difficult at best and sometimes impossible. Despite the initial assertions and rumors that North Korea was behind the attacks and slight evidence that the programmer had some familiarity with South Korean software, the consensus of most computer security specialists is that the attackers could be located anywhere in the world.",
      "author": "John Markoff (NY Times writer)"
    },
    {
      "quote":
        "There's a growing sense that the online ad industry is out of control from a privacy perspective and that some rules need to be put in place.",
      "author":
        "Marc Rotenberg, Executive Director for the Electronic Privacy Information Center"
    },
    {
      "quote":
        "The trouble with quotes on the Internet is that you never know if they are genuine.",
      "author": "Benjamin Franklin"
    },
    {
      "quote":
        "Solitude and privacy have become more essential to the individual; but modern enterprise and invention have, through invasions upon his privacy, subjected him to mental pain and distress.",
      "author":
        "Samuel D. Warren and Louis D. Brandeis, Harvard Law Review, 1890"
    },
    {
      "quote":
        "We cannot simply suspend or restrict civil liberties until the War on Terror is over, because the War on Terror is unlikely ever to be truly over.",
      "author": "Judge Gerald Tjoflat of the 11th U.S. Circuit Court of Appeals"
    },
    {
      "quote":
        "We have never had vulnerabilities exploited before the patch was known.",
      "author":
        "David Aucsmith, head of technology at Microsoft's security business and technology unit"
    },
    {
      "quote":
        "An unconditional right to say what one pleases about public affairs is what I consider to be the minimum guarantee of the First Amendment.",
      "author": "Justice Hugo Black"
    },
    {
      "quote":
        "You can only protect your liberties in this world by protecting the other man's freedom. You can only be free if I am free.",
      "author": "Clarence S. Darrow"
    },
    {
      "quote":
        "No government can be long secure without a formidable opposition.",
      "author": "Benjammin Disraeli"
    },
    {
      "quote":
        "Today's systems must anticipate future attacks. Any comprehensive system – whether for authenticated communications, secure data storage, or electronic commerce – is likely to remain in use for five years or more. It must be able to withstand the future: smarter attackers, more computational power, and greater incentives to subvert a widespread system. There won't be time to upgrade it in the field. History has taught us: never underestimate the amount of money, time, and effort someone will expend to thwart a security system. It's always better to assume the worst. Assume your adversaries are better than they are. Assume science and technology will soon be able to do things they cannot yet. Give yourself a margin for error. Give yourself more security than you need today. When the unexpected happens, you'll be glad you did.",
      "author": "Bruce Schneier"
    },
    {
      "quote":
        "Briefly and simply, assurance work makes a user or a creditor more confident that the system works as intended without flaws, without surprises, even in the presence of malice. … The major shortfall is absence of assurance or safety mechanisms in software. If my car crashed as often as my computer does, I'd be dead by now.",
      "author":
        "Brian Snow, Former Technical Director of the US National Security Agency"
    },
    {
      "quote": "Even a paranoid can have enemies.",
      "author": "Henry Kissinger"
    },
    {
      "quote":
        "The smartphone is the most lethal weapon you can get inside a prison. The smartphone is the equivalent of the old Swiss Army knife. You can do a lot of other things with it.",
      "author":
        "Terry L. Bittner, Director of Security Products, ITT Corporation"
    },
    {
      "quote":
        "Although prison officials have long battled illegal cellphones, smartphones have changed the game. With Internet access, a prisoner can call up phone directories, maps and photographs for criminal purposes, corrections officials and prison security experts say. Gang violence and drug trafficking, they say, are increasingly being orchestrated online, allowing inmates to keep up criminal behavior even as they serve time.",
      "author": "Kim Severson and Robbie Brown"
    },
    {
      "quote": "The Internet is the crime scene of the 21st Century.",
      "author": "Manhattan District Attorney Cyrus Vance Jr."
    },
    {
      "quote":
        "Stealing is stealing, whether you use a computer command or a crowbar, and whether you take documents, data or dollars.",
      "author": "Carmen M. Ortiz, United States attorney for Massachusetts"
    },
    {
      "quote": "A secure system is one that does what it is supposed to.",
      "author": "Eugene Spafford"
    },
    {
      "quote":
        "A secure system is one that does what it is supposed to do, and nothing more.",
      "author": "John B. Ippolito, CISSP"
    },
    {
      "quote":
        "Asking the Government to protect your Privacy is like asking a Peeping Tom to install your window blinds.",
      "author": "Founder of the EFF"
    },
    {
      "quote":
        "In some ways, cryptography is like pharmaceuticals. Its integrity may be absolutely crucial. Bad penicillin looks the same as good penicillin. You can tell if you spread sheet is wrong, but how do you tell if your cryptography package is weak? The ciphertext produced by a weak encryption algorithm looks as good as ciphertext produced by a strong encryption algorithm. There's a lot of snake oil out there. A lot of quack cures. Unlike the patent medicine hucksters of old, these sofwtare implementors usually don't even know their stuff is snake oil. They may be good software engineers, but they usually haven't even read any of the academic literature in cryptography. But they think they can write good cryptographic software. And why not? After all, it seems intuitively easy to do so. And their software seems to work ok.",
      "author": "Philip Zimmermann"
    },
    {
      "quote": "Gentlemen do not read each others mail.",
      "author": "Henry Lewis Stimson"
    },
    {
      "quote":
        "Strengthening U.S. cyber security is common sense, like locking your door at night. But it's one thing to turn the lock - and another to spend the night hunched in your living room with a shotgun.",
      "author": "Douglas Birch"
    },
    {
      "quote":
        "Programmers are in a race with the Universe to create bigger and better idiot-proof programs, while the Universe is trying to create bigger and better idiots. So far the Universe is winning.",
      "author": "Rich Cook"
    },
    {
      "quote":
        "Most of you are familiar with the virtues of a programmer. There are three, of course: laziness, impatience, and hubris.",
      "author": "Larry Wall"
    },
    {
      "quote":
        "The trouble with programmers is that you can never tell what a programmer is doing until it's too late.",
      "author": "Seymour Cray"
    },
    {
      "quote":
        "That's the thing about people who think they hate computers. What they really hate is lousy programmers.",
      "author": "Larry Niven"
    },
    {
      "quote":
        "For a long time it puzzled me how something so expensive, so leading edge, could be so useless. And then it occurred to me that a computer is a stupid machine with the ability to do incredibly smart things, while computer programmers are smart people with the ability to do incredibly stupid things. They are, in short, a perfect match.",
      "author": "Bill Bryson"
    },
    {
      "quote":
        "Computer science education cannot make anybody an expert programmer any more than studying brushes and pigment can make somebody an expert painter.",
      "author": "Eric Raymond"
    },
    {
      "quote":
        "A programmer is a person who passes as an exacting expert on the basis of being able to turn out, after innumerable punching, an infinite series of incomprehensive answers calculated with micrometric precisions from vague assumptions based on debatable figures taken from inconclusive documents and carried out on instruments of problematical accuracy by persons of dubious reliability and questionable mentality for the avowed purpose of annoying and confounding a hopelessly defenseless department that was unfortunate enough to ask for the information in the first place.",
      "author": "IEEE Grid newsmagazine"
    },
    {
      "quote":
        "A hacker on a roll may be able to produce–in a period of a few months–something that a small development group (say, 7-8 people) would have a hard time getting together over a year. IBM used to report that certain programmers might be as much as 100 times as productive as other workers, or more.",
      "author": "Peter Seebach"
    },
    {
      "quote":
        "The best programmers are not marginally better than merely good ones. They are an order-of-magnitude better, measured by whatever standard: conceptual creativity, speed, ingenuity of design, or problem-solving ability.",
      "author": "Randall E. Stross"
    },
    {
      "quote":
        "A great lathe operator commands several times the wage of an average lathe operator, but a great writer of software code is worth 10,000 times the price of an average software writer.",
      "author": "Bill Gates"
    },
    {
      "quote":
        "Don't worry if it doesn't work right. If everything did, you'd be out of a job.",
      "author": "Mosher's Law of Software Engineering"
    },
    {
      "quote":
        "Measuring programming progress by lines of code is like measuring aircraft building progress by weight.",
      "author": "Bill Gates"
    },
    {
      "quote":
        "Writing code has a place in the human hierarchy worth somewhere above grave robbing and beneath managing.",
      "author": "Gerald Weinberg"
    },
    {
      "quote":
        "First learn computer science and all the theory. Next develop a programming style. Then forget all that and just hack.",
      "author": "George Carrette"
    },
    {
      "quote": "First, solve the problem. Then, write the code.",
      "author": "John Johnson"
    },
    {
      "quote":
        "Optimism is an occupational hazard of programming; feedback is the treatment.",
      "author": "Kent Beck"
    },
    {
      "quote": "To iterate is human, to recurse divine.",
      "author": "L. Peter Deutsch"
    },
    {
      "quote":
        "The best thing about a boolean is even if you are wrong, you are only off by a bit.",
      "author": "Anonymous"
    },
    {
      "quote":
        "Should array indices start at 0 or 1? My compromise of 0.5 was rejected without, I thought, proper consideration.",
      "author": "Stan Kelly-Bootle"
    },
    {
      "quote":
        "There are only two kinds of programming languages: those people always bitch about and those nobody uses.",
      "author": "Bjarne Stroustrup"
    },
    {
      "quote":
        "PHP is a minor evil perpetrated and created by incompetent amateurs, whereas Perl is a great and insidious evil perpetrated by skilled but perverted professionals.",
      "author": "Jon Ribbens"
    },
    {
      "quote":
        "The use of COBOL cripples the mind; its teaching should therefore be regarded as a criminal offense.",
      "author": "E.W. Dijkstra"
    },
    {
      "quote":
        "It is practically impossible to teach good programming style to students that have had prior exposure to BASIC. As potential programmers, they are mentally mutilated beyond hope of regeneration.",
      "author": "E. W. Dijkstra"
    },
    {
      "quote":
        "I think Microsoft named .Net so it wouldn't show up in a Unix directory listing.",
      "author": "Oktal"
    },
    {
      "quote":
        "There is no programming language–no matter how structured–that will prevent programmers from making bad programs.",
      "author": "Larry Flon"
    },
    {
      "quote":
        "Computer language design is just like a stroll in the park. Jurassic Park, that is.",
      "author": "Larry Wall"
    },
    {
      "quote":
        "Fifty years of programming language research, and we end up with C++?",
      "author": "Richard A. O'Keefe"
    },
    {
      "quote":
        "Writing in C or C++ is like running a chain saw with all the safety guards removed.",
      "author": "Bob Gray"
    },
    {
      "quote":
        "In C++ it's harder to shoot yourself in the foot, but when you do, you blow off your whole leg.",
      "author": "Bjarne Stroustrup"
    },
    {
      "quote": "C++ : Where friends have access to your private members.",
      "author": "Gavin Russell Baker"
    },
    {
      "quote":
        "One of the main causes of the fall of the Roman Empire was that–lacking zero–they had no way to indicate successful termination of their C programs.",
      "author": "Robert Firth"
    },
    {
      "quote": "Java is, in many ways, C++–.",
      "author": "Michael Feldman"
    },
    {
      "quote":
        "Saying that Java is nice because it works on all OSes is like saying that anal sex is nice because it works on all genders.",
      "author": "Alanna"
    },
    {
      "quote":
        "Fine, Java MIGHT be a good example of what a programming language should be like. But Java applications are good examples of what applications SHOULDN'T be like.",
      "author": "pixadel"
    },
    {
      "quote":
        "If Java had true garbage collection, most programs would delete themselves upon execution.",
      "author": "Robert Sewell"
    },
    {
      "quote": "Software is like sex: It's better when it's free.",
      "author": "Linus Torvalds"
    },
    {
      "quote":
        "The only people who have anything to fear from free software are those whose products are worth even less.",
      "author": "David Emery"
    },
    {
      "quote": "Good code is its own best documentation.",
      "author": "Steve McConnell"
    },
    {
      "quote":
        "Any code of your own that you haven't looked at for six or more months might as well have been written by someone else.",
      "author": "Eagleson's Law"
    },
    {
      "quote":
        "The first 90% of the code accounts for the first 90% of the development time. The remaining 10% of the code accounts for the other 90% of the development time.",
      "author": "Tom Cargill"
    },
    {
      "quote":
        "Good programmers use their brains, but good guidelines save us having to think out every case.",
      "author": "Francis Glassborow"
    },
    {
      "quote":
        "In software, we rarely have meaningful requirements. Even if we do, the only measure of success that matters is whether our solution solves the customer's shifting idea of what their problem is.",
      "author": "Jeff Atwood"
    },
    {
      "quote":
        "Considering the current sad state of our computer programs, software development is clearly still a black art, and cannot yet be called an engineering discipline.",
      "author": "Bill Clinton"
    },
    {
      "quote":
        "You can't have great software without a great team, and most software teams behave like dysfunctional families.",
      "author": "Jim McCarthy"
    },
    {
      "quote":
        "As soon as we started programming, we found to our surprise that it wasn't as easy to get programs right as we had thought. Debugging had to be discovered. I can remember the exact instant when I realized that a large part of my life from then on was going to be spent in finding mistakes in my own programs.",
      "author": "Maurice Wilkes discovers debugging, 1949"
    },
    {
      "quote":
        "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are–by definition–not smart enough to debug it.",
      "author": "Brian Kernighan"
    },
    {
      "quote":
        "If debugging is the process of removing bugs, then programming must be the process of putting them in.",
      "author": "Edsger W. Dijkstra"
    },
    {
      "quote":
        "I don't care if it works on your machine! We are not shipping your machine!",
      "author": "Vidiu Platon"
    },
    {
      "quote":
        "Programming is like sex: one mistake and you're providing support for a lifetime.",
      "author": "Michael Sinz"
    },
    {
      "quote":
        "There are two ways to write error-free programs; only the third one works.",
      "author": "Alan J. Perlis"
    },
    {
      "quote":
        "You can either have software quality or you can have pointer arithmetic, but you cannot have both at the same time.",
      "author": "Bertrand Meyer"
    },
    {
      "quote":
        "If McDonalds were run like a software company, one out of every hundred Big Macs would give you food poisoning, and the response would be, 'We're sorry, here's a coupon for two more.' ",
      "author": "Mark Minasi"
    },
    {
      "quote":
        "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live.",
      "author": "Martin Golding"
    },
    {
      "quote":
        "To err is human, but to really foul things up you need a computer.",
      "author": "Paul Ehrlich"
    },
    {
      "quote":
        "A computer lets you make more mistakes faster than any invention in human history–with the possible exceptions of handguns and tequila.",
      "author": "Mitch Radcliffe"
    },
    {
      "quote": "Everything that can be invented has been invented.",
      "author": "Charles H. Duell, Commissioner, U.S. Office of Patents, 1899"
    },
    {
      "quote": "I think there's a world market for about 5 computers.",
      "author": "Thomas J. Watson, Chairman of the Board, IBM, circa 1948"
    },
    {
      "quote":
        "It would appear that we have reached the limits of what it is possible to achieve with computer technology, although one should be careful with such statements, as they tend to sound pretty silly in 5 years.",
      "author": "John Von Neumann, circa 1949"
    },
    {
      "quote": "But what is it good for?",
      "author":
        "Engineer at the Advanced Computing Systems Division of IBM, commenting on the microchip, 1968"
    },
    {
      "quote":
        "There is no reason for any individual to have a computer in his home.",
      "author": "Ken Olson, President, Digital Equipment Corporation, 1977"
    },
    {
      "quote": "640K ought to be enough for anybody.",
      "author": "Bill Gates, 1981"
    },
    {
      "quote":
        "Windows NT addresses 2 Gigabytes of RAM, which is more than any application will ever need.",
      "author": "Microsoft, on the development of Windows NT, 1992"
    },
    {
      "quote":
        "We will never become a truly paper-less society until the Palm Pilot folks come out with WipeMe 1.0.",
      "author": "Andy Pierson"
    },
    {
      "quote":
        "If it keeps up, man will atrophy all his limbs but the push-button finger.",
      "author": "Frank Lloyd Wright"
    },
    {
      "quote":
        "Quality is free, but only to those who are willing to pay heavily for it.",
      "author": "DeMarco and Lister"
    },
    {
      "quote":
        "The bitterness of poor quality remains long after the sweetness of low price is forgotten.",
      "author": "Benjamin Franklin"
    },
    {
      "quote":
        "Software never was perfect and won't get perfect. But is that a license to create garbage? The missing ingredient is our reluctance to quantify quality.",
      "author": "Boris Beizer"
    },
    {
      "quote":
        "Geeks are people who love something so much that all the details matter.",
      "author": "Melissa Meyer, Yahoo! CEO"
    },
    {
      "quote":
        "Be a yardstick of quality. Some people aren't used to an environment where excellence is expected.",
      "author": "Steve Jobs "
    },
    {
      "quote":
        "Testers don't like to break things; they like to dispel the illusion that things work.",
      "author": "Kaner, Bach, Pettichord"
    },
    {
      "quote": "You can see a lot by just looking.",
      "author": "Yogi Berra"
    },
    {
      "quote":
        "Pretty good testing is easy to do (that's partly why some people like to say 'testing is dead'– they think testing isn't needed as a special focus because they note that anyone can find at least some bugs some of the time). Excellent testing is quite hard to do.",
      "author": "James Bach"
    },
    {
      "quote": "A pinch of probability is worth a pound of perhaps.",
      "author": "James Thurber"
    },
    {
      "quote":
        "Testing is not responsible for the bugs inserted into software any more than the sun is responsible for creating dust in the air.",
      "author": "Dorothy Graham"
    },
    {
      "quote":
        "To those who say that \"if you need testing at the end, you're doing it wrong\", would you prefer a Boeing, or are you going Air Icarus?",
      "author": "Michael Bolton"
    },
    {
      "quote":
        "The problem is not that testing is the bottleneck. The problem is that you don't know what's in the bottle. That's a problem that testing addresses.",
      "author": "Michael Bolton"
    },
    {
      "quote":
        "I am pretty sure there is a difference between \"this has not been proven\" and \"this is false\".",
      "author": "Ron Jeffries"
    },
    {
      "quote":
        "Testing is a skill. While this may come as a surprise to some people it is a simple fact.",
      "author": "Fewster and Graham"
    },
    {
      "quote":
        "You can be a great tester if you have programming skills. You can also be a great tester if you have no programming skills at all. And, you can be a lousy tester with or without programming skills. A great tester will learn what skills she needs to continue to be great, in her own style.",
      "author": "Jerry Weinberg"
    },
    {
      "quote":
        "No amount of testing can prove a software right, a single test can prove a software wrong.",
      "author": "Amir Ghahrai"
    },
    {
      "quote":
        "Discovering the unexpected is more important than confirming the known.",
      "author": "George E. P. Box"
    },
    {
      "quote":
        "The most exciting phrase to hear in science, the one that heralds discoveries, is not 'Eureka!' but 'Now that's funny…'",
      "author": "Isaac Asimov"
    },
    {
      "quote":
        "Testing is an infinite process of comparing the invisible to the ambiguous in order to avoid the unthinkable happening to the anonymous.",
      "author": "James Bach"
    },
    {
      "quote": "We only see what we know.",
      "author": "Goethe"
    },
    {
      "quote":
        "The more effort I put into testing the product conceptually at the start of the process, the less I effort I had to put into manually testing the product at the end because less bugs would emerge as a result.",
      "author": "Trish Khoo"
    },
    {
      "quote":
        "I do believe it's important for testers to know the market that their client or their employer is in and the reason for that is if you understand what risks your client is facing and you understand what the competing products are and where the challenges lie in the market, you can plan your testing accordingly.",
      "author": "Karen N. Johnson"
    },
    {
      "quote":
        "I think when you hear the phrase 'it's just test code'. To me that's a code smell.",
      "author": "Alan Page"
    },
    {
      "quote": "Testers don't break software, software is already broken.",
      "author": "Amir Gahrai"
    },
    {
      "quote": "Documents are the corpse of knowledge.",
      "author": "Rick Bradley"
    },
    {
      "quote":
        "Just because you've counted all the trees doesn't mean you've seen the forest.",
      "author": "Anonymous"
    },
    {
      "quote":
        "As a rule, software systems do not work well until they have been used, and have failed repeatedly, in real applications.",
      "author": "Dave Parnas"
    },
    {
      "quote":
        "It's not at all important to get it right the first time. It's vitally important to get it right the last time.",
      "author": "Andrew Hunt and David Thomas"
    },
    {
      "quote":
        "Simple systems are not feasible because they require infinite testing.",
      "author": "Norman Ralph Augustine"
    },
    {
      "quote":
        "If we want to be serious about quality, it is time to get tired of finding bugs and start preventing their happening in the first place.",
      "author": "Alan Page"
    },
    {
      "quote":
        "More than the act of testing, the act of designing tests is one of the best bug preventers known.",
      "author": "Boris Beizer"
    },
    {
      "quote":
        "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it.",
      "author": "Brian W. Kernighan"
    },
    {
      "quote":
        "When debugging, novices insert corrective code; experts remove defective code.",
      "author": "Richard Pattis"
    },
    {
      "quote":
        "It's hard enough to find an error in your code when you're looking for it; it's even harder when you've assumed your code is error-free.",
      "author": "Steve McConnell"
    },
    {
      "quote":
        "Beware of bugs in the above code; I have only proved it correct, not tried it.",
      "author": "Donald Knuth"
    },
    {
      "quote":
        "Just as athletes can't win without a sophisticated mixture of strategy, form, attitude, tactics, and speed, performance engineering requires a good collection of metrics and tools to deliver the desired business results.",
      "author": "Todd DeCapua"
    },
    {
      "quote":
        "If an end user perceives bad performance from your website, her next click will likely be on your-competition.com.",
      "author": "Ian Molyneaux"
    },
    {
      "quote":
        "Also common is the test automation group zombie. This zombie is the practice of assigning test automation to a dedicated team of test automators. The appeal is that we can keep developers focused on writing new code instead of writing and maintaining automated tests. The danger is that test automation inevitably lags development, so feedback from testing is delayed in a way that significantly reduces its value.",
      "author": "Dale Emery"
    },
    {
      "quote":
        "Automation does not do what testers used to do, unless one ignores most things a tester really does. Automated testing is useful for extending the reach of the testers work, not to replace it.",
      "author": "James Bach"
    },
    {
      "quote":
        "Right or wrong, it's very pleasant to break something from time to time.",
      "author": "Fyodor Dostoevsky, courtesy of Elena Houser's blog  "
    },
    {
      "quote": "Where is the 'any' key?",
      "author": "Homer Simpson"
    },
    {
      "quote": "f u cn rd ths, u cn gt a gd jb n sftwr tstng.",
      "author": "Anonymous"
    },
    {
      "quote":
        "To an optimist, the glass is half full. To a pessimist, the glass is half empty. To a good tester, the glass is twice as big as it needs to be.",
      "author": "Anonymous"
    },
    {
      "quote":
        "Irreproducible bugs become highly reproducible right after delivery to the customer.",
      "author": "Michael Stahl's derivative of Murphy's Law"
    },
    {
      "quote":
        "Q: How many testers does it take to change a lightbulb? A: None, they just tell you that the room is dark.",
      "author": "Anonymous"
    },
    {
      "quote": "All code is guilty until proven innocent.",
      "author": "Anonymous"
    },
    {
      "quote":
        "A computer once beat me at chess, but it was no match for me at kickboxing.",
      "author": "Emo Philips"
    },
    {
      "quote":
        "Software and cathedrals are much the same: first we build them, then we pray.",
      "author": "Anonymous"
    },
    {
      "quote":
        "First law of Bad Management: If something isn't working, do more of it.",
      "author": "DeMarco"
    },
    {
      "quote":
        "The only system which is truly secure is one which is switched off and unplugged, locked in a titanium lined safe, buried in a concrete bunker, and is surrounded by nerve gas and very highly paid armed guards. Even then, I wouldn't stake my life on it.",
      "author": "Gene Spafford"
    },
    {
      "quote":
        "Silicon Valley is the QA department for the rest of the world. It's where you test out new business models.",
      "author": "James Cham"
    },
    {
      "quote": "Alpha is simply that you want somebody to share your pain!",
      "author": "Anonymous"
    },
    {
      "quote": "Weeks of programming can save you hours of planning.",
      "author": "Anonymous"
    },
    {
      "quote":
        "Programming can be fun, so can cryptography; however they should not be combined.",
      "author": "Kreitzberg and Shneiderman"
    },
    {
      "quote":
        "The computer was born to solve problems that did not exist before.",
      "author": "Bill Gates"
    },
    {
      "quote":
        "There are 10 types of people in this world: those who understand binary and those who don't.",
      "author": "Anonymous"
    },
    {
      "quote": "The internet? That thing is still around?",
      "author": "Homer Simpson"
    },
    {
      "quote":
        "I think it's a new feature. Don't tell anyone it was an accident.",
      "author": "Larry Wall"
    },
    {
      "quote":
        "Walking on water and developing software from a specification are easy if both are frozen.",
      "author": "Edward V. Berard"
    },
    {
      "quote": "As any poet knows, a system is a way of looking at the world.",
      "author": "Jerry Weinberg"
    },
    {
      "quote":
        "If the software doesn't have to work, you can always meet any other requirement.",
      "author": "Jerry Weinberg"
    },
    {
      "quote":
        "Software is like entropy: It is difficult to grasp, weighs nothing, and obeys the Second Law of Thermodynamics; i.e., it always increases.",
      "author": "Norman Augustine"
    },
    {
      "quote": "Software is a gas; it expands to fill its container.",
      "author": "Nathan Myhrvold"
    },
    {
      "quote":
        "It's hardware that makes a machine fast.  It's software that makes a fast machine slow.",
      "author": "Craig Bruce"
    },
    {
      "quote":
        "Computers are good at following instructions, but not at reading your mind.",
      "author": "Donald Knuth"
    },
    {
      "quote":
        "Any fool can write code that a computer can understand. Good programmers write code that humans can understand.",
      "author": "Martin Fowler"
    },
    {
      "quote":
        "Just like with everything else, tools won't give you good results unless you know how, when, and why to apply them. If you go out and you buy the most expensive frying pan on the market it's still not going to make you a good chef.",
      "author": "Christin Wiedemann"
    },
    {
      "quote":
        "He who thinks a tool can solve all problems, has a new problem.",
      "author": "Federico Toledo"
    },
    {
      "quote":
        "We have as many testers as we have developers. And testers spend all their time testing, and developers spend half their time testing. We're more of a testing, a quality software organization than we're a software organization.",
      "author": "Bill Gates"
    },
    {
      "quote":
        "A great tester gives programmers immediate feedback on what they did right and what they did wrong. Believe it or not, one of the most valuable features of a tester is providing positive reinforcement. There is no better way to improve a programmer's morale, happiness, and subjective sense of well-being than a La Marzocco Linea espresso machine to have dedicated testers who get frequent releases from the developers, try them out, and give negative and positive feedback.",
      "author": "Joel Spolsky"
    },
    {
      "quote":
        "I remember the days when QA testers were treated almost as second-class citizens and developers ruled the software world. But as it recently occurred to me: we're all testers now.",
      "author": "Joe Colantonio"
    },
    {
      "quote":
        "Testing has to be an integral part of developing software and not a separate phase. When this approach is taken, product quality is owned by everyone on the team. It is easy to state, but hard to put into practice because of long-standing preconceived notions that developers and testers are better kept apart.",
      "author": "James Sivak"
    },
    {
      "quote":
        "Think outside the thought leadership to avoid being a thought follower. Adopting a good idea means you'll still evaluate the next one.",
      "author": "Lanette Creamer"
    },
    {
      "quote":
        "Having a testing specialist on the team is a valuable asset, but the role of a specialist isn't to restrict that responsibility to a single person.",
      "author": "Trish Khoo"
    },
    {
      "quote":
        "The key to building a great product is building a great team first. To me, great teams aren't bound by roles, but they're driven by moving forward.",
      "author": "Alan Page"
    },
    {
      "quote":
        "While we may understand the problem, it is critical for us to change our thinking, our practices, and continuously evolve to stay ahead of the problems we face.",
      "author": "Mike Lyles"
    },
    {
      "quote":
        "We cannot solve our problems with the same thinking we used when we created them.",
      "author": "Albert Einstein"
    },
    {
      "quote":
        "The more you improve the way you go about your work, the harder the work will be.",
      "author": "Lister, DeMarco"
    },
    {
      "quote":
        "Ever Tried. Ever failed. No matter. Try again. Fail again. Fail better.",
      "author": "Samuel Beckett "
    },
    {
      "quote":
        "Earning the \"annoying\" label for asking questions is ok, but becoming \"annoying\" via your response to their answers isn't.",
      "author": "Scott Barber"
    },
    {
      "quote":
        "I'm pretty much convinced that if you want a team to go fast, a feeling of momentum is more important than a sense of urgency.",
      "author": "Elisabeth Hendrickson "
    },
    {
      "quote":
        "When a flower doesn't bloom you fix the environment in which it grows, not the flower.",
      "author": "Alexander Den Heijer via Anne-Marie Charrett"
    },
    {
      "quote":
        "Only conducting performance testing at the conclusion of system or functional testing is like conducting a diagnostic blood test on a patient who is already dead.",
      "author": "Scott Barber"
    },
    {
      "quote": "Before software can be reusable it first has to be usable.",
      "author": "Ralph Johnson"
    },
    {
      "quote": "Nine people can’t make a baby in a month.",
      "author": "Fred Brooks"
    },
    {
      "quote":
        "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. So far, the Universe is winning.",
      "author": "Rich Cook"
    },
    {
      "quote":
        "The gap between theory and practice is not as wide in theory as it is in practice.",
      "author": "Author Unknown"
    },
    {
      "quote":
        "A computer lets you make more mistakes faster than any other invention in human history, with the possible exceptions of handguns and tequila.",
      "author": "Mitch Ratcliffe"
    },
    {
      "quote":
        "We have a deal with God – he doesn’t produce software and we do not produce miracles.",
      "author": "Anonymous software engineer"
    },
    {
      "quote":
        "Why do we never have time to do it right, but always have time to do it over?",
      "author": "anonymous developer"
    },
    {
      "quote": "Software written here. Good, Fast, Cheap. Pick any two.",
      "author": "Anonymous"
    },
    {
      "quote":
        "Better train people and risk they leave – than do nothing and risk they stay",
      "author": "anon"
    },
    {
      "quote":
        "In theory there is no difference between theory and practice. In practice there is.",
      "author": "Yogi Berra"
    },
    {
      "quote":
        "Progress is not made by early risers or hard workers, but by LAZY people, trying to find easier ways to do the same.",
      "author": "Henry Ford"
    },
    {
      "quote":
        "It should be noted that no ethically-trained software engineer would ever consent to write a DestroyBaghdad procedure. Basic professional ethics would instead require him to write a DestroyCity procedure, to which Baghdad could be given as a parameter.",
      "author": "Nathaniel S. Borenstein"
    },
    {
      "quote":
        "Some people, when confronted with a problem, think ‘I know, I’ll use regular expressions.’ Now they have two problems.",
      "author": "Jamie Zawinski"
    },
    {
      "quote":
        "Programming is like sex: one mistake and you have to support it for the rest of your life.",
      "author": "Michael Sinz"
    },
    {
      "quote":
        "One of the main causes of the fall of the Roman Empire was that, lacking zero, they had no way to indicate successful termination of their C programs.",
      "author": "unknown"
    },
    {
      "quote":
        "\"Torture the data long enough and it will confess to anything\", when it comes to bias statistics.",
      "author": "Intel Dept & Chuck Missler."
    },
    {
      "quote":
        "The three chief virtues of a programmer are: Laziness, Impatience and Hubris.",
      "author":
        "Larry Wall, in the glossary of the first Programming Perl book."
    },
    {
      "quote": "Don’t anthropomorphize computers – they hate it.",
      "author": "Author Unknown"
    },
    {
      "quote":
        "Theory is when you know something, but it doesn’t work. Practice is when something works, but you don’t know why. Programmers combine theory and practice: Nothing works and they don’t know why.",
      "author": "Author Unknown"
    },
    {
      "quote":
        "A computer once beat me at chess, but it was no match for me at kick boxing.",
      "author": "Emo Philips"
    },
    {
      "quote":
        "Computer Science is no more about computers than astronomy is about telescopes.",
      "author": "Edsger W. Dijkstra"
    },
    {
      "quote": "Physics is the universe’s operating system.",
      "author": "Steven R Garman "
    },
    {
      "quote":
        "The greatest enemy of knowledge is not ignorance, it is the illusion of knowledge.",
      "author": "Stephen Hawking"
    },
    {
      "quote": "The more you know, the more you realize you know nothing.",
      "author": "Socrates"
    },
    {
      "quote":
        "Tell me and I forget.  Teach me and I remember.  Involve me and I learn.",
      "author": "Benjamin Franklin"
    },
    {
      "quote":
        "If people never did silly things, nothing intelligent would ever get done.",
      "author": "Ludwig Wittgenstein"
    },
    {
      "quote": "Real knowledge is to know the extent of one’s ignorance.",
      "author": "Confucius"
    },
    {
      "quote": "If you think your users are idiots, only idiots will use it.",
      "author": "Linus Torvalds"
    },
    {
      "quote":
        "Your most unhappy customers are your greatest source of learning.",
      "author": "Bill Gates"
    },
    {
      "quote":
        "The most likely way for the world to be destroyed, most experts agree, is by accident.  That’s where we come in; we’re computer professionals.  We cause accidents.",
      "author": "Nathaniel Borenstein"
    },
    {
      "quote":
        "Pessimists, we’re told, look at a glass containing 50% air and 50% water and see it as half empty.  Optimists, in contrast, see it as half full.  Engineers, of course, understand the glass is twice as big as it needs to be.",
      "author": "Bob Lewis"
    },
    {
      "quote":
        "Mostly, when you see programmers, they aren’t doing anything.  One of the attractive things about programmers is that you cannot tell whether or not they are working simply by looking at them.  Very often they’re sitting there seemingly drinking coffee and gossiping, or just staring into space.  What the programmer is trying to do is get a handle on all the individual and unrelated ideas that are scampering around in his head.",
      "author": "Charles M. Strauss"
    },
    {
      "quote":
        "If you think you are worth what you know, you are very wrong.  Your knowledge today does not have much value beyond a couple of years.  Your value is what you can learn and how easily you can adapt to the changes this profession brings so often.",
      "author": "Jose M. Aguilar"
    },
    {
      "quote":
        "Commenting your code is like cleaning your bathroom — you never want to do it, but it really does create a more pleasant experience for you and your guests.",
      "author": "Ryan Campbell "
    },
    {
      "quote": "Low-level programming is good for the programmer’s soul.",
      "author": "John Carmack"
    },
    {
      "quote": "If you automate a mess, you get an automated mess.",
      "author": "Rod Michael"
    },
    {
      "quote":
        "Looking at code you wrote more than two weeks ago is like looking at code you are seeing for the first time.",
      "author": "Dan Hurvitz"
    },
    {
      "quote":
        "Less than 10% of the code has to do with the ostensible purpose of the system; the rest deals with input-output, data validation, data structure maintenance, and other housekeeping.",
      "author": "Mary Shaw"
    },
    {
      "quote":
        "Programming without an overall architecture or design in mind is like exploring a cave with only a flashlight: You don’t know where you’ve been, you don’t know where you’re going, and you don’t know quite where you are.",
      "author": "Danny Thorpe"
    },
    {
      "quote": "A change in perspective is worth 80 IQ points.",
      "author": "Alan Kay"
    },
    {
      "quote":
        "The future is not laid out on a track. It is something that we can decide, and to the extent that we do not violate any known laws of the universe, we can probably make it work the way that we want to.",
      "author": "Alan Kay"
    },
    {
      "quote": "Make everything as simple as possible, but not simpler.",
      "author": "Albert Einstein"
    },
    {
      "quote":
        "Today, most software exists, not to solve a problem, but to interface with other software.",
      "author": "IO Angell"
    },
    {
      "quote":
        "Program testing can be a very effective way to show the presence of bugs, but is hopelessly inadequate for showing their absence.",
      "author": "Edsger Dijkstra"
    },
    {
      "quote":
        "UNIX is simple.  It just takes a genius to understand its simplicity.",
      "author": "Dennis Ritchie"
    },
    {
      "quote":
        "Being able to break security doesn’t make you a hacker anymore than being able to hotwire cars makes you an automotive engineer.",
      "author": "Eric Raymond"
    },
    {
      "quote":
        "If you think technology can solve your security problems, then you don’t understand the problems and you don’t understand the technology.",
      "author": "Bruce Schneier "
    },
    {
      "quote":
        "Companies spend millions of dollars on firewalls, encryption and secure access devices, and it’s money wasted, because none of these measures address the weakest link in the security chain.",
      "author": "Kevin Mitnick"
    },
    {
      "quote":
        "In an information economy, the most valuable company assets drive themselves home every night. If they are not treated well, they do not return the next morning.",
      "author": "Peter Chang "
    },
    {
      "quote":
        "Most creativity is a transition from one context into another where things are more surprising. Our job is to remind us that there are more contexts than the one that we’re in — the one that we think is reality.",
      "author": "Alan Kay"
    },
    {
      "quote":
        "There is no elevator to success, you have to take the stairs.",
      "author": "Zig Ziglar"
    }
  ]
}
