{
  "name": "Claim Your Data Visualization Certificate",
  "order": 18,
  "time": "5 minutes",
  "challenges": [
    {
      "id": "561add10cb82ac38a17513b3",
      "title": "Claim Your Data Visualization Certificate",
      "description": [
        [
          "//i.imgur.com/Et3iD74.jpg",
          "An image of our Data Visualization Certificate",
          "This challenge will give you your verified Data Visualization Certificate. Before we issue your certificate, we must verify that you have completed all of our React and D3.js projects. You must also accept our Academic Honesty Pledge. Click the button below to start this process.",
          ""
        ],
        [
          "//i.imgur.com/woACUFX.png",
          "The definition of plagiarism: Plagiarism (noun) - copying someone else’s work and presenting it as your own without crediting them",
          "By clicking below, you pledge that all of your submitted code A) is code you or your pair personally wrote, or B) comes from open source libraries like jQuery, or C) has been clearly attributed to its original authors. You also give us permission to audit your challenge solutions and revoke your certificate if we discover evidence of plagiarism.",
          "#"
        ],
        [
          "//i.imgur.com/nTuA3rZ.png",
          "An image of the text \"Data Visualization Certificate requirements\"",
          "Let's confirm that you have completed our React and D3.js projects. Click the button below to verify this.",
          "#"
        ],
        [
          "//i.imgur.com/3Is4oV0.png",
          "An image of the word \"Congratulations!\"",
          "Congratulations! We've added your Data Visualization Certificate to your portfolio page. Unless you choose to hide your solutions, this certificate will remain publicly visible and verifiable.",
          ""
        ]
      ],
      "challengeSeed": [
        {
          "properties": [
            "isHonest",
            "isDataVisualizationCert"
          ],
          "apis": [
            "/certificate/honest",
            "/certificate/verify/data-visualization"
          ],
          "stepIndex": [
            1,
            2
          ]
        }
      ],
      "tests": [
        {
          "id": "bd7157d8c242eddfaeb5bd13",
          "title": "Build a Markdown Previewer"
        },
        {
          "id": "bd7156d8c242eddfaeb5bd13",
          "title": "Build a Camper Leaderboard"
        },
        {
          "id": "bd7155d8c242eddfaeb5bd13",
          "title": "Build a Recipe Box"
        },
        {
          "id": "bd7154d8c242eddfaeb5bd13",
          "title": "Build the Game of Life"
        },
        {
          "id": "bd7153d8c242eddfaeb5bd13",
          "title": "Build a Roguelike Dungeon Crawler Game"
        },
        {
          "id": "bd7168d8c242eddfaeb5bd13",
          "title": "Visualize Data with a Bar Chart"
        },
        {
          "id": "bd7178d8c242eddfaeb5bd13",
          "title": "Visualize Data with a Scatterplot Graph"
        },
        {
          "id": "bd7188d8c242eddfaeb5bd13",
          "title": "Visualize Data with a Heat Map"
        },
        {
          "id": "bd7198d8c242eddfaeb5bd13",
          "title": "Show National Contiguity with a Force Directed Graph"
        },
        {
          "id": "bd7108d8c242eddfaeb5bd13",
          "title": "Map Data Across the Globe"
        }
      ],
      "type": "Waypoint",
      "challengeType": 7,
      "translations": {
        "es": {
          "title": "Reclama tu certificado de Visualización de datos",
          "description": [
            [
              "//i.imgur.com/Et3iD74.jpg",
              "Una imagen que muestra nuestro certificado de Visualización de datos",
              "Este desafío te otorga tu certificado autenticado de Visualización de datos. Antes de que podamos emitir tu certificado, debemos verificar que has completado todos los proyectos con React y D3.js. También debes aceptar nuestro Juramento de honestidad académica. Pulsa el botón siguiente para iniciar este proceso.",
              ""
            ],
            [
              "//i.imgur.com/swuEma9.png",
              "Plagio (nombre): acción y efecto de plagiar. Plagiar (verbo) - copiar en lo sustancial obras ajenas, dándolas como propias.",
              "Al pulsar el botón siguiente, juras que todo el código en tus soluciones a los desafíos A) es código que tú o tu compañero escribieron personalmente, o B) proviene de librerías de código abierto como jQuery, o C) ha sido claramente atribuido a sus autores originales. También nos otorgas el permiso para auditar tus soluciones a los desafíos y revocar tu certificado si encontramos evidencia de plagio.",
              "#"
            ],
            [
              "//i.imgur.com/6b50POD.png",
              "Una imagen del texto \"Los requisitos de Certificación de Visualización de datos\"",
              "Confirmemos que has completado todos nuestros proyectos en React y D3.js. Pulsa el botón siguiente para hacer la verificación.",
              "#"
            ],
            [
              "//i.imgur.com/PnFG11N.png",
              "Una imagen de la palabra \"Felicitaciones!\"",
              "¡Felicitaciones! Hemos agregado tu certificado de Visualización de datos a tu portafolio. A menos que elijas no mostrar tus soluciones, este certificado será públicamente visible y verificable.",
              ""
            ]
          ]
        },
        "fr": {
          "title": "Réclamer votre Certificat de Visualisation de données",
          "description": [
            [
              "//i.imgur.com/Et3iD74.jpg",
              "Une image de note Certificat de Visualisation de données",
              "Ce défi vous permettra d’avoir votre Certificat de Visualisation de données vérifiée. Avant de vous donner votre certificat, il faut s’assurer que vous avez bien accomplie tous les projets de React et D3.js et il faut que vous acceptiez notre Academic Honesty Pledge. Cliquez sur le bouton si dessous pour démarrer le processus.",
              ""
            ],
            [
              "//i.imgur.com/iFL1xR1.png",
              "Une définition du plagiat : Plagiat (nom) – copier le travail d’un autre et le présenter comme étant le tien, sans mention de l’auteur original",
              "En cliquant si dessous, je garantie que tout le code que j’ai présenté A) est mon propre code ou celui de mon collaborateur, B) vient d’un projet open-source comme jQuery, ou C) contient les mentions nécessaires des auteurs. Vous nous donnez aussi la permission de vérifier vos solutions et de révoquer votre certificat en cas de détection de plagiat.",
              "#"
            ],
            [
              "//i.imgur.com/0GZ0KHa.png",
              "Une image du texte \"Les exigences de certification de visualisation de données\"",
              "On va confirmer maintenant que vous avez bien terminé nos projets de React et D3.js. Cliquez sur le bouton si dessous pour vérifier cela.",
              "#"
            ],
            [
              "//i.imgur.com/EJXMNIQ.png",
              "Une image du mot \"Félicitations à vous!\"",
              "Félicitations! On vient d’ajouter votre Certificat de Visualisation de données à votre profile. Cette certificat est public et vérifiable, mais vous pouvez le cacher si vous désirer.",
              ""
            ]
          ]
        }
      }
    }
  ]
}
