{
  "name": "Dynamic Web Application Projects",
  "order": 27,
  "time": "250 hours",
  "helpRoom": "HelpBackEnd",
  "challenges": [
    {
      "id": "bd7158d8c443eddfaeb5bcef",
      "title": "Get Set for our Dynamic Web Application Projects",
      "description": [
        [
          "//i.imgur.com/4IZjWZ3.gif",
          "A gif showing how to create a c9.io account.",
          "We recommend building our full stack Basejump challenges on c9.io, a powerful browser-based development environment. This will save you hours of time that you would spend configuring your local computer to run Node.js and MongoDB - time you could instead spend coding.<br><br>Create a c9.io account by clicking the GitHub symbol in the upper right hand corner of the c9.io page. Click the big plus symbol to create a new workspace. Enter your email address when prompted.",
          "https://c9.io"
        ],
        [
          "//i.imgur.com/F7i5Hhi.gif",
          "A gif showing how to fill out the new workspace form",
          "Instead of starting from scratch, we recommend using <a href='http://www.clementinejs.com/' target='_blank'>Clementine.js</a>, a full stack JavaScript \"boilerplate\" that already has some basic code written for you. Clementine.js has a detailed tutorial you can go through to build it yourself, but for now let's just clone its code.<br><br>On c9.io, give your workspace a name, then leave \"Template\" as custom and create your workspace from this GitHub url: <code>https://github.com/johnstonbl01/clementinejs-fcc.git</code>",
          ""
        ],
        [
          "//i.imgur.com/42m1vyr.gif",
          "A gif showing you how to show hidden files.",
          "Click the gear in the upper right corner of c9.io's file structure. Select \"Show Hidden Files\".",
          ""
        ],
        [
          "//i.imgur.com/qrE8xaK.gif",
          "A gif showing you how to create a new file.",
          "Right click and create a new file called <code>.env</code>.",
          ""
        ],
        [
          "//i.imgur.com/jkQX9SQ.gif",
          "A gif showing you how to prep your environmental variables in your .env file.",
          "Open your .env file and paste this into it, then save it:<br><br><code>GITHUB_KEY=<br>GITHUB_SECRET=<br>MONGO_URI=mongodb://localhost:27017/clementinejs<br>PORT=8080<br>APP_URL=http://localhost:8080/</code>",
          ""
        ],
        [
          "//i.imgur.com/f3DE7zB.gif",
          "A gif showing you how to open c9.io's preview window.",
          "Open up your application in a preview tab by clicking Window > Share > Application > Open.",
          ""
        ],
        [
          "//i.imgur.com/Ip0qUdQ.gif",
          "A gif showing you how to create a GitHub app using c9.io's preview URL.",
          "Create a GitHub app for authentication and choose an \"Application name\". For the homepage URL, paste the URL from your preview tab. You'll also paste the URL from your preview tab into \"Authorization callback URL\", then add to it: <code>auth/github/callback</code>",
          "https://github.com/settings/applications/new"
        ],
        [
          "//i.imgur.com/qCUVRFb.gif",
          "A gif showing you how to transfer GitHub's key and secret over to your .env file, as well as your c9.io URL.",
          "GitHub will create an app and present you with a Client ID and a Client Secret. Set your <code>.env</code> file's <code>GITHUB_KEY</code> equal to the Client ID, and set your <code>.env</code> file's <code>GITHUB_SECRET</code> equal to the Client Secret. Copy the URL from your preview tab and paste it into your <code>.env</code> file as your <code>APP_URL</code>.",
          ""
        ],
        [
          "//i.imgur.com/2a20Vah.gif",
          "A gif showing you how to install MongoDB and start it in c9.io's terminal.",
          "In your terminal, install MongoDB by entering: <br><br><code>sudo apt-get install mongodb-org</code><br><br> then start MongoDB by entering:<br><br><code>mongod --smallfiles</code>",
          ""
        ],
        [
          "//i.imgur.com/dC55pWk.gif",
          "A gif showing you how to open a new tab in c9.io's terminal.",
          "Open a new terminal tab with the <code>+</code> button above your terminal, then run <code>npm install</code>",
          ""
        ],
        [
          "//i.imgur.com/54OC2Ro.gif",
          "A gif showing you how to navigate to your preview tab and sign in to your new Clementine.js app.",
          "Run <code>node server.js</code> to start the server. Refresh your preview tab. You should see the Clementine.js logo. Click \"sign in\" and accept GitHub's prompt to authorize the application.",
          ""
        ],
        [
          "//i.imgur.com/2IJfyvN.gif",
          "A gif showing you how to click the button to trigger an AJAX action with Clementine.js and how to look at your user profile from the GitHub authentication data.",
          "Click the \"Click Me\" button and you'll see that it increments the number clicks. Click the profile button and you'll see that it has your GitHub information.",
          ""
        ],
        [
          "//i.imgur.com/bjO5pnq.gif",
          "A gif showing you how to create a new GitHub repository and push your code up to it.",
          "Create a new GitHub repository. Then copy its .git URL.<br><br>Return to c9.io's terminal and set your GitHub remote URL: <code>git remote set-url origin</code> followed by the URL you copied from GitHub.<br><br>Run <code>git push origin master</code>.<br><br>Now tab back to GitHub and refresh, and you'll see that your code is now on GitHub.",
          "https://github.com/new"
        ],
        [
          "//i.imgur.com/Qn0K65B.gif",
          "A gif showing you how to add add-ons to Heroku.",
          "We will soon add instructions for getting Clementine running on Heroku. For now, develop your Basejumps right on c9.io.",
          ""
        ]
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "Waypoint",
      "challengeType": 7,
      "isRequired": false,
      "translations": {
        "es": {
          "title": "Prepárate para nuestros Proyectos de Desarrollo en el lado del servidor",
          "description": [
            [
              "//i.imgur.com/4IZjWZ3.gif",
              "Una imagen gif que te muestra cómo crear una cuenta en c9.io.",
              "Te recomendamos resolver nuestros desafíos de pila completa (full stack) en c9.io, un poderoso ambiente de desarrollo basado en tu navegador. Esto te ahorrará muchas horas que utilizarías configurando tu computadora para correr Node.js y MongoDB - tiempo que podrías utilizar escribiendo código. <br>Crea una cuenta en c9.io pulsando el símbolo de GitHub en la esquina superior derecha de la página de c9.io. Pulsa el botón con el símbolo de suma para crear una área de trabajo nueva. Introduce tu dirección de correo electrónico cuando se te solicite.",
              "https://c9.io"
            ],
            [
              "//i.imgur.com/F7i5Hhi.gif",
              "Una imagen gif que te muestra cómo llenar el formulario para crear un área de trabajo nueva",
              "En vez de iniciar desde cero, recomendamos utilizar Clementine.js, un modelo (<em>bolierplate</em>) de JavaScript pila completa (full stack) que viene con código básico ya escrito para ti. Clementine.js tiene un tutorial detallado que puedes seguir para construirlo por ti mismo, pero por ahora simplemente vamos a clonarlo. En c9.io, dale un nombre a tu área de trabajo, luego deja \"Plantilla\" (\"Template\") como personalizado y crea tu espacio de trabajo usando el siguiente url de GitHub: <code>https://github.com/johnstonbl01/clementinejs-fcc.git</code>",
              ""
            ],
            [
              "//i.imgur.com/42m1vyr.gif",
              "Una imagen gif que te muestra cómo mostrar los archivos ocultos.",
              "Pulsa el engrane en la esquina superior derecha del árbol de archivos de c9.io. Selecciona \"show hidden files\".",
              ""
            ],
            [
              "//i.imgur.com/qrE8xaK.gif",
              "Una imagen gif que te muestra cómo crear un archivo nuevo.",
              "Haciendo clic derecho, crea un nuevo archivo llamado <code>.env</code>.",
              ""
            ],
            [
              "//i.imgur.com/jkQX9SQ.gif",
              "Una imagen gif que te muestra cómo preparar tus variables de ambiente en tu archivo .env.",
              "Abre tu archivo .env pega el siguiente código, y luego guárdalo: <br><code>GITHUB_KEY=<br>GITHUB_SECRET=<br>MONGO_URI=mongodb://localhost:27017/clementinejs<br>PORT=8080<br>APP_URL=http://localhost:8080/</code>",
              ""
            ],
            [
              "//i.imgur.com/f3DE7zB.gif",
              "Una imagen gif que te muestra cómo abir la vista previa de la ventana de c9.io.",
              "Abre tu aplicación en una pestaña de vista previa pulsando window > share > application > open.",
              ""
            ],
            [
              "//i.imgur.com/Ip0qUdQ.gif",
              "Una imagen gif que te muestra cómo crear una aplicación de GitHub usando la URL de vista previa de c9.io.",
              "Crea una aplicación de GitHub para autenticación y elige un \"Nombre de aplicación\". Para la URL de inicio (homepage), pega la URL de tu pestaña de vista previa. También debes pegar la URL de tu pestaña de vista previa en <code>Authorization callback URL</code>, agrégale: <code>auth/github/callback</code>",
              "https://github.com/settings/applications/new"
            ],
            [
              "//i.imgur.com/qCUVRFb.gif",
              "Una imagen gif que te muestra cómo transferir tu llave (key) y tu código secreto (secret) de GitHub a tu archivo .env, así como tu URL de c9.io.",
              "GitHub creará una aplicación y te entregará un ID de cliente (Client ID) y un Código secreto de cliente (Client Secret). Haz que el GITHUB_KEY en tu archivo .env sea igual al ID de cliente, y haz que tu GITHUB_SECRET en el archivo .env sea igual al Código secreto de cliente. Copia la URL de tu pestaña de vista previa y pégala en tu archivo .env como tu APP_URL.",
              ""
            ],
            [
              "//i.imgur.com/2a20Vah.gif",
              "Una imagen gif que te muestra cómo iniciar mongoDB en la terminal de c9.io.",
              "En tu terminal, instala MongoDB usando el siguiente comando: <br><br><code>sudo apt-get install mongodb-org</code><br><br>. Inicia MongoDB con el siguiente comando: <code>mongod --smallfiles</code>",
              ""
            ],
            [
              "//i.imgur.com/dC55pWk.gif",
              "Una imagen gif que te muestra cómo abrir una nueva pestaña en la terminal de c9.io.",
              "Abre una nueva pestaña de terminal pulsando el botón de + sobre tu terminal, luego ejecuta <code>npm install</code>",
              ""
            ],
            [
              "//i.imgur.com/54OC2Ro.gif",
              "Una imagen gif que te muestra cómo navegar a tu pestaña de vista previa e ingresar a tu nueva aplicación Clementine.js.",
              "Ejecuta <code>node server.js</code> para iniciar el servidor. Actualiza tu pestaña de vista previa. Deberías poder ver el logo de Clementine.js. Pulsa \"sign in\"  y acepta la solicitud de GitHub para autorizar la aplicación.",
              ""
            ],
            [
              "//i.imgur.com/2IJfyvN.gif",
              "Una imagen gif que te muestra cómo pulsar un botón para desencadenar una acción AJAX con Clementine.js y cómo ver tu perfil de usuario en los datos de autenticación provistos por GitHub.",
              "Pulsa el botón que dice \"click me\" y verás que se incrementa el número de clics. Pulsa el botón de perfil (profile) y verás la información de tu perfil de GitHub.",
              ""
            ],
            [
              "//i.imgur.com/bjO5pnq.gif",
              "Una imagen gif que te muestra cómo crear un nuevo repositorio de GitHub GitHub y empujar allí tu código.",
              "Crea un nuevo repositorio en GitHub. Luego copia su ULR .git. <br>Regresa a tu terminal de c9.io y establece tu URL remota de GitHub: <code>git remote set-url origin</code> seguido de la URL que copiaste de GitHub. <br>Ejecuta <code>git push origin master</code>. <br>Ahora ve de regreso a la página de GitHub y actualízala. Verás que tu código ahora está ahora en GitHub.",
              "https://github.com/new"
            ],
            [
              "//i.imgur.com/Qn0K65B.gif",
              "Una imagen gif que te muestra cómo agregar complementos a Heroku.",
              "Pronto agregaremos instrucciones para hacer que Clementine corra en Heroku. Por ahora, desarrolla tus Basejumps en c9.io.",
              ""
            ]
          ]
        }
      }
    },
    {
      "id": "bd7158d8c443eddfaeb5bdef",
      "title": "Build a Voting App",
      "description": [
        "<strong>Objective:</strong> Build a full stack JavaScript app that is functionally similar to this: <a href='https://fcc-voting-arthow4n.herokuapp.com/' target='_blank'>https://fcc-voting-arthow4n.herokuapp.com/</a> and deploy it to Heroku.",
        "Note that for each project, you should create a new GitHub repository and a new Heroku project. If you can't remember how to do this, revisit <a href='/challenges/get-set-for-our-dynamic-web-application-projects'>https://freecodecamp.com/challenges/get-set-for-our-dynamic-web-application-projects</a>.",
        "Here are the specific user stories you should implement for this project:",
        "<strong>User Story:</strong> As an authenticated user, I can keep my polls and come back later to access them.",
        "<strong>User Story:</strong> As an authenticated user, I can share my polls with my friends.",
        "<strong>User Story:</strong> As an authenticated user, I can see the aggregate results of my polls.",
        "<strong>User Story:</strong> As an authenticated user, I can delete polls that I decide I don't want anymore.",
        "<strong>User Story:</strong> As an authenticated user, I can create a poll with any number of possible items.",
        "<strong>User Story:</strong> As an unauthenticated or authenticated user, I can see and vote on everyone's polls.",
        "<strong>User Story:</strong> As an unauthenticated or authenticated user, I can see the results of polls in chart form. (This could be implemented using Chart.js or Google Charts.)",
        "<strong>User Story:</strong> As an authenticated user, if I don't like the options on a poll, I can create a new option.",
        "Once you've finished implementing these user stories, click the \"I've completed this challenge\" button and enter the URLs for both your GitHub repository and your live app running on Heroku.",
        "You can get feedback on your project by sharing it with your friends on Facebook."
      ],
      "challengeSeed": [
        "JBKnbY_fdg4"
      ],
      "tests": [],
      "type": "basejump",
      "challengeType": 4,
      "isRequired": true,
      "translations": {
        "es": {
          "description": [
            "<strong>Objetivo:</strong> Construye una aplicación de pila completa (full stack) en JavaScript que funcione de forma similar al siguiente proyecto: <a href='https://fcc-voting-arthow4n.herokuapp.com/' target='_blank'>https://fcc-voting-arthow4n.herokuapp.com/</a> y despliégala en Heroku.",
            "Ten en cuenta que para cada proyecto, debes crear un nuevo repositorio en GitHub y un nuevo proyecto en Heroku. Si no recuerdas cómo hacerlo, visita de nuevo <a href='/challenges/get-set-for-our-dynamic-web-application-projects'>https://freecodecamp.com/challenges/get-set-for-our-dynamic-web-application-projects</a>.",
            "Estas son las Historias de usuario que debes satisfacer para este proyecto:",
            "<strong>Historia de usuario:</strong> Como un usuario autenticado, puedo guardar mis votaciones y acceder a ellas posteriormente.",
            "<strong>Historia de usuario:</strong> Como un usuario autenticado, puedo compartir mis votaciones con mis amigos.",
            "<strong>Historia de usuario:</strong> Como un usuario autenticado, puedo ver los resultados agregados de mis votaciones.",
            "<strong>Historia de usuario:</strong> Como un usuario autenticado, puedo eliminar votaciones que ya no quiero tener guardadas.",
            "<strong>Historia de usuario:</strong> Como un usuario autenticado, puedo crear una votación con cualquier número de opciones.",
            "<strong>Historia de usuario:</strong> Como un usuario autenticado o no autenticado, puedo ver y votar en las votaciones de otros.",
            "<strong>Historia de usuario:</strong> Como un usuario autenticado o no autenticado, puedo ver los resultados de las votaciones por medio de un gráfico. (Esto podría implementarse utilizando Chart.js o Google Charts.)",
            "<strong>Historia de usuario:</strong> Como un usuario autenticado, si no me gustan las opciones en una votación, puedo crear una nueva opción.",
            "Una vez hayas terminado de implementar estas historias de usuario, pulsa el botón de \"I've completed this challenge\" e incluye las URLs de tu repositorio GitHub y de tu aplicación corriendo en Heroku.",
            "Puedes obtener retroalimentación acerca de tu proyecto de parte de tus compañeros campistas compartiéndolo en nuestro <a href='//gitter.im/freecodecamp/codereview' target='_blank'>Cuarto de revisión de código</a>. También puedes compartirlo en Twitter y en el campamento de tu ciudad (en Facebook)."
          ]
        }
      }
    },
    {
      "id": "bd7158d8c443eddfaeb5bdff",
      "title": "Build a Nightlife Coordination App",
      "description": [
        "<strong>Objective:</strong> Build a full stack JavaScript app that is functionally similar to this: <a href='http://whatsgoinontonight.herokuapp.com/' target='_blank'>http://whatsgoinontonight.herokuapp.com/</a> and deploy it to Heroku.",
        "Note that for each project, you should create a new GitHub repository and a new Heroku project. If you can't remember how to do this, revisit <a href='/challenges/get-set-for-our-dynamic-web-application-projects'>https://freecodecamp.com/challenges/get-set-for-our-dynamic-web-application-projects</a>.",
        "Here are the specific user stories you should implement for this project:",
        "<strong>User Story:</strong> As an unauthenticated user, I can view all bars in my area.",
        "<strong>User Story:</strong> As an authenticated user, I can add myself to a bar to indicate I am going there tonight.",
        "<strong>User Story:</strong> As an authenticated user, I can remove myself from a bar if I no longer want to go there.",
        "<strong>User Story:</strong> As an unauthenticated user, when I login I should not have to search again.",
        "<strong>Hint:</strong> Try using the <a href='https://www.yelp.com/developers/documentation/v2/overview' target='_blank'>Yelp API</a> to find venues in the cities your users search for. If you use Yelp's API, be sure to mention so in your app.",
        "Once you've finished implementing these user stories, click the \"I've completed this challenge\" button and enter the URLs for both your GitHub repository and your live app running on Heroku.",
        "You can get feedback on your project by sharing it with your friends on Facebook."
      ],
      "challengeSeed": [
        "Gei7QfPmcMw"
      ],
      "tests": [],
      "type": "basejump",
      "challengeType": 4,
      "isRequired": true,
      "translations": {
        "es": {
          "description": [
            "<strong>Objetivo:</strong> Construye una aplicación de pila completa (full stack) en JavaScript que funcione de forma similar al siguiente proyecto: <a href='http://whatsgoinontonight.herokuapp.com/' target='_blank'>http://whatsgoinontonight.herokuapp.com/</a> y despliégala en Heroku.",
            "Ten en cuenta que para cada proyecto, debes crear un nuevo repositorio en GitHub y un nuevo proyecto en Heroku. Si no recuerdas cómo hacerlo, visita de nuevo <a href='/challenges/get-set-for-our-dynamic-web-application-projects'>https://freecodecamp.com/challenges/get-set-for-our-dynamic-web-application-projects</a>.",
            "Estas son las Historias de usuario que debes satisfacer para este Basejump:",
            "<strong>Historia de usuario:</strong> Como un usuario no autenticado, puedo ver todos los bares en mi área.",
            "<strong>Historia de usuario:</strong> Como un usuario autenticado, puedo agregarme a mí mismo a un bar para indicar que voy a estar allí esta noche.",
            "<strong>Historia de usuario:</strong> Como un usuario autenticado, puedo removerme de un bar si ya no pienso ir allí.",
            "<strong>Historia de usuario:</strong> Como un usuario no autenticado, cuando accedo a mi cuenta no debo tener la necesidad de buscar de nuevo.",
            "<span class='text-info'>Pista:</span> Prueba utilizar el <a href='https://www.yelp.com/developers/documentation/v2/overview' target='_blank'>API de Yelp</a> para encontrar lugares en las ciudades donde tus usuarios buscan. Si utilizas el API de Yelp, asegúrate de mencionarlo en tu aplicación.",
            "Una vez hayas terminado de implementar estas historias de usuario, pulsa el botón de \"I've completed this challenge\" e incluye las URLs de tu repositorio GitHub y de tu aplicación corriendo en Heroku.",
            "Puedes obtener retroalimentación acerca de tu proyecto de parte de tus compañeros campistas compartiéndolo en nuestro <a href='//gitter.im/freecodecamp/codereview' target='_blank'>Cuarto de revisión de código</a>. También puedes compartirlo en Twitter y en el campamento de tu ciudad (en Facebook)."
          ]
        }
      }
    },
    {
      "id": "bd7158d8c443eddfaeb5bd0e",
      "title": "Chart the Stock Market",
      "description": [
        "<strong>Objective:</strong> Build a full stack JavaScript app that is functionally similar to this: <a href='http://watchstocks.herokuapp.com/' target='_blank'>http://watchstocks.herokuapp.com/</a> and deploy it to Heroku.",
        "Note that for each project, you should create a new GitHub repository and a new Heroku project. If you can't remember how to do this, revisit <a href='/challenges/get-set-for-our-dynamic-web-application-projects'>https://freecodecamp.com/challenges/get-set-for-our-dynamic-web-application-projects</a>.",
        "Here are the specific user stories you should implement for this project:",
        "<strong>User Story:</strong> I can view a graph displaying the recent trend lines for each added stock.",
        "<strong>User Story:</strong> I can add new stocks by their symbol name.",
        "<strong>User Story:</strong> I can remove stocks.",
        "<strong>User Story:</strong> I can see changes in real-time when any other user adds or removes a stock. For this you will need to use Web Sockets.",
        "Once you've finished implementing these user stories, click the \"I've completed this challenge\" button and enter the URLs for both your GitHub repository and your live app running on Heroku.",
        "You can get feedback on your project by sharing it with your friends on Facebook."
      ],
      "challengeSeed": [
        "CENs50cnRgM"
      ],
      "tests": [],
      "type": "basejump",
      "challengeType": 4,
      "isRequired": true,
      "translations": {
        "es": {
          "description": [
            "<strong>Objetivo:</strong> Construye una aplicación de pila completa (full stack) en JavaScript que funcione de forma similar al siguiente proyecto: <a href='http://watchstocks.herokuapp.com/' target='_blank'>http://watchstocks.herokuapp.com/</a> y despliégalo en Heroku.",
            "Ten en cuenta que para cada proyecto, debes crear un nuevo repositorio en GitHub y un nuevo proyecto en Heroku. Si no recuerdas cómo hacerlo, visita de nuevo <a href='/challenges/get-set-for-our-dynamic-web-application-projects'>https://freecodecamp.com/challenges/get-set-for-our-dynamic-web-application-projects</a>.",
            "Estas son las Historias de usuario que debes satisfacer para este Basejump:",
            "<strong>Historia de usuario:</strong> Como usuario, puedo ver un gráfico que me muestre las líneas de tendencia recientes para cada acción agregada.",
            "<strong>Historia de usuario:</strong> Como usuario, puedo agregar nuevas acciones por su símbolo.",
            "<strong>Historia de usuario:</strong> Como usuario, puedo remover acciones.",
            "<strong>Historia de usuario:</strong> Como usuario, puedo ver cambios en tiempo real cuando algún otro usuario agrega o remueve una acción. Puedes usar Web Sockets para hacer esto.",
            "Una vez hayas terminado de implementar estas historias de usuario, pulsa el botón de \"I've completed this challenge\" e incluye las URLs de tu repositorio GitHub y de tu aplicación corriendo en Heroku.",
            "Puedes obtener retroalimentación acerca de tu proyecto de parte de tus compañeros campistas compartiéndolo en nuestro <a href='//gitter.im/freecodecamp/codereview' target='_blank'>Cuarto de revisión de código</a>. También puedes compartirlo en Twitter y en el campamento de tu ciudad (en Facebook)."
          ]
        }
      }
    },
    {
      "id": "bd7158d8c443eddfaeb5bd0f",
      "title": "Manage a Book Trading Club",
      "description": [
        "<strong>Objective:</strong> Build a full stack JavaScript app that is functionally similar to this: <a href='http://bookjump.herokuapp.com/' target='_blank'>http://bookjump.herokuapp.com/</a> and deploy it to Heroku.",
        "Note that for each project, you should create a new GitHub repository and a new Heroku project. If you can't remember how to do this, revisit <a href='/challenges/get-set-for-our-dynamic-web-application-projects'>https://freecodecamp.com/challenges/get-set-for-our-dynamic-web-application-projects</a>.",
        "Here are the specific user stories you should implement for this project:",
        "<strong>User Story:</strong> I can view all books posted by every user.",
        "<strong>User Story:</strong> I can add a new book.",
        "<strong>User Story:</strong> I can update my settings to store my full name, city, and state.",
        "<strong>User Story:</strong> I can propose a trade and wait for the other user to accept the trade.",
        "Once you've finished implementing these user stories, click the \"I've completed this challenge\" button and enter the URLs for both your GitHub repository and your live app running on Heroku.",
        "You can get feedback on your project by sharing it with your friends on Facebook."
      ],
      "challengeSeed": [
        "mzElFmbGqQI"
      ],
      "tests": [],
      "type": "basejump",
      "challengeType": 4,
      "isRequired": true,
      "translations": {
        "es": {
          "description": [
            "<strong>Objetivo:</strong> Construye una aplicación de pila completa (full stack) en JavaScript que funcione de forma similar al siguiente proyecto: <a href='http://bookjump.herokuapp.com/' target='_blank'>http://bookjump.herokuapp.com/</a> y despliégalo en Heroku.",
            "Ten en cuenta que para cada proyecto, debes crear un nuevo repositorio en GitHub y un nuevo proyecto en Heroku. Si no recuerdas cómo hacerlo, visita de nuevo <a href='/challenges/get-set-for-our-dynamic-web-application-projects'>https://freecodecamp.com/challenges/get-set-for-our-dynamic-web-application-projects</a>.",
            "Estas son las Historias de usuario que debes satisfacer para este Basejump:",
            "<strong>Historia de usuario:</strong> Puedo ver todos los libros agregados por cada usuario.",
            "<strong>Historia de usuario:</strong> Puedo agregar un nuevo libro.",
            "<strong>Historia de usuario:</strong> Puedo actualizar mi configuración para que almacene mi nombre completo, ciudad y Estado.",
            "<strong>Historia de usuario:</strong> Puedo proponer un intercambio y esperar a que algún otro usuario acepte el trato.",
            "Una vez hayas terminado de implementar estas historias de usuario, pulsa el botón de \"I've completed this challenge\" e incluye las URLs de tu repositorio GitHub y de tu aplicación corriendo en Heroku.",
            "Puedes obtener retroalimentación acerca de tu proyecto de parte de tus compañeros campistas compartiéndolo en nuestro <a href='//gitter.im/freecodecamp/codereview' target='_blank'>Cuarto de revisión de código</a>. También puedes compartirlo en Twitter y en el campamento de tu ciudad (en Facebook)."
          ]
        }
      }
    },
    {
      "id": "bd7158d8c443eddfaeb5bdee",
      "title": "Build a Pinterest Clone",
      "description": [
        "<strong>Objective:</strong> Build a full stack JavaScript app that is functionally similar to this: <a href='http://pintech.herokuapp.com/' target='_blank'>http://pintech.herokuapp.com/</a> and deploy it to Heroku.",
        "Note that for each project, you should create a new GitHub repository and a new Heroku project. If you can't remember how to do this, revisit <a href='/challenges/get-set-for-our-dynamic-web-application-projects'>https://freecodecamp.com/challenges/get-set-for-our-dynamic-web-application-projects</a>.",
        "Here are the specific user stories you should implement for this project:",
        "<strong>User Story:</strong> As an unauthenticated user, I can login with Twitter.",
        "<strong>User Story:</strong> As an authenticated user, I can link to images.",
        "<strong>User Story:</strong> As an authenticated user, I can delete images that I've linked to.",
        "<strong>User Story:</strong> As an authenticated user, I can see a Pinterest-style wall of all the images I've linked to.",
        "<strong>User Story:</strong> As an unauthenticated user, I can browse other users' walls of images.",
        "<strong>User Story:</strong> As an authenticated user, if I upload an image that is broken, it will be replaced by a placeholder image. (can use jQuery broken image detection)",
        "<strong>Hint:</strong> <a href='http://masonry.desandro.com/' target='_blank'>Masonry.js</a> is a library that allows for Pinterest-style image grids.",
        "Once you've finished implementing these user stories, click the \"I've completed this challenge\" button and enter the URLs for both your GitHub repository and your live app running on Heroku.",
        "You can get feedback on your project by sharing it with your friends on Facebook."
      ],
      "challengeSeed": [
        "adrOtJCVP04"
      ],
      "tests": [],
      "type": "basejump",
      "challengeType": 4,
      "isRequired": true,
      "translations": {
        "es": {
          "description": [
            "<strong>Objetivo:</strong> Construye una aplicación de pila completa (full stack) en JavaScript que funcione de forma similar al siguiente proyecto: <a href='http://pintech.herokuapp.com/' target='_blank'>http://pintech.herokuapp.com/</a> y despliégalo en Heroku.",
            "Ten en cuenta que para cada proyecto, debes crear un nuevo repositorio en GitHub y un nuevo proyecto en Heroku. Si no recuerdas cómo hacerlo, visita de nuevo <a href='/challenges/get-set-for-our-dynamic-web-application-projects'>https://freecodecamp.com/challenges/get-set-for-our-dynamic-web-application-projects</a>.",
            "Estas son las Historias de usuario que debes satisfacer para este Basejump:",
            "<strong>Historia de usuario:</strong> Como usuario autenticado, puedo acceder a mi cuenta con Twitter.",
            "<strong>Historia de usuario:</strong> Como usuario autenticado, puedo agregar enlaces a imágenes.",
            "<strong>Historia de usuario:</strong> Como usuario autenticado, puedo elimiar imágenes que he agregado.",
            "<strong>Historia de usuario:</strong> Como usuario autenticado, puedo ver un muro al estilo de Pinterest con todas las imágenes para las que he agregado un enlace.",
            "<strong>Historia de usuario:</strong> Como usuario no autenticado, puedo navegar los muros de imágenes de otros usuarios.",
            "<strong>Historia de usuario:</strong> Como usuario autenticado, si agrego una imagen corrupta, será reemplazada por una imagen predeterminada. (Puedes utilizar la detección de imágenes corruptas de jQuery)",
            "<strong>Pista:</strong> <a href='http://masonry.desandro.com/' target='_blank'>Masonry.js</a> es una librería que permite crear cuadrículas de imágenes al estilo de Pinterest.",
            "Una vez hayas terminado de implementar estas historias de usuario, pulsa el botón de \"I've completed this challenge\" e incluye las URLs de tu repositorio GitHub y de tu aplicación corriendo en Heroku.",
            "Puedes obtener retroalimentación acerca de tu proyecto de parte de tus compañeros campistas compartiéndolo en nuestro <a href='//gitter.im/freecodecamp/codereview' target='_blank'>Cuarto de revisión de código</a>. También puedes compartirlo en Twitter y en el campamento de tu ciudad (en Facebook)."
          ]
        }
      }
    }
  ]
}
