{
  "name": "Git",
  "order": 24,
  "time": "3 hours",
  "helpRoom": "HelpBackEnd",
  "challenges": [
    {
      "id": "bd7353d8c341eddeaeb5bd0f",
      "title": "Save your Code Revisions Forever with Git",
      "description": [
        "To complete this challenge, you will need to install a few things on your computer - a text editor, Git, and the Git-It-Electron desktop app.",
        "Text Editor - A text editor is a good tool to have as a programmer. You can download and install <a href=\"https://atom.io/\" target=\"_blank\">Atom</a>, <a href=\"https://www.sublimetext.com/3\" target=\"_blank\">Sublime Text</a>, or <a href=\"http://brackets.io/\" target=\"_blank\">Brackets</a>. All these editors are available for Windows, Mac and Linux platforms. Alternatively, if you already have a text editor, or you would like to use a different one, you're welcome to do so.",
        "Git - Download and install Git from <a href=\"https://git-scm.com/download/\" target=\"_blank\">git-scm</a>. You can complete the installation with the recommended defaults. Note - for Windows users - as the installation completes, on the final screen, click on \"Launch Git Bash\". Mac and Linux users may use their terminal instead.",
        "Git-It-Electron - Visit the <a href=\"https://github.com/jlord/git-it-electron\" target=\"_blank\">git-it-electron</a> repository on Github and <a href=\"https://github.com/jlord/git-it-electron/releases\" target=\"_blank\">download the release</a> corresponding to your operating system. Once the download completes, extract the zipped folder and run the \"Git-it\" application. This will launch the Git-it desktop app, where you will complete the challenges. Once the app launches, click  on \"Start challenge one\".",
        "Complete \"Get Git\". Note - if you already have Git installed from step 3 above (you can verify this by running <code>git --version</code> in the git bash/terminal), then you may skip the installation of Github Desktop, which is stated in this challenge. Although if you do want to learn about it, you're welcome to install it. Complete the rest of the objectives in this challenge and click \"verify\".",
        "Complete \"Repository\".",
        "Complete \"Commit To It\".",
        "Complete \"GitHubbin\".",
        "Complete \"Remote Control\". Note - after the <code>git push</code> command, you might get a pop up window - \"Github Login\". Enter your credentials from the Github website and click \"login\".",
        "Complete \"Forks And Clones\".",
        "Complete \"Branches Aren't Just For Birds\".",
        "Complete \"It's A Small World\".",
        "Complete \"Pull, Never Out Of Date\".",
        "Complete \"Requesting You Pull, Please\".",
        "Complete \"Merge Tada!\".",
        "Once you've completed these steps, move on to our next challenge."
      ],
      "challengeSeed": [],
      "tests": [],
      "type": "waypoint",
      "challengeType": 2
    }
  ]
}
