{
  "name": "Git",
  "order": 24,
  "time": "3 hours",
  "helpRoom": "HelpBackEnd",
  "challenges": [
    {
      "id": "bd7353d8c341eddeaeb5bd0f",
      "title": "Save your Code Revisions Forever with Git",
      "description": [
        "To complete this challenge, you will need to install a few things on your computer - a text editor, Git, and the Git-It-Electron desktop app.",
        "Text Editor - A text editor is a good tool to have as a programmer. You can download and install <a href=\"https://atom.io/\" target=\"_blank\">Atom</a>, <a href=\"https://www.sublimetext.com/3\" target=\"_blank\">Sublime Text</a>, or <a href=\"http://brackets.io/\" target=\"_blank\">Brackets</a>. All these editors are available for Windows, Mac and Linux platforms. Alternatively, if you already have a text editor, or you would like to use a different one, you're welcome to do so.",
        "Git - Download and install Git from <a href=\"https://git-scm.com/download/\" target=\"_blank\">git-scm</a>. You can complete the installation with the recommended defaults. Note - for Windows users - as the installation completes, on the final screen, click on \"Launch Git Bash\". Mac and Linux users may use their terminal instead.",
        "Git-It-Electron - Visit the <a href=\"https://github.com/jlord/git-it-electron\" target=\"_blank\">git-it-electron</a> repository on Github and <a href=\"https://github.com/jlord/git-it-electron/releases\" target=\"_blank\">download the release</a> corresponding to your operating system. Once the download completes, extract the zipped folder and run the \"Git-it\" application. This will launch the Git-it desktop app, where you will complete the challenges. Once the app launches, click  on \"Start challenge one\".",
        "Complete \"Get Git\". Note - if you already have Git installed from step 3 above (you can verify this by running <code>git --version</code> in the git bash/terminal), then you may skip the installation of Github Desktop, which is stated in this challenge. Although if you do want to learn about it, you're welcome to install it. Complete the rest of the objectives in this challenge and click \"verify\".",
        "Complete \"Repository\".",
        "Complete \"Commit To It\".",
        "Complete \"GitHubbin\".",
        "Complete \"Remote Control\". Note - after the <code>git push</code> command, you might get a pop up window - \"Github Login\". Enter your credentials from the Github website and click \"login\".",
        "Complete \"Forks And Clones\".",
        "Complete \"Branches Aren't Just For Birds\".",
        "Complete \"It's A Small World\".",
        "Complete \"Pull, Never Out Of Date\".",
        "Complete \"Requesting You Pull, Please\".",
        "Complete \"Merge Tada!\".",
        "Once you've completed these steps, move on to our next challenge."
      ],
      "challengeSeed": [
        "oznlW01iKRA"
      ],
      "tests": [],
      "type": "waypoint",
      "challengeType": 2,
      "titleEs": "Guarda las revisiones de tu código por siempre con Git",
      "descriptionEs": [
        "Haremos este desafío en Cloud 9, un poderoso editor en línea con un ambiente de trabajo Ubuntu Linux completo, corriendo totalmente en la nube.",
        "Si todavía no tienes una cuenta en Cloud 9, crea una ahora en <a href='http://c9.io' target='_blank'>http://c9.io</a>.",
        "Abre <a href='http://c9.io' target='_blank'>http://c9.io</a> y accede a tu cuenta.",
        "Pulsa el icono \"+\" en la parte superior derecha de la página de c9.io para crear un nuevo espacio de trabajo.",
        "Dale un nombre a tu espacio de trabajo. Opcionalmente también puede escribir una descripción.",
        "Elije Node.js entre las opciones en el área debajo del campo donde escribiste el nombre.",
        "Pulsa el botón que dice \"Create workspace\".",
        "Una vez C9 termine de cargar tu espacio de trabajo, verás una terminal en la ventana de la esquina inferior derecha. Introduce los comandos siguientes en esa ventana (no te preocupes si no entiendes por ahora qué es lo que hacen):",
        "Instala <code>git-it</code> usando el siguiente comando: <code>npm install -g git-it</code>",
        "Ahora inicia el tutorial ejecutando <code>git-it</code>",
        "Puedes modificar el tamaño de las ventanas en c9.io arrastrándolas por el borde.",
        "Asegúrate de que siempre te encuentres en el directorio \"workspace\" de tu proyecto. Puedes regresar a este directorio cuando quieras usando el comando: <code>cd ~/workspace</code>.",
        "Puedes ver el código fuente de este módulo de Node School en GitHub visitando <a href='https://github.com/jlord/git-it' target='_blank'>https://github.com/jlord/git-it</a>.",
        "Completa \"Get Git\"",
        "Completa \"Repository\"",
        "Completa \"Commit to it\"",
        "Completa \"Githubbin\"",
        "Completa \"Remote Control\"",
        "Completa \"Forks and Clones\"",
        "Completa \"Branches aren't just for Birds\"",
        "Completa \"It's a Small World\"",
        "Completa \"Pull, Never out of Date\"",
        "Completa \"Requesting you Pull, Please\"",
        "Completa \"Merge Tada!\"",
        "Una vez hayas terminado con este tutorial, puedes continuar con el siguiente desafío."
      ]
    }
  ]
}
