{
  "name": "Computer Basics",
  "order": 0,
  "time": "3 hours",
  "challenges": [
    {
      "id": "bd7128d8c441eddfbeb5bddf",
      "title": "Computer Basics 1: The 4 Basic Parts of a Computer",
      "description": [
        "At the very least, a machine needs these four basic parts to be considered a computer.",
        "Today we're going to talk about the basics of computer hardware.",
        "Computers are made up of 4 basic parts: the input, output, CPU, and memory.",
        "The input is what you're putting into the computer.",
        "Think about mouse, keyboard, microphone, any way you're getting data into the computer.",
        "The output is what you're watching on your monitor or listening to on your speakers.",
        "These can both be any format like text, numbers, videos, images, what have you, it doesn't matter.",
        "CPU stands for central processing unit, and that's what we all think of when we think of a computer.",
        "It's what does the functions, it's what runs the software, it manipulates the data.",
        "The memory is where we store data and information.",
        "Now, the CPU has exclusive access to this memory.",
        "You can't get to the memory from the input or the output without the use of the CPU.",
        "So, just to review, we've got 4 basic parts of the computer: the input, the output, CPU, and memory."
      ],
      "challengeSeed": [
        "132542064"
      ],
      "tests": [
        [
          "The computer has 3 basic parts.",
          false,
          "The computer has 4 basic parts: input, output, CPU, and memory"
        ],
        [
          "CPU stands for Central Processing Unit.",
          true
        ],
        [
          "All parts can access the memory",
          false,
          "Only the CPU has access to the memory"
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7127d8c441eddfbeb5bddf",
      "title": "Computer Basics 2: More Computer Hardware",
      "description": [
        "In this video we cover the basic functions of a motherboard, expansion slots, and power supply.",
        "Let's quickly review - the 4 basic parts of a computer are the input, like the mouse or the keyboard, the output, which is seen on the monitor or heard on the speakers, the CPU, the central processing unit, and the memory.",
        "Now memory can be short term memory, called RAM, or longer term memory.",
        "That's usually as a hard drive, but it can also be a CD-ROM or a flash drive, anything like that.",
        "In addition to those four basic parts, we have three more things we're going to discuss today: the motherboard, expansion cards, and power supply.",
        "The motherboard is what connects everything.",
        "While the data's flying around over here trying to figure out where to go, the motherboard helps route it so it goes to the right place.",
        "Expansion cards are sound cards, video cards, that kind of thing that can really up your experience as a user.",
        "Power supply is, as it sounds, what gets power to the computer.",
        "It's usually that part that has a fan on it to keep it from overheating.",
        "So let's do a quick review.",
        "In addition to the four basic parts of input, output, CPU, and memory, we also usually have a motherboard, expansion cards, and a power supply."
      ],
      "challengeSeed": [
        "132542458"
      ],
      "tests": [
        [
          "The power supply isn't a necessary part of a computer since it's not one of the 4 main parts.",
          false,
          "The computer needs power!"
        ],
        [
          "A motherboard connects all of the working parts in a computer.",
          true
        ],
        [
          "Memory is usually categorized into 3 parts.",
          false,
          "Only 2 parts, RAM and long term memory such as a hard drive"
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7126d8c441eddfbeb5bddf",
      "title": "Computer Basics 3: Intro to Binary Code",
      "description": [
        "What binary looks like, and what it can mean.",
        "0's and 1's can turn be interpreted into far more complex data.",
        "Today we're going to talk a little bit about binary code.",
        "Binary code is a really simple computer language where there are only 1's and 0's, that are either on or off, 1 being on and 0 being off.",
        "Those 1's and 0's can be pretty much anything, but generally they are just numbers, letters, and symbols.",
        "We're going to go into how you decode a number in binary, but as you can probably guess, translating binary can be done with a quick google search.",
        "The most important part of this is you undrestand the concept that even simple things like 1's and 0's can translate into something really complex that is the basis for all of the computer languages that exist today."
      ],
      "challengeSeed": [
        "132542757"
      ],
      "tests": [
        [
          "1's and 0's are how we talk about little switches being on and off.",
          true
        ],
        [
          "1 means on, and 0 means off.",
          true
        ],
        [
          "There are some things which cannot be translated into binary.",
          false,
          "everything can be expressed through binary code!"
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7125d8c441eddfbeb5bddf",
      "title": "Computer Basics 4: Decoding a Binary Number",
      "description": [
        "In this video, we decode a number written in binary notation.",
        "Let's talk about the binary numeral system, also known as a bunch of 1's and 0's over and over again.",
        "We're going to start by labeling, staring backwards, how many numbers there are.",
        "(In this video there are 7, but we start at 0, so we only get up to 6.) Pretty straightforward.",
        "The next step is to take 2 to the power of whatever place it is, a 2 to the 0, 2 to the 1, all the way up to the largest placeholder.",
        "Then, all we have to do is fill in some mathamatical blanks by completing the exponential 2 problems.",
        "If there is a 1, we keep that number (the two to the exponent solution) and add it to other \"1\" or \"on\" numbers.",
        "If it's a 0, we disregard it.",
        "In this video, our number adds up to 75."
      ],
      "challengeSeed": [
        "132543332"
      ],
      "tests": [
        [
          "1 === on and 0 ===off",
          true
        ],
        [
          "Not all numbers can be expressed through binary numeral notation.",
          false,
          "All numbers can!"
        ],
        [
          "If we have the opportunity to include base 2 to every given power, we can create any number.",
          true
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7124d8c441eddfbeb5bddf",
      "title": "Computer Basics 5: How To Measure Data Size",
      "description": [
        "How the size/amount of data is measured, starting from a bit and going all the way up to a petabyte.",
        "Today we're going to be talking about Data Size.",
        "The smallest size we can have is called a bit.",
        "That bit can only be a 1 or a 0, and that goes back go binary we've been talking about.",
        "After that, we've got a Nibble, which is 4 bits, which isn't common but it's adorable.",
        "The Byte, which is very common, is 8 bits.",
        "A lot of things are expressed in binary Bytes.",
        "After we get past the tiny bit and the small Byte, we get bigger really fast.",
        "The next step up is a Kilobyte, 1024 Bytes, or 1,048,576 bits.",
        "After that there's Megabyte, or 1024 Bytes to the power of two.",
        "Then it's Gigabyte, 1024 Bytes to the power of three; Terabyte, 1024 Bytes to the power of 4, and Petabyte, 1024 to the power of 5.",
        "These get much bigger really quickly!"
      ],
      "challengeSeed": [
        "132543959"
      ],
      "tests": [
        [
          "A Byte is the smallest possible amount of data.",
          false,
          "A Byte is 8 bits."
        ],
        [
          "A bit is the smallest possible amount of data.",
          true
        ],
        [
          "A Kilobyte is 1024 Bytes.",
          true
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7123d8c441eddfbeb5bddf",
      "title": "Computer Basics 6: Measuring Data Speed",
      "description": [
        "Data speed and data size are measured differently.",
        "In this video, we cover how data speed is measured.",
        "Let's talk about data speed.",
        "Data speed, unlike data size, is usually measured in bits per second, whereas size is usually measured in Bits.",
        "Once we start talking exponentially, that makes a really big difference.",
        "How we talk about speed really depends on what we're talking about.",
        "In audio download, we talk about kilobits per second.",
        "In internet, we use megabits per second.",
        "In network speed, we talk about Gigabits per second (one billion bits per second!).",
        "The main takeaway here is that speed is usually measured in bits and size is measured in Bytes.",
        "Additionally, if you have an internet speed that says however many bits per second, keep in mind they are talking about something 8 times less than Bytes, how you are thinking about data."
      ],
      "challengeSeed": [
        "132545171"
      ],
      "tests": [
        [
          "Data speed is measured in bits.",
          true
        ],
        [
          "Data size is measured in bits.",
          false,
          "Size is Bytes and speed is bits."
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7122d8c441eddfbeb5bddf",
      "title": "Computer Basics 7: Binary Bytes",
      "description": [
        "Binary does more than express numbers - through bytes, it can symbolize all alphanumeric symbols, which can then be interpreted into more complex code.",
        "Let's talk about the most basic level that computer can understand other languages, like javascript.",
        "THe most basic thing is a bit, up or down, 1 or 0.",
        "After that ther'es a Byte, 8 bits.",
        "All numbers (255 and less), letters, and symbols can be translated into Bytes that the computer can understand.",
        "So, all of the numbers, letters, and symbols in your javascript can be translated.",
        "There are a lot of languages that computers can work with, and what I want you to get away from this video is that all data in your computer boils down to binary Bytes."
      ],
      "challengeSeed": [
        "132545417"
      ],
      "tests": [
        [
          "All digits, letters, and symbols have a binary Byte translation.",
          true
        ],
        [
          "It's good practice to memorize these.",
          false,
          "You can just look these up as needed."
        ],
        [
          "Everything can be expressed binarily, even pictures, sound, and video",
          true
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7121d8c441eddfbeb5bddf",
      "title": "Computer Basics 8: Types of Computers",
      "description": [
        "This video covers the basics of supercomputers, servers, workstations, PCs, and microcontrollers.",
        "Let's discuss the different types of computers.",
        "The biggest type is called a super computer, a computer with lots of CPUS that work on the same problem at the same time using a technique called parallel processing.",
        "The next type is called a server.",
        "A server holds and accesses lots of data or programs.",
        "Free Code Camp is hosted on a server which stores all of that information.",
        "Let's talk now about a workstation computer - a computer that may look similar to a personal computer, but has a lot more power and is a lot pricier.",
        "Toy Story was built on workstation computers.",
        "Now, personal computers are by far the most common.",
        "Maybe you've heard \"I'm a Mac!\" or \"I'm a PC!\", something indicating they're different, but really my own personal MacBook is still a PC, a personal compter.",
        "It's both a Mac and a PC.",
        "The last type of computer we'll talk about is a microcontroller, the type of computer you might have in your car that is really good at a small specialized task, but wouldn't be used the same way a PC would be."
      ],
      "challengeSeed": [
        "132546182"
      ],
      "tests": [
        [
          "The most common type of computer is a Personal Computer, a PC.",
          true
        ],
        [
          "What makes Supercomputers 'super' is when multiple CPUs work on one problem, called parallel processing.",
          true
        ],
        [
          "Microcontrollers and workstation computers can perform roughly the same tasks.",
          false,
          "A microcontroller can only perform a small specialized task while a workstation computer has a lot of power, though also specialized."
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7120d8c441eddfbeb5bddf",
      "title": "Computer Basics 9: More on the Motherboard",
      "description": [
        "A little more detail on what constitutes a motherboard and what functionalities are standard in PCs.",
        "Today we're going to be talking more about the motherboard.",
        "We mentioned it briefly in previous videos, but we'll give some more detail today.",
        "What makes a motherboard is the connection between the CPU and the memory - if it doesn't do that, it's not a motherboard.",
        "But, most motherboards do a lot more than that.",
        "Primarily, they have expansion slots and ports.",
        "Expansion slots are where you put anything that can increase the performance of a computer without putting more load on the CPU.",
        "For example, a graphics or a sound card would up the user experience by giving better sound or video quality, but it wouldn't slow down the computer.",
        "A Network Interface Card could also go in an expansion slot.",
        "This would help your computer conncet with the networks around it, something we'll talk about more in upcoming videos.",
        "PC and Express cards are primarily found in laptops, and Express cards are taking over due to their smaller size.",
        "In addition to expansion slots, motherboards have ports.",
        "On your computer, you probably know there's a place to connect USB, firewire, SD card, ethernet, even an audio plug-in to listen through headphones.",
        "These are all considered ports, a place on the motherboard where you can connect the CPU to some outside source to either get or give information."
      ],
      "challengeSeed": [
        "132547285"
      ],
      "tests": [
        [
          "A motherboard must connect the CPU, the memory, and the network.",
          false,
          "A motherboard is a motherboard as long as it connects the CPU and the memory."
        ],
        [
          "Expansion slots allow users to add capabilities to a computer.",
          true
        ],
        [
          "Ports help the computer access information.",
          true
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd712fd8c441eddfbeb5bddf",
      "title": "Computer Basics 10: Data Networks",
      "description": [
        "This video covers the basics of local area networks, wide area networks, and virtual private networks.",
        "In this video we talk about Data Networks.",
        "You've heard of networks, like a water network, road network, cell phone network, or television network.",
        "Today we'll talk about data networks, which are the networks that computers use.",
        "The three types we'll cover are the Local Area Network (LAN), the Wide Area Network (WAN), and the Virtual Private Network (VPN).",
        "A LAN is just a small group of computers that are connected together.",
        "The most important thing about a LAN is that those computers are close together.",
        "So, if you're using wifi at Starbucks or at your school, you're probably using a LAN that you can only connect to if you are physically close to it.",
        "A WAN (Wide Area Network) is two or more LANs that are connected over long distances.",
        "So, maybe a school in Colorado wants to connect to a school in Missouri.",
        "They could use a WAN.",
        "You might think that these are connected over the internet, and in the case of a VPN (Virtual Private Network, which is basically the same conceptionally as a WAN), you're right.",
        "However, a WAN usually rents a cable from an internet company to creat the connection."
      ],
      "challengeSeed": [
        "132547590"
      ],
      "tests": [
        [
          "You can connect to a LAN from far away.",
          false,
          "To connect to a LAN you must be physically near to it."
        ],
        [
          "VPNs (Virtual Private Networks) and WANs (Wide Area Networks) do just about the same thing.",
          true
        ],
        [
          "VPNs and WANs both use the internet to connect LANs.",
          false,
          "While both connect LANs, VPNs use the internet and WANs use a rented cable."
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd712ed8c441eddfbeb5bddf",
      "title": "Computer Basics 11: IP Addresses",
      "description": [
        "The Internet, part 1: IP Addresses.",
        "Every device has an IP address.",
        "IP addresses are assigned based on location, and are vital for the internet to work.",
        "We're going to talk about the Internet: Part 1, How the Internet Works.",
        "To know how the internet works, we're going to talk first about IP addresses.",
        "You may be familliar with the fact that each of your devices has its own IP address, just like a house or an apartment has its own address.",
        "The internet can't deliver data to a device unless it has an IP address.",
        "Not only does your device have one, but so does the modem, the router, and every step along the way, which we'll get to later.",
        "IP addresses are determined based on location, starting with 5 big international regions.",
        "Moving from left to right, the numbers mean something specific about your location.",
        "This number isn't specific enough that you could call 911, give them your IP address, and have them know where you live.",
        "However, it is specific enough that you could google \"Where's the best ice cream near me\" and google could give you information close to your location.",
        "This is done using your IP address."
      ],
      "challengeSeed": [
        "132548071"
      ],
      "tests": [
        [
          "IP addresses are necessary to use and participate in the internet.",
          true
        ],
        [
          "IP addresses are determined and assigned based on location.",
          true
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd712dd8c441eddfbeb5bddf",
      "title": "Computer Basics 12: How the Internet Works",
      "description": [
        "This is a brief and basic overview of how the internet works.",
        "For a more in-depth explanation, check out web.stanford.edu/class/msande91si/www-spr04/readings/week1/InternetWhitepaper.htm",
        "Let's talk a little more about how the internet works.",
        "We've already estabilished that every device and router on the intenet has its own IP address, which is assigned based on location.",
        "Using these IP addresses, your device can talk to your modem, then to a router, which is set up by a web service.",
        "The router would go to the domain name server, still just sending a request.",
        "That server would send back the information that was requested, and it would go back to your device.",
        "You might think this is fallable; if one step goes out, then the whole process is done.",
        "But really, there are so many routers and so many routes that if even a big chunk goes out, that still won't really affect the functionality.",
        "It's really amazing.",
        "What I want you take away from this video is that your device, since it has an IP address, can send out a request for informatoin, and that information will get back to your device via servers and routers that comprise the internet.",
        "Now, this explaination is really quite basic.",
        "For more information, check out web.stanford.edu/class/msande91si/www-spr04/readings/week1/InternetWhitepaper.htm."
      ],
      "challengeSeed": [
        "132548579"
      ],
      "tests": [
        [
          "Your computer sends a request for information.",
          true
        ],
        [
          "The Internet can be broken by a large chunk of routers and servers going down.",
          false,
          "There are so many connections that even a large amount of routers and servers can stop functioning and your experience will still not be affected."
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd712cd8c441eddfbeb5bddf",
      "title": "Computer Basics 13: Software",
      "description": [
        "We discriminate between hardware and software, and also discuss the differences between an operating system and application software.",
        "In this video, we'll discuss the basics of software.",
        "We've already covered hardware, which are parts of the computer you can see and feel with your hands.",
        "Software is the program or the programs that run on the hardware.",
        "Software is the code that is written and imprinted onto hardware.",
        "The two types of software we're going to talk about today are operating system software and applications.",
        "There are three main operating systems: Windows, Mac, and Linux.",
        "Applications comprise all other software, like your web browser, games, things like Photoshop, how you view your mail, editing documents, etc."
      ],
      "challengeSeed": [
        "132548908"
      ],
      "tests": [
        [
          "Safari, Chrome, and Firefox are all examples of application software.",
          true
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd712bd8c441eddfbeb5bddf",
      "title": "What Do Programmers Do?",
      "description": [
        "Programmers (a.k.a. coders, developers, or software engineers) solve problems by turning big ideas into tiny steps that a computer can understand.",
        "In this video, we'll discuss what programmers do.",
        "Programmers can also be called coders, developers, or software engineers, and what all of these peple do is take ideas and turn them into functional code.",
        "It's not just creating that code, but also maintaining it.",
        "Let's look at how the computer looks at code, specifically javascript.",
        "The computer looks at code one line at a time, and as you're writing code, you will notice numbers on the left hand side.",
        "The computer literally goes down line by line, making sense of what each line has to say.",
        "Everything is done sequentially, just straight down, so refrencing something that is below and hasn't happened yet will lead to a problem.",
        "Computers just read straight down like you would read a book.",
        "Programmers are the ones responsible for breaking their ideas down into the little tiny steps and writing them in a way that computers can understand them."
      ],
      "challengeSeed": [
        "133166912"
      ],
      "tests": [
        [
          "Computers look at code one line at a time",
          true
        ],
        [
          "Programmers and developers are totally different professions with very little in common.",
          false,
          "Those titles are so similar they could even describe the same job position."
        ],
        [
          "Programmers take ideas and break them down into little tiny steps the computer can understand",
          true
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd712ad8c441eddfbeb5bddf",
      "title": "Console and Logging",
      "description": [
        "We discuss what (and where) the console is, why it's useful, and show a little of how it works.",
        "The console: what it is, where you can find it, and what you use it for.",
        "The console is very commonly used to display system adminstrative messages.",
        "Your browser and your computer both have their own consoles.",
        "Once you become famlliar with it, you will find it to be a very useful and powerful tool.",
        "In Javascript, the console is used as a great tool for debugging and finding out where in your code there's a problem.",
        "One of the most important terms you'll need to remember is \"console.log()\".",
        "The process of doing this can be put anywhere in the lines of code to help find, identify, and ultimately fix specific issues.",
        "Using the Chrome browser and the Chrome console, if we type in \"console.log(\"Free Code Camp rocks!\");\", the console will literally display \"Free Code Camp rocks!\".",
        "This will also work with numbers and booleans, which are true/false statements.",
        "When consoling words, it's important to put it inside of quotations so it recognizes it's a string."
      ],
      "challengeSeed": [
        "133170880"
      ],
      "tests": [
        [
          "The console serves only small, unnecessary purposes.",
          false,
          "The console's main purpose is to debug, which is a vital step in creating code."
        ],
        [
          "You can console strings (sets of words), numbers, and booleans (true/false statements)",
          true
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7119d8c441eddfbeb5bddf",
      "title": "Variables In Code",
      "description": [
        "Variables are used frequently in Javascript and many other coding languages.",
        "In this video, we're going to talk about variables in code.",
        "Variables, just like in Algebra, are when you have a letter or a word and it represents something else.",
        "Here we're doing var x = \"Briana\". When we reference \"x\" later on, it's going to know that's Briana.",
        "When we console.log(x), it's going to output \"Briana\".",
        "But be careful - if we put console.log(\"x\"), with the x in quotation marks, it will output the letter \"x\".",
        "What I want you to take away from this video is that variables exist in code, and you can store everything from a simple string all the way up to a function, all within a simple name."
      ],
      "challengeSeed": [
        "133172920"
      ],
      "tests": [
        [
          "Variables are useful in coding languages like JavaScript.",
          true
        ],
        [
          "Variables can't stand for anything that isn't a string, number, or boolean.",
          false,
          "Variables can stand for things ranging from simple to very complex"
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7029d8c441eddfbeb5bddf",
      "title": "Source Code",
      "description": [
        "In this video we discuss what source code is, interpreters and compilers, and what open source means.",
        "Let's talk about source code: what source code is, where you'll see it, and how the computer makes sense of it.",
        "Source code itself is the actual text document that the programmer creates: they type it up, it's letters, numbers, and symbols.",
        "If you give that to somebody and have them look at that document on their computer, that's not going to help them view their email, it's not going to be a browser, it's just a text document.",
        "The computer has to have a way of interpreting that and making something really powerful run from it.",
        "There are two main ways this is done: either by an interpreter or a compiler.",
        "Every browser has an interpreter, and that's how javascript is processed.",
        "Other languages, like C++, are used with a compiler.",
        "Unlike an interpreter, the compiler does all of its work on the programmer's end.",
        "They send out their package, their product, and it's already been compiled, it can already run on a machine.",
        "Javascript, however, and other interpreter languages, you just write the javascript and the browser on the user's end has the capability to interpret it so you don't need a compiler.",
        "Everyone has an opinion to which is better (interpreter or compiler), but really each has their pros and cons, and it goes on a case by case basis.",
        "They're better at different things.",
        "Now, let's focus on what open source means.",
        "Free Code Camp is open source, meaning that all of the documentation and source code is open and accessable.",
        "You may be thinking, \"so what?\", but what's awesome is that if you want to change or improve Free Code Camp, you can write that improvement and maybe get it implemented.",
        "It's a great way for websites and software to grow in a strong and fast way because of the community working together to improve it.",
        "One unwritten rule of contributing to open source projects is that you should generally submit your improvements to also be open source, and by giving that improvement back to the public, you let others use your improvement as well."
      ],
      "challengeSeed": [
        "133177129"
      ],
      "tests": [
        [
          "Source code is a text document.",
          true
        ],
        [
          "Javascript is a compiler language.",
          false,
          "Javascript is an interpreter language"
        ],
        [
          "Free Code Camp is open source.",
          true
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7129d8b441eddfbeb5bddf",
      "title": "Routers and Packets",
      "description": [
        "In this video, we go into a little more detail about routers and packets, important concepts to understand about how the internet works.",
        "Let's talk more about routers and how they relate to networking.",
        "Routers are the things that connect different small area networks.",
        "I want to give a metaphor for this: I'm a teacher and I work at a school.",
        "Say I have a package that I need to get to someone who works in the district offices.",
        "I don't know where she is, I don't know where her office is located, but I know her name.",
        "I go to my secretary, like my first router, and I say \"Hey, I need to get this to so-and-so at the district office, can you please help me?\", and she'll say \"Sure, I don't know exactly where her office is either, but I know the next step, I can get it to the district\".",
        "So she goes on and sends it to the secretary at the district office, the next router.",
        "That secretary has no idea who I am or where I am, but she sees the name on the package and knows the end location.",
        "What I'm trying to get across here is that each router only has to know its own little network, the stops right next to it.",
        "It doesn't have to know the whole internet, but just its own connections.",
        "It can take information and say, alright, I don't know exactly where that's going, but I'll pass it along in the right direction.",
        "That's really all it takes.",
        "Routers can be different sizes, different capacities, but what they do is know their own neighborhood, take the information, and pass it in the right direction.",
        "Another thing we'll get into a little later is that the routers don't even have to have the full package of information.",
        "If one comptuer is trying to send information to another, the data might get split up between different routers and that's okay.",
        "The computers still know how to put the information back together correctly.",
        "The little pieces of information that are sent are called packets.",
        "Packets are actually little pieces of binary code (drawn on board).",
        "This is an example of what packets might look like, a visual representation of the electrical current that the computer can translate into 1's and 0's, which we all know is binary that can represent literally any digital data.",
        "These little packets are sent across through routers, and if a file is too large for one packet, it can be broken up into frames (smaller little packets).",
        "The frames don't have to take the same route to the end destination.",
        "They can take whichever route is open, whichever is fastest, and since they have the end IP address, all of the routers know where to send them.",
        "Once they get to the end destination, that computer knows how to put all of the information back together."
      ],
      "challengeSeed": [
        "133181251"
      ],
      "tests": [
        [
          "Routers have to know the whole internet.",
          false,
          "Routers just have to know the stops around them to send information in the right direction."
        ],
        [
          "Packets are little peices of binary code.",
          true
        ],
        [
          "Packets have to be sent in one piece.",
          false,
          "packets can be broken up into frames."
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7129d8a441eddfbeb5bddf",
      "title": "Hardware: Chips and Moore's Law",
      "description": [
        "We discuss what constitutes a chip and why technology gets cheaper every year.",
        "In this video we are going to be talking about chips and something called Moore's Law.",
        "You've probably noticed over the last 10 or so years, if you're going to go buy an MP3 player, you can get a lot more storage for a lot lower price.",
        "You probably have even done the thing where you're at the store and you think, \"Well, I can get one now, or I could wait 6 months and see how far the price has dropped\", which might sound ridiculous but this is actually a trend that's been happening for a long time.",
        "Let's talk about what makes a chip.",
        "A chip is full of these little things called transistors, which are switches that can either be a 1 or a 0 (noticing a theme here?).",
        "All of these transistors fit onto a chip, and that's how it stores information.",
        "What makes these chips larger/faster is the amount of transistors on a single chip.",
        "Moore's Law is the observation that the amount of transistors fit on each chip has doubled every two years since 1965.",
        "This is important because it's making technology more affordable and accessible."
      ],
      "challengeSeed": [
        "133182057"
      ],
      "tests": [
        [
          "Chips have transistors, little switches that can store a 1 or a 0.",
          true
        ],
        [
          "Moore's Law is the observation that technology doubles in speed every year.",
          false,
          "Moore's Law is the observation that the number of transistors per chip doubles every 2 years)."
        ],
        [
          "Moore's Law has slowed down in recent years.",
          false,
          "Somehow this continues to be true."
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7129d80441eddfbeb5bddf",
      "title": "Analog vs Digital and File Compression",
      "description": [
        "How computers turn analog sound into digital files, and the pros and cons of data compression.",
        "Let's discuss analog vs digital on a very basic level.",
        "Most specifically, we'll talk about how computers interpret analog sound and turn it into a digital file.",
        "An analog sound wave could look like anything, but for this example it's a wavy line.",
        "The computer takes it and measures at lots of different points, turning them into numbers.",
        "This is called sampling.",
        "Later, the computer can take those numbers and turn them into sound again.",
        "Let's also discuss data compression.",
        "The benefit of compression is that it's a smaller file: it's easier to store, it's easier to send to someone else, and it just takes up less space.",
        "One of the ways this is done in sound is that the sampling is taken less often.",
        "Another way is that it takes the measurement from a median point instead of from 0, so the numbers recorded are smaller.",
        "In images, it's done by measuring groups of pixels by 16 instead of individually.",
        "The takeaway from this video is that you'll want to use digital files as they're a higher quality, and when you're looking at compression, you want to decide how far you are willing to go to ensure the user still has the best possible experience."
      ],
      "challengeSeed": [
        "133182587"
      ],
      "tests": [
        [
          "Digital files can be made from analog sounds and analog sounds can be made from digital files.",
          true
        ],
        [
          "Compression is not worth it, because it lessens quality.",
          false,
          "Sometimes compression is a great idea. It depends on what you're trying to do and what your end goal for the product is."
        ]
      ],
      "type": "hike",
      "challengeType": 6
    },
    {
      "id": "bd7129d89441eddfbeb5bddf",
      "title": "Computer Security",
      "description": [
        "The basics of computer security, and how to make sure you protect your information.",
        "Let's cover computer security.",
        "The first thing we're going to talk about is something called a dictionary attack which has to do with your passwords.",
        "When creating your passwords, some sites require extremely specific and complicated passwords, which is actually a bit unnecessary.",
        "The type of attacks they're trying to gaurd you from are dictionary attacks.",
        "Dictionary attacks are programmed to try every word in the dictionary, or in its own database of common words and passwords, as the password for a large mass of usernames.",
        "If your password is Kangaroo, they're probably going to break into your account.",
        "Most passwords aren't this simple, but that doesn't matter.",
        "They attack such a massive amount of accounts that they only need a few passwords that are relatively simple.",
        "When creating a password, you want to use different cases, numbers, and symbols, but one of the most effective ways to create a good password is to throw some random letters in there (ex: kangarooSyCA67).",
        "Also, stay away from sequential numbers.",
        "Phishing, another thing to watch out for, is emails or webpages that mimic other valid sites to try and trick people into entering their personal information, though the site truly isn't connected to the site it's trying to mimic.",
        "In general, two ways to safeguard from these attacks are checking the address in the browser and to open a new browser and go to the website that is claiming to contact you.",
        "Let's also discuss encryption and HTTPS.",
        "If you are at Starbucks trying to access your bank account, you have reason to be suspicious that someone could see and take your information.",
        "You will want to look for a green HTTPS instead of HTTP at the beginning of the web address.",
        "That means that the site you're sending your information to is encrypting your passwords and other information, scrambling up data according to a code that only they know.",
        "In general, whenever you're showing private or sensitive information, check for HTTPS.",
        "A few other general tips: don't share passwords between important accounts.",
        "If a site you use gets hacked into, your password may be compromised regardless of its strength.",
        "Also, don't download strange files.",
        "If you don't recognise the file type like .pdf, .txt, .jpg, be wary.",
        "Some of these files you download can be very powerful and even run your computer from the inside.",
        "Lastly, keep your software updated, particularly software that interacts with the internet.",
        "One way that information can be compromised is when 'bad guys' find holes and gaps in security of older versions of softwares.",
        "Those bugs have been patched in newer versions, so if you keep everything updated, you'll avoid lots of problems.",
        "These are all very basic things you should know about how to keep your information safe on your computer."
      ],
      "challengeSeed": [
        "133186284"
      ],
      "tests": [
        [
          "Passwords should be shared with all of your accounts.",
          false,
          "Don't reuse important passwords"
        ],
        [
          "If you don't trust a site or an email, open a new browser and re-enter the intended location.",
          true
        ],
        [
          "Keeping software updated will help protect your computer and your information.",
          true
        ]
      ],
      "type": "hike",
      "challengeType": 6
    }
  ]
}
