{
  "responsive-web-design": {
    "title": "Legacy Responsive Web Design Challenges",
    "intro": [
      "In questo corso di Web Design Responsivo conoscerai i linguaggi usati per costruire le pagine web: HTML (Hypertext Markup Language) per il contenuto, e CSS (Cascade Style Sheets) per il design.",
      "Per prima cosa, costruirai un'app di foto per gatti per imparare le basi di HTML e CSS. Poi apprenderai tecniche più moderne come le variabili in CSS costruendo un pinguino, e le migliori pratiche per l'accessibilità costruendo un modulo web.",
      "Infine, imparerai a realizzare pagine web adattabili a diverse misure di schermo costruendo una card Twitter con Flexbox, e un complesso layout per blog con CSS Grid."
    ],
    "note": "Nota: Alcune estensioni del browser, come ad esempio gli ad-blocker e le estensioni per la modalità scura, possono interferire con i test. In caso di problemi, ti consigliamo di disabilitare le estensioni che modificano il contenuto o il layout delle pagine durante il corso.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "HTML Base e HTML5",
        "intro": [
          "HTML è un linguaggio di markup che utilizza una sintassi o notazione speciale che descrive la struttura di una pagina web al browser. Gli elementi HTML solitamente hanno un tag di apertura e di chiusura che danno significato al contenuto in essi racchiuso. Per esempio, diversi elementi possono descrivere il testo come un titolo, un paragrafo o la voce di una lista.",
          "In questo corso, costruirai un'app per foto di gatti per imparare a usare alcuni dei più comuni elementi HTML — i mattoni di ogni pagina web."
        ]
      },
      "basic-css": {
        "title": "CSS Base",
        "intro": [
          "CSS o Cascading Style Sheet, dice al browser come disporre il testo e altri contenuti che hai scritto in HTML. Con CSS, puoi controllare il colore, font, dimensione, spaziatura e molti altri aspetti degli elementi HTML.",
          "Ora che hai descritto la struttura della tua app di foto di gatti, dalle un po' di stile con CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Visual Design Applicato",
        "intro": [
          "Il visual design combina tipografia, teoria del colore, grafica, animazione, layout della pagina, e altro per aiutarti a esprimere il tuo messaggio in maniera unica.",
          "In questo corso imparerai ad applicare questi diversi elementi di visual design alla tua pagina web."
        ]
      },
      "applied-accessibility": {
        "title": "Accessibilità Applicata",
        "intro": [
          "Nello sviluppo web, con accessibilità ci si riferisce al contenuto web e all'UI (User Interface, cioè interfaccia utente) che deve essere comprensibile, navigabile e interattiva per una grande varietà di utenti. Questo include persone con disabilità visive, uditive, motorie o cognitive.",
          "In questo corso imparerai le migliori pratiche per costruire pagine web accessibili a tutti."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Principi di Web Design Responsivo",
        "intro": [
          "Ci sono molti dispositivi che possono accedere al web, di tutte le forme e dimensioni. Il Web design responsivo è la pratica di creare design flessibili per siti web che possano adattarsi alle diverse dimensioni, orientazioni e risoluzioni degli schermi.",
          "In questo corso, imparerai come utilizzare CSS per rendere più belle le tue pagine web, a prescindere dal dispositivo utilizzato per accedervi."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox è un metodo di layout potente e ben supportato che è stato introdotto con l'ultima versione di CSS: CSS3. Con flexbox, è facile centrare gli elementi nella pagina e creare interfacce utente dinamiche che si rimpiccioliscono e si espandono automaticamente.",
          "In questo corso, imparerai le basi di flexbox e dei layout dinamici costruendo una card di Twitter."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "CSS grid, o griglia CSS, è un nuovo standard che rende facile costruire layout responsivi complessi. Funziona trasformando un elemento HTML in una griglia, lasciandoti inserire elementi figli ovunque al suo interno.",
          "In questo corso imparerai le basi della griglia CSS costruendo vari layout complessi, incluso un blog."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Web Design Responsivo",
    "intro": [
      "In questo corso certificato di Web Design Responsivo imparerai i linguaggi che gli sviluppatori utilizzano per creare le pagine web. HTML (Hypertext Markup Language) per i contenuti e CSS (Cascading Style Sheets) per il design.",
      "Per prima cosa, costruirai un'app con foto di gatti per imparare le basi di HTML e CSS. Poi apprenderai tecniche più moderne come le variabili in CSS costruendo un pinguino, e le migliori pratiche per l'accessibilità costruendo un quiz.",
      "Infine, imparerai a realizzare pagine web adattabili a diverse misure di schermo costruendo una galleria di foto con Flexbox e il layout di un articolo di rivista con CSS Grid."
    ],
    "note": "Nota: Alcune estensioni del browser, come ad esempio gli ad-blocker e le estensioni per la modalità scura, possono interferire con i test. In caso di problemi, ti consigliamo di disabilitare le estensioni che modificano il contenuto o il layout delle pagine durante il corso.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Pagina Tributo",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai una pagina tributo per un soggetto di tua scelta, immaginario o reale."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Pagina web portfolio personale",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai la tua pagina del portfolio personale."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Landing page di un prodotto",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai una landing page per commercializzare un prodotto di tua scelta."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Modulo di sondaggio",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, creerai un modulo di sondaggio per raccogliere dati dai tuoi utenti."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Pagina di documentazione tecnica",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, si costruirà una pagina di documentazione tecnica che fungerà da istruzioni o riferimento per un argomento."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Impara l’HTML progettando una app per foto di gatti",
        "intro": [
          "I tag HTML danno a una pagina web la sua struttura. Puoi usare tag HTML per aggiungere foto, pulsanti e altri elementi alla tua pagina web.",
          "In questo corso, imparerai i tag HTML più comuni costruendo la tua app con foto di gatti."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Impara le basi del CCS realizzando il menù di un bar",
        "intro": [
          "CSS dice al browser come visualizzare la tua pagina web. Puoi usare CSS per impostare il colore, il carattere, la dimensione e altri aspetti degli elementi HTML.",
          "In questo corso, imparerai CSS progettando una pagina del menu per la pagina web di un bar."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Impara il Box Model CSS realizzando un dipinto di Rothko",
        "intro": [
          "Ogni elemento HTML costituisce una scatola – con la propria spaziatura e un bordo. Questo si chiama Box Model (o modello a scatola).",
          "In questo corso, userai CSS e il Box Model per creare i tuoi pezzi d'arte rettangolari in stile Rothko."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Impara le variabili CSS costruendo lo skyline di una città",
        "intro": [
          "Le variabili CSS ti aiutano a organizzare i tuoi stili e a riutilizzarli.",
          "In questo corso, costruirai uno skyline della città. Imparerai come configurare le variabili CSS in modo da poterle riutilizzare ogni volta che vuoi."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Impara i moduli HTML realizzando un modulo di registrazione",
        "intro": [
          "Puoi utilizzare moduli HTML per raccogliere informazioni da persone che visitano la tua pagina web.",
          "In questo corso, imparerai i moduli HTML costruendo una pagina di registrazione. Imparerai come controllare i tipi di dati che le persone possono digitare nel tuo modulo e alcuni nuovi strumenti CSS per impostare lo stile della tua pagina."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Impara l'accessibilità realizzando un Quiz",
        "intro": [
          "L'accessibilità rende la tua pagina web facile da usare per tutte le persone – anche le persone con disabilità.",
          "In questo corso, costruirai una pagina web di un quiz. Conoscerai strumenti di accessibilità come scorciatoie da tastiera, attributi ARIA e le migliori pratiche di progettazione."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Impara il CSS intermedio realizzando un dipinto di Picasso",
        "intro": [
          "In questo corso, imparerai a usare alcune tecniche CSS intermedie codificando la tua pagina web con un dipinto di Picasso. Conoscerai le icone SVG, il posizionamento CSS e rivederai le altre abilità CSS che hai imparato."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Impara il Design Responsivo creando un pianoforte",
        "intro": [
          "Il design responsivo dice alle tue pagine che aspetto devono avere su schermi di diverse dimensioni.",
          "In questo corso, utilizzerai CSS e il design responsivo per creare un pianoforte. Scoprirai anche di più sulle media query e sugli pseudo selettori."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Impara Flexbox CSS costruendo una fotogallery",
        "intro": [
          "Flexbox ti aiuta a progettare la tua pagina web in modo che vada bene su qualsiasi dimensione dello schermo.",
          "In questo corso, utilizzerai Flexbox per creare una pagina web di una galleria fotografica reattiva."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Impara CSS Grid creando una rivista",
        "intro": [
          "La griglia CSS ti dà il controllo sulle righe e le colonne della tua pagina web.",
          "In questo corso, creerai un articolo di una rivista. Imparerai come usare la griglia CSS, inclusi concetti come le righe della griglia e le colonne della griglia."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Impara la Tipografia costruendo un'etichetta nutrizionale",
        "intro": [
          "La tipografia è l'arte modellare lo stile del testo in modo che sia facilmente leggibile e adatto al suo scopo.",
          "In questo corso, userai la tipografia per creare una pagina web con un'etichetta nutrizionale. Imparerai come dare stile al testo, regolare l'altezza delle righe e posizionare il testo usando il CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Impara le trasformazioni CSS costruendo un pinguino",
        "intro": [
          "Puoi trasformare gli elementi HTML per creare design piacevoli che attirano l'occhio del tuo lettore. Puoi usare le trasformazioni per ruotare elementi, cambiarne le dimensioni, e altro.",
          "In questo corso, costruirai un pinguino. Userai le trasformazioni CSS per posizionare e ridimensionare le parti del tuo pinguino, creare un background e animare il tuo lavoro."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Impara le animazioni CSS costruendo una ruota panoramica",
        "intro": [
          "Puoi usare le animazioni CSS per attirare l'attenzione su specifiche sezioni della tua pagina web e renderle più attraenti.",
          "In questo corso creerai una ruota panoramica. Imparerai come usare CSS per animare gli elementi, trasformarli e cambiarne la velocità."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Impara di più sugli pseudo selettori CSS costruendo un foglio di bilancio",
        "intro": [
          "Puoi usare gli pseudo selettori CSS per cambiare specifici elementi HTML.",
          "In questo corso, costruirai un foglio di bilancio usando gli pseudo selettori. Imparerai come cambiare lo stile di un elemento quando ci passi sopra il mouse, e attivare altri eventi sulla tua pagina."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Impara i colori CSS creando un set di pennarelli colorati",
        "intro": [
          "Selezionare il colore corretto per la tua pagina web può renderla molto più gradevole per i tuoi lettori.",
          "In questo corso creerai un set di pennarelli colorati. Imparerai metodi diversi per impostare i valori dei colori e come accoppiare i colori."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Learn Intermediate CSS by Building a Cat Painting",
        "intro": ["", ""]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Algoritmi e Strutture Dati in JavaScript",
    "intro": [
      "Mentre HTML e CSS controllano il contenuto e lo stile della pagina, JavaScript viene utilizzato per renderla interattiva. Nella Certificazione Algoritmi e Strutture Dati in JavaScript, imparerai le basi di JavaScript, tra cui variabili, array, oggetti, loop e funzioni.",
      "Una volta che avrai appreso le basi, applicherai queste conoscenze creando algoritmi per manipolare stringhe, fattorizzare numeri, e persino calcolare l'orbita della Stazione Spaziale Internazionale.",
      "Lungo il percorso, imparerai anche due importanti stili di programmazione o paradigmi: la Programmazione Orientata agli Oggetti (Object Oriented Programming, OOP) e la Programmazione Funzionale (Functional Programming, FP)."
    ],
    "note": "Nota: Alcune estensioni del browser, come ad esempio gli ad-blocker e gli script-blocker, possono interferire con i test. In caso di problemi, ti raccomandiamo di disabilitare le estensioni che modificano o bloccano il contenuto delle pagine durante il corso.",
    "blocks": {
      "basic-javascript": {
        "title": "JavaScript Base",
        "intro": [
          "JavaScript è un linguaggio si scripting che viene utilizzato per rendere interattive le pagine web. È una delle principali tecnologie del web, insieme ad HTML e CSS, ed è supportato da tutti i browser moderni.",
          "In questo corso, imparerai i concetti di base della programmazione in JavaScript. Inizierai dalle strutture dati di base come numeri e stringhe. Poi imparerai a lavorare con array, oggetti, funzioni, loop, istruzioni if/else e molto altro."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript o ES è una versione standardizzata di JavaScript. Dato che tutti i maggiori browser seguono queste specifiche, i termini ECMAScript e JavaScript sono intercambiabili.",
          "La maggior parte del JavaScript che hai appreso finora era in ES5 (ECMAScript 5), che fu definito nel 2009. Anche se puoi ancora scrivere programmi in ES5, JavaScript è in costante evoluzione, e vengono rilasciate ogni anno nuove funzionalità.",
          "ES6, rilasciato nel 2015, ha aggiunto molte nuove potenti funzionalità al linguaggio. In questo corso conoscerai queste funzionalità, tra cui funzioni freccia, destrutturazione, classi, promise e moduli."
        ]
      },
      "regular-expressions": {
        "title": "Espressioni regolari",
        "intro": [
          "Le espressioni regolari, spesso abbreviate dall'inglese con \"regex\" o \"regexp\", sono schemi che aiutano i programmatori a far corrispondere, cercare, e sostituire dei testi. Le espressioni regolari sono molto potenti, ma possono risultare difficili da leggere perché usano dei caratteri speciali per eseguire dei riscontri più complessi.",
          "In questo corso, imparerai come usare i caratteri speciali, i gruppi di cattura, i lookahead positivi e negativi, e altre tecniche per cercare corrispondenze di qualunque testo desideri."
        ]
      },
      "debugging": {
        "title": "Debugging",
        "intro": [
          "Il debugging è il processo di revisione del tuo codice, utile a trovare i problemi e a sistemarli.",
          "I problemi col codice in generale si manifestano in tre forme: errori di sintassi che impediscono al tuo programma di avviarsi, errori di runtime quando il tuo codice si comporta in modo inaspettato, o errori di logica quando il tuo codice non funziona come desideravi.",
          "In questo corso, imparerai ad usare la console di JavaScript per fare il debugging dei programmi e prevenire problemi comuni prima che avvengano."
        ]
      },
      "basic-data-structures": {
        "title": "Strutture Dati Base",
        "intro": [
          "I dati possono essere memorizzati e letti in molti modi. Conosci già alcune strutture di dati JavaScript comuni — array e oggetti.",
          "In questo corso Strutture Dati Base imparerai di più sulle differenze tra array e oggetti, e quali utilizzare in diverse situazioni. Imparerai anche come utilizzare utili metodi JS come <code>splice()</code> e <code>Object.keys()</code> per accedere a dei dati e manipolarli."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Scrittura di Algoritmi Base",
        "intro": [
          "Un algoritmo è una serie di istruzioni passo-passo che descrivono come fare qualcosa.",
          "Per scrivere un algoritmo efficace, aiuta spezzare un problema in parti più piccole e pensare attentamente a come risolvere ogni parte con il codice.",
          "In questo corso, imparerai i fondamenti del pensiero algoritmico scrivendo algoritmi che fanno di tutto, dalla conversione delle temperature alla gestione di complessi array 2D."
        ]
      },
      "object-oriented-programming": {
        "title": "Programmazione Orientata agli Oggetti",
        "intro": [
          "La Programmazione Orientata agli Oggetti (OOP, o Object Oriented Programming), è uno dei principali approcci al processo di sviluppo del software. In OOP, gli oggetti e le classi sono utilizzati per organizzare il codice per descrivere le cose e cosa possono fare.",
          "In questo corso, imparerai i principi di base di OOP in JavaScript, tra cui la parola chiave <code>this</code>, le catene di prototipi, i costruttori e l'ereditarietà."
        ]
      },
      "functional-programming": {
        "title": "Programmazione Funzionale",
        "intro": [
          "La programmazione funzionale è un altro approccio popolare allo sviluppo del software. Nella programmazione funzionale, il codice è organizzato in funzioni di base più piccole che possono essere combinate per costruire programmi complessi.",
          "In questo corso, imparerai i concetti fondamentali della Programmazione Funzionale, comprese le funzioni pure, come evitare le mutazioni, e come scrivere codice più pulito con metodi come <code>.map()</code> e <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Scrittura di Algoritmi Intermedio",
        "intro": [
          "Ora che conosci le basi del pensiero algoritmico, insieme a OOP e alla Programmazione Funzionale, prova le tue abilità con le sfide sulla scrittura di Algoritmi di livello intermedio."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "Progetti di Algoritmi e Strutture Dati JavaScript",
        "intro": [
          "Ci siamo — è il momento di mettere al lavoro le tue nuove abilità JavaScript. Questi progetti sono simili alle sfide di scrittura di algoritmi che hai fatto prima – solo molto più difficili.",
          "Completa questi 5 progetti JavaScript per ottenere la Certificazione Algoritmi e Strutture Dati in JavaScript."
        ]
      }
    }
  },
  "2022/javascript-algorithms-and-data-structures": {
    "title": "Algoritmi e Strutture Dati JavaScript (Beta)",
    "intro": ["segnaposto", "segnaposto"],
    "note": "",
    "blocks": {
      "build-a-caesars-cipher-project": {
        "title": "Crea un cifrario di Cesare",
        "intro": ["", ""]
      },
      "build-a-cash-register-project": {
        "title": "Crea un registro di cassa",
        "intro": ["", ""]
      },
      "build-a-palindrome-checker-project": {
        "title": "Crea un verificatore di palindromi",
        "intro": ["", ""]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Crea un convertitore di numeri romani",
        "intro": ["", ""]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Crea un validatore di numeri telefonici",
        "intro": ["", ""]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Impara JavaScript Base creando un gioco di ruolo",
        "intro": ["", ""]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Impara la validazione dei moduli creando un contatore di calorie",
        "intro": ["", ""]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Impara programmazione funzionale creando un foglio di calcolo",
        "intro": ["", ""]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Learn Modern JavaScript Methods By Building Football Team Cards",
        "intro": ["", ""]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Impara metodi per array avanzati costruendo una calcolatrice statistica",
        "intro": ["", ""]
      },
      "learn-data-structures-by-building-a-shopping-cart": {
        "title": "Impara le strutture di dati costruendo un carrello degli acquisti",
        "intro": ["", ""]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Learn Fetch and Promises By Building an fCC Authors Page",
        "intro": ["", ""]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Learn Regular Expressions by Building a Spam Filter",
        "intro": ["", ""]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Learn Basic Algorithmic Thinking by Building a Number Sorter",
        "intro": ["", ""]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Librerie di sviluppo Front End",
    "intro": [
      "Ora che hai familiarità con HTML, CSS, e JavaScript, aumenta le tue competenze conoscendo alcune delle più popolari librerie di front-end del settore.",
      "Nella Certificazione Librerie di Sviluppo Front End, imparerai come definire rapidamente lo stile del tuo sito con Bootstrap. Imparerai anche come aggiungere la logica ai tuoi stili CSS e ad estenderli con Sass.",
      "Più tardi, costruirai un carrello e altre applicazioni per imparare a creare potenti applicazioni a pagina singola (Single Page Application, SPA) con React e Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap è un framework front-end utilizzato per progettare pagine web e applicazioni responsive. Esso adotta un approccio mobile-first per lo sviluppo web e include stili e classi CSS precostruiti, oltre ad alcune funzionalità JavaScript.",
          "In questo corso, imparerai come costruire siti web responsivi con Bootstrap, e a utilizzare le sue classi per stilizzare pulsanti, immagini, moduli, navigazione e altri elementi comuni."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery è una delle librerie JavaScript più utilizzate al mondo.",
          "Nel 2006, quando è stata rilasciata, tutti i principali browser gestivano JavaScript in modo leggermente diverso. jQuery ha semplificato il processo di scrittura di JavaScript lato client, e ha anche garantito che il codice funzioni allo stesso modo in tutti i browser.",
          "In questo corso, imparerai come usare jQuery per selezionare, rimuovere, clonare e modificare diversi elementi nella pagina."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, o \"Syntactically Awesome StyleSheets\", è un'estensione linguistica di CSS. Aggiunge funzionalità che non sono disponibili nel CSS di base, che ti rendono più facile semplificare e mantenere i fogli di stile per i tuoi progetti.",
          "In questo corso di Sass imparerai come memorizzare i dati in variabili, annidare CSS, creare stili riutilizzabili con mixin, aggiungere logica e cicli ai tuoi stili, e altro ancora."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React è una popolare libreria JavaScript per costruire interfacce utente riutilizzabili e basate su componenti, per pagine web o applicazioni.",
          "React combina HTML con funzionalità JavaScript nel proprio linguaggio di markup chiamato JSX. React facilita anche la gestione del flusso di dati attraverso l'applicazione.",
          "In questo corso, imparerai come creare diversi componenti React, gestire i dati sotto forma di proprietà dello stato, utilizzare diversi metodi del ciclo di vita come <code>componentDidMount</code>, e molto altro ancora."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "Man mano che le applicazioni crescono in termini di dimensioni e ambito di applicazione, la gestione dei dati condivisi diventa molto più difficile. Redux è definito come un \"contenitore di stato prevedibile per le app JavaScript\" che aiuta a garantire che le tue app funzionino in modo prevedibile, e siano facili da testare.",
          "Dato che è possibile utilizzare Redux con qualsiasi libreria di visualizzazione, presentiamo Redux qui prima di combinarlo con React nel prossimo gruppo di corsi.",
          "In questo corso, imparerai i fondamenti degli store, actions, reducers e middleware di Redux per gestire i dati in tutta l'applicazione."
        ]
      },
      "react-and-redux": {
        "title": "React e Redux",
        "intro": [
          "React e Redux sono spesso citati insieme, e a buona ragione. Lo sviluppatore che ha creato Redux era uno sviluppatore React che voleva rendere più facile la condivisione dei dati tra i diversi componenti.",
          "Ora che sai come gestire il flusso di dati condivisi con Redux, è il momento di combinare tale conoscenza con React. Nei corsi React e Redux, costruirai un componente React e imparerai a gestire lo stato localmente al livello dei componenti e in tutta l'applicazione con Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Progetti sulle Librerie di Sviluppo Front-End",
        "intro": [
          "È tempo di mettere alla prova le tue capacità di sviluppo con le librerie di sviluppo del front-end. Usa Bootstrap, jQuery, Sass, React e Redux per costruire 5 progetti che testeranno tutto quello che hai imparato fino a questo punto.",
          "Completa tutti e 5 i progetti e otterrai la Certificazione Librerie di Sviluppo Front End."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Data Visualization",
    "intro": [
      "I dati ci circondano, ma non ci dicono molto senza forma o contesto.",
      "Nella Certificazione Visualizzazione dei Dati, costruirai diagrammi, grafici e mappe per presentare diversi tipi di dati con la libreria D3.js.",
      "Imparerai anche JSON (JavaScript Object Notation), e come lavorare con i dati online utilizzando un'API (Application Programming Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Visualizzazione dei dati con D3",
        "intro": [
          "D3, o D3.js, sta per Data Driven Documents. È una libreria JavaScript per creare visualizzazioni di dati dinamiche e interattive nel browser.",
          "D3 è costruito per lavorare con standard web comuni, vale a dire HTML, CSS, e Scalable Vector Graphics (SVG).",
          "D3 supporta molti tipi diversi di formati di dati di input. Poi, utilizzando i suoi potenti metodi integrati, potrai trasformare questi dati in differenti diagrammi, grafici e mappe.",
          "Nei corsi di Visualizzazione dei Dati con D3, imparerai come lavorare con i dati per creare diversi grafici a barre, grafici, elementi di sovrimpressione e altri ingredienti per creare visualizzazioni di dati dinamiche e attraenti."
        ]
      },
      "json-apis-and-ajax": {
        "title": "API JSON e AJAX",
        "intro": [
          "In modo simile a come le Interfacce Utente (UI) aiutano le persone a utilizzare i programmi, le API (Application Programming Interfaces) aiutano i programmi a interagire con gli altri programmi. Le API sono strumenti che i computer usano per comunicare tra di loro, in parte per inviare e ricevere dati.",
          "I programmatori usano spesso AJAX (Asynchronous JavaScript and XML) quando lavorano con le API. AJAX si riferisce a un gruppo di tecnologie che fanno richieste asincrone a un server per trasferire dati, e quindi caricare nella pagina tutti i dati restituiti. E i dati trasferiti tra il browser e il server sono spesso in un formato chiamato JSON (JavaScript Object Notation).",
          "Questo corso ti insegnerà le basi su come lavorare con le API e le diverse tecnologie AJAX nel browser."
        ]
      },
      "data-visualization-projects": {
        "title": "Progetti di Visualizzazione dei Dati",
        "intro": [
          "Ora che hai imparato a lavorare con le tecnologie D3, API e AJAX, mettete alla prova le tue abilità con questi 5 progetti di visualizzazione dei dati.",
          "In questi progetti, è necessario recuperare i dati e analizzare un dataset, quindi utilizzare D3 per creare diverse visualizzazioni. Terminali tutti per ottenere la certificazione Visualizzazione dei Dati."
        ]
      },
      "d3-dashboard": {
        "title": "Dashboard D3",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Database Relazionali",
    "intro": [
      "Per questi corsi, userai veri strumenti e software da sviluppatori inclusi VSCode, PostgreSQL, e la riga di comando Linux / Unix per completare i tutorial interattivi e creare progetti.",
      "Questi corsi iniziano con comandi Bash di base. Usando il terminale imparerai tutto da navigare e manipolare il sistema dei file, creare script in bash, tutto quanto fino all'uso avanzato.",
      "Poi, imparerari come creare e usare un database relazionale con PostgreSQL, un sistema di gestione database, e SQL, il linguaggio di questi database.",
      "Infine, imparerai Git, il sistema di controllo versione, uno strumento essenziale per ogni sviluppatore."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "Database Corpi Celesti",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai un database di corpi celesti usando PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Gioco di indovinare il numero",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, userai Bash scripting, PostgreSQL e Git per creare un gioco di indovinare il numero che esegue nel terminale e salva le informazioni dell'utente."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "Database della Tavola Periodica",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, creerai uno script Bash per ottenere informazioni sugli elementi chimici da un database della tavola periodica."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Pianificatore Appuntamento Salone",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, creerai un programma Bash interattivo che utilizza PostgreSQL per tenere traccia dei clienti e degli appuntamenti per il tuo salone."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "Database Coppa Del Mondo",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, creerai uno script di Bash che inserisce informazioni da partite della coppa del mondo in PostgreSQL, e poi fare query al database per ottenere statistiche utili."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Impara Bash avanzato costruendo un traduttore Kitty Ipsum",
        "intro": [
          "C'è più dei comandi Bash di quanto tu possa pensare.",
          "In questo corso da 140 lezioni, imparerai comandi un po' più complessi e i dettagli di come i comandi lavorano."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Impara Bash e SQL costruendo uno shop di noleggio biciclette",
        "intro": [
          "In questo corso da 210 lezioni, costruirai un programma Bash interattivo che immagazzina informazioni per il tuo negozio di noleggio biciclette che usa PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Impara Bash costruendo un codice Boilerplate",
        "intro": [
          "Il terminale ti permette di mandare comandi di testo al tuo computer che possono manipolare il sistema dei file, eseguire programmi, automatizzare attività, e molto altro.",
          "In questo corso da 170 lezioni, imparerai i comandi del terminale creando un boilerplate di un sito web usando solo la riga di comando."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Impara lo Scripting Bash costruendo cinque programmi",
        "intro": [
          "Scripting in Bash combina comandi del terminale e logica in programmi che possono eseguire o automatizzare attività e moltro altro.",
          "In questo corso con 220 lezioni, imparerai più comandi per il terminale e come usarli con script di Bash creando cinque piccoli programmi."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Impara Git costruendo un oggetto di riferimento SQL",
        "intro": [
          "Git è un sistema di controllo versione che tiene traccia di tutti i cambiamenti che fai al tuo codice.",
          "In questo corso da 240 lezioni, imparareai come Git tiene traccia del tuo codice creando un oggetto che contiene comadni SQL comunemente usati."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Impara Nano costruendo un castello",
        "intro": [
          "Nano è un programma che ti permette di modificare file direttamente dal terminale.",
          "In questo corso di 40 lezioni, imparerai a modificare i file nel terminale con Nano mentre costruisci un castello."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Impara i database relazionali costruendo un database Mario",
        "intro": [
          "Un database relazionale organizza i dati in tabelle che sono legate assieme tramite delle relazioni.",
          "In questo corso da 165 lezioni, imparerai le basi di un database relazionale creando un database PostgreSQL pieno di personaggi di videogiochi."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Apprendi SQL costruendo un database degli studenti: Parte 1",
        "intro": [
          "SQL, o Structured Query Language (linguaggio strutturato di richieste), è un linguaggio per comunicare con un database relazionale.",
          "In questo corso di 140 lezioni, creerai uno script Bash che utilizza SQL per inserire informazioni sui tuoi studenti di informatica in PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Apprendi SQL costruendo un database degli studenti: Parte 2",
        "intro": [
          "I comandi SQL join sono usati per combinare informazioni da diverse tabelle in un database relazionale",
          "In questo corso da 140 lezioni, completerai il tuo database degli studenti andando più a fondo nei comandi SQL."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Sviluppo Back End e API",
    "intro": [
      "Fino a questo punto, hai usato solo JavaScript sul front-end per aggiungere interattività a una pagina, risolvere sfide algoritmiche o costruire una Single Page Application. Ma JavaScript può essere utilizzato anche nel backend (cioè lato server), per costruire intere applicazioni web.",
      "Oggi, uno dei modi più popolari per costruire applicazioni è attraverso i microservizi, che sono piccole applicazioni modulari che lavorano insieme per formare qualcosa di più grande.",
      "Nella Certificazione Sviluppo Back End e API, imparerai a scrivere app per il backend con Node.js e npm. Costruirai anche applicazioni web con il framework Express, e costruirai un microservizio Trova Persone con MongoDB e la libreria Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Gestire i pacchetti con NPM",
        "intro": [
          "npm (Node Package Manager) è uno strumento da riga di comando per installare, creare e condividere pacchetti di codice JavaScript scritto per Node.js. Ci sono molti pacchetti open source disponibili su npm, quindi prima di iniziare un progetto, prenditi del tempo per esplorarli in modo da non finire per ricreare la ruota per cose come lavorare con gli insiemi di dati o recuperare i dati da un'API.",
          "In questo corso, imparerai le basi dell'utilizzo di npm, incluso come lavorare con il <code>package.json</code> e come gestire le dipendenze installate."
        ]
      },
      "basic-node-and-express": {
        "title": "Node e Express Base",
        "intro": [
          "Node.js è un runtime JavaScript che permette agli sviluppatori di scrivere programmi backend (lato server) in JavaScript. Node.js viene fornito con una manciata di moduli incorporati — piccoli programmi indipendenti — che aiutano in questo. Alcuni dei moduli principali includono HTTP, che agisce come un server e File System, un modulo per leggere e modificare i file.",
          "Nell'ultimo gruppo di corsi hai imparato ad installare e gestire pacchetti da npm, che sono collezioni di moduli più piccoli. Questi pacchetti possono aiutarti a costruire applicazioni più grandi e complesse.",
          "Express è un framework per applicazioni web leggero ed è uno dei pacchetti più popolari su npm. Express rende molto più facile creare un server e gestire l'instradamento (routing) per l'applicazione, che gestisce cose come dirigere le persone alla pagina corretta quando visitano un determinato endpoint come <pre>/blog</pre>.",
          "In questo corso, imparerai le basi di Node e Express, incluso come creare un server, servire file diversi, e gestire richieste diverse dal browser."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB e Mongoose",
        "intro": [
          "MongoDB è un'applicazione di databse che memorizza documenti JSON (o record) che puoi usare nella tua applicazione. A differenza di SQL, un altro tipo di database, MongoDB è un database non relazionale o un database \"NoSQL\". Questo significa che MongoDB memorizza tutti i dati associati in un record al posto di memorizzarli in varie tabelle preimpostate come in un database SQL.",
          "Mongoose è un popolare pacchetto npm che interagisce con MongoDB. Con Mongoose puoi utilizzare dei semplici oggetti JavaScript al posto di JSON, ciò rende più facile lavorare con MongoDB. Inoltre, ti permette di creare schemi per i tuoi documenti chiamati schemas, così da non salvare il tipo di dato sbagliato e causare bug in seguito.",
          "Nei corsi di MongoDB e Mongoose, imparerai i fondamenti di come si lavora con dati persistenti, incluso come impostare un modello, e salvare, cancellare e trovare documenti nel database."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Progetti di sviluppo Back End e API",
        "intro": [
          "Hai già lavorato con le API prima, ma ora che conosci npm, Node, Express, MongoDB e Mongoose, è ora di costruirle. Costruisci su tutto quello che hai imparato fino a questo punto per creare 5 diversi microservizi, che sono applicazioni più piccole, con un ambito di applicazione ristretto.",
          "Dopo averli creati, avrai 5 belle API di microservizi che potrai mostrare a amici, familiari e potenziali datori di lavoro. Oh, e avrai anche una certificazione nuova di zecca su Sviluppo Back End e API."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Garanzia di Qualità",
    "intro": [
      "Mano a mano che i tuoi programmi o applicazioni web diventeranno più complessi, vorrai testarli per assicurarti che le nuove modifiche non compromettano la loro funzionalità originaria.",
      "Nella Certificazione Garanzia di Qualità imparerai a scrivere i test con Chai per garantire che le tue applicazioni funzionino nel modo in cui ti aspetti.",
      "Poi costruirai un'applicazione di chat per apprendere concetti avanzati Node e Express. Utilizzerai anche Pug come motore di modelli, Passport per l'autenticazione e Socket.io per la comunicazione in tempo reale tra il server e i client connessi."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Garanzia di qualità e test con Chai",
        "intro": [
          "Chai è una libreria di test JavaScript che ti aiuta a confermare che il tuo programma si comporta ancora come ti aspetti dopo aver apportato modifiche al tuo codice.",
          "Utilizzando Chai, potrai scrivere test che descrivono i requisiti del programma e vedere se il programma li soddisfa.",
          "In questo corso, familiarizzerai con concetti come assertion, deep equality, truthiness, testi di API, e altri fondamentali per testare le applicazioni JavaScript."
        ]
      },
      "advanced-node-and-express": {
        "title": "Node ed Express avanzati",
        "intro": [
          "Ora è il momento di approfondire Node.js e Express.js costruendo un'applicazione di chat con un sistema di accesso.",
          "Per implementare il sistema di accesso in modo sicuro, è necessario conoscere l'autenticazione. Questo è l'atto di verificare l'identità di una persona o di un processo.",
          "In questo corso, imparerai come utilizzare Passport per gestire l'autenticazione, Pug per creare modelli riutilizzabili per costruire rapidamente il front-end, e i web sockets per la comunicazione in tempo reale tra i client e il server."
        ]
      },
      "quality-assurance-projects": {
        "title": "Progetti di Garanzia di Qualità",
        "intro": [
          "Python è uno dei linguaggi di programmazione più popolari e flessibili al giorno d'oggi. Puoi usarlo per tutto, dallo scripting di base all'apprendimento automatico (machine learning).",
          "Dopo aver completato questi progetti di Garanzia di Qualità, avrai altri 5 progetti al tuo attivo e una nuova certificazione da mostrare nel tuo portfolio."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Calcolo scientifico con Python",
    "intro": [
      "Python è uno dei linguaggi di programmazione più popolari e flessibili al giorno d'oggi. Puoi usarlo per tutto, dallo scripting di base all'apprendimento automatico (machine learning).",
      "Nella Certificazione Calcolo Scientifico con Python, imparerai i fondamentali di Python come variabili, cicli, condizionali e funzioni. Quindi passerai rapidamente a strutture di dati complesse, networking, database relazionali e visualizzazione dei dati."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python per Tutti",
        "intro": [
          "Python per tutti è una serie di corsi video gratuiti che insegna le basi dell'utilizzo di Python 3.",
          "I corsi sono stati creati dal Dr. Charles Severance (noto anche come Dr. Chuck). È Clinical Professor presso la University of Michigan School of Information, dove insegna vari corsi orientati alla tecnologia tra cui programmazione, progettazione di database e sviluppo web."
        ]
      },
      "scientific-computing-with-python-projects": {
        "title": "Progetti di Calcolo scientifico con Python",
        "intro": [
          "È ora di mettere alla prova le tue abilità Python. Completando questi progetti, dimostrerai di avere una buona conoscenza di base di Python e ti qualificherai per la Certificazione Calcolo Scientifico con Python."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Analisi dei dati con Python",
    "intro": [
      "L'analisi dei dati esiste da molto tempo, ma fino a pochi anni fa, gli sviluppatori l'hanno praticata utilizzando costosi strumenti proprietari come Tableau. Recentemente però, Python, SQL e altre librerie aperte hanno cambiato per sempre il mondo dell'analisi dei dati.",
      "Nella Certificazione Analisi dei dati con Python, imparerai i fondamenti dell'analisi dei dati con Python. Alla fine di questa certificazione, saprai leggere i dati da fonti come CSV e SQL, e come usare librerie come Numpy, Pandas, Matplotlib, e Seaborn per elaborare e visualizzare i dati."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Analisi dei dati con Python",
        "intro": [
          "In questi videocorsi completi, creati da Santiago Basulto, imparerai l'intero processo di analisi dei dati. Potrai leggere i dati da più fonti (CSV, SQL, Excel), elaborarli utilizzando NumPy e Pandas e visualizzarli utilizzando Matplotlib e Seaborn,",
          "Inoltre, abbiamo incluso un corso completo di Jupyter Notebook e un rapido riferimento Python per aggiornare le tue abilità di programmazione."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Apprendi le basi della libreria NumPy nel seguente videocorso creato da Keith Galli.",
          "In questo corso, imparerai come funziona NumPy e come si confronta con le liste integrate di Python. Imparerai anche a scrivere codice con NumPy, indicizzazione, riformulazione, statistiche applicate, e molto altro."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Progetti di Analisi dei dati con Python",
        "intro": [
          "Ci sono molti modi per analizzare i dati con Python. Completando questi progetti, dimostrerai di avere una buona conoscenza dei fondamenti dell'analisi dei dati con Python.",
          "Completali tutti per ottenere la tua certificazione Analisi dei Dati con Python."
        ]
      }
    }
  },
  "information-security": {
    "title": "Sicurezza dell'Informazione",
    "intro": [
      "Con tutto quello che facciamo online, c'è una grande quantità di informazioni sensibili a rischio: indirizzi e-mail, password, numeri di telefono e molto altro.",
      "Con la Certificazione Sicurezza dell'Informazione, costruirai una web app sicura con HelmetJS per apprendere i fondamenti della protezione delle informazioni delle persone online.",
      "Costruirai anche un client TCP e uno scanner Nmap e un port scanner in Python. Questo ti aiuterà a imparare le basi del penetration testing — una componente importante di una buona sicurezza dell'informazione."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Sicurezza dell'informazione con HelmetJS",
        "intro": [
          "Questo corso di programmazione si concentra su HelmetJS, un tipo di middleware per le applicazioni basate su Express, che imposta automaticamente le intestazioni HTTP. In questo modo può impedire che informazioni sensibili vengano accidentalmente trasmesse tra il server e il client.",
          "Completare questi corsi ti aiuterà a capire come proteggere il tuo sito web da comportamenti dannosi."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python per il Penetration Testing",
        "intro": [
          "Questi video corsi ti insegneranno il penetration testing con Python. Conosciuto anche come pen test, il penetration testing è un attacco simulato contro un sistema per controllarne le vulnerabilità.",
          "In questo corso, imparerai cosa sono i socket, come creare un server e un client TCP, come costruire uno scanner Nmap, e altri strumenti e tecniche che i pen tester utilizzano quotidianamente."
        ]
      },
      "information-security-projects": {
        "title": "Progetti di Sicurezza dell'Informazione",
        "intro": [
          "Ora è il momento di mettere in pratica le tue nuove abilità di sicurezza dell'informazione. Questi progetti ti daranno la possibilità di applicare le abilità, i principi e i concetti di sicurezza dell'informazione che hai appreso.",
          "Quando avrai finito, avrai molti progetti di sicurezza dell'informazione al tuo attivo, insieme a una certificazione che potrai mostrare agli amici, alla famiglia e ai datori di lavoro."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Machine Learning con Python",
    "intro": [
      "L'apprendimento automatico (Machine Learning), ha molte applicazioni pratiche che potrai utilizzare nei tuoi progetti o al lavoro.",
      "Nella Certificazione Machine Learning con Python, userai il framework TensorFlow per costruire diverse reti neurali ed esplorare tecniche più avanzate come l'elaborazione del linguaggio naturale e l'apprendimento rinforzato.",
      "Potrai anche immergerti nelle reti neurali e imparare i principi dietro al funzionamento delle reti neurali profonde, ricorrenti e convoluzionali."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "Tensorflow",
        "intro": [
          "TensorFlow è un framework open source che rende l'apprendimento automatico e le reti neurali più facile da usare.",
          "Il seguente video corso è stato creato da Tim Ruscica, noto anche come “Tech With Tim”. Ti aiuterà a capire TensorFlow e alcune delle sue potenti capacità."
        ]
      },
      "how-neural-networks-work": {
        "title": "Come Funzionano le Reti Neurali",
        "intro": [
          "Le reti neurali sono al centro di quella che oggi chiamiamo intelligenza artificiale. Storicamente però sono state difficili da comprendere. Soprattutto per i principianti nel campo del machine learning.",
          "Anche se sei completamente nuovo alle reti neurali, questi video corsi di Brandon Rohrer ti faranno sentire a tuo agio con i concetti e la matematica che stanno dietro."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Progetti di Machine Learning con Python",
        "intro": [
          "Il Machine learning ha molte applicazioni pratiche. Completando questi progetti di codifica gratuiti e impegnativi, dimostrerai di avere una buona conoscenza dei fondamenti dell'apprendimento automatico, e ti qualificherai per la tua Certificazione Machine Learning con Python."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "Algebra Universitaria con Python",
    "intro": [
      "Questo corso è progettato come un corso universitario di un semestre. Si compone di video didattici, con notebook di Google Colaboratory per seguire in modo interattivo, attività e progetti stimolanti.",
      "Affrontando le varie parti di questo corso in sequenza, otterrai una piena comprensione dell'algebra e di come scrivere del codice Python per risolvere problemi di algebra.",
      "Durante questo corso, costruirai anche un notebook Colab di algebra, che potrai utilizzare come calcolatrice personalizzata. Questo corso (e il codice che scriverai) ti darà le basi per una comprensione più profonda della matematica e della scienza dei dati."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Rapporti e Proporzioni",
        "intro": [
          "Il tuo viaggio inizia qui, mentre impari come configurare un notebook Colab in grado di eseguire il codice Python. Utilizza il notebook per seguire i video per imparare rapporti e proporzioni utilizzando Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Risolvere per X",
        "intro": [
          "Questa unità tratta di come risolvere per un numero sconosciuto (spesso indicato come \"x\") usando l'algebra scritta e il codice Python."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Frazioni e Decimali",
        "intro": [
          "Questa unità tratta della conversione di decimali in frazioni e percentuali."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Funzioni e Grafici",
        "intro": ["In questa unità apprenderai le funzioni matematiche."]
      },
      "learn-linear-functions": {
        "title": "Funzioni Lineari",
        "intro": [
          "Questa unità ti mostrerà come sviluppare equazioni lineari da due punti."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Fattori Comuni e Radici Quadrate",
        "intro": [
          "In questa unità, imparerai a trovare i fattori comuni e a raccoglierli. Ciò sarà utile nella semplificazione delle frazioni e nella fattorizzazione delle radici quadrate."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Calcolatrice Multifunzione",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai una calcolatrice multifunzione."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Graficare Sistemi di Equazioni",
        "intro": [
          "Questa unità ti mostrerà come tracciare il grafico di due equazioni sullo stesso piano di coordinate, in modo da poter vedere dove si intersecano."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Risolvere Sistemi di Equazioni",
        "intro": [
          "In questa unità, imparerai come risolvere un sistema di due equazioni (con due variabili) senza tracciare il grafico. Vedrai come si può fattorizzare un'equazione e risolvere per una determinata variabile con Python. Alla fine di questa unità, sarai in grado di risolvere e graficare un sistema di equazioni con un blocco di codice."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Applicazioni dei Sistemi Lineari",
        "intro": [
          "In questa unità, vedrai come è possibile utilizzare l'algebra che hai imparato finora per risolvere i problemi del mondo reale."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Equazioni Quadratiche",
        "intro": [
          "Questa unità andrà oltre le equazioni lineari, lavorando con esponenti e tracciando parabole. Imparerai come trovare i punti chiave delle parabole e come risolvere le equazioni quadratiche."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Calcolatrice Grafica",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai una calcolatrice grafica."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Grafici Genitori e Polinomi",
        "intro": [
          "Questa unità ti mostrerà molti tipi diversi di grafici \"genitori\", i modelli che costituiscono la base di grafici più complicati. I polinomi sono espressioni matematiche con \"elementi multipli\" - le equazioni più complicate costruite con modelli di base. Vedrai come appaiono questi grafici, come modificarli e come fare fare tutto ciò con il codice Python."
        ]
      },
      "build-three-math-games-project": {
        "title": "Tre Giochi di Matematica",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto costruirai tre giochi di matematica."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Applicazioni Economiche dell'Algebra Universitaria",
        "intro": [
          "Questa unità ti mostrerà come applicare le tue abilità nel risolvere equazioni e tracciare grafici per trovare costo, ricavo e profitto. Scriverai il codice per ottenere la funzione della domanda da due punti. Vedrai come il prezzo influenza il grafico del profitto e come tutte queste equazioni sono collegate tra di loro."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Interesse Semplice e Composto",
        "intro": [
          "Questa unità ti mostrerà come calcolare gli interessi, la rata di un prestito e il valore stimato di investimenti. Vedrai la formula matematica la trasformerai in codice. Poiché queste formule tendono a essere complicate, apprezzerai di avere il codice in cui è possibile modificare solo alcuni valori."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Esponenziali e Logaritmi",
        "intro": [
          "Questa unità vi mostrerà come esponenziali e logaritmi sono funzioni inverse, e come è possibile utilizzare queste funzioni in varie applicazioni."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Calcolatrice Finanziaria",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai una calcolatrice finanziaria."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "Algebra Universitaria con Python: Conclusione",
        "intro": [
          "Questa è l'ultima unità di questo corso. Diamo un'occhiata a come è possibile collegare le conoscenze di matematica e Python con dati esterni."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Data Graph Explorer",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto costruirai un data graph explorer."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Preparazione per il colloquio di lavoro per programmatori",
    "intro": [
      "Se stai cercando esercizi di programmazione gratuiti per prepararti al tuo prossimo colloquio di lavoro, sei nel posto giusto.",
      "Questa sezione contiene centinaia di sfide di programmazione che testano la tua conoscenza di algoritmi, strutture di dati e matematica. Ha anche una serie di progetti pronti da portare a casa che puoi utilizzare per rafforzare le tue competenze, o aggiungere al tuo porfolio."
    ],
    "note": "Il Progetto Eulero è stato spostato in un corso indipendente. Torna al curriculum per vedere l'elenco dei corsi che offriamo.",
    "blocks": {
      "algorithms": {
        "title": "Algoritmi",
        "intro": [
          "Questi esercizi di programmazione gratuiti ti aiuteranno a comprendere alcuni algoritmi comuni che probabilmente incontrerai nella vita reale. Sono una grande opportunità per migliorare le tue competenze logiche e di programmazione.",
          "Questi algoritmi sono spesso utilizzati nei colloqui di lavoro per testare le abilità di un candidato. Ti forniremo spiegazioni chiare e concise su come funzionano in modo che tu possa implementare una soluzione per ciascuno di essi."
        ]
      },
      "data-structures": {
        "title": "Strutture Dati",
        "intro": [
          "Questi corsi di programmazione gratuita sono pensati per aiutarti a gestire strutture dati grandi e complesse con le quali potresti non essere ancora familiare.",
          "Con questi corsi scoprirai i vari tipi di struttura di dati e imparerai a implementare degli algoritmi per rafforzare la tua comprensione di essi."
        ]
      },
      "take-home-projects": {
        "title": "Progetti da completare a casa",
        "intro": [
          "I colloqui di lavoro per programmatori sono sempre stati stressanti. Ai candidati viene a volte chiesto di completare un lavoro a casa. Questi tipi di colloquio di solito richiedono molto lavoro, ma sono un ottimo modo per i datori di lavoro per vedere cosa il candidato è in grado di fare.",
          "Costruisci i progetti facoltativi per fare delle esercitazioni extra. Prenditi il tempo necessario, ampliali, e metteli nel tuo curriculum o portfolio per mostrarli ai potenziali datori di lavoro."
        ]
      },
      "rosetta-code": {
        "title": "Codice Rosetta",
        "intro": [
          "Fai salire di livello le tue capacità creative di problem solving con queste attività di programmazione gratuite dalla libreria classica Rosetta Code.",
          "Queste sfide possono rivelarsi difficili, ma spingeranno la tua logica algoritmica a nuove vette.",
          "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Fonte: Codice Rosetta</a>"
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "The Odin Project",
    "intro": [
      "The Odin Project è una di quelle risorse che \"avrei voluto mentre stavo imparando\". ",
      "Non tutti hanno accesso a un'educazione all'informatica o ai fondi per frequentare una scuola intensiva di programmazione e, in ogni caso, sono soluzioni non adatte a tutti.",
      "Questo progetto è stato ideato per colmare il vuoto per le persone che stanno cercando di farcela da sole ma desiderano un'istruzione di alta qualità."
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Impara i Fondamenti di HTML",
        "intro": ["A description is to be determined"]
      },
      "top-working-with-text": {
        "title": "Working with Text",
        "intro": ["A description is to be determined"]
      },
      "top-links-and-images": {
        "title": "Links and Images",
        "intro": ["A description is to be determined"]
      },
      "top-build-a-recipe-project": {
        "title": "Impara i Fondamenti di HTML Creando una Pagina di Ricette",
        "intro": ["A description is to be determined"]
      },
      "top-learn-css-foundations": {
        "title": "Impara i Fondamenti di CSS",
        "intro": ["A description is to be determined"]
      },
      "top-learn-css-foundations-projects": {
        "title": "Learn CSS Foundations Projects",
        "intro": ["A description is to be determined"]
      },
      "top-learn-css-specificity": {
        "title": "Learn CSS Specificity",
        "intro": ["A description is to be determined"]
      },
      "top-the-box-model": {
        "title": "Learn the Box Model",
        "intro": ["A description is to be determined"]
      }
    }
  },
  "project-euler": {
    "title": "Progetto Eulero",
    "intro": [
      "Completa le sfide di programmazione sottostanti, dagli enormi archivi del Progetto Eulero. Consolideranno le tue conoscenze in materia di algoritmi e matematica.",
      "Questi problemi variano in difficoltà e, per molti, l'esperienza di apprendimento è a catena induttiva. Cioè, risolvendo un problema, sarai esposto a un nuovo concetto che consente di affrontare un problema precedentemente inaccessibile. Riesci a finirli tutti?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Problemi del Progetto Eulero da 1 a 100",
        "intro": [
          "In questa prima serie di sfide, utilizzerai concetti matematici come la sequenza di Fibonacci, la teoria dei numeri primi e la combinatoria per scrivere algoritmi efficienti per risolvere dei problemi."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Problemi del Progetto Eulero da 101 a 200",
        "intro": [
          "In questa serie di sfide, ti baserai sulle competenze che hai acquisito nella prima parte del corso e utilizzerai concetti più avanzati come il calcolo vettoriale, la piramide di Pascal e l'algoritmo RSA per risolvere dei problemi in modo efficiente."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Problemi del Progetto Eulero da 201 a 300",
        "intro": [
          "In questa serie di sfide, continuerai a usare ciò che hai imparato in precedenza e a utilizzare concetti come il teorema binomiale, i numeri di Hamming e la sequenza di Collatz per affinare ulteriormente le tue abilità matematiche e di problem solving."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Problemi del Progetto Eulero da 301 a 400",
        "intro": [
          "Qui continuerai a modellare le tue abilità matematiche e algoritmiche utilizzando concetti come la teoria dei giochi combinatoria, le operazioni bitwise e la sequenza auto-descrittiva di Golomb per sviluppare soluzioni efficienti a questi problemi."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Problemi del Progetto Eulero da 401 a 480",
        "intro": [
          "In questa serie finale di sfide, avrai bisogno di attingere a tutto quello che hai imparato fino a questo punto e utilizzare concetti avanzati come i divisori unitari, l'algoritmo di Kaprekar e molto altro ancora per risolvere problemi complessi."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "Foundational C# with Microsoft",
    "intro": [
      "This course offers a comprehensive introduction to C# programming, covering its core concepts, syntax, and practical application in software development.",
      "Through hands-on exercises and projects, you will learn the fundamentals of C#, including variables, data types, control structures, and object-oriented programming principles.",
      "By the end of this course, you will have gained the practical skills and knowledge needed to confidently leverage C# for building robust and scalable applications"
    ],
    "note": "Note: You must complete the trophy challenge in each section below to qualify for the certification exam.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Write Your First Code Using C#",
        "intro": [
          "Begin your journey by learning to write your first code using C#. Develop a strong foundation as you explore the fundamentals and syntax of the language, setting the stage for your programming adventures."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Create and Run Simple C# Console Applications",
        "intro": [
          "Master the art of creating and running simple C# console applications. Dive into the world of console-based programming, where you will gain hands-on experience executing your code and seeing it in action."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Add Logic to C# Console Applications",
        "intro": [
          "Unlock the power of logic in C# console applications. Learn how to add logic and decision-making capabilities to your code, enabling your applications to make dynamic choices and respond intelligently to different scenarios."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Work with Variable Data in C# Console Applications",
        "intro": [
          "Discover the versatility of variable data in C# console applications. Harness the ability to store and manipulate different types of data, such as numbers and text, as you delve into the essential concepts of variables and data handling."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Create Methods in C# Console Applications",
        "intro": [
          "Take your C# console applications to the next level by mastering the art of creating methods. Learn how to organize and modularize your code, making it more manageable, reusable, and efficient."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Debug C# Console Applications",
        "intro": [
          "Sharpen your troubleshooting skills as you dive into the world of debugging C# console applications. Gain the ability to identify and fix issues in your code, ensuring your applications run smoothly and deliver the desired results."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Foundational C# with Microsoft Certification Exam",
        "intro": [
          "Use what you've learned to pass the exam to earn your Foundational C# with Microsoft Certification"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Upcoming Python",
    "intro": ["placeholder"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Learn Python by Building a Blackjack Game",
        "intro": ["Learn Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Upcoming Python Project",
        "intro": ["placeholder"]
      }
    }
  },
  "example-certification": {
    "title": "Example Certification",
    "intro": ["placeholder"],
    "blocks": {
      "example-certification-exam": {
        "title": "Example Certification Exam",
        "intro": ["placeholder"]
      }
    }
  },
  "misc-text": {
    "certification": "Certificazione {{cert}}",
    "browse-other": "Sfoglia le altre nostre certificazioni gratuite\n(consigliamo di seguirle in ordine)",
    "courses": "Corsi",
    "steps": "Passaggi",
    "expand": "Espandi corso",
    "collapse": "Chiudi corso",
    "legacy-header": "Vecchi corsi",
    "legacy-desc": "Questi corsi non sono più parte del percorso di certificazioni, ma sono ancora disponibili per avanzare il tuo apprendimento.",
    "legacy-go-back": "Vai alla versione corrente del curriculum.",
    "course-maintenance": "Questi corsi sono in manutenzione. Se non funzionano, puoi imparare come eseguirli localmente su <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "I tuoi progressi non saranno salvati sul tuo account freeCodeCamp quando li esegui localmente.",
    "go-back-to-learn": "Torna alla versione stabile del curriculum.",
    "read-database-cert-article": "Per favore leggi questo post sul forum prima di procedere.",
    "enable-cookies": "Devi abilitare i cookie di terze parti prima di iniziare.",
    "english-only": "I corsi in questa sezione sono disponibili solo in inglese. Siamo solo in grado di tradurre i titoli e le introduzioni in questo momento, non le lezioni stesse."
  }
}
