{
  "responsive-web-design": {
    "title": "Sfide del Web Design Responsivo Legacy",
    "intro": [
      "In questo corso di Web Design Responsivo conoscerai i linguaggi usati per costruire le pagine web: HTML (Hypertext Markup Language) per il contenuto, e CSS (Cascade Style Sheets) per il design.",
      "Per prima cosa, costruirai un'app di foto per gatti per imparare le basi di HTML e CSS. Poi apprenderai tecniche più moderne come le variabili in CSS costruendo un pinguino, e le migliori pratiche per l'accessibilità costruendo un modulo web.",
      "Infine, imparerai a realizzare pagine web adattabili a diverse misure di schermo costruendo una card Twitter con Flexbox, e un complesso layout per blog con CSS Grid."
    ],
    "note": "Nota: Alcune estensioni del browser, come ad esempio gli ad-blocker e le estensioni per la modalità scura, possono interferire con i test. In caso di problemi, ti consigliamo di disabilitare le estensioni che modificano il contenuto o il layout delle pagine durante il corso.",
    "blocks": {
      "basic-html-and-html5": {
        "title": "HTML Base e HTML5",
        "intro": [
          "HTML è un linguaggio di markup che utilizza una sintassi o notazione speciale che descrive la struttura di una pagina web al browser. Gli elementi HTML solitamente hanno un tag di apertura e di chiusura che danno significato al contenuto in essi racchiuso. Per esempio, diversi elementi possono descrivere il testo come un titolo, un paragrafo o la voce di una lista.",
          "In questo corso, costruirai un'app per foto di gatti per imparare a usare alcuni dei più comuni elementi HTML — i mattoni di ogni pagina web."
        ]
      },
      "basic-css": {
        "title": "CSS Base",
        "intro": [
          "CSS o Cascading Style Sheet, dice al browser come disporre il testo e altri contenuti che hai scritto in HTML. Con CSS, puoi controllare il colore, font, dimensione, spaziatura e molti altri aspetti degli elementi HTML.",
          "Ora che hai descritto la struttura della tua app di foto di gatti, dalle un po' di stile con CSS."
        ]
      },
      "applied-visual-design": {
        "title": "Visual Design Applicato",
        "intro": [
          "Il visual design combina tipografia, teoria del colore, grafica, animazione, layout della pagina, e altro per aiutarti a esprimere il tuo messaggio in maniera unica.",
          "In questo corso imparerai ad applicare questi diversi elementi di visual design alla tua pagina web."
        ]
      },
      "applied-accessibility": {
        "title": "Accessibilità Applicata",
        "intro": [
          "Nello sviluppo web, con accessibilità ci si riferisce al contenuto web e all'UI (User Interface, cioè interfaccia utente) che deve essere comprensibile, navigabile e interattiva per una grande varietà di utenti. Questo include persone con disabilità visive, uditive, motorie o cognitive.",
          "In questo corso imparerai le migliori pratiche per costruire pagine web accessibili a tutti."
        ]
      },
      "responsive-web-design-principles": {
        "title": "Principi di Web Design Responsivo",
        "intro": [
          "Ci sono molti dispositivi che possono accedere al web, di tutte le forme e dimensioni. Il Web design responsivo è la pratica di creare design flessibili per siti web che possano adattarsi alle diverse dimensioni, orientazioni e risoluzioni degli schermi.",
          "In questo corso, imparerai come utilizzare CSS per rendere più belle le tue pagine web, a prescindere dal dispositivo utilizzato per accedervi."
        ]
      },
      "css-flexbox": {
        "title": "CSS Flexbox",
        "intro": [
          "Flexbox è un metodo di layout potente e ben supportato che è stato introdotto con l'ultima versione di CSS: CSS3. Con flexbox, è facile centrare gli elementi nella pagina e creare interfacce utente dinamiche che si rimpiccioliscono e si espandono automaticamente.",
          "In questo corso, imparerai le basi di flexbox e dei layout dinamici costruendo una card di Twitter."
        ]
      },
      "css-grid": {
        "title": "CSS Grid",
        "intro": [
          "CSS grid, o griglia CSS, è un nuovo standard che rende facile costruire layout responsivi complessi. Funziona trasformando un elemento HTML in una griglia, lasciandoti inserire elementi figli ovunque al suo interno.",
          "In questo corso imparerai le basi della griglia CSS costruendo vari layout complessi, incluso un blog."
        ]
      }
    }
  },
  "2022/responsive-web-design": {
    "title": "Web Design Responsivo",
    "intro": [
      "In questo corso certificato di Web Design Responsivo imparerai i linguaggi che gli sviluppatori utilizzano per creare le pagine web. HTML (Hypertext Markup Language) per i contenuti e CSS (Cascading Style Sheets) per il design.",
      "Per prima cosa, costruirai un'app con foto di gatti per imparare le basi di HTML e CSS. Poi apprenderai tecniche più moderne come le variabili in CSS costruendo un pinguino, e le migliori pratiche per l'accessibilità costruendo un quiz.",
      "Infine, imparerai a realizzare pagine web adattabili a diverse misure di schermo costruendo una galleria di foto con Flexbox e il layout di un articolo di rivista con CSS Grid."
    ],
    "note": "Nota: Alcune estensioni del browser, come ad esempio gli ad-blocker e le estensioni per la modalità scura, possono interferire con i test. In caso di problemi, ti consigliamo di disabilitare le estensioni che modificano il contenuto o il layout delle pagine durante il corso.",
    "blocks": {
      "build-a-tribute-page-project": {
        "title": "Pagina Tributo",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai una pagina tributo per un soggetto di tua scelta, immaginario o reale."
        ]
      },
      "build-a-personal-portfolio-webpage-project": {
        "title": "Pagina web portfolio personale",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai la tua pagina del portfolio personale."
        ]
      },
      "build-a-product-landing-page-project": {
        "title": "Landing page di un prodotto",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai una landing page per commercializzare un prodotto di tua scelta."
        ]
      },
      "build-a-survey-form-project": {
        "title": "Modulo di sondaggio",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, creerai un modulo di sondaggio per raccogliere dati dai tuoi utenti."
        ]
      },
      "build-a-technical-documentation-page-project": {
        "title": "Pagina di documentazione tecnica",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, si costruirà una pagina di documentazione tecnica che fungerà da istruzioni o riferimento per un argomento."
        ]
      },
      "learn-html-by-building-a-cat-photo-app": {
        "title": "Impara l’HTML progettando una app per foto di gatti",
        "intro": [
          "I tag HTML danno a una pagina web la sua struttura. Puoi usare tag HTML per aggiungere foto, pulsanti e altri elementi alla tua pagina web.",
          "In questo corso, imparerai i tag HTML più comuni costruendo la tua app con foto di gatti."
        ]
      },
      "learn-basic-css-by-building-a-cafe-menu": {
        "title": "Impara le basi del CCS realizzando il menù di un bar",
        "intro": [
          "CSS dice al browser come visualizzare la tua pagina web. Puoi usare CSS per impostare il colore, il carattere, la dimensione e altri aspetti degli elementi HTML.",
          "In questo corso, imparerai CSS progettando una pagina del menu per la pagina web di un bar."
        ]
      },
      "learn-the-css-box-model-by-building-a-rothko-painting": {
        "title": "Impara il Box Model CSS realizzando un dipinto di Rothko",
        "intro": [
          "Ogni elemento HTML costituisce una scatola – con la propria spaziatura e un bordo. Questo si chiama Box Model (o modello a scatola).",
          "In questo corso, userai CSS e il Box Model per creare i tuoi pezzi d'arte rettangolari in stile Rothko."
        ]
      },
      "learn-css-variables-by-building-a-city-skyline": {
        "title": "Impara le variabili CSS costruendo lo skyline di una città",
        "intro": [
          "Le variabili CSS ti aiutano a organizzare i tuoi stili e a riutilizzarli.",
          "In questo corso, costruirai uno skyline della città. Imparerai come configurare le variabili CSS in modo da poterle riutilizzare ogni volta che vuoi."
        ]
      },
      "learn-html-forms-by-building-a-registration-form": {
        "title": "Impara i moduli HTML realizzando un modulo di registrazione",
        "intro": [
          "Puoi utilizzare moduli HTML per raccogliere informazioni da persone che visitano la tua pagina web.",
          "In questo corso, imparerai i moduli HTML costruendo una pagina di registrazione. Imparerai come controllare i tipi di dati che le persone possono digitare nel tuo modulo e alcuni nuovi strumenti CSS per impostare lo stile della tua pagina."
        ]
      },
      "learn-accessibility-by-building-a-quiz": {
        "title": "Impara l'accessibilità realizzando un Quiz",
        "intro": [
          "L'accessibilità rende la tua pagina web facile da usare per tutte le persone – anche le persone con disabilità.",
          "In questo corso, costruirai una pagina web di un quiz. Conoscerai strumenti di accessibilità come scorciatoie da tastiera, attributi ARIA e le migliori pratiche di progettazione."
        ]
      },
      "learn-intermediate-css-by-building-a-picasso-painting": {
        "title": "Impara il CSS intermedio realizzando un dipinto di Picasso",
        "intro": [
          "In questo corso, imparerai a usare alcune tecniche CSS intermedie codificando la tua pagina web con un dipinto di Picasso. Conoscerai le icone SVG, il posizionamento CSS e rivederai le altre abilità CSS che hai imparato."
        ]
      },
      "learn-responsive-web-design-by-building-a-piano": {
        "title": "Impara il Design Responsivo creando un pianoforte",
        "intro": [
          "Il design responsivo dice alle tue pagine che aspetto devono avere su schermi di diverse dimensioni.",
          "In questo corso, utilizzerai CSS e il design responsivo per creare un pianoforte. Scoprirai anche di più sulle media query e sugli pseudo selettori."
        ]
      },
      "learn-css-flexbox-by-building-a-photo-gallery": {
        "title": "Impara Flexbox CSS costruendo una fotogallery",
        "intro": [
          "Flexbox ti aiuta a progettare la tua pagina web in modo che vada bene su qualsiasi dimensione dello schermo.",
          "In questo corso, utilizzerai Flexbox per creare una pagina web di una galleria fotografica reattiva."
        ]
      },
      "learn-css-grid-by-building-a-magazine": {
        "title": "Impara CSS Grid creando una rivista",
        "intro": [
          "La griglia CSS ti dà il controllo sulle righe e le colonne della tua pagina web.",
          "In questo corso, creerai un articolo di una rivista. Imparerai come usare la griglia CSS, inclusi concetti come le righe della griglia e le colonne della griglia."
        ]
      },
      "learn-typography-by-building-a-nutrition-label": {
        "title": "Impara la Tipografia costruendo un'etichetta nutrizionale",
        "intro": [
          "La tipografia è l'arte modellare lo stile del testo in modo che sia facilmente leggibile e adatto al suo scopo.",
          "In questo corso, userai la tipografia per creare una pagina web con un'etichetta nutrizionale. Imparerai come dare stile al testo, regolare l'altezza delle righe e posizionare il testo usando il CSS."
        ]
      },
      "learn-css-transforms-by-building-a-penguin": {
        "title": "Impara le trasformazioni CSS costruendo un pinguino",
        "intro": [
          "Puoi trasformare gli elementi HTML per creare design piacevoli che attirano l'occhio del tuo lettore. Puoi usare le trasformazioni per ruotare elementi, cambiarne le dimensioni, e altro.",
          "In questo corso, costruirai un pinguino. Userai le trasformazioni CSS per posizionare e ridimensionare le parti del tuo pinguino, creare un background e animare il tuo lavoro."
        ]
      },
      "learn-css-animation-by-building-a-ferris-wheel": {
        "title": "Impara le animazioni CSS costruendo una ruota panoramica",
        "intro": [
          "Puoi usare le animazioni CSS per attirare l'attenzione su specifiche sezioni della tua pagina web e renderle più attraenti.",
          "In questo corso creerai una ruota panoramica. Imparerai come usare CSS per animare gli elementi, trasformarli e cambiarne la velocità."
        ]
      },
      "learn-more-about-css-pseudo-selectors-by-building-a-balance-sheet": {
        "title": "Learn More About CSS Pseudo Selectors by Building A Balance Sheet",
        "intro": [
          "Puoi usare gli pseudo selettori CSS per cambiare specifici elementi HTML.",
          "In questo corso, costruirai un foglio di bilancio usando gli pseudo selettori. Imparerai come cambiare lo stile di un elemento quando ci passi sopra il mouse, e attivare altri eventi sulla tua pagina."
        ]
      },
      "learn-css-colors-by-building-a-set-of-colored-markers": {
        "title": "Impara i colori CSS creando un set di pennarelli colorati",
        "intro": [
          "Selezionare il colore corretto per la tua pagina web può renderla molto più gradevole per i tuoi lettori.",
          "In questo corso creerai un set di pennarelli colorati. Imparerai metodi diversi per impostare i valori dei colori e come accoppiare i colori."
        ]
      },
      "learn-intermediate-css-by-building-a-cat-painting": {
        "title": "Impara il CSS intermedio realizzando il disegno di un gatto",
        "intro": [
          "Mastering CSS positioning is essential for creating visually appealing and responsive web layouts",
          "In this course, you will build a cat painting. You'll learn about how to work with absolute positioning, the z-index property, and the transform property."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Legacy JavaScript Algorithms and Data Structures",
    "intro": [
      "Mentre HTML e CSS controllano il contenuto e lo stile della pagina, JavaScript viene utilizzato per renderla interattiva. Nella Certificazione Algoritmi e Strutture Dati in JavaScript, imparerai le basi di JavaScript, tra cui variabili, array, oggetti, loop e funzioni.",
      "Una volta che avrai appreso le basi, applicherai queste conoscenze creando algoritmi per manipolare stringhe, fattorizzare numeri, e persino calcolare l'orbita della Stazione Spaziale Internazionale.",
      "Lungo il percorso, imparerai anche due importanti stili di programmazione o paradigmi: la Programmazione Orientata agli Oggetti (Object Oriented Programming, OOP) e la Programmazione Funzionale (Functional Programming, FP)."
    ],
    "note": "Nota: Alcune estensioni del browser, come ad esempio gli ad-blocker e gli script-blocker, possono interferire con i test. In caso di problemi, ti raccomandiamo di disabilitare le estensioni che modificano o bloccano il contenuto delle pagine durante il corso.",
    "blocks": {
      "basic-javascript": {
        "title": "JavaScript Base",
        "intro": [
          "JavaScript è un linguaggio si scripting che viene utilizzato per rendere interattive le pagine web. È una delle principali tecnologie del web, insieme ad HTML e CSS, ed è supportato da tutti i browser moderni.",
          "In questo corso, imparerai i concetti di base della programmazione in JavaScript. Inizierai dalle strutture dati di base come numeri e stringhe. Poi imparerai a lavorare con array, oggetti, funzioni, loop, istruzioni if/else e molto altro."
        ]
      },
      "es6": {
        "title": "ES6",
        "intro": [
          "ECMAScript o ES è una versione standardizzata di JavaScript. Dato che tutti i maggiori browser seguono queste specifiche, i termini ECMAScript e JavaScript sono intercambiabili.",
          "La maggior parte del JavaScript che hai appreso finora era in ES5 (ECMAScript 5), che fu definito nel 2009. Anche se puoi ancora scrivere programmi in ES5, JavaScript è in costante evoluzione, e vengono rilasciate ogni anno nuove funzionalità.",
          "ES6, rilasciato nel 2015, ha aggiunto molte nuove potenti funzionalità al linguaggio. In questo corso conoscerai queste funzionalità, tra cui funzioni freccia, destrutturazione, classi, promise e moduli."
        ]
      },
      "regular-expressions": {
        "title": "Espressioni regolari",
        "intro": [
          "Le espressioni regolari, spesso abbreviate dall'inglese con \"regex\" o \"regexp\", sono schemi che aiutano i programmatori a far corrispondere, cercare, e sostituire dei testi. Le espressioni regolari sono molto potenti, ma possono risultare difficili da leggere perché usano dei caratteri speciali per eseguire dei riscontri più complessi.",
          "In questo corso, imparerai come usare i caratteri speciali, i gruppi di cattura, i lookahead positivi e negativi, e altre tecniche per cercare corrispondenze di qualunque testo desideri."
        ]
      },
      "debugging": {
        "title": "Debugging",
        "intro": [
          "Il debugging è il processo di revisione del tuo codice, utile a trovare i problemi e a sistemarli.",
          "I problemi col codice in generale si manifestano in tre forme: errori di sintassi che impediscono al tuo programma di avviarsi, errori di runtime quando il tuo codice si comporta in modo inaspettato, o errori di logica quando il tuo codice non funziona come desideravi.",
          "In questo corso, imparerai ad usare la console di JavaScript per fare il debugging dei programmi e prevenire problemi comuni prima che avvengano."
        ]
      },
      "basic-data-structures": {
        "title": "Strutture Dati Base",
        "intro": [
          "I dati possono essere memorizzati e letti in molti modi. Conosci già alcune strutture di dati JavaScript comuni — array e oggetti.",
          "In questo corso Strutture Dati Base imparerai di più sulle differenze tra array e oggetti, e quali utilizzare in diverse situazioni. Imparerai anche come utilizzare utili metodi JS come <code>splice()</code> e <code>Object.keys()</code> per accedere a dei dati e manipolarli."
        ]
      },
      "basic-algorithm-scripting": {
        "title": "Scrittura di Algoritmi Base",
        "intro": [
          "Un algoritmo è una serie di istruzioni passo-passo che descrivono come fare qualcosa.",
          "Per scrivere un algoritmo efficace, aiuta spezzare un problema in parti più piccole e pensare attentamente a come risolvere ogni parte con il codice.",
          "In questo corso, imparerai i fondamenti del pensiero algoritmico scrivendo algoritmi che fanno di tutto, dalla conversione delle temperature alla gestione di complessi array 2D."
        ]
      },
      "object-oriented-programming": {
        "title": "Programmazione Orientata agli Oggetti",
        "intro": [
          "La Programmazione Orientata agli Oggetti (OOP, o Object Oriented Programming), è uno dei principali approcci al processo di sviluppo del software. In OOP, gli oggetti e le classi sono utilizzati per organizzare il codice per descrivere le cose e cosa possono fare.",
          "In questo corso, imparerai i principi di base di OOP in JavaScript, tra cui la parola chiave <code>this</code>, le catene di prototipi, i costruttori e l'ereditarietà."
        ]
      },
      "functional-programming": {
        "title": "Programmazione Funzionale",
        "intro": [
          "La programmazione funzionale è un altro approccio popolare allo sviluppo del software. Nella programmazione funzionale, il codice è organizzato in funzioni di base più piccole che possono essere combinate per costruire programmi complessi.",
          "In questo corso, imparerai i concetti fondamentali della Programmazione Funzionale, comprese le funzioni pure, come evitare le mutazioni, e come scrivere codice più pulito con metodi come <code>.map()</code> e <code>.filter()</code>."
        ]
      },
      "intermediate-algorithm-scripting": {
        "title": "Scrittura di Algoritmi Intermedio",
        "intro": [
          "Ora che conosci le basi del pensiero algoritmico, insieme a OOP e alla Programmazione Funzionale, prova le tue abilità con le sfide sulla scrittura di Algoritmi di livello intermedio."
        ]
      },
      "javascript-algorithms-and-data-structures-projects": {
        "title": "Progetti di Algoritmi e Strutture Dati JavaScript",
        "intro": [
          "Ci siamo — è il momento di mettere al lavoro le tue nuove abilità JavaScript. Questi progetti sono simili alle sfide di scrittura di algoritmi che hai fatto prima – solo molto più difficili.",
          "Completa questi 5 progetti JavaScript per ottenere la Certificazione Algoritmi e Strutture Dati in JavaScript."
        ]
      }
    }
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "JavaScript Algorithms and Data Structures (Beta)",
    "intro": [
      "Developers use HTML and CSS to control the content and styling of a page. And they use JavaScript to make that page interactive.",
      "Nella certificazione JavaScript Algoritmi e Strutture di Dati, imparerai i fondamenti di JavaScript come variabili, array, oggetti, loop, funzioni, il DOM e altro ancora.",
      "Imparerai anche la programmazione orientata agli oggetti (OOP), la programmazione funzionale, come sviluppare algoritmi, lavorare con il local storage e come recuperare i dati utilizzando un'API."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and script-blockers can interfere with the tests. If you face issues, we recommend disabling extensions that modify or block the content of pages while taking the course.",
    "blocks": {
      "build-a-pokemon-search-app-project": {
        "title": "Costruisci un'App per Cercare i Pokemon",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "In questo progetto, costruirai una App per Cercare i Pokemon."
        ]
      },
      "build-a-cash-register-project": {
        "title": "Build a Cash Register Project",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "In questo progetto, costruirai l'app di un registratore di cassa."
        ]
      },
      "build-a-palindrome-checker-project": {
        "title": "Build a Palindrome Checker Project",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "In questo progetto, costruirai un'applicazione che verifica se una data parola è un palindromo."
        ]
      },
      "build-a-roman-numeral-converter-project": {
        "title": "Build a Roman Numeral Converter Project",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "In questo progetto, costruirai un'applicazione che converte numeri interi in numeri romani."
        ]
      },
      "build-a-telephone-number-validator-project": {
        "title": "Build a Telephone Number Validator Project",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "In questo progetto, costruirai un'applicazione che verifica se un numero è un numero di telefono valido per gli Stati Uniti."
        ]
      },
      "learn-basic-javascript-by-building-a-role-playing-game": {
        "title": "Learn Basic JavaScript by Building a Role Playing Game",
        "intro": [
          "JavaScript è un potente linguaggio di scripting che viene utilizzato per rendere interattive le pagine web. È una delle principali tecnologie del web, insieme ad HTML e CSS. Tutti i browser moderni supportano JavaScript.",
          "In questo progetto pratica, imparerai i concetti fondamentali di programmazione in JavaScript creando il tuo gioco di gioco di ruolo. Imparerai come lavorare con array, stringhe, oggetti, funzioni, loop, istruzioni <code>if/else</code> e altro ancora."
        ]
      },
      "learn-form-validation-by-building-a-calorie-counter": {
        "title": "Learn Form Validation by Building a Calorie Counter",
        "intro": [
          "A volte quando programmi un'applicazione web, devi essere in grado di accettare l'input di un utente. In questo progetto di un conta calorie, imparerai come convalidare l'input di un utente, eseguire calcoli basati su tale input e aggiornare dinamicamente l'interfaccia per visualizzare i risultati.",
          "In questo progetto di pratica, imparerai le basi delle espressioni regolari, i template literal, il metodo <code>addEventListener()</code> e altro ancora."
        ]
      },
      "learn-functional-programming-by-building-a-spreadsheet": {
        "title": "Learn Functional Programming by Building a Spreadsheet",
        "intro": [
          "La programmazione funzionale è un approccio popolare allo sviluppo del software. Nella programmazione funzionale, gli sviluppatori organizzano il codice in funzioni semplici che combinano per costruire programmi complessi.",
          "In this spreadsheet application project, you'll learn about parsing and evaluating mathematical expressions, implementing spreadsheet functions, handling cell references, and creating interactive web interfaces. You'll learn how to dynamically update the page based on user input.",
          "This project will cover concepts like the <code>map()</code>, <code>find()</code>, and <code>includes()</code> methods and the <code>parseInt()</code> function."
        ]
      },
      "learn-modern-javascript-methods-by-building-football-team-cards": {
        "title": "Learn Modern JavaScript Methods by Building Football Team Cards",
        "intro": [
          "One common aspect of building web applications: processing datasets, and then outputting information to the screen. In this sports team cards project, you'll learn how to work with DOM manipulation, object destructuring, event handling, and data filtering.",
          "This project will cover concepts like, default parameters, <code>Object.freeze()</code>, and reinforce your knowledge of the <code>switch</code> statement and <code>map()</code> method."
        ]
      },
      "learn-advanced-array-methods-by-building-a-statistics-calculator": {
        "title": "Learn Advanced Array Methods by Building a Statistics Calculator",
        "intro": [
          "Man mano che accresci le tua abilità con JavaScript, è bene che tu sia a tuo agio con metodi di manipolazione degli array come <code>map()</code>, <code>reduce()</code> e <code>filter()</code>.",
          "In questo progetto di una calcolatrice statistica, acquisirai esperienza con la gestione degli input utente, la manipolazione del DOM e il concatenamento dei metodi. Farai pratica eseguendo calcoli statistici come media, mediana, moda, varianza e deviazione standard."
        ]
      },
      "learn-basic-oop-by-building-a-shopping-cart": {
        "title": "Impara OOP di Base Costruendo un Carrello degli Acquisti",
        "intro": [
          "La Programmazione Orientata agli Oggetti (Object Oriented Programming, OOP), è uno dei principali approcci al processo di sviluppo del software. In OOP, gli sviluppatori utilizzano oggetti e classi per strutturare il proprio codice.",
          "In questo progetto di un carrello degli acquisti, imparerai come definire le classi e usarle. Creerai istanze di una classe e implementerai metodi per la manipolazione dei dati.",
          "Questo progetto tratterà concetti come l'operatore ternario, l'operatore spread, la parola chiave <code>this</code> e altro ancora."
        ]
      },
      "learn-fetch-and-promises-by-building-an-fcc-authors-page": {
        "title": "Learn Fetch and Promises by Building an fCC Authors Page",
        "intro": [
          "Un aspetto comune dello sviluppo web è imparare a recuperare i dati da un'API esterna, quindi lavorare con JavaScript asincrono.",
          "Questo progetto della pagina degli autori freeCodeCamp ti mostrerà come usare il metodo fetch, per poi aggiornare dinamicamente il DOM per visualizzare i dati recuperati.",
          "Questo progetto ti insegnerà anche come impaginare i tuoi dati in modo da poter caricare i risultati in gruppi."
        ]
      },
      "learn-regular-expressions-by-building-a-spam-filter": {
        "title": "Learn Regular Expressions by Building a Spam Filter",
        "intro": [
          "Regular expressions, often shortened to \"regex\" or \"regexp\", are patterns that help programmers match, search, and replace text. Regular expressions are powerful, but can be difficult to understand because they use so many special characters.",
          "In questo progetto di un filtro anti-spam, conoscerai gruppi di acquisizione, lookahead positivi, lookahead negativi e altre tecniche per trovare qualsiasi testo desideri."
        ]
      },
      "learn-basic-algorithmic-thinking-by-building-a-number-sorter": {
        "title": "Impara il Pensiero Algoritmico di Base Costruendo un Ordinatore di Numeri",
        "intro": [
          "In informatica, ci sono algoritmi di ordinamento fondamentali che tutti gli sviluppatori dovrebbero imparare. In questo progetto di un ordinatore di numeri, imparerai come implementare e visualizzare diversi algoritmi di ordinamento come bubble sort, selection sort e insertion sort – tutto con JavaScript.",
          "Questo progetto ti aiuterà a capire i concetti fondamentali alla base di questi algoritmi e come applicarli per ordinare dati numerici in applicazioni web."
        ]
      },
      "review-algorithmic-thinking-by-building-a-dice-game": {
        "title": "Review Algorithmic Thinking by Building a Dice Game",
        "intro": [
          "Algorithmic thinking involves the ability to break down complex problems into a sequence of well-defined, step-by-step instructions.",
          "In this Dice game project, you’ll learn how to manage game state, implement game logic for rolling dice, keeping score, and applying rules for various combinations.",
          "This project covers concepts such as event handling, array manipulation, conditional logic, and updating the user interface dynamically based on game state."
        ]
      },
      "learn-intermediate-oop-by-building-a-platformer-game": {
        "title": "Impara OOP Intermedia Costruendo un Videogioco a Piattaforme",
        "intro": [
          "Programmare un gioco è un ottimo modo per cogliere i principi fondamentali della programmazione, creando al contempo un'esperienza di gioco interattiva.",
          "In questo progetto di un videogioco a piattaforme continuerai a conoscere classi, oggetti, ereditarietà e incapsulamento. Imparerai anche come progettare e organizzare gli elementi di gioco in modo efficiente e acquisire conoscenze su problem solving e riutilizzabilità del codice."
        ]
      },
      "learn-localstorage-by-building-a-todo-app": {
        "title": "Learn localStorage by Building a Todo App",
        "intro": [
          "Local storage is a web browser feature that lets web applications store key-value pairs persistently within a user's browser. This allows web apps to save data during one session, then retrieve it in a later page session.",
          "In this TODO application, you'll learn how to handle form inputs, manage local storage, perform CRUD (Create, Read, Update, Delete) operations on tasks, implement event listeners, and toggle UI elements."
        ]
      },
      "learn-the-date-object-by-building-a-date-formatter": {
        "title": "Learn the Date Object by Building a Date Formatter",
        "intro": [
          "Working with dates in JavaScript can be challenging. You have to navigate various methods, formats, and time zones. In this project, you'll learn how to work with the JavaScript Date object, including its methods and properties. You'll also learn how to correctly format dates.",
          "This project will cover concepts such as the <code>getDate()</code>, <code>getMonth()</code>, and <code>getFullYear()</code> methods."
        ]
      },
      "learn-asynchronous-programming-by-building-an-fcc-forum-leaderboard": {
        "title": "Learn Asynchronous Programming by Building an fCC Forum Leaderboard",
        "intro": [
          "JavaScript is an asynchronous programming language. And this project will help you gain proficiency in asynchronous concepts. You'll code your own freeCodeCamp forum leaderboard.",
          "This project will cover the Fetch API, promises, Async/Await, and the try..catch statement."
        ]
      },
      "learn-basic-string-and-array-methods-by-building-a-music-player": {
        "title": "Learn Basic String and Array Methods by Building a Music Player",
        "intro": [
          "Now let's learn some essential string and array methods like the <code>find()</code>, <code>forEach()</code>, <code>map()</code>, and <code>join()</code>. These methods are crucial for developing dynamic web applications.",
          "In this project, you'll code a basic MP3 player using HTML, CSS, and JavaScript. The project covers fundamental concepts such as handling audio playback, managing a playlist, implementing play, pause, next, previous, and shuffle functionalities. You'll even learn how to dynamically update your user interface based on the current song."
        ]
      },
      "learn-recursion-by-building-a-decimal-to-binary-converter": {
        "title": "Learn Recursion by Building a Decimal to Binary Converter",
        "intro": [
          "Recursion is a programming concept where a function calls itself. This can reduce a complex problem into simpler sub-problems, until they become straightforward to solve.",
          "In this project, you’ll build a decimal-to-binary converter using JavaScript. You’ll learn the fundamental concepts of recursion, explore the call stack, and build out a visual representation of the recursion process through an animation."
        ]
      },
      "learn-introductory-javascript-by-building-a-pyramid-generator": {
        "title": "Learn Introductory JavaScript by Building a Pyramid Generator",
        "intro": [
          "JavaScript is a powerful scripting language that you can use to make web pages interactive. It's one of the core technologies of the web, along with HTML and CSS. All modern browsers support JavaScript.",
          "In this practice project, you'll learn fundamental programming concepts in JavaScript by coding your own Pyramid Generator. You'll learn how to work with arrays, strings, functions, loops, <code>if/else</code> statements, and more."
        ]
      },
      "review-js-fundamentals-by-building-a-gradebook-app": {
        "title": "Review JavaScript Fundamentals by Building a Gradebook App",
        "intro": [
          "In this mini project, you will get to review JavaScript fundamentals like functions, variables, conditionals and more by building a gradebook app.",
          "This will give you an opportunity to solve small problems and get a better understanding of the basics."
        ]
      },
      "learn-basic-debugging-by-building-a-random-background-color-changer": {
        "title": "Learn Basic Debugging by Building a Random Background Color Changer",
        "intro": [
          "Debugging is the process of going through your code, finding any issues, and fixing them.",
          "In this project, you will help CamperBot build a random background color changer and help them find and fix errors."
        ]
      },
      "review-dom-manipulation-by-building-a-rock-paper-scissors-game": {
        "title": "Review DOM Manipulation by Building a Rock, Paper, Scissors Game",
        "intro": [
          "In the previous projects you learned how to work with basic DOM manipulation. Now it is time to review what you have learned by building a Rock, Paper, Scissors game.",
          "In this mini project, you will review conditionals, functions, <code>getElementById</code>, and more. This project will give you an opportunity to solve small problems and get a better understanding of the basics."
        ]
      }
    }
  },
  "front-end-development-libraries": {
    "title": "Librerie di sviluppo Front End",
    "intro": [
      "Ora che hai familiarità con HTML, CSS, e JavaScript, aumenta le tue competenze conoscendo alcune delle più popolari librerie di front-end del settore.",
      "Nella Certificazione Librerie di Sviluppo Front End, imparerai come definire rapidamente lo stile del tuo sito con Bootstrap. Imparerai anche come aggiungere la logica ai tuoi stili CSS e ad estenderli con Sass.",
      "Più tardi, costruirai un carrello e altre applicazioni per imparare a creare potenti applicazioni a pagina singola (Single Page Application, SPA) con React e Redux."
    ],
    "note": "",
    "blocks": {
      "bootstrap": {
        "title": "Bootstrap",
        "intro": [
          "Bootstrap è un framework front-end utilizzato per progettare pagine web e applicazioni responsive. Esso adotta un approccio mobile-first per lo sviluppo web e include stili e classi CSS precostruiti, oltre ad alcune funzionalità JavaScript.",
          "In questo corso, imparerai come costruire siti web responsivi con Bootstrap, e a utilizzare le sue classi per stilizzare pulsanti, immagini, moduli, navigazione e altri elementi comuni."
        ]
      },
      "jquery": {
        "title": "jQuery",
        "intro": [
          "jQuery è una delle librerie JavaScript più utilizzate al mondo.",
          "Nel 2006, quando è stata rilasciata, tutti i principali browser gestivano JavaScript in modo leggermente diverso. jQuery ha semplificato il processo di scrittura di JavaScript lato client, e ha anche garantito che il codice funzioni allo stesso modo in tutti i browser.",
          "In questo corso, imparerai come usare jQuery per selezionare, rimuovere, clonare e modificare diversi elementi nella pagina."
        ]
      },
      "sass": {
        "title": "SASS",
        "intro": [
          "Sass, o \"Syntactically Awesome StyleSheets\", è un'estensione linguistica di CSS. Aggiunge funzionalità che non sono disponibili nel CSS di base, che ti rendono più facile semplificare e mantenere i fogli di stile per i tuoi progetti.",
          "In questo corso di Sass imparerai come memorizzare i dati in variabili, annidare CSS, creare stili riutilizzabili con mixin, aggiungere logica e cicli ai tuoi stili, e altro ancora."
        ]
      },
      "react": {
        "title": "React",
        "intro": [
          "React è una popolare libreria JavaScript per costruire interfacce utente riutilizzabili e basate su componenti, per pagine web o applicazioni.",
          "React combina HTML con funzionalità JavaScript nel proprio linguaggio di markup chiamato JSX. React facilita anche la gestione del flusso di dati attraverso l'applicazione.",
          "In questo corso, imparerai come creare diversi componenti React, gestire i dati sotto forma di proprietà dello stato, utilizzare diversi metodi del ciclo di vita come <code>componentDidMount</code>, e molto altro ancora."
        ]
      },
      "redux": {
        "title": "Redux",
        "intro": [
          "Man mano che le applicazioni crescono in termini di dimensioni e ambito di applicazione, la gestione dei dati condivisi diventa molto più difficile. Redux è definito come un \"contenitore di stato prevedibile per le app JavaScript\" che aiuta a garantire che le tue app funzionino in modo prevedibile, e siano facili da testare.",
          "Dato che è possibile utilizzare Redux con qualsiasi libreria di visualizzazione, presentiamo Redux qui prima di combinarlo con React nel prossimo gruppo di corsi.",
          "In questo corso, imparerai i fondamenti degli store, actions, reducers e middleware di Redux per gestire i dati in tutta l'applicazione."
        ]
      },
      "react-and-redux": {
        "title": "React e Redux",
        "intro": [
          "React e Redux sono spesso citati insieme, e a buona ragione. Lo sviluppatore che ha creato Redux era uno sviluppatore React che voleva rendere più facile la condivisione dei dati tra i diversi componenti.",
          "Ora che sai come gestire il flusso di dati condivisi con Redux, è il momento di combinare tale conoscenza con React. Nei corsi React e Redux, costruirai un componente React e imparerai a gestire lo stato localmente al livello dei componenti e in tutta l'applicazione con Redux."
        ]
      },
      "front-end-development-libraries-projects": {
        "title": "Progetti sulle Librerie di Sviluppo Front-End",
        "intro": [
          "È tempo di mettere alla prova le tue capacità di sviluppo con le librerie di sviluppo del front-end. Usa Bootstrap, jQuery, Sass, React e Redux per costruire 5 progetti che testeranno tutto quello che hai imparato fino a questo punto.",
          "Completa tutti e 5 i progetti e otterrai la Certificazione Librerie di Sviluppo Front End."
        ]
      }
    }
  },
  "data-visualization": {
    "title": "Data Visualization",
    "intro": [
      "I dati ci circondano, ma non ci dicono molto senza forma o contesto.",
      "Nella Certificazione Visualizzazione dei Dati, costruirai diagrammi, grafici e mappe per presentare diversi tipi di dati con la libreria D3.js.",
      "Imparerai anche JSON (JavaScript Object Notation), e come lavorare con i dati online utilizzando un'API (Application Programming Interface)."
    ],
    "note": "",
    "blocks": {
      "data-visualization-with-d3": {
        "title": "Visualizzazione dei dati con D3",
        "intro": [
          "D3, o D3.js, sta per Data Driven Documents. È una libreria JavaScript per creare visualizzazioni di dati dinamiche e interattive nel browser.",
          "D3 è costruito per lavorare con standard web comuni, vale a dire HTML, CSS, e Scalable Vector Graphics (SVG).",
          "D3 supporta molti tipi diversi di formati di dati di input. Poi, utilizzando i suoi potenti metodi integrati, potrai trasformare questi dati in differenti diagrammi, grafici e mappe.",
          "Nei corsi di Visualizzazione dei Dati con D3, imparerai come lavorare con i dati per creare diversi grafici a barre, grafici, elementi di sovrimpressione e altri ingredienti per creare visualizzazioni di dati dinamiche e attraenti."
        ]
      },
      "json-apis-and-ajax": {
        "title": "API JSON e AJAX",
        "intro": [
          "In modo simile a come le Interfacce Utente (UI) aiutano le persone a utilizzare i programmi, le API (Application Programming Interfaces) aiutano i programmi a interagire con gli altri programmi. Le API sono strumenti che i computer usano per comunicare tra di loro, in parte per inviare e ricevere dati.",
          "I programmatori usano spesso AJAX (Asynchronous JavaScript and XML) quando lavorano con le API. AJAX si riferisce a un gruppo di tecnologie che fanno richieste asincrone a un server per trasferire dati, e quindi caricare nella pagina tutti i dati restituiti. E i dati trasferiti tra il browser e il server sono spesso in un formato chiamato JSON (JavaScript Object Notation).",
          "Questo corso ti insegnerà le basi su come lavorare con le API e le diverse tecnologie AJAX nel browser."
        ]
      },
      "data-visualization-projects": {
        "title": "Progetti di Visualizzazione dei Dati",
        "intro": [
          "Ora che hai imparato a lavorare con le tecnologie D3, API e AJAX, mettete alla prova le tue abilità con questi 5 progetti di visualizzazione dei dati.",
          "In questi progetti, è necessario recuperare i dati e analizzare un dataset, quindi utilizzare D3 per creare diverse visualizzazioni. Terminali tutti per ottenere la certificazione Visualizzazione dei Dati."
        ]
      },
      "d3-dashboard": {
        "title": "Dashboard D3",
        "intro": ["", ""]
      }
    }
  },
  "relational-database": {
    "title": "Database Relazionali",
    "intro": [
      "Per questi corsi, userai veri strumenti e software da sviluppatori inclusi VSCode, PostgreSQL, e la riga di comando Linux / Unix per completare i tutorial interattivi e creare progetti.",
      "Questi corsi iniziano con comandi Bash di base. Usando il terminale imparerai tutto da navigare e manipolare il sistema dei file, creare script in bash, tutto quanto fino all'uso avanzato.",
      "Poi, imparerari come creare e usare un database relazionale con PostgreSQL, un sistema di gestione database, e SQL, il linguaggio di questi database.",
      "Infine, imparerai Git, il sistema di controllo versione, uno strumento essenziale per ogni sviluppatore."
    ],
    "blocks": {
      "build-a-celestial-bodies-database-project": {
        "title": "Database Corpi Celesti",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai un database di corpi celesti usando PostgreSQL."
        ]
      },
      "build-a-number-guessing-game-project": {
        "title": "Gioco di indovinare il numero",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, userai Bash scripting, PostgreSQL e Git per creare un gioco di indovinare il numero che esegue nel terminale e salva le informazioni dell'utente."
        ]
      },
      "build-a-periodic-table-database-project": {
        "title": "Database della Tavola Periodica",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "For this project, you will create a Bash script to get information about chemical elements from a periodic table database."
        ]
      },
      "build-a-salon-appointment-scheduler-project": {
        "title": "Pianificatore Appuntamento Salone",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, creerai un programma Bash interattivo che utilizza PostgreSQL per tenere traccia dei clienti e degli appuntamenti per il tuo salone."
        ]
      },
      "build-a-world-cup-database-project": {
        "title": "Database Coppa Del Mondo",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, creerai uno script di Bash che inserisce informazioni da partite della coppa del mondo in PostgreSQL, e poi fare query al database per ottenere statistiche utili."
        ]
      },
      "learn-advanced-bash-by-building-a-kitty-ipsum-translator": {
        "title": "Impara Bash avanzato costruendo un traduttore Kitty Ipsum",
        "intro": [
          "C'è più dei comandi Bash di quanto tu possa pensare.",
          "In questo corso da 140 lezioni, imparerai comandi un po' più complessi e i dettagli di come i comandi lavorano."
        ]
      },
      "learn-bash-and-sql-by-building-a-bike-rental-shop": {
        "title": "Impara Bash e SQL costruendo uno shop di noleggio biciclette",
        "intro": [
          "In questo corso da 210 lezioni, costruirai un programma Bash interattivo che immagazzina informazioni per il tuo negozio di noleggio biciclette che usa PostgreSQL."
        ]
      },
      "learn-bash-by-building-a-boilerplate": {
        "title": "Impara Bash costruendo un codice Boilerplate",
        "intro": [
          "Il terminale ti permette di mandare comandi di testo al tuo computer che possono manipolare il sistema dei file, eseguire programmi, automatizzare attività, e molto altro.",
          "In questo corso da 170 lezioni, imparerai i comandi del terminale creando un boilerplate di un sito web usando solo la riga di comando."
        ]
      },
      "learn-bash-scripting-by-building-five-programs": {
        "title": "Impara lo Scripting Bash costruendo cinque programmi",
        "intro": [
          "Scripting in Bash combina comandi del terminale e logica in programmi che possono eseguire o automatizzare attività e moltro altro.",
          "In questo corso con 220 lezioni, imparerai più comandi per il terminale e come usarli con script di Bash creando cinque piccoli programmi."
        ]
      },
      "learn-git-by-building-an-sql-reference-object": {
        "title": "Impara Git costruendo un oggetto di riferimento SQL",
        "intro": [
          "Git è un sistema di controllo versione che tiene traccia di tutti i cambiamenti che fai al tuo codice.",
          "In questo corso da 240 lezioni, imparareai come Git tiene traccia del tuo codice creando un oggetto che contiene comadni SQL comunemente usati."
        ]
      },
      "learn-nano-by-building-a-castle": {
        "title": "Impara Nano costruendo un castello",
        "intro": [
          "Nano è un programma che ti permette di modificare file direttamente dal terminale.",
          "In questo corso di 40 lezioni, imparerai a modificare i file nel terminale con Nano mentre costruisci un castello."
        ]
      },
      "learn-relational-databases-by-building-a-mario-database": {
        "title": "Impara i database relazionali costruendo un database Mario",
        "intro": [
          "Un database relazionale organizza i dati in tabelle che sono legate assieme tramite delle relazioni.",
          "In questo corso da 165 lezioni, imparerai le basi di un database relazionale creando un database PostgreSQL pieno di personaggi di videogiochi."
        ]
      },
      "learn-sql-by-building-a-student-database-part-1": {
        "title": "Apprendi SQL costruendo un database degli studenti: Parte 1",
        "intro": [
          "SQL, o Structured Query Language (linguaggio strutturato di richieste), è un linguaggio per comunicare con un database relazionale.",
          "In questo corso di 140 lezioni, creerai uno script Bash che utilizza SQL per inserire informazioni sui tuoi studenti di informatica in PostgreSQL."
        ]
      },
      "learn-sql-by-building-a-student-database-part-2": {
        "title": "Apprendi SQL costruendo un database degli studenti: Parte 2",
        "intro": [
          "I comandi SQL join sono usati per combinare informazioni da diverse tabelle in un database relazionale",
          "In questo corso da 140 lezioni, completerai il tuo database degli studenti andando più a fondo nei comandi SQL."
        ]
      }
    }
  },
  "back-end-development-and-apis": {
    "title": "Sviluppo Back End e API",
    "intro": [
      "Fino a questo punto, hai usato solo JavaScript sul front-end per aggiungere interattività a una pagina, risolvere sfide algoritmiche o costruire una Single Page Application. Ma JavaScript può essere utilizzato anche nel backend (cioè lato server), per costruire intere applicazioni web.",
      "Oggi, uno dei modi più popolari per costruire applicazioni è attraverso i microservizi, che sono piccole applicazioni modulari che lavorano insieme per formare qualcosa di più grande.",
      "Nella Certificazione Sviluppo Back End e API, imparerai a scrivere app per il backend con Node.js e npm. Costruirai anche applicazioni web con il framework Express, e costruirai un microservizio Trova Persone con MongoDB e la libreria Mongoose."
    ],
    "note": "",
    "blocks": {
      "managing-packages-with-npm": {
        "title": "Gestire i pacchetti con NPM",
        "intro": [
          "npm (Node Package Manager) è uno strumento da riga di comando per installare, creare e condividere pacchetti di codice JavaScript scritto per Node.js. Ci sono molti pacchetti open source disponibili su npm, quindi prima di iniziare un progetto, prenditi del tempo per esplorarli in modo da non finire per ricreare la ruota per cose come lavorare con gli insiemi di dati o recuperare i dati da un'API.",
          "In questo corso, imparerai le basi dell'utilizzo di npm, incluso come lavorare con il <code>package.json</code> e come gestire le dipendenze installate."
        ]
      },
      "basic-node-and-express": {
        "title": "Node e Express Base",
        "intro": [
          "Node.js è un runtime JavaScript che permette agli sviluppatori di scrivere programmi backend (lato server) in JavaScript. Node.js viene fornito con una manciata di moduli incorporati — piccoli programmi indipendenti — che aiutano in questo. Alcuni dei moduli principali includono HTTP, che agisce come un server e File System, un modulo per leggere e modificare i file.",
          "Nell'ultimo gruppo di corsi hai imparato ad installare e gestire pacchetti da npm, che sono collezioni di moduli più piccoli. Questi pacchetti possono aiutarti a costruire applicazioni più grandi e complesse.",
          "Express è un framework per applicazioni web leggero ed è uno dei pacchetti più popolari su npm. Express rende molto più facile creare un server e gestire l'instradamento (routing) per l'applicazione, che gestisce cose come dirigere le persone alla pagina corretta quando visitano un determinato endpoint come <pre>/blog</pre>.",
          "In questo corso, imparerai le basi di Node e Express, incluso come creare un server, servire file diversi, e gestire richieste diverse dal browser."
        ]
      },
      "mongodb-and-mongoose": {
        "title": "MongoDB e Mongoose",
        "intro": [
          "MongoDB è un'applicazione di databse che memorizza documenti JSON (o record) che puoi usare nella tua applicazione. A differenza di SQL, un altro tipo di database, MongoDB è un database non relazionale o un database \"NoSQL\". Questo significa che MongoDB memorizza tutti i dati associati in un record al posto di memorizzarli in varie tabelle preimpostate come in un database SQL.",
          "Mongoose è un popolare pacchetto npm che interagisce con MongoDB. Con Mongoose puoi utilizzare dei semplici oggetti JavaScript al posto di JSON, ciò rende più facile lavorare con MongoDB. Inoltre, ti permette di creare schemi per i tuoi documenti chiamati schemas, così da non salvare il tipo di dato sbagliato e causare bug in seguito.",
          "Nei corsi di MongoDB e Mongoose, imparerai i fondamenti di come si lavora con dati persistenti, incluso come impostare un modello, e salvare, cancellare e trovare documenti nel database."
        ]
      },
      "back-end-development-and-apis-projects": {
        "title": "Progetti di sviluppo Back End e API",
        "intro": [
          "Hai già lavorato con le API prima, ma ora che conosci npm, Node, Express, MongoDB e Mongoose, è ora di costruirle. Costruisci su tutto quello che hai imparato fino a questo punto per creare 5 diversi microservizi, che sono applicazioni più piccole, con un ambito di applicazione ristretto.",
          "Dopo averli creati, avrai 5 belle API di microservizi che potrai mostrare a amici, familiari e potenziali datori di lavoro. Oh, e avrai anche una certificazione nuova di zecca su Sviluppo Back End e API."
        ]
      }
    }
  },
  "quality-assurance": {
    "title": "Garanzia di Qualità",
    "intro": [
      "Mano a mano che i tuoi programmi o applicazioni web diventeranno più complessi, vorrai testarli per assicurarti che le nuove modifiche non compromettano la loro funzionalità originaria.",
      "Nella Certificazione Garanzia di Qualità imparerai a scrivere i test con Chai per garantire che le tue applicazioni funzionino nel modo in cui ti aspetti.",
      "Poi costruirai un'applicazione di chat per apprendere concetti avanzati Node e Express. Utilizzerai anche Pug come motore di modelli, Passport per l'autenticazione e Socket.io per la comunicazione in tempo reale tra il server e i client connessi."
    ],
    "note": "",
    "blocks": {
      "quality-assurance-and-testing-with-chai": {
        "title": "Garanzia di qualità e test con Chai",
        "intro": [
          "Chai è una libreria di test JavaScript che ti aiuta a confermare che il tuo programma si comporta ancora come ti aspetti dopo aver apportato modifiche al tuo codice.",
          "Utilizzando Chai, potrai scrivere test che descrivono i requisiti del programma e vedere se il programma li soddisfa.",
          "In questo corso, familiarizzerai con concetti come assertion, deep equality, truthiness, testi di API, e altri fondamentali per testare le applicazioni JavaScript."
        ]
      },
      "advanced-node-and-express": {
        "title": "Node ed Express avanzati",
        "intro": [
          "Ora è il momento di approfondire Node.js e Express.js costruendo un'applicazione di chat con un sistema di accesso.",
          "Per implementare il sistema di accesso in modo sicuro, è necessario conoscere l'autenticazione. Questo è l'atto di verificare l'identità di una persona o di un processo.",
          "In questo corso, imparerai come utilizzare Passport per gestire l'autenticazione, Pug per creare modelli riutilizzabili per costruire rapidamente il front-end, e i web sockets per la comunicazione in tempo reale tra i client e il server."
        ]
      },
      "quality-assurance-projects": {
        "title": "Progetti di Garanzia di Qualità",
        "intro": [
          "Python è uno dei linguaggi di programmazione più popolari e flessibili al giorno d'oggi. Puoi usarlo per tutto, dallo scripting di base all'apprendimento automatico (machine learning).",
          "Dopo aver completato questi progetti di Garanzia di Qualità, avrai altri 5 progetti al tuo attivo e una nuova certificazione da mostrare nel tuo portfolio."
        ]
      }
    }
  },
  "scientific-computing-with-python": {
    "title": "Scientific Computing with Python (Beta)",
    "intro": [
      "The Scientific Computing with Python (Beta) curriculum will equip you with the skills to analyze and manipulate data using Python, a powerful and versatile programming language. You'll learn key concepts like data structures, algorithm, Object Oriented Programming, and how to perform complex calculations using a variety of tools.",
      "This comprehensive course will guide you through the fundamentals of scientific computing, including data structures, and algorithms."
    ],
    "note": "",
    "blocks": {
      "learn-string-manipulation-by-building-a-cipher": {
        "title": "Learn String Manipulation by Building a Cipher",
        "intro": [
          "Python is a powerful and popular programming language widely used for data science, data visualization, web development, game development, machine learning and more.",
          "In this project, you'll learn fundamental programming concepts in Python, such as variables, functions, loops, and conditional statements. You'll use these to code your first programs."
        ]
      },
      "learn-how-to-work-with-numbers-and-strings-by-implementing-the-luhn-algorithm": {
        "title": "Learn How to Work with Numbers and Strings by Implementing the Luhn Algorithm",
        "intro": [
          "The Luhn Algorithm is widely used for error-checking in various applications, such as verifying credit card numbers.",
          "By building this project, you'll gain experience working with numerical computations and string manipulation."
        ]
      },
      "learn-list-comprehension-by-building-a-case-converter-program": {
        "title": "Learn Python List Comprehension by Building a Case Converter Program",
        "intro": [
          "List Comprehension is a way to construct a new Python list from an iterable types: lists, tuples, and strings. All without using a for loop or the `.append()` list method.",
          "In this project, you'll write a program that takes a string formatted in Camel Case or Pascal Case, then converts it into Snake Case.",
          "The project has two phases: first you'll use a for loop to implement the program. Then you'll learn how to use List Comprehension instead of a loop to achieve the same results."
        ]
      },
      "learn-regular-expressions-by-building-a-password-generator": {
        "title": "Learn Regular Expressions by Building a Password Generator",
        "intro": [
          "A Python module is a file that contains a set of statements and definitions that you can use in your code.",
          "In this project, you'll learn how to import modules from the Python standard library. You'll also learn how to use Regular Expressions by building your own password generator program."
        ]
      },
      "learn-algorithm-design-by-building-a-shortest-path-algorithm": {
        "title": "Learn Algorithm Design by Building a Shortest Path Algorithm",
        "intro": [
          "Algorithms are step-by-step procedures that developers use to perform calculations and solve computational problems.",
          "In this project, you'll learn how to use functions, loops, conditional statements, and dictionary comprehensions to implement a Shortest Path algorithm."
        ]
      },
      "learn-recursion-by-solving-the-tower-of-hanoi-puzzle": {
        "title": "Learn Recursion by Solving the Tower of Hanoi Puzzle",
        "intro": [
          "Recursion is a programming approach that allows you to solve complicated computational problems with just a little code.",
          "In this project, you'll start with a loop-based approach to solving the tower of Hanoi mathematical puzzle. Then you'll learn how to implement a recursive solution."
        ]
      },
      "learn-data-structures-by-building-the-merge-sort-algorithm": {
        "title": "Learn Data Structures by Building the Merge Sort Algorithm",
        "intro": [
          "The Merge Sort Algorithm is a sorting algorithm based on the divide and conquer principle.",
          "In this project, you'll learn how to interact with data structures by sorting a list of random numbers using the Merge Sort Algorithm."
        ]
      },
      "learn-classes-and-objects-by-building-a-sudoku-solver": {
        "title": "Learn Classes and Objects by Building a Sudoku Solver",
        "intro": [
          "Classes and objects are important programming concepts. These Object-Oriented Programming tools help developers to achieve code modularity, abstraction, and readability. And they promote reusability.",
          "In this Sudoku Solver project, you'll learn how to use classes and objects to build a Sudoku grid and to solve a Sudoku puzzle."
        ]
      },
      "learn-tree-traversal-by-building-a-binary-search-tree": {
        "title": "Learn Tree Traversal by Building a Binary Search Tree",
        "intro": [
          "A Binary Search Tree (BST) is an common data structure where data is sorted hierarchically.",
          "In this project, you'll learn how to construct your own BST and perform an in-order traversal. You'll also learn key operations like insertion, search, and deletion."
        ]
      },
      "learn-lambda-functions-by-building-an-expense-tracker": {
        "title": "Learn Lambda Functions by Building an Expense Tracker",
        "intro": [
          "Lambda functions give you a concise way to write small, throwaway functions in your code.",
          "In this project, you'll explore the power of Lambda Functions by creating an expense tracker. Your resulting app will demonstrate how you can use Lambda Functions for efficient, streamlined operations."
        ]
      },
      "build-an-arithmetic-formatter-project": {
        "title": "Build an Arithmetic Formatter Project",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione."
        ]
      },
      "build-a-time-calculator-project": {
        "title": "Build a Time Calculator Project",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione."
        ]
      },
      "build-a-budget-app-project": {
        "title": "Build a Budget App Project",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione."
        ]
      },
      "build-a-polygon-area-calculator-project": {
        "title": "Build a Polygon Area Calculator Project",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione."
        ]
      },
      "build-a-probability-calculator-project": {
        "title": "Build a Probability Calculator Project",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione."
        ]
      },
      "learn-interfaces-by-building-an-equation-solver": {
        "title": "Learn Interfaces by Building an Equation Solver",
        "intro": [
          "Abstract classes enable you to define formal interfaces - objects acting as blueprints for classes.",
          "In this project, you'll discover how to implement an interface in Python while building a simple equation solver program."
        ]
      },
      "learn-special-methods-by-building-a-vector-space": {
        "title": "Learn Special Methods by Building a Vector Space",
        "intro": [
          "Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.",
          "In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space."
        ]
      },
      "learn-encapsulation-by-building-a-projectile-trajectory-calculator": {
        "title": "Learn Encapsulation by Building a Projectile Trajectory Calculator",
        "intro": [
          "Encapsulation is a core OOP principle based on writing code that limits direct access to data.",
          "In this project, you'll discover new concepts related to encapsulation, such as getters, setters, and name mangling, and you'll use them together with what you already learned to create a program that calculates a projectile trajectory."
        ]
      },
      "learn-the-bisection-method-by-finding-the-square-root-of-a-number": {
        "title": "Learn the Bisection Method by Finding the Square Root of a Number",
        "intro": [
          "Numerical methods are used to approximate solutions to mathematical problems that are difficult or impossible to solve analytically.",
          "In this project, you will explore the numerical method of bisection to find the square root of a number by iteratively narrowing down the possible range of values that contain the square root."
        ]
      }
    }
  },
  "data-analysis-with-python": {
    "title": "Analisi dei dati con Python",
    "intro": [
      "L'analisi dei dati esiste da molto tempo, ma fino a pochi anni fa, gli sviluppatori l'hanno praticata utilizzando costosi strumenti proprietari come Tableau. Recentemente però, Python, SQL e altre librerie aperte hanno cambiato per sempre il mondo dell'analisi dei dati.",
      "Nella Certificazione Analisi dei dati con Python, imparerai i fondamenti dell'analisi dei dati con Python. Alla fine di questa certificazione, saprai leggere i dati da fonti come CSV e SQL, e come usare librerie come Numpy, Pandas, Matplotlib, e Seaborn per elaborare e visualizzare i dati."
    ],
    "note": "",
    "blocks": {
      "data-analysis-with-python-course": {
        "title": "Analisi dei dati con Python",
        "intro": [
          "In questi videocorsi completi, creati da Santiago Basulto, imparerai l'intero processo di analisi dei dati. Potrai leggere i dati da più fonti (CSV, SQL, Excel), elaborarli utilizzando NumPy e Pandas e visualizzarli utilizzando Matplotlib e Seaborn,",
          "Inoltre, abbiamo incluso un corso completo di Jupyter Notebook e un rapido riferimento Python per aggiornare le tue abilità di programmazione."
        ]
      },
      "numpy": {
        "title": "Numpy",
        "intro": [
          "Apprendi le basi della libreria NumPy nel seguente videocorso creato da Keith Galli.",
          "In questo corso, imparerai come funziona NumPy e come si confronta con le liste integrate di Python. Imparerai anche a scrivere codice con NumPy, indicizzazione, riformulazione, statistiche applicate, e molto altro."
        ]
      },
      "data-analysis-with-python-projects": {
        "title": "Progetti di Analisi dei dati con Python",
        "intro": [
          "Ci sono molti modi per analizzare i dati con Python. Completando questi progetti, dimostrerai di avere una buona conoscenza dei fondamenti dell'analisi dei dati con Python.",
          "Completali tutti per ottenere la tua certificazione Analisi dei Dati con Python."
        ]
      }
    }
  },
  "information-security": {
    "title": "Sicurezza dell'Informazione",
    "intro": [
      "Con tutto quello che facciamo online, c'è una grande quantità di informazioni sensibili a rischio: indirizzi e-mail, password, numeri di telefono e molto altro.",
      "Con la Certificazione Sicurezza dell'Informazione, costruirai una web app sicura con HelmetJS per apprendere i fondamenti della protezione delle informazioni delle persone online.",
      "Costruirai anche un client TCP e uno scanner Nmap e un port scanner in Python. Questo ti aiuterà a imparare le basi del penetration testing — una componente importante di una buona sicurezza dell'informazione."
    ],
    "note": "",
    "blocks": {
      "information-security-with-helmetjs": {
        "title": "Sicurezza dell'informazione con HelmetJS",
        "intro": [
          "Questo corso di programmazione si concentra su HelmetJS, un tipo di middleware per le applicazioni basate su Express, che imposta automaticamente le intestazioni HTTP. In questo modo può impedire che informazioni sensibili vengano accidentalmente trasmesse tra il server e il client.",
          "Completare questi corsi ti aiuterà a capire come proteggere il tuo sito web da comportamenti dannosi."
        ]
      },
      "python-for-penetration-testing": {
        "title": "Python per il Penetration Testing",
        "intro": [
          "Questi video corsi ti insegneranno il penetration testing con Python. Conosciuto anche come pen test, il penetration testing è un attacco simulato contro un sistema per controllarne le vulnerabilità.",
          "In questo corso, imparerai cosa sono i socket, come creare un server e un client TCP, come costruire uno scanner Nmap, e altri strumenti e tecniche che i pen tester utilizzano quotidianamente."
        ]
      },
      "information-security-projects": {
        "title": "Progetti di Sicurezza dell'Informazione",
        "intro": [
          "Ora è il momento di mettere in pratica le tue nuove abilità di sicurezza dell'informazione. Questi progetti ti daranno la possibilità di applicare le abilità, i principi e i concetti di sicurezza dell'informazione che hai appreso.",
          "Quando avrai finito, avrai molti progetti di sicurezza dell'informazione al tuo attivo, insieme a una certificazione che potrai mostrare agli amici, alla famiglia e ai datori di lavoro."
        ]
      }
    }
  },
  "machine-learning-with-python": {
    "title": "Machine Learning con Python",
    "intro": [
      "L'apprendimento automatico (Machine Learning), ha molte applicazioni pratiche che potrai utilizzare nei tuoi progetti o al lavoro.",
      "Nella Certificazione Machine Learning con Python, userai il framework TensorFlow per costruire diverse reti neurali ed esplorare tecniche più avanzate come l'elaborazione del linguaggio naturale e l'apprendimento rinforzato.",
      "Potrai anche immergerti nelle reti neurali e imparare i principi dietro al funzionamento delle reti neurali profonde, ricorrenti e convoluzionali."
    ],
    "note": "",
    "blocks": {
      "tensorflow": {
        "title": "TensorFlow",
        "intro": [
          "TensorFlow è un framework open source che rende l'apprendimento automatico e le reti neurali più facile da usare.",
          "Il seguente video corso è stato creato da Tim Ruscica, noto anche come “Tech With Tim”. Ti aiuterà a capire TensorFlow e alcune delle sue potenti capacità."
        ]
      },
      "how-neural-networks-work": {
        "title": "Come Funzionano le Reti Neurali",
        "intro": [
          "Le reti neurali sono al centro di quella che oggi chiamiamo intelligenza artificiale. Storicamente però sono state difficili da comprendere. Soprattutto per i principianti nel campo del machine learning.",
          "Anche se sei completamente nuovo alle reti neurali, questi video corsi di Brandon Rohrer ti faranno sentire a tuo agio con i concetti e la matematica che stanno dietro."
        ]
      },
      "machine-learning-with-python-projects": {
        "title": "Progetti di Machine Learning con Python",
        "intro": [
          "Il Machine learning ha molte applicazioni pratiche. Completando questi progetti di codifica gratuiti e impegnativi, dimostrerai di avere una buona conoscenza dei fondamenti dell'apprendimento automatico, e ti qualificherai per la tua Certificazione Machine Learning con Python."
        ]
      }
    }
  },
  "college-algebra-with-python": {
    "title": "Algebra Universitaria con Python",
    "intro": [
      "Questo corso è progettato come un corso universitario di un semestre. Si compone di video didattici, con notebook di Google Colaboratory per seguire in modo interattivo, attività e progetti stimolanti.",
      "Affrontando le varie parti di questo corso in sequenza, otterrai una piena comprensione dell'algebra e di come scrivere del codice Python per risolvere problemi di algebra.",
      "Durante questo corso, costruirai anche un notebook Colab di algebra, che potrai utilizzare come calcolatrice personalizzata. Questo corso (e il codice che scriverai) ti darà le basi per una comprensione più profonda della matematica e della scienza dei dati."
    ],
    "note": "",
    "blocks": {
      "learn-ratios-and-proportions": {
        "title": "Rapporti e Proporzioni",
        "intro": [
          "Il tuo viaggio inizia qui, mentre impari come configurare un notebook Colab in grado di eseguire il codice Python. Utilizza il notebook per seguire i video per imparare rapporti e proporzioni utilizzando Python."
        ]
      },
      "learn-how-to-solve-for-x": {
        "title": "Risolvere per X",
        "intro": [
          "Questa unità tratta di come risolvere per un numero sconosciuto (spesso indicato come \"x\") usando l'algebra scritta e il codice Python."
        ]
      },
      "learn-fractions-and-decimals": {
        "title": "Frazioni e Decimali",
        "intro": [
          "Questa unità tratta della conversione di decimali in frazioni e percentuali."
        ]
      },
      "learn-functions-and-graphing": {
        "title": "Funzioni e Grafici",
        "intro": ["In questa unità apprenderai le funzioni matematiche."]
      },
      "learn-linear-functions": {
        "title": "Funzioni Lineari",
        "intro": [
          "Questa unità ti mostrerà come sviluppare equazioni lineari da due punti."
        ]
      },
      "learn-common-factors-and-square-roots": {
        "title": "Fattori Comuni e Radici Quadrate",
        "intro": [
          "In questa unità, imparerai a trovare i fattori comuni e a raccoglierli. Ciò sarà utile nella semplificazione delle frazioni e nella fattorizzazione delle radici quadrate."
        ]
      },
      "build-a-multi-function-calculator-project": {
        "title": "Calcolatrice Multifunzione",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai una calcolatrice multifunzione."
        ]
      },
      "learn-how-to-graph-systems-of-equations": {
        "title": "Graficare Sistemi di Equazioni",
        "intro": [
          "Questa unità ti mostrerà come tracciare il grafico di due equazioni sullo stesso piano di coordinate, in modo da poter vedere dove si intersecano."
        ]
      },
      "learn-how-to-solve-systems-of-equations": {
        "title": "Risolvere Sistemi di Equazioni",
        "intro": [
          "In questa unità, imparerai come risolvere un sistema di due equazioni (con due variabili) senza tracciare il grafico. Vedrai come si può fattorizzare un'equazione e risolvere per una determinata variabile con Python. Alla fine di questa unità, sarai in grado di risolvere e graficare un sistema di equazioni con un blocco di codice."
        ]
      },
      "learn-applications-of-linear-systems": {
        "title": "Applicazioni dei Sistemi Lineari",
        "intro": [
          "In questa unità, vedrai come è possibile utilizzare l'algebra che hai imparato finora per risolvere i problemi del mondo reale."
        ]
      },
      "learn-quadratic-equations": {
        "title": "Equazioni Quadratiche",
        "intro": [
          "Questa unità andrà oltre le equazioni lineari, lavorando con esponenti e tracciando parabole. Imparerai come trovare i punti chiave delle parabole e come risolvere le equazioni quadratiche."
        ]
      },
      "build-a-graphing-calculator-project": {
        "title": "Calcolatrice Grafica",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai una calcolatrice grafica."
        ]
      },
      "learn-parent-graphs-and-polynomials": {
        "title": "Grafici Genitori e Polinomi",
        "intro": [
          "Questa unità ti mostrerà molti tipi diversi di grafici \"genitori\", i modelli che costituiscono la base di grafici più complicati. I polinomi sono espressioni matematiche con \"elementi multipli\" - le equazioni più complicate costruite con modelli di base. Vedrai come appaiono questi grafici, come modificarli e come fare fare tutto ciò con il codice Python."
        ]
      },
      "build-three-math-games-project": {
        "title": "Tre Giochi di Matematica",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto costruirai tre giochi di matematica."
        ]
      },
      "learn-business-applications-of-college-algebra": {
        "title": "Applicazioni Economiche dell'Algebra Universitaria",
        "intro": [
          "Questa unità ti mostrerà come applicare le tue abilità nel risolvere equazioni e tracciare grafici per trovare costo, ricavo e profitto. Scriverai il codice per ottenere la funzione della domanda da due punti. Vedrai come il prezzo influenza il grafico del profitto e come tutte queste equazioni sono collegate tra di loro."
        ]
      },
      "learn-simple-and-compound-interest": {
        "title": "Interesse Semplice e Composto",
        "intro": [
          "Questa unità ti mostrerà come calcolare gli interessi, la rata di un prestito e il valore stimato di investimenti. Vedrai la formula matematica la trasformerai in codice. Poiché queste formule tendono a essere complicate, apprezzerai di avere il codice in cui è possibile modificare solo alcuni valori."
        ]
      },
      "learn-exponents-and-logarithms": {
        "title": "Esponenziali e Logaritmi",
        "intro": [
          "Questa unità vi mostrerà come esponenziali e logaritmi sono funzioni inverse, e come è possibile utilizzare queste funzioni in varie applicazioni."
        ]
      },
      "build-a-financial-calculator-project": {
        "title": "Calcolatrice Finanziaria",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto, costruirai una calcolatrice finanziaria."
        ]
      },
      "college-algebra-with-python-conclusion": {
        "title": "Algebra Universitaria con Python: Conclusione",
        "intro": [
          "Questa è l'ultima unità di questo corso. Diamo un'occhiata a come è possibile collegare le conoscenze di matematica e Python con dati esterni."
        ]
      },
      "build-a-data-graph-explorer-project": {
        "title": "Data Graph Explorer",
        "intro": [
          "Questo è uno dei progetti necessari per ottenere la tua certificazione.",
          "Per questo progetto costruirai un data graph explorer."
        ]
      }
    }
  },
  "python-for-everybody": {
    "title": "Legacy Python for Everybody",
    "intro": [
      "Python is one of the most popular, flexible programming languages today. You can use it for everything from basic scripting to machine learning."
    ],
    "note": "",
    "blocks": {
      "python-for-everybody": {
        "title": "Python for Everybody",
        "intro": [
          "Python for everybody is a free video course series that teaches the basics of using Python 3.",
          "The courses were created by Dr. Charles Severance (also known as Dr. Chuck). He is a Clinical Professor at the University of Michigan School of Information, where he teaches various technology-oriented courses including programming, database design, and web development."
        ]
      }
    }
  },
  "coding-interview-prep": {
    "title": "Preparazione per il colloquio di lavoro per programmatori",
    "intro": [
      "Se stai cercando esercizi di programmazione gratuiti per prepararti al tuo prossimo colloquio di lavoro, sei nel posto giusto.",
      "Questa sezione contiene centinaia di sfide di programmazione che testano la tua conoscenza di algoritmi, strutture di dati e matematica. Ha anche una serie di progetti pronti da portare a casa che puoi utilizzare per rafforzare le tue competenze, o aggiungere al tuo porfolio."
    ],
    "note": "The Project Euler Project and Rosetta Code have been moved to their own courses. Go back to the curriculum to see the list of courses we offer.",
    "blocks": {
      "algorithms": {
        "title": "Algoritmi",
        "intro": [
          "Questi esercizi di programmazione gratuiti ti aiuteranno a comprendere alcuni algoritmi comuni che probabilmente incontrerai nella vita reale. Sono una grande opportunità per migliorare le tue competenze logiche e di programmazione.",
          "Questi algoritmi sono spesso utilizzati nei colloqui di lavoro per testare le abilità di un candidato. Ti forniremo spiegazioni chiare e concise su come funzionano in modo che tu possa implementare una soluzione per ciascuno di essi."
        ]
      },
      "data-structures": {
        "title": "Strutture Dati",
        "intro": [
          "Questi corsi di programmazione gratuita sono pensati per aiutarti a gestire strutture dati grandi e complesse con le quali potresti non essere ancora familiare.",
          "Con questi corsi scoprirai i vari tipi di struttura di dati e imparerai a implementare degli algoritmi per rafforzare la tua comprensione di essi."
        ]
      },
      "take-home-projects": {
        "title": "Progetti da completare a casa",
        "intro": [
          "I colloqui di lavoro per programmatori sono sempre stati stressanti. Ai candidati viene a volte chiesto di completare un lavoro a casa. Questi tipi di colloquio di solito richiedono molto lavoro, ma sono un ottimo modo per i datori di lavoro per vedere cosa il candidato è in grado di fare.",
          "Costruisci i progetti facoltativi per fare delle esercitazioni extra. Prenditi il tempo necessario, ampliali, e metteli nel tuo curriculum o portfolio per mostrarli ai potenziali datori di lavoro."
        ]
      }
    }
  },
  "the-odin-project": {
    "title": "The Odin Project - freeCodeCamp Remix (Beta)",
    "intro": [
      "The Odin Project was created in 2013 by a lone developer, Erik Trautman. Over the years, an open source community has sprung up to maintain and expand the project.",
      "freeCodeCamp has expanded upon the open source curriculum to make it run interactively in the browser, with tests to evaluate your code and ensure you've understood key concepts.",
      "If you want the original experience of configuring all of The Odin Project to run on your local computer, you can check out the original Odin Project on <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>The Odin Project website</a>. A huge thanks to The Odin Project community for continuing to maintain this valuable learning resource for developers all around the world.",
      "This course is unofficial, and not endorsed by The Odin Project. Changes to The Odin Project curriculum content have been made, and all instructional material for this course is licenced under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; The Odin Project</a>",
      "This course includes content from <a href='javascript.info'>JavaScript.info</a>, which is licenced under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>"
    ],
    "blocks": {
      "top-learn-html-foundations": {
        "title": "Impara i Fondamenti di HTML",
        "intro": [
          "Get a solid grasp of HTML essentials with this course. From structuring web pages to understanding semantic tags, you'll build a strong foundation for creating well-organized and accessible content on the web."
        ]
      },
      "top-working-with-text": {
        "title": "Working with Text",
        "intro": [
          "Explore the intricacies of working with text in web development. Learn about text formatting, manipulation, and presentation to enhance your skills in creating web content."
        ]
      },
      "top-links-and-images": {
        "title": "Links and Images",
        "intro": [
          "Learn how to incorporate links and images into your web projects. This course covers the fundamentals of creating links and embedding images to make your websites more interactive and visually appealing."
        ]
      },
      "top-build-a-recipe-project": {
        "title": "Impara i Fondamenti di HTML Creando una Pagina di Ricette",
        "intro": [
          "Put your HTML skills into practice by building a recipe page. This hands-on project allows you to apply your knowledge and create a functional web page while reinforcing key concepts of HTML development."
        ]
      },
      "top-learn-css-foundations": {
        "title": "Impara i Fondamenti di CSS",
        "intro": [
          "Dive into the world of Cascading Style Sheets (CSS) and learn how to style your HTML elements. Explore styling properties, selectors, and layouts to bring your web pages to life."
        ]
      },
      "top-learn-css-foundations-projects": {
        "title": "Learn CSS Foundations Projects",
        "intro": [
          "Take your CSS skills to the next level by working on practical projects. This course provides hands-on experience in applying CSS to create responsive designs for real-world scenarios."
        ]
      },
      "top-learn-css-specificity": {
        "title": "Learn CSS Specificity",
        "intro": [
          "Learn CSS specificity and gain a better understanding of how styles are applied to HTML elements. This course explores the nuances of CSS rules and helps you write efficient and targeted styles for your web pages."
        ]
      },
      "top-the-box-model": {
        "title": "Learn the Box Model",
        "intro": [
          "Learn the CSS box model with this course. Understand how elements are rendered on the web, and learn to manipulate spacing, borders, and padding to achieve your desired layout and design."
        ]
      },
      "top-introduction-to-flexbox": {
        "title": "Introduction to Flexbox",
        "intro": [
          "Discover the power of Flexbox, a layout model that simplifies the design of flexible and responsive web layouts. Learn how to create dynamic and adaptive page structures with ease."
        ]
      },
      "top-learn-block-and-inline": {
        "title": "Learn the difference between Block and Inline",
        "intro": [
          "Explore the distinctions between block and inline elements in HTML and CSS. This course provides insights into how these display types affect layout and behavior, empowering you to make informed design decisions."
        ]
      },
      "top-learn-variables-and-operators": {
        "title": "Learn Variables and Operators",
        "intro": [
          "Get started with JavaScript by learning about variables and operators. This course covers the fundamentals of JavaScript programming, including data types, operators, and variable declarations."
        ]
      },
      "top-learn-data-types-and-conditionals": {
        "title": "Impara i Tipi di Dato e le Istruzioni Condizionali",
        "intro": ["Learn about data types and conditionals in JavaScript."]
      },
      "top-learn-function-basics": {
        "title": "Learn Function Basics",
        "intro": ["Learn about functions in JavaScript."]
      },
      "top-basic-function-projects": {
        "title": "Basic Function Projects",
        "intro": [
          "Put your JavaScript skills to the test by building basic functions."
        ]
      },
      "top-learn-arrays-and-loops": {
        "title": "Learn Arrays and Loops",
        "intro": ["Learn about arrays and loops in JavaScript."]
      },
      "top-learn-to-solve-problems-and-understand-errors": {
        "title": "Learn to Solve Problems and Understand Errors",
        "intro": [
          "Learn how to solve problems and understand errors in JavaScript."
        ]
      },
      "top-build-a-rock-paper-scissors-game": {
        "title": "Build a Rock Paper Scissor Game",
        "intro": [
          "Put your JavaScript skills to the test by building a Rock Paper Scissors game."
        ]
      }
    }
  },
  "project-euler": {
    "title": "Progetto Eulero",
    "intro": [
      "Completa le sfide di programmazione sottostanti, dagli enormi archivi del Progetto Eulero. Consolideranno le tue conoscenze in materia di algoritmi e matematica.",
      "Questi problemi variano in difficoltà e, per molti, l'esperienza di apprendimento è a catena induttiva. Cioè, risolvendo un problema, sarai esposto a un nuovo concetto che consente di affrontare un problema precedentemente inaccessibile. Riesci a finirli tutti?"
    ],
    "blocks": {
      "project-euler-problems-1-to-100": {
        "title": "Problemi del Progetto Eulero da 1 a 100",
        "intro": [
          "In questa prima serie di sfide, utilizzerai concetti matematici come la sequenza di Fibonacci, la teoria dei numeri primi e la combinatoria per scrivere algoritmi efficienti per risolvere dei problemi."
        ]
      },
      "project-euler-problems-101-to-200": {
        "title": "Problemi del Progetto Eulero da 101 a 200",
        "intro": [
          "In questa serie di sfide, ti baserai sulle competenze che hai acquisito nella prima parte del corso e utilizzerai concetti più avanzati come il calcolo vettoriale, la piramide di Pascal e l'algoritmo RSA per risolvere dei problemi in modo efficiente."
        ]
      },
      "project-euler-problems-201-to-300": {
        "title": "Problemi del Progetto Eulero da 201 a 300",
        "intro": [
          "In questa serie di sfide, continuerai a usare ciò che hai imparato in precedenza e a utilizzare concetti come il teorema binomiale, i numeri di Hamming e la sequenza di Collatz per affinare ulteriormente le tue abilità matematiche e di problem solving."
        ]
      },
      "project-euler-problems-301-to-400": {
        "title": "Problemi del Progetto Eulero da 301 a 400",
        "intro": [
          "Qui continuerai a modellare le tue abilità matematiche e algoritmiche utilizzando concetti come la teoria dei giochi combinatoria, le operazioni bitwise e la sequenza auto-descrittiva di Golomb per sviluppare soluzioni efficienti a questi problemi."
        ]
      },
      "project-euler-problems-401-to-480": {
        "title": "Problemi del Progetto Eulero da 401 a 480",
        "intro": [
          "In questa serie finale di sfide, avrai bisogno di attingere a tutto quello che hai imparato fino a questo punto e utilizzare concetti avanzati come i divisori unitari, l'algoritmo di Kaprekar e molto altro ancora per risolvere problemi complessi."
        ]
      }
    }
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "(Nuovo) Fondamenti di C# con Microsoft",
    "intro": [
      "Questo corso offre un'introduzione completa alla programmazione in C# trattandone i concetti principali, sintassi e applicazione pratica nello sviluppo di software.",
      "Attraverso esercizi e progetti pratici imparerai i fondamenti di C#, comprese le variabili, i tipi di dati, le strutture di controllo e i principi della programmazione orientati agli oggetti.",
      "Alla fine di questo corso, avrai acquisito le competenze pratiche e le conoscenze necessarie per usare C# con sicurezza creare applicazioni."
    ],
    "note": "Each section below has a trophy associated with it that you must earn on the Microsoft Learn platform. After earning each trophy, you need to verify them on freeCodeCamp. Once you have done those, you can qualify for the certification exam.",
    "blocks": {
      "write-your-first-code-using-c-sharp": {
        "title": "Write Your First Code Using C#",
        "intro": [
          "Begin your journey by learning to write your first code using C#. Develop a strong foundation as you explore the fundamentals and syntax of the language, setting the stage for your programming adventures."
        ]
      },
      "create-and-run-simple-c-sharp-console-applications": {
        "title": "Create and Run Simple C# Console Applications",
        "intro": [
          "Master the art of creating and running simple C# console applications. Dive into the world of console-based programming, where you will gain hands-on experience executing your code and seeing it in action."
        ]
      },
      "add-logic-to-c-sharp-console-applications": {
        "title": "Add Logic to C# Console Applications",
        "intro": [
          "Unlock the power of logic in C# console applications. Learn how to add logic and decision-making capabilities to your code, enabling your applications to make dynamic choices and respond intelligently to different scenarios."
        ]
      },
      "work-with-variable-data-in-c-sharp-console-applications": {
        "title": "Work with Variable Data in C# Console Applications",
        "intro": [
          "Discover the versatility of variable data in C# console applications. Harness the ability to store and manipulate different types of data, such as numbers and text, as you delve into the essential concepts of variables and data handling."
        ]
      },
      "create-methods-in-c-sharp-console-applications": {
        "title": "Create Methods in C# Console Applications",
        "intro": [
          "Take your C# console applications to the next level by mastering the art of creating methods. Learn how to organize and modularize your code, making it more manageable, reusable, and efficient."
        ]
      },
      "debug-c-sharp-console-applications": {
        "title": "Debug C# Console Applications",
        "intro": [
          "Sharpen your troubleshooting skills as you dive into the world of debugging C# console applications. Gain the ability to identify and fix issues in your code, ensuring your applications run smoothly and deliver the desired results."
        ]
      },
      "foundational-c-sharp-with-microsoft-certification-exam": {
        "title": "Foundational C# with Microsoft Certification Exam",
        "intro": [
          "Use what you've learned to pass the exam to earn your Foundational C# with Microsoft Certification"
        ]
      }
    }
  },
  "upcoming-python": {
    "title": "Upcoming Python",
    "intro": ["placeholder"],
    "blocks": {
      "learn-python-by-building-a-blackjack-game": {
        "title": "Learn Python by Building a Blackjack Game",
        "intro": ["Learn Python.", ""]
      },
      "upcoming-python-project": {
        "title": "Upcoming Python Project",
        "intro": ["placeholder"]
      }
    }
  },
  "a2-english-for-developers": {
    "title": "A2 English for Developers (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": [
      "In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the A2 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.",
      "The first half of the curriculum will help you get comfortable with English grammar and usage. It will give you tons of hands-on practice. You'll learn basics like introducing yourself, making small talk, and discussing your work.",
      "In the second half, you'll practice vocabulary specific to software development. You'll learn how to describe code, discuss tech trends, and participate in stand-up meetings.",
      "This entire A2-level curriculum includes 105 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting."
    ],
    "blocks": {
      "learn-greetings-in-your-first-day-at-the-office": {
        "title": "Learn Greetings in your First Day at the Office",
        "intro": [
          "In this first course, you'll learn common expressions for situations you may encounter on your first day at work. You'll learn about introductions, getting to know people, asking for lunch recommendations, and getting an access card from security."
        ]
      },
      "learn-introductions-in-an-online-team-meeting": {
        "title": "Learn Introductions in an Online Team Meeting",
        "intro": [
          "In this course, you'll learn how to give a personal introduction. You'll also learn how to state your profession, and share your goals in group meetings."
        ]
      },
      "learn-conversation-starters-in-the-break-room": {
        "title": "Learn Conversation Starters in the Break Room",
        "intro": [
          "In this course, you'll learn how to start a conversation in casual settings. You'll also learn how to talk about your hobbies and personality traits. You'll even learn how to ask about places around the town."
        ]
      },
      "learn-how-to-talk-about-a-typical-workday-and-tasks": {
        "title": "Learn How to Talk About a Typical Workday and Tasks",
        "intro": [
          "In this course, you'll learn how to talk about your workday and the tasks that you perform in the workplace and how to share them with others. It mainly focuses on the structures used for describing your activities and task-related vocabulary."
        ]
      },
      "learn-how-to-discuss-your-morning-or-evening-routine": {
        "title": "Learn How to Discuss Your Morning or Evening Routine",
        "intro": [
          "In this course, you'll learn how to talk about details of your routine and share them with someone else. It mainly focuses on the structures used for declaring routine actions and related vocabulary."
        ]
      },
      "learn-how-to-describe-your-current-project": {
        "title": "Learn How to Describe Your Current Project",
        "intro": [
          "In this course, you'll learn how to talk about the projects that you are involved in and how to inform others of what you are doing in these projects. It mainly focuses on the structures used for informing it and on the related vocabulary."
        ]
      },
      "learn-how-to-ask-and-share-about-educational-and-professional-background": {
        "title": "Learn How to Ask and Share About Educational and Professional Background",
        "intro": [
          "In this course, you'll learn how to ask about another person's educational and professional backgrounds and you'll learn how to share information about your background as well."
        ]
      },
      "learn-how-to-talk-about-hobbies-and-interests": {
        "title": "Learn How to Talk About Hobbies and Interests",
        "intro": [
          "In this course, you'll learn different ways to talk about hobbies and things that interest you. You'll also learn how to ask about other people's hobbies and how to invite them to join you in these activities."
        ]
      },
      "learn-how-to-discuss-roles-and-responsibilies": {
        "title": "Learn How to Discuss Roles and Responsibilities",
        "intro": [
          "In this course, you'll discuss people's roles and responsibilities in a company and out of it. You'll discover how to ask about these roles and responsibilities and how to share information about you related to the topic."
        ]
      },
      "learn-how-to-have-a-conversation-about-preferences-and-motivations": {
        "title": "Learn How to Have a Conversation About Preferences and Motivations",
        "intro": [
          "In this course, you'll learn how to ask about what motivates people in their personal and professional lives, answer questions related to your motivations, and discuss about people's preferences."
        ]
      },
      "learn-how-to-discuss-popular-trends-in-technology": {
        "title": "Learn How to Discuss Popular Trends in Technology",
        "intro": [
          "In this course, you'll learn how to discuss about things that everybody's talking about in technology these days."
        ]
      },
      "learn-how-to-clarify-information-in-different-interactions": {
        "title": "Learn How to Clarify Information in Different Interactions",
        "intro": [
          "In this course, you'll learn how to check to see if the information you had is correct and how to ask for clarification when something is not clear to you."
        ]
      },
      "learn-how-to-use-basic-programming-vocabulary-in-conversations": {
        "title": "Learn How to Use Basic Programming Vocabulary in Conversations",
        "intro": [
          "This course will present basic vocabulary related to programming. You'll learn how to ask questions related to basic programming concepts."
        ]
      },
      "learn-how-to-use-code-related-concepts-and-terms": {
        "title": "Learn How to Use Code-related Concepts and Terms",
        "intro": [
          "In this course, you will be introduced to terms related to coding and learn how to use them in conversation."
        ]
      },
      "learn-how-to-discuss-tech-trends-and-updates": {
        "title": "Learn How to Discuss Tech Trends and Updates",
        "intro": [
          "In this course, you will be introduced to some recent trends in the world of technology and learn how to discuss them in English."
        ]
      },
      "learn-how-to-help-a-coworker-troubleshoot-on-github": {
        "title": "Learn How to Help a Coworker Troubleshoot on GitHub",
        "intro": [
          "In this course, you will learn expression related to how to ask for help from a coworker as well as how to offer them some assistance."
        ]
      },
      "learn-how-to-share-your-progress-in-weekly-stand-up-meetings": {
        "title": "Learn How to Share Your Progress in Weekly Stand-up Meetings",
        "intro": [
          "This course will show you how to talk about your projects in terms of what you have already done and what you are currently doing in them."
        ]
      },
      "learn-how-to-ask-for-clarification-on-code-understanding": {
        "title": "Learn How to Ask for Clarification on Code Understanding",
        "intro": [
          "In this course, you will see how you can ask questions to clarify things which are not very clear to you in a code."
        ]
      },
      "learn-how-to-document-code-for-a-project": {
        "title": "Learn How to Document Code for a Project",
        "intro": [
          "This course will show you expressions related to what to do when documenting code."
        ]
      },
      "learn-how-to-read-and-understand-code-documentation": {
        "title": "Learn How to Read and Understand Code Documentation",
        "intro": [
          "This course will present more expressions related to code documentation and bring tips on how to understand it."
        ]
      },
      "learn-how-to-analyze-code-documentation": {
        "title": "Learn How to Analyze Code Documentation",
        "intro": [
          "In this course, you will see some ideas to help you to approach documentation and analyze it in simple terms."
        ]
      },
      "learn-how-to-share-progress-and-accomplishments": {
        "title": "Learn How to Share Progress and Accomplishments",
        "intro": [
          "In this course, you will learn how to share your progress with coworkers and tell about what successes you've had in your projects."
        ]
      },
      "learn-how-to-talk-about-updates-and-plans-for-tasks-and-projects": {
        "title": "Learn How to Talk about Updates and Plans for Tasks and Projects",
        "intro": [
          "This course will show you how to speak about the most recent advancements in your projects and about your plans."
        ]
      },
      "learn-how-to-express-agreement-or-disagreement": {
        "title": "Learn How to Express Agreement or Disagreement",
        "intro": [
          "This course will introduce how to say that you agree with what another person says and to tell them politely that you do not agree with them."
        ]
      },
      "learn-how-to-offer-technical-support-and-guidance": {
        "title": "Learn How to Offer Technical Support and Guidance",
        "intro": [
          "In this course, you will see ways of offering some help in terms of technical specifics to another person."
        ]
      },
      "learn-how-to-request-and-receive-guidance": {
        "title": "Learn How to Request and Receive Guidance",
        "intro": [
          "This course will show you how to ask for assistance from a coworker when you need it."
        ]
      },
      "learn-how-to-provide-explanations-when-helping-others": {
        "title": "Learn How to Provide Explanations When Helping Others",
        "intro": [
          "This course will provide you with ways to explain things to other people while assisting them."
        ]
      }
    }
  },
  "b1-english-for-developers": {
    "title": "B1 English for Developers (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"],
    "blocks": {
      "learn-how-to-describe-places-and-events": {
        "title": "Learn How to Describe Places and Events",
        "intro": [""]
      },
      "learn-how-to-talk-about-past-experiences": {
        "title": "Learn How to Talk About Past Experiences",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-past-activities": {
        "title": "Learn How to Talk About Past Activities",
        "intro": ["", ""]
      },
      "learn-present-perfect-while-talking-about-accessibility": {
        "title": "Learn Present Perfect while Talking About Accessibility",
        "intro": ["", ""]
      },
      "learn-how-to-plan-future-events": {
        "title": "Learn How to Plan Future Events",
        "intro": ["", ""]
      },
      "learn-future-continuous-while-describing-actions": {
        "title": "Learn Future Continuous while Describing Actions",
        "intro": ["", ""]
      },
      "learn-how-to-use-conditionals": {
        "title": "Learn How to Use Conditionals",
        "intro": ["", ""]
      },
      "learn-how-to-share-feedback": {
        "title": "Learn How to Share Feedback",
        "intro": ["", ""]
      },
      "learn-how-to-share-your-opinion": {
        "title": "Learn How to Share Your Opinion",
        "intro": ["", ""]
      },
      "learn-how-to-express-agreement": {
        "title": "Learn How to Express Agreement",
        "intro": ["", ""]
      },
      "learn-how-to-express-disagreement": {
        "title": "Learn How to Express Disagreement",
        "intro": ["", ""]
      },
      "learn-how-to-express-concerns": {
        "title": "Learn How to Express Concerns",
        "intro": ["", ""]
      },
      "learn-how-to-express-decisions-based-on-comparisons": {
        "title": "Learn How to Express Decisions Based on Comparisons",
        "intro": ["", ""]
      },
      "learn-how-to-use-modal-verbs": {
        "title": "Learn How to Use Modal Verbs",
        "intro": ["", ""]
      },
      "learn-how-to-manage-a-conversation": {
        "title": "Learn How to Manage a Conversation",
        "intro": ["", ""]
      },
      "learn-how-to-clarify-misunderstandings": {
        "title": "Learn How to Clarify Misunderstandings",
        "intro": ["", ""]
      },
      "learn-about-speculation-and-requests": {
        "title": "Learn About Speculation and Requests",
        "intro": ["", ""]
      },
      "learn-about-adverbial-phrases": {
        "title": "Learn About Adverbial Phrases",
        "intro": ["", ""]
      },
      "learn-how-to-use-adjectives-in-conversations": {
        "title": "Learn How to Use Adjectives in Conversations",
        "intro": ["", ""]
      },
      "learn-determiners-and-advanced-use-of-articles": {
        "title": "Learn Determiners and Advanced Use of Articles",
        "intro": ["", ""]
      },
      "learn-how-to-use-reported-speech": {
        "title": "Learn How to Use Reported Speech",
        "intro": ["", ""]
      },
      "learn-how-to-use-prepositions-according-to-context": {
        "title": "Learn How to Use Prepositions According to Context",
        "intro": ["", ""]
      },
      "learn-how-to-talk-about-numbers-with-a-coworker": {
        "title": "Learn How to Talk About Numbers with a Coworker",
        "intro": ["", ""]
      },
      "learn-common-phrasal-verbs-and-idioms": {
        "title": "Learn Common Phrasal Verbs and Idioms",
        "intro": ["", ""]
      }
    }
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Level up your creative problem solving skills with these free programming tasks from the classic Rosetta Code library.",
      "These challenges can prove to be difficult, but they will push your algorithm logic to new heights.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Attribute: Rosetta Code</a>"
    ],
    "blocks": {
      "rosetta-code-challenges": {
        "title": "Rosetta Code Challenges",
        "intro": ["These are the challenges for Rosetta Code."]
      }
    }
  },
  "front-end-development": {
    "title": "Front End Development",
    "intro": ["placeholder"],
    "blocks": {
      "efpl": {
        "title": "0",
        "intro": []
      },
      "xpmy": {
        "title": "1",
        "intro": []
      },
      "workshop-cat-photo-app": {
        "title": "Build a Cat Photo App",
        "intro": [
          "HTML stands for HyperText Markup Language and it represents the content and structure of a web page.",
          "In this workshop, you will learn how to work with basic HTML elements such as headings, paragraphs, images, links, and lists."
        ]
      },
      "lab-recipe-page": {
        "title": "Build a Recipe Page",
        "intro": [
          "For this lab, you will create a web page of your favorite recipe."
        ]
      },
      "gwyd": {
        "title": "4",
        "intro": []
      },
      "lab-travel-agency-page": {
        "title": "Build a Travel Agency Page",
        "intro": [
          "For this lab, you will create a web page of a travel agency."
        ]
      },
      "vipr": {
        "title": "6",
        "intro": []
      },
      "lab-video-compilation-page": {
        "title": "Build a Video Compilation Page",
        "intro": ["For this lab, you will create a video compilation web page."]
      },
      "bzfv": {
        "title": "8",
        "intro": []
      },
      "snuv": {
        "title": "9",
        "intro": []
      },
      "quiz-basic-html": {
        "title": "Basic HTML Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic HTML knowledge."
        ]
      },
      "evdc": {
        "title": "11",
        "intro": []
      },
      "workshop-blog-page": {
        "title": "Build a Cat Blog Page",
        "intro": [
          "In this workshop, you will learn how to build an HTML only blog page using semantic elements including the <code>main</code>, <code>nav</code>, <code>article</code> and <code>footer</code> elements."
        ]
      },
      "lab-event-hub": {
        "title": "Build an Event Hub",
        "intro": [
          "In this lab, you will build an event hub using semantic HTML."
        ]
      },
      "ijdq": {
        "title": "14",
        "intro": []
      },
      "quiz-semantic-html": {
        "title": "Semantic HTML Quiz",
        "intro": [
          "Test what you've learned in this quiz of semantic HTML knowledge."
        ]
      },
      "cfgp": {
        "title": "16",
        "intro": []
      },
      "workshop-hotel-feedback-form": {
        "title": "Build a Hotel Feedback Form",
        "intro": [
          "In this workshop, you will learn how to work with forms by building a Hotel Feedback Form.",
          "You will learn how to work with labels, inputs, fieldsets, legends, textareas and buttons."
        ]
      },
      "lab-survey-form": {
        "title": "Build a Survey Form",
        "intro": ["For this lab, you will create a survey form."]
      },
      "wgot": {
        "title": "19",
        "intro": []
      },
      "workshop-final-exams-table": {
        "title": "Build a Final Exams Table",
        "intro": [
          "In this workshop, you will learn how to work with HTML tables by building a table of final exams."
        ]
      },
      "lab-book-catalog-table": {
        "title": "Build a Book Catalog Table",
        "intro": [
          "In this lab, you will create table filled with book information."
        ]
      },
      "rsve": {
        "title": "22",
        "intro": []
      },
      "xzam": {
        "title": "23",
        "intro": []
      },
      "quiz-html-tables-and-forms": {
        "title": "HTML Tables and Forms Quiz",
        "intro": [
          "Test what you've learned in this quiz of HTML tables and forms."
        ]
      },
      "ghoc": {
        "title": "25",
        "intro": []
      },
      "lab-checkout-page": {
        "title": "Build a Checkout Page",
        "intro": ["In this lab, you will create an accessible checkout page."]
      },
      "fqai": {
        "title": "27",
        "intro": []
      },
      "quiz-html-accessibility": {
        "title": "HTML Accessibility Quiz",
        "intro": [
          "Test what you've learned in this quiz of HTML accessibility knowledge."
        ]
      },
      "pspj": {
        "title": "29",
        "intro": []
      },
      "qpra": {
        "title": "30",
        "intro": []
      },
      "joim": {
        "title": "31",
        "intro": []
      },
      "gvtb": {
        "title": "32",
        "intro": []
      },
      "cqhu": {
        "title": "33",
        "intro": []
      },
      "tmdc": {
        "title": "34",
        "intro": []
      },
      "quiz-computer-basics": {
        "title": "Computer Basics Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic computer knowledge."
        ]
      },
      "dxpc": {
        "title": "36",
        "intro": []
      },
      "workshop-cafe-menu": {
        "title": "Design a Cafe Menu",
        "intro": [
          "CSS tells the browser how to display your webpage. You can use CSS to set the color, font, size, and other aspects of HTML elements.",
          "In this workshop, you'll learn CSS by designing a menu page for a cafe webpage."
        ]
      },
      "lab-business-card": {
        "title": "Design a Business Card",
        "intro": [
          "In this lab, you'll create a business card and style it using CSS."
        ]
      },
      "gnuk": {
        "title": "39",
        "intro": []
      },
      "zlfj": {
        "title": "40",
        "intro": []
      },
      "quiz-basic-css": {
        "title": "Basic CSS Quiz",
        "intro": [
          "Test what you've learned in this quiz of basic CSS knowledge."
        ]
      },
      "sdul": {
        "title": "42",
        "intro": []
      },
      "lab-stylized-to-do-list": {
        "title": "Build a Stylized To-Do List",
        "intro": [
          "In this lab, you'll build a To-Do list and apply different styles to the links"
        ]
      },
      "humj": {
        "title": "44",
        "intro": []
      },
      "pahx": {
        "title": "45",
        "intro": []
      },
      "rzdx": {
        "title": "46",
        "intro": []
      },
      "quiz-css-backgrounds-and-borders": {
        "title": "CSS Backgrounds and Borders Quiz",
        "intro": [
          "Test what you've learned in this quiz of backgrounds and borders in CSS."
        ]
      },
      "ljmt": {
        "title": "48",
        "intro": []
      },
      "lxpk": {
        "title": "49",
        "intro": []
      },
      "lzqy": {
        "title": "50",
        "intro": []
      },
      "gvel": {
        "title": "51",
        "intro": []
      },
      "quiz-design-fundamentals": {
        "title": "Design Fundamentals Quiz",
        "intro": [
          "Test what you've learned in this quiz of UI design fundamentals."
        ]
      },
      "bgrw": {
        "title": "53",
        "intro": []
      },
      "sbnz": {
        "title": "54",
        "intro": []
      },
      "lab-event-flyer-page": {
        "title": "Build an Event Flyer Page",
        "intro": [
          "In this lab, you will use absolute and relative CSS units to create an event flyer page."
        ]
      },
      "ywfm": {
        "title": "56",
        "intro": []
      },
      "quiz-css-relative-and-absolute-units": {
        "title": "CSS Relative and Absolute Units Quiz",
        "intro": [
          "Test what you've learned in this quiz of relative and absolute units in CSS."
        ]
      },
      "ohhu": {
        "title": "58",
        "intro": []
      },
      "syga": {
        "title": "59",
        "intro": []
      },
      "sdym": {
        "title": "60",
        "intro": []
      },
      "ivpx": {
        "title": "61",
        "intro": []
      },
      "quiz-css-pseudo-classes": {
        "title": "CSS Pseudo-classes Quiz",
        "intro": [
          "Test what you've learned in this quiz of pseudo-classes in CSS."
        ]
      },
      "fvcj": {
        "title": "63",
        "intro": []
      },
      "ogdb": {
        "title": "64",
        "intro": []
      },
      "zxiy": {
        "title": "65",
        "intro": []
      },
      "qpze": {
        "title": "66",
        "intro": []
      },
      "quiz-css-colors": {
        "title": "CSS Colors Quiz",
        "intro": [
          "Test what you've learned in this quiz of using colors in CSS."
        ]
      },
      "jnqt": {
        "title": "68",
        "intro": []
      },
      "vkei": {
        "title": "69",
        "intro": []
      },
      "lab-contact-form": {
        "title": "Design a Contact Form",
        "intro": [
          "In this lab, you will design a contact form in HTML and style it using CSS."
        ]
      },
      "ipmw": {
        "title": "71",
        "intro": []
      },
      "quiz-styling-forms": {
        "title": "Styling Forms Quiz",
        "intro": [
          "Test what you've learned in this quiz of how to style forms using CSS."
        ]
      },
      "qzcx": {
        "title": "73",
        "intro": []
      },
      "wozq": {
        "title": "74",
        "intro": []
      },
      "lab-confidential-email-page": {
        "title": "Build a Confidential Email Page",
        "intro": [
          "For this lab, you will create a web page of a confidential email using HTML and CSS."
        ]
      },
      "zter": {
        "title": "76",
        "intro": []
      },
      "quiz-css-layout-and-effects": {
        "title": "CSS Layout and Effects Quiz",
        "intro": [
          "Test what you've learned in this quiz of the box model, transforms, filters, and overflow in CSS."
        ]
      },
      "tcwi": {
        "title": "78",
        "intro": []
      },
      "uptf": {
        "title": "79",
        "intro": []
      },
      "lab-page-of-playing-cards": {
        "title": "Build a Page of Playing Cards",
        "intro": [
          "For this lab, you will use flexbox to create a webpage of playing cards."
        ]
      },
      "kqao": {
        "title": "81",
        "intro": []
      },
      "quiz-css-flexbox": {
        "title": "CSS Flexbox Quiz",
        "intro": [
          "Test what you've learned in this quiz of using flexbox in CSS."
        ]
      },
      "vqut": {
        "title": "83",
        "intro": []
      },
      "ujcf": {
        "title": "84",
        "intro": []
      },
      "lab-newspaper-article": {
        "title": "Build a Newspaper Article",
        "intro": [
          "In this lab, you will build a newspaper article page using HTML and CSS."
        ]
      },
      "hbme": {
        "title": "86",
        "intro": []
      },
      "quiz-css-typography": {
        "title": "CSS Typography Quiz",
        "intro": ["Test what you've learned in this quiz of typography in CSS."]
      },
      "dyvj": {
        "title": "88",
        "intro": []
      },
      "rjsv": {
        "title": "89",
        "intro": []
      },
      "lab-tribute-page": {
        "title": "Build a Tribute Page",
        "intro": [
          "For this lab, you will build a tribute page for a subject of your choosing, fictional or real."
        ]
      },
      "fnde": {
        "title": "91",
        "intro": []
      },
      "quiz-css-accessibility": {
        "title": "CSS Accessibility Quiz",
        "intro": [
          "Test what you've learned in this quiz of making your webpage accessible with CSS."
        ]
      },
      "swpl": {
        "title": "93",
        "intro": []
      },
      "hcje": {
        "title": "94",
        "intro": []
      },
      "lab-book-inventory-app": {
        "title": "Build a Book Inventory App",
        "intro": ["For this lab, you will create a book inventory app."]
      },
      "huyd": {
        "title": "96",
        "intro": []
      },
      "quiz-css-attribute-selectors": {
        "title": "CSS Attribute Selectors Quiz",
        "intro": [
          "Test what you've learned in this quiz of using attribute selectors in CSS."
        ]
      },
      "rxzk": {
        "title": "98",
        "intro": []
      },
      "xobh": {
        "title": "99",
        "intro": []
      },
      "lab-house-painting": {
        "title": "Build a House Painting",
        "intro": ["For this lab, you will build a house painting using CSS."]
      },
      "rrtt": {
        "title": "101",
        "intro": []
      },
      "quiz-css-positioning": {
        "title": "CSS Positioning Quiz",
        "intro": [
          "Test what you've learned in this quiz of how positioning works in CSS."
        ]
      },
      "xebj": {
        "title": "103",
        "intro": []
      },
      "jkdt": {
        "title": "104",
        "intro": []
      },
      "lab-technical-documentation-page": {
        "title": "Build a Technical Documentation Page",
        "intro": [
          "For this lab, you will build a technical documentation page to serve as instruction or reference for a topic."
        ]
      },
      "xcti": {
        "title": "106",
        "intro": []
      },
      "quiz-responsive-web-design": {
        "title": "Responsive Web Design Quiz",
        "intro": [
          "Test what you've learned in this quiz of making your webpage responsive."
        ]
      },
      "mtbl": {
        "title": "108",
        "intro": []
      },
      "vlov": {
        "title": "109",
        "intro": []
      },
      "lab-availability-table": {
        "title": "Build an Availability Table",
        "intro": ["For this lab, you will create an availability table."]
      },
      "sget": {
        "title": "111",
        "intro": []
      },
      "quiz-css-variables": {
        "title": "CSS Variables Quiz",
        "intro": [
          "Test what you've learned in this quiz of how using variables in CSS."
        ]
      },
      "agbl": {
        "title": "113",
        "intro": []
      },
      "ogko": {
        "title": "114",
        "intro": []
      },
      "harp": {
        "title": "115",
        "intro": []
      },
      "nsiq": {
        "title": "116",
        "intro": []
      },
      "lab-product-landing-page": {
        "title": "Build a Product Landing Page",
        "intro": [
          "For this project, you will build a product landing page to market a product of your choice."
        ]
      },
      "fdam": {
        "title": "118",
        "intro": []
      },
      "quiz-css-grid": {
        "title": "CSS Grid Quiz",
        "intro": ["Test what you've learned in this quiz of using grid in CSS."]
      },
      "dorc": {
        "title": "120",
        "intro": []
      },
      "adzu": {
        "title": "121",
        "intro": []
      },
      "lab-moon-orbit": {
        "title": "Build a Moon Orbit",
        "intro": [
          "For this lab, you will create an animation of the moon orbiting the earth."
        ]
      },
      "lugl": {
        "title": "123",
        "intro": []
      },
      "lab-personal-portfolio": {
        "title": "Build a Personal Portfolio",
        "intro": [
          "For this project, you will build your own personal portfolio page."
        ]
      },
      "lvqc": {
        "title": "125",
        "intro": []
      },
      "quiz-css-animations": {
        "title": "CSS Animations Quiz",
        "intro": [
          "Test what you've learned in this quiz of using animations in CSS."
        ]
      },
      "wvjx": {
        "title": "127",
        "intro": []
      },
      "uquz": {
        "title": "128",
        "intro": []
      },
      "kdgd": {
        "title": "129",
        "intro": []
      },
      "wryp": {
        "title": "130",
        "intro": []
      },
      "workshop-greeting-bot": {
        "title": "Build a Greeting Bot",
        "intro": [
          "For this workshop, you will learn how to work with JavaScript fundamentals by building a greeting bot.",
          "You will learn about variables, <code>let</code>, <code>const</code>, <code>console.log</code> and basic string usage."
        ]
      },
      "lab-javascript-trivia-bot": {
        "title": "Build a JavaScript Trivia Bot",
        "intro": [
          "In this lab, you will practice working with JavaScript variables and strings by building a trivia bot."
        ]
      },
      "dthi": {
        "title": "133",
        "intro": []
      },
      "yskn": {
        "title": "134",
        "intro": []
      },
      "quiz-javascript-variables-and-data-types": {
        "title": "JavaScript Variables and Data Types Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Variables and Data Types."
        ]
      },
      "hoec": {
        "title": "136",
        "intro": []
      },
      "workshop-teacher-chatbot": {
        "title": "Build a Teacher Chatbot",
        "intro": [
          "In this workshop, you will continue to learn more about JavaScript strings by building a chatbot.",
          "You will learn how to work with template literals, and the <code>indexOf</code> method."
        ]
      },
      "axgb": {
        "title": "138",
        "intro": []
      },
      "rwac": {
        "title": "139",
        "intro": []
      },
      "quiz-javascript-strings": {
        "title": "JavaScript Strings Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Strings."
        ]
      },
      "hxwa": {
        "title": "141",
        "intro": []
      },
      "workshop-mathbot": {
        "title": "Build a Mathbot",
        "intro": [
          "In this workshop, you will review how to work with the different Math object methods by building a Mathbot."
        ]
      },
      "lab-fortune-teller": {
        "title": "Build a Fortune Teller",
        "intro": [
          "In this lab, you will build a fortune teller by randomly selecting a fortune from the avaialble fortunes."
        ]
      },
      "wfyg": {
        "title": "144",
        "intro": []
      },
      "guqy": {
        "title": "145",
        "intro": []
      },
      "quiz-javascript-math": {
        "title": "JavaScript Math Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Math."]
      },
      "hafd": {
        "title": "147",
        "intro": []
      },
      "phko": {
        "title": "148",
        "intro": []
      },
      "quiz-javascript-comparisons-and-conditionals": {
        "title": "JavaScript Comparisons and Conditionals Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Comparisons and Conditionals."
        ]
      },
      "tsdq": {
        "title": "150",
        "intro": []
      },
      "workshop-calculator": {
        "title": "Build a Calculator",
        "intro": [
          "In this workshop, you will review working with functions by building a calculator."
        ]
      },
      "lab-email-masker": {
        "title": "Build an Email Masker",
        "intro": [
          "In this lab, you'll build an email masker that will take an email address and obscure it."
        ]
      },
      "lab-sentence-maker": {
        "title": "Build a Sentence Maker",
        "intro": [
          "In this lab, you will create different stories by assigning different words to different variables."
        ]
      },
      "workshop-loan-qualification-checker": {
        "title": "Build a Loan Qualification Checker",
        "intro": [
          "In this workshop, you will continue to learn how to work with conditionals by building a loan qualification checker app.",
          "You will learn more about <code>if</code> statements, and how to use comparison operators and multiple conditions in an <code>if</code> statement."
        ]
      },
      "lab-leap-year-calculator": {
        "title": "Build a Leap Year Calculator ",
        "intro": [
          "In this lab you will use conditional statements and loops to determine if a year is a leap year."
        ]
      },
      "pljo": {
        "title": "156",
        "intro": []
      },
      "quiz-javascript-functions": {
        "title": "JavaScript Functions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Functions."
        ]
      },
      "mexq": {
        "title": "158",
        "intro": []
      },
      "ifgn": {
        "title": "159",
        "intro": []
      },
      "workshop-shopping-list": {
        "title": "Build a Shopping List",
        "intro": [
          "In this workshop, you will practice working with arrays by building a shopping list.",
          "You will review how to add and remove elements from an array using methods like <code>push</code>, <code>pop</code>, <code>shift</code>, and <code>unshift</code>."
        ]
      },
      "lab-lunch-picker-program": {
        "title": "Build a Lunch Picker Program",
        "intro": [
          "In this lab, you will review working with arrays and random numbers by building a lunch picker program."
        ]
      },
      "mokm": {
        "title": "161",
        "intro": []
      },
      "froz": {
        "title": "162",
        "intro": []
      },
      "quiz-javascript-arrays": {
        "title": "JavaScript Arrays Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Arrays."]
      },
      "dvnt": {
        "title": "164",
        "intro": []
      },
      "ekdb": {
        "title": "165",
        "intro": []
      },
      "lab-quiz-game": {
        "title": "Build a Quiz Game",
        "intro": ["For this lab, you will build a quiz game."]
      },
      "lab-factorial-calculator": {
        "title": "Build a Factorial Calculator ",
        "intro": ["In this lab, you will build a factorial calculator."]
      },
      "quiz-javascript-objects": {
        "title": "JavaScript Objects Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Objects."
        ]
      },
      "kgtw": {
        "title": "169",
        "intro": []
      },
      "workshop-sentence-analyzer": {
        "title": "Build a Sentence Analyzer",
        "intro": [
          "In this workshop, you'll review working with JavaScript loops by building a sentence analyzer app."
        ]
      },
      "kcci": {
        "title": "171",
        "intro": []
      },
      "puhe": {
        "title": "172",
        "intro": []
      },
      "quiz-javascript-loops": {
        "title": "JavaScript Loops Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Loops."]
      },
      "hjtr": {
        "title": "174",
        "intro": []
      },
      "lab-pyramid-generator": {
        "title": "Build a Pyramid Generator",
        "intro": ["In this lab you will build a pyramid generator."]
      },
      "lab-gradebook-app": {
        "title": "Build a Gradebook App",
        "intro": ["For this lab, you will create a gradebook app."]
      },
      "epfc": {
        "title": "177",
        "intro": []
      },
      "lab-inventory-management-program": {
        "title": "Build an Inventory Management Program",
        "intro": [
          "For this lab, you will build an inventory management program using JavaScript."
        ]
      },
      "fbbn": {
        "title": "179",
        "intro": []
      },
      "lnmg": {
        "title": "180",
        "intro": []
      },
      "wead": {
        "title": "181",
        "intro": []
      },
      "quiz-javascript-fundamentals": {
        "title": "JavaScript Fundamentals Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Fundamentals Quiz."
        ]
      },
      "plic": {
        "title": "183",
        "intro": []
      },
      "vjmm": {
        "title": "184",
        "intro": []
      },
      "bxtv": {
        "title": "185",
        "intro": []
      },
      "xiqk": {
        "title": "186",
        "intro": []
      },
      "quiz-javascript-higher-order-functions": {
        "title": "JavaScript Higher Order Functions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Higher Order Functions."
        ]
      },
      "esfh": {
        "title": "188",
        "intro": []
      },
      "gibb": {
        "title": "189",
        "intro": []
      },
      "lab-favorite-icon-toggler": {
        "title": "Build a Favorite Icon Toggler",
        "intro": [
          "In this lab, you will build a favorite icon toggler by utilizing JavaScript click events."
        ]
      },
      "fhxc": {
        "title": "191",
        "intro": []
      },
      "quiz-dom-manipulation-and-click-event-with-javascript": {
        "title": "DOM Manipulation and Click Events with JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on DOM Manipulation and Click Events with JavaScript Quiz."
        ]
      },
      "ubpx": {
        "title": "193",
        "intro": []
      },
      "lbyi": {
        "title": "194",
        "intro": []
      },
      "lab-real-time-counter": {
        "title": "Build a Real Time Counter",
        "intro": ["In this lab, you will build a real-time character counter"]
      },
      "fmbk": {
        "title": "196",
        "intro": []
      },
      "lab-lightbox-viewer": {
        "title": "Build a Lightbox Viewer",
        "intro": [
          "In this lab, you will build a lighbox viewer for viewing images in a focused mode."
        ]
      },
      "workshop-rps-game": {
        "title": "Build a Rock, Paper, Scissors Game",
        "intro": [
          "In this workshop, you will review DOM manipulation and events by building a Rock, Paper, Scissors Game."
        ]
      },
      "lab-palindrome-checker": {
        "title": "Build a Palindrome Checker",
        "intro": [
          "For this lab, you'll build an application that checks whether a given word is a palindrome."
        ]
      },
      "lab-football-team-cards": {
        "title": "Build a Set of Football Team Cards",
        "intro": [
          "One common aspect of building web applications is processing datasets and outputting information to the screen. In this project, you will use DOM manipulation, object destructuring, event handling, and data filtering to build a set of football team cards."
        ]
      },
      "iejn": {
        "title": "201",
        "intro": []
      },
      "quiz-javascript-events": {
        "title": "JavaScript Events Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Events."]
      },
      "kaqq": {
        "title": "203",
        "intro": []
      },
      "lab-random-background-color-changer": {
        "title": "Debug a Random Background Color Changer",
        "intro": [
          "For this lab, you will debug a random background color changer and fix the errors to make it work properly."
        ]
      },
      "ksfc": {
        "title": "205",
        "intro": []
      },
      "quiz-debugging-javascript": {
        "title": "Debugging JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Debugging JavaScript."
        ]
      },
      "dqth": {
        "title": "207",
        "intro": []
      },
      "ilop": {
        "title": "208",
        "intro": []
      },
      "qrer": {
        "title": "209",
        "intro": []
      },
      "lab-regex-sandbox": {
        "title": "Build a RegEx Sandbox",
        "intro": ["In this lab you will build a regex sandbox."]
      },
      "svsl": {
        "title": "211",
        "intro": []
      },
      "quiz-javascript-regular-expressions": {
        "title": "JavaScript Regular Expressions Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Regular Expressions."
        ]
      },
      "zalp": {
        "title": "213",
        "intro": []
      },
      "hhvp": {
        "title": "214",
        "intro": []
      },
      "egkv": {
        "title": "215",
        "intro": []
      },
      "qlvw": {
        "title": "216",
        "intro": []
      },
      "quiz-form-validation-with-javascript": {
        "title": "Form Validation with JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Form Validation with JavaScript."
        ]
      },
      "lupt": {
        "title": "218",
        "intro": []
      },
      "lab-date-conversion": {
        "title": "Build a Date Conversion Program",
        "intro": [
          "In this lab, you will build a program to convert a date from one format to another."
        ]
      },
      "xtfk": {
        "title": "220",
        "intro": []
      },
      "quiz-javascript-dates": {
        "title": "JavaScript Dates Quiz",
        "intro": ["Test what you've learned in this quiz on JavaScript Dates."]
      },
      "lvts": {
        "title": "222",
        "intro": []
      },
      "foal": {
        "title": "223",
        "intro": []
      },
      "crzf": {
        "title": "224",
        "intro": []
      },
      "xofr": {
        "title": "225",
        "intro": []
      },
      "quiz-javascript-audio-and-video": {
        "title": "JavaScript Audio and Video Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Audio and Video."
        ]
      },
      "pehm": {
        "title": "227",
        "intro": []
      },
      "cvsw": {
        "title": "228",
        "intro": []
      },
      "lab-bookmark-manager-app": {
        "title": "Build a Bookmark Manager App",
        "intro": ["For this lab, you will build a bookmark manager app."]
      },
      "fgbp": {
        "title": "230",
        "intro": []
      },
      "quiz-local-storage-and-crud": {
        "title": "Local Storage and CRUD Quiz",
        "intro": [
          "Test what you've learned in this quiz on Local Storage and CRUD."
        ]
      },
      "jbst": {
        "title": "232",
        "intro": []
      },
      "peyf": {
        "title": "233",
        "intro": []
      },
      "bdqj": {
        "title": "234",
        "intro": []
      },
      "ndlf": {
        "title": "235",
        "intro": []
      },
      "quiz-recursion": {
        "title": "Recursion Quiz",
        "intro": ["Test what you've learned in this quiz on Recursion."]
      },
      "yshh": {
        "title": "237",
        "intro": []
      },
      "wyxz": {
        "title": "238",
        "intro": []
      },
      "lab-quicksort-algorithm": {
        "title": "Build the Quicksort Algorithm",
        "intro": [
          "For this lab, you will implement the Quicksort algorithm using JavaScript."
        ]
      },
      "dtfv": {
        "title": "240",
        "intro": []
      },
      "quiz-searching-and-sorting-algorithms": {
        "title": "Searching and Sorting Algorithms Quiz",
        "intro": [
          "Test what you've learned in this quiz on Searching and Sorting Algorithms."
        ]
      },
      "bnvw": {
        "title": "242",
        "intro": []
      },
      "xkhk": {
        "title": "243",
        "intro": []
      },
      "lab-roman-numeral-converter": {
        "title": "Build a Roman Numeral Converter",
        "intro": [
          "For this lab, you'll build an application that converts integers to Roman numerals."
        ]
      },
      "yaxm": {
        "title": "245",
        "intro": []
      },
      "lab-telephone-number-validator": {
        "title": "Build a Telephone Number Validator",
        "intro": [
          "For this lab, you'll build an application that checks if a number is a valid United States phone number."
        ]
      },
      "lab-cash-register": {
        "title": "Build a Cash Register",
        "intro": ["For this lab, you will build a cash register."]
      },
      "udia": {
        "title": "248",
        "intro": []
      },
      "quiz-javascript-problem-solving-and-algorithmic-thinking": {
        "title": "JavaScript Problem Solving and Algorithmic Thinking Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Problem Solving and Algorithmic Thinking."
        ]
      },
      "xayi": {
        "title": "250",
        "intro": []
      },
      "mjbe": {
        "title": "251",
        "intro": []
      },
      "byqx": {
        "title": "252",
        "intro": []
      },
      "alda": {
        "title": "253",
        "intro": []
      },
      "quiz-javascript-functional-programming": {
        "title": "JavaScript Functional Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Functional Programming."
        ]
      },
      "cvaf": {
        "title": "255",
        "intro": []
      },
      "tdgy": {
        "title": "256",
        "intro": []
      },
      "saxu": {
        "title": "257",
        "intro": []
      },
      "kagw": {
        "title": "258",
        "intro": []
      },
      "mbib": {
        "title": "259",
        "intro": []
      },
      "oxiv": {
        "title": "260",
        "intro": []
      },
      "quiz-javascript-object-oriented-programming": {
        "title": "JavaScript Object Oriented Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Object Oriented Programming."
        ]
      },
      "nixz": {
        "title": "262",
        "intro": []
      },
      "lab-stack-class": {
        "title": "Build a Stack Class",
        "intro": [
          "For this lab, you will build a stack class using JavaScript."
        ]
      },
      "lab-linked-list-class": {
        "title": "Build a Linked List Class",
        "intro": [
          "For this lab, you will build a linked list class using JavaScript."
        ]
      },
      "lab-hash-table-class": {
        "title": "Build a Hash Table Class",
        "intro": ["For this lab, you will build a hash table using JavaScript."]
      },
      "muyw": {
        "title": "266",
        "intro": []
      },
      "quiz-javascript-data-structures": {
        "title": "JavaScript Data Structures Quiz",
        "intro": [
          "Test what you've learned in this quiz on JavaScript Data Structures."
        ]
      },
      "rmpy": {
        "title": "268",
        "intro": []
      },
      "lab-depth-first-search": {
        "title": "Implement the Depth-First Search Algorithm",
        "intro": [
          "For this lab, you will use JavaScript to implement the Depth-First Search algorithm."
        ]
      },
      "xdyh": {
        "title": "270",
        "intro": []
      },
      "quiz-graphs-and-trees": {
        "title": "Graphs and Trees Quiz",
        "intro": ["Test what you've learned in this quiz on Graphs and Trees."]
      },
      "vjgg": {
        "title": "272",
        "intro": []
      },
      "lab-nth-fibonacci-number-generator": {
        "title": "Build the nth Fibonacci number generator",
        "intro": [
          "For this lab, you will implement the nth Fibonacci number generator."
        ]
      },
      "kaui": {
        "title": "274",
        "intro": []
      },
      "quiz-dynamic-programming": {
        "title": "Dynamic Programming Quiz",
        "intro": [
          "Test what you've learned in this quiz on Dynamic Programming."
        ]
      },
      "sgau": {
        "title": "276",
        "intro": []
      },
      "clak": {
        "title": "277",
        "intro": []
      },
      "fcom": {
        "title": "278",
        "intro": []
      },
      "ffpt": {
        "title": "279",
        "intro": []
      },
      "lab-pokemon-search-app": {
        "title": "Build a Pokémon Search App",
        "intro": ["For this project, you will build a Pokémon search app."]
      },
      "vyzp": {
        "title": "281",
        "intro": []
      },
      "quiz-asynchronous-javascript": {
        "title": "Asynchronous JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Asynchronous JavaScript."
        ]
      },
      "icdr": {
        "title": "283",
        "intro": []
      },
      "zdsj": {
        "title": "284",
        "intro": []
      },
      "mzae": {
        "title": "285",
        "intro": []
      },
      "gjbf": {
        "title": "286",
        "intro": []
      },
      "mbpv": {
        "title": "287",
        "intro": []
      },
      "eeez": {
        "title": "288",
        "intro": []
      },
      "quiz-web-standards": {
        "title": "Web Standards Quiz",
        "intro": ["Test what you've learned in this quiz on Web Standards."]
      },
      "khuu": {
        "title": "290",
        "intro": []
      },
      "xdly": {
        "title": "291",
        "intro": []
      },
      "rhhl": {
        "title": "292",
        "intro": []
      },
      "trvf": {
        "title": "293",
        "intro": []
      },
      "kwmg": {
        "title": "294",
        "intro": []
      },
      "nodx": {
        "title": "295",
        "intro": []
      },
      "erfj": {
        "title": "296",
        "intro": []
      },
      "quiz-react-basics": {
        "title": "React Basics Quiz",
        "intro": ["Test what you've learned in this quiz on React Basics."]
      },
      "hfwi": {
        "title": "298",
        "intro": []
      },
      "rnwr": {
        "title": "299",
        "intro": []
      },
      "oeqv": {
        "title": "300",
        "intro": []
      },
      "rdzk": {
        "title": "301",
        "intro": []
      },
      "vtpz": {
        "title": "302",
        "intro": []
      },
      "dfwl": {
        "title": "303",
        "intro": []
      },
      "adzm": {
        "title": "304",
        "intro": []
      },
      "quiz-react-state-and-hooks": {
        "title": "React State and Hooks Quiz",
        "intro": [
          "Test what you've learned in this quiz on React State and Hooks."
        ]
      },
      "voks": {
        "title": "306",
        "intro": []
      },
      "uwum": {
        "title": "307",
        "intro": []
      },
      "ukem": {
        "title": "308",
        "intro": []
      },
      "sdjg": {
        "title": "309",
        "intro": []
      },
      "buzx": {
        "title": "310",
        "intro": []
      },
      "pexz": {
        "title": "311",
        "intro": []
      },
      "prlo": {
        "title": "312",
        "intro": []
      },
      "jsnd": {
        "title": "313",
        "intro": []
      },
      "quiz-advanced-react": {
        "title": "Advanced React Quiz",
        "intro": ["Test what you've learned in this quiz on Advanced React."]
      },
      "tkgg": {
        "title": "315",
        "intro": []
      },
      "coip": {
        "title": "316",
        "intro": []
      },
      "quiz-web-performance": {
        "title": "Web Performance Quiz",
        "intro": ["Test what you've learned in this quiz on Web Performance."]
      },
      "hzab": {
        "title": "318",
        "intro": []
      },
      "ggea": {
        "title": "319",
        "intro": []
      },
      "vgvz": {
        "title": "320",
        "intro": []
      },
      "jkfc": {
        "title": "321",
        "intro": []
      },
      "quiz-typescript": {
        "title": "TypeScript Quiz",
        "intro": ["Test what you've learned in this quiz on TypeScript."]
      },
      "zhhp": {
        "title": "323",
        "intro": []
      },
      "nwwd": {
        "title": "324",
        "intro": []
      },
      "quiz-css-libraries-and-frameworks": {
        "title": "CSS Libraries and Frameworks Quiz",
        "intro": [
          "Test what you've learned in this quiz on CSS Libraries and Frameworks."
        ]
      },
      "gora": {
        "title": "326",
        "intro": []
      },
      "vpkl": {
        "title": "327",
        "intro": []
      },
      "quiz-testing": {
        "title": "Testing Quiz",
        "intro": ["Test what you've learned in this quiz on Testing."]
      },
      "lzvx": {
        "title": "329",
        "intro": []
      },
      "mfwu": {
        "title": "330",
        "intro": []
      },
      "dfcd": {
        "title": "331",
        "intro": []
      },
      "workshop-bash-boilerplate": {
        "title": "Build a Boilerplate",
        "intro": [
          "The terminal allows you to send text commands to your computer that can manipulate the file system, run programs, automate tasks, and much more.",
          "In this 170-lesson workshop, you will learn terminal commands by creating a website boilerplate using only the command line."
        ]
      },
      "vfje": {
        "title": "333",
        "intro": []
      },
      "quiz-bash-commands": {
        "title": "Bash Commands Quiz",
        "intro": ["Test what you've learned in this quiz on Bash Commands."]
      },
      "thsj": {
        "title": "335",
        "intro": []
      },
      "workshop-mario-database": {
        "title": "Build a Mario Database",
        "intro": [
          "A relational database organizes data into tables that are linked together through relationships.",
          "In this 165-lesson workshop, you will learn the basics of a relational database by creating a PostgreSQL database filled with video game characters."
        ]
      },
      "lab-celestial-bodies-database": {
        "title": "Build a Celestial Bodies Database",
        "intro": [
          "For this project, you will build a database of celestial bodies using PostgreSQL."
        ]
      },
      "cvvu": {
        "title": "338",
        "intro": []
      },
      "quiz-relational-database": {
        "title": "Relational Database Quiz",
        "intro": [
          "Test what you've learned in this quiz on Relational Databases."
        ]
      },
      "ynqt": {
        "title": "340",
        "intro": []
      },
      "workshop-bash-five-programs": {
        "title": "Build Five Programs",
        "intro": [
          "Bash scripts combine terminal commands and logic into programs that can execute or automate tasks, and much more.",
          "In this 220-lesson workshop, you will learn more terminal commands and how to use them within Bash scripts by creating five small programs."
        ]
      },
      "hnta": {
        "title": "342",
        "intro": []
      },
      "quiz-bash-scripting": {
        "title": "Bash Scripting Quiz",
        "intro": ["Test what you've learned in this quiz on Bash Scripting."]
      },
      "pegc": {
        "title": "344",
        "intro": []
      },
      "workshop-sql-student-database-part-1": {
        "title": "Build a Student Database: Part 1",
        "intro": [
          "SQL, or Structured Query Language, is the language for communicating with a relational database.",
          "In this 140-lesson workshop, you will create a Bash script that uses SQL to enter information about your computer science students into PostgreSQL."
        ]
      },
      "workshop-sql-student-database-part-2": {
        "title": "Build a Student Database: Part 2",
        "intro": [
          "SQL join commands are used to combine information from multiple tables in a relational database",
          "In this 140-lesson workshop, you will complete your student database while diving deeper into SQL commands."
        ]
      },
      "lab-world-cup-database": {
        "title": "Build a World Cup Database",
        "intro": [
          "For this project, you will create a Bash script that enters information from World Cup games into PostgreSQL, then query the database for useful statistics."
        ]
      },
      "workshop-kitty-ipsum-translator": {
        "title": "Build a Kitty Ipsum Translator",
        "intro": [
          "There's more to Bash commands than you might think.",
          "In this 140-lesson workshop, you will learn some more complex commands, and the details of how commands work."
        ]
      },
      "workshop-bike-rental-shop": {
        "title": "Build a Bike Rental Shop",
        "intro": [
          "In this 210-lesson workshop, you will build an interactive Bash program that stores rental information for your bike rental shop using PostgreSQL."
        ]
      },
      "lab-salon-appointment-scheduler": {
        "title": "Build a Salon Appointment Scheduler",
        "intro": [
          "For this lab, you will create an interactive Bash program that uses PostgreSQL to track the customers and appointments for your salon."
        ]
      },
      "udfh": {
        "title": "351",
        "intro": []
      },
      "quiz-bash-and-sql": {
        "title": "Bash and SQL Quiz",
        "intro": ["Test what you've learned in this quiz on Bash and SQL."]
      },
      "movb": {
        "title": "353",
        "intro": []
      },
      "workshop-castle": {
        "title": "Build a Castle",
        "intro": [
          "Nano is a program that allows you to edit files right in the terminal.",
          "In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle."
        ]
      },
      "dzsr": {
        "title": "355",
        "intro": []
      },
      "quiz-nano": {
        "title": "Nano Quiz",
        "intro": ["Test what you've learned in this quiz on Nano."]
      },
      "pzmc": {
        "title": "357",
        "intro": []
      },
      "workshop-sql-reference-object": {
        "title": "Build an SQL Reference Object",
        "intro": [
          "Git is a version control system that keeps track of all the changes you make to your codebase.",
          "In this 240-lesson workshop, you will learn how Git keeps track of your code by creating an object containing commonly used SQL commands."
        ]
      },
      "lab-periodic-table-database": {
        "title": "Build a Periodic Table Database",
        "intro": [
          "For this lab, you will create a Bash script to get information about chemical elements from a periodic table database."
        ]
      },
      "lab-number-guessing-game": {
        "title": "Build a Number Guessing Game",
        "intro": [
          "For this lab, you will use Bash scripting, PostgreSQL, and Git to create a number guessing game that runs in the terminal and saves user information."
        ]
      },
      "nfoc": {
        "title": "361",
        "intro": []
      },
      "quiz-git": {
        "title": "Git Quiz",
        "intro": ["Test what you've learned in this quiz on Git."]
      },
      "ibmn": {
        "title": "363",
        "intro": []
      },
      "zpjj": {
        "title": "364",
        "intro": []
      },
      "ghfk": {
        "title": "365",
        "intro": []
      },
      "ugfq": {
        "title": "366",
        "intro": []
      },
      "quiz-security-and-privacy": {
        "title": "Security and Privacy Quiz",
        "intro": [
          "Test what you've learned in this quiz on Security and Privacy."
        ]
      },
      "qjov": {
        "title": "368",
        "intro": []
      },
      "workshop-npm-packages": {
        "title": "Managing Packages with npm",
        "intro": [
          "npm (Node Package Manager), is a command line tool to install, create, and share packages of JavaScript code written for Node.js. There are many open source packages available on npm, so before starting a project, take some time to explore so you don't end up recreating the wheel for things like working with dates or fetching data from an API.",
          "In this workshop, you'll learn the basics of using npm, including how to work with the <code>package.json</code> file and how to manage your installed dependencies."
        ]
      },
      "hjku": {
        "title": "370",
        "intro": []
      },
      "workshop-node-and-express": {
        "title": "Basic Node and Express",
        "intro": [
          "Node.js is a JavaScript runtime that allows developers to write backend (server-side) programs in JavaScript. Node.js comes with a handful of built-in modules — small, independent programs — that help with this. Some of the core modules include HTTP, which acts like a server, and File System, a module to read and modify files.",
          "In the last set of courses you learned to install and manage packages from npm, which are collections of smaller modules. These packages can help you build larger, more complex applications.",
          "Express is a lightweight web application framework, and is one of the most popular packages on npm. Express makes it much easier to create a server and handle routing for your application, which handles things like directing people to the correct page when they visit a certain endpoint like <pre>/blog</pre>.",
          "In this course, you'll learn the basics of Node and Express including how to create a server, serve different files, and handle different requests from the browser."
        ]
      },
      "lab-timestamp-microservice": {
        "title": "Build a Timestamp Microservice",
        "intro": ["In this lab you will build a timestamp microservice"]
      },
      "lab-request-header-parser-microservice": {
        "title": "Build a Request Header Parser Microservice",
        "intro": [
          "In this lab, you will build a request header parser microservice"
        ]
      },
      "lab-url-shortener-microservice": {
        "title": "Build a URL Shortener Microservice",
        "intro": ["In this lab, you will build a URL Shortener Microservice"]
      },
      "lab-exercise-tracker": {
        "title": "Build an Exercise Tracker",
        "intro": ["In this lab, you will build an exercise tracker"]
      },
      "lab-file-metadata-microservice": {
        "title": "Build a File Metadata Microservice",
        "intro": ["For this lab you will build a file metadata microservice"]
      },
      "kegi": {
        "title": "377",
        "intro": []
      },
      "quiz-backend-javascript": {
        "title": "Backend JavaScript Quiz",
        "intro": [
          "Test what you've learned in this quiz on Backend JavaScript."
        ]
      },
      "vnfu": {
        "title": "379",
        "intro": []
      },
      "rlli": {
        "title": "380",
        "intro": []
      },
      "rjpv": {
        "title": "381",
        "intro": []
      },
      "xbri": {
        "title": "382",
        "intro": []
      },
      "quiz-tooling-and-deployment": {
        "title": "Tooling and Deployment Quiz",
        "intro": [
          "Test what you've learned in this quiz of tooling and deployment"
        ]
      },
      "nkjt": {
        "title": "384",
        "intro": []
      },
      "pgjj": {
        "title": "385",
        "intro": []
      },
      "exom": {
        "title": "386",
        "intro": []
      },
      "bvqc": {
        "title": "387",
        "intro": []
      },
      "xish": {
        "title": "388",
        "intro": []
      },
      "front-end-development-certification-exam": {
        "title": "Front End Development Certification Exam",
        "intro": ["", ""]
      }
    }
  },
  "misc-text": {
    "certification": "Certificazione {{cert}}",
    "browse-other": "Sfoglia le altre nostre certificazioni gratuite\n(consigliamo di seguirle in ordine)",
    "courses": "Corsi",
    "steps": "Passaggi",
    "expand": "Espandi corso",
    "collapse": "Chiudi corso",
    "legacy-header": "Vecchi corsi",
    "legacy-desc": "Questi corsi non sono più parte del percorso di certificazioni, ma sono ancora disponibili per avanzare il tuo apprendimento.",
    "legacy-go-back": "Vai alla versione corrente del curriculum.",
    "course-maintenance": "Questi corsi sono in manutenzione. Se non funzionano, puoi imparare come eseguirli localmente su <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "course-disabling-soon": "The browser version of these courses will be temporarily disabled soon and your virtual machines will be deleted. Any progress in your virtual machines will be lost. If you have any files you want from them, you should save them to your computer. We apologize for any inconvenience. We hope to have an improved browser version of these courses available again in the next few weeks.",
    "course-disabled": "These courses are temporarily unavailable to run in the browser. We apologize for any inconvenience. You can learn how to run them locally at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. We hope to have an improved browser version available again soon.",
    "run-locally": "For now, we recommend running the courses locally on your computer. You can learn how at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "I tuoi progressi non saranno salvati sul tuo account freeCodeCamp quando li esegui localmente.",
    "go-back-to-learn": "Torna alla versione stabile del curriculum.",
    "read-database-cert-article": "Per favore leggi questo post sul forum prima di procedere.",
    "enable-cookies": "Devi abilitare i cookie di terze parti prima di iniziare.",
    "english-only": "I corsi in questa sezione sono disponibili solo in inglese. Siamo solo in grado di tradurre i titoli e le introduzioni in questo momento, non le lezioni stesse.",
    "exam-english-only": "Please note that the certification exam is currently available only in English. The rest of the courses are available in some languages."
  }
}
