{
  "responsive-web-design": {
    "title": "Sfide del Web Design Responsivo Legacy",
    "intro": [
      "In questo corso di Web Design Responsivo conoscerai i linguaggi usati per costruire le pagine web: HTML (Hypertext Markup Language) per il contenuto, e CSS (Cascade Style Sheets) per il design.",
      "Per prima cosa, costruirai un'app di foto per gatti per imparare le basi di HTML e CSS. Poi apprenderai tecniche più moderne come le variabili in CSS costruendo un pinguino, e le migliori pratiche per l'accessibilità costruendo un modulo web.",
      "Infine, imparerai a realizzare pagine web adattabili a diverse misure di schermo costruendo una card Twitter con Flexbox, e un complesso layout per blog con CSS Grid."
    ],
    "note": "Nota: Alcune estensioni del browser, come ad esempio gli ad-blocker e le estensioni per la modalità scura, possono interferire con i test. In caso di problemi, ti consigliamo di disabilitare le estensioni che modificano il contenuto o il layout delle pagine durante il corso."
  },
  "2022/responsive-web-design": {
    "title": "Web Design Responsivo",
    "intro": [
      "In questo corso certificato di Web Design Responsivo imparerai i linguaggi che gli sviluppatori utilizzano per creare le pagine web. HTML (Hypertext Markup Language) per i contenuti e CSS (Cascading Style Sheets) per il design.",
      "Per prima cosa, costruirai un'app con foto di gatti per imparare le basi di HTML e CSS. Poi apprenderai tecniche più moderne come le variabili in CSS costruendo un pinguino, e le migliori pratiche per l'accessibilità costruendo un quiz.",
      "Infine, imparerai a realizzare pagine web adattabili a diverse misure di schermo costruendo una galleria di foto con Flexbox e il layout di un articolo di rivista con CSS Grid."
    ],
    "note": "Nota: Alcune estensioni del browser, come ad esempio gli ad-blocker e le estensioni per la modalità scura, possono interferire con i test. In caso di problemi, ti consigliamo di disabilitare le estensioni che modificano il contenuto o il layout delle pagine durante il corso."
  },
  "javascript-algorithms-and-data-structures": {
    "title": "Legacy JavaScript Algorithms and Data Structures",
    "intro": [
      "Mentre HTML e CSS controllano il contenuto e lo stile della pagina, JavaScript viene utilizzato per renderla interattiva. Nella Certificazione Algoritmi e Strutture Dati in JavaScript, imparerai le basi di JavaScript, tra cui variabili, array, oggetti, loop e funzioni.",
      "Una volta che avrai appreso le basi, applicherai queste conoscenze creando algoritmi per manipolare stringhe, fattorizzare numeri, e persino calcolare l'orbita della Stazione Spaziale Internazionale.",
      "Lungo il percorso, imparerai anche due importanti stili di programmazione o paradigmi: la Programmazione Orientata agli Oggetti (Object Oriented Programming, OOP) e la Programmazione Funzionale (Functional Programming, FP)."
    ],
    "note": "Nota: Alcune estensioni del browser, come ad esempio gli ad-blocker e gli script-blocker, possono interferire con i test. In caso di problemi, ti raccomandiamo di disabilitare le estensioni che modificano o bloccano il contenuto delle pagine durante il corso."
  },
  "javascript-algorithms-and-data-structures-v8": {
    "title": "JavaScript Algorithms and Data Structures",
    "intro": [
      "Developers use HTML and CSS to control the content and styling of a page. And they use JavaScript to make that page interactive.",
      "Nella certificazione JavaScript Algoritmi e Strutture di Dati, imparerai i fondamenti di JavaScript come variabili, array, oggetti, loop, funzioni, il DOM e altro ancora.",
      "Imparerai anche la programmazione orientata agli oggetti (OOP), la programmazione funzionale, come sviluppare algoritmi, lavorare con il local storage e come recuperare i dati utilizzando un'API."
    ],
    "note": "Note: Some browser extensions, such as ad-blockers and script-blockers can interfere with the tests. If you face issues, we recommend disabling extensions that modify or block the content of pages while taking the course."
  },
  "front-end-development-libraries": {
    "title": "Librerie di sviluppo Front End",
    "intro": [
      "Ora che hai familiarità con HTML, CSS, e JavaScript, aumenta le tue competenze conoscendo alcune delle più popolari librerie di front-end del settore.",
      "Nella Certificazione Librerie di Sviluppo Front End, imparerai come definire rapidamente lo stile del tuo sito con Bootstrap. Imparerai anche come aggiungere la logica ai tuoi stili CSS e ad estenderli con Sass.",
      "Più tardi, costruirai un carrello e altre applicazioni per imparare a creare potenti applicazioni a pagina singola (Single Page Application, SPA) con React e Redux."
    ],
    "note": ""
  },
  "data-visualization": {
    "title": "Data Visualization",
    "intro": [
      "I dati ci circondano, ma non ci dicono molto senza forma o contesto.",
      "Nella Certificazione Visualizzazione dei Dati, costruirai diagrammi, grafici e mappe per presentare diversi tipi di dati con la libreria D3.js.",
      "Imparerai anche JSON (JavaScript Object Notation), e come lavorare con i dati online utilizzando un'API (Application Programming Interface)."
    ],
    "note": ""
  },
  "relational-database": {
    "title": "Database Relazionali",
    "intro": [
      "Per questi corsi, userai veri strumenti e software da sviluppatori inclusi VSCode, PostgreSQL, e la riga di comando Linux / Unix per completare i tutorial interattivi e creare progetti.",
      "Questi corsi iniziano con comandi Bash di base. Usando il terminale imparerai tutto da navigare e manipolare il sistema dei file, creare script in bash, tutto quanto fino all'uso avanzato.",
      "Poi, imparerari come creare e usare un database relazionale con PostgreSQL, un sistema di gestione database, e SQL, il linguaggio di questi database.",
      "Infine, imparerai Git, il sistema di controllo versione, uno strumento essenziale per ogni sviluppatore."
    ]
  },
  "back-end-development-and-apis": {
    "title": "Sviluppo Back End e API",
    "intro": [
      "Fino a questo punto, hai usato solo JavaScript sul front-end per aggiungere interattività a una pagina, risolvere sfide algoritmiche o costruire una Single Page Application. Ma JavaScript può essere utilizzato anche nel backend (cioè lato server), per costruire intere applicazioni web.",
      "Oggi, uno dei modi più popolari per costruire applicazioni è attraverso i microservizi, che sono piccole applicazioni modulari che lavorano insieme per formare qualcosa di più grande.",
      "Nella Certificazione Sviluppo Back End e API, imparerai a scrivere app per il backend con Node.js e npm. Costruirai anche applicazioni web con il framework Express, e costruirai un microservizio Trova Persone con MongoDB e la libreria Mongoose."
    ],
    "note": ""
  },
  "quality-assurance": {
    "title": "Garanzia di Qualità",
    "intro": [
      "Mano a mano che i tuoi programmi o applicazioni web diventeranno più complessi, vorrai testarli per assicurarti che le nuove modifiche non compromettano la loro funzionalità originaria.",
      "Nella Certificazione Garanzia di Qualità imparerai a scrivere i test con Chai per garantire che le tue applicazioni funzionino nel modo in cui ti aspetti.",
      "Poi costruirai un'applicazione di chat per apprendere concetti avanzati Node e Express. Utilizzerai anche Pug come motore di modelli, Passport per l'autenticazione e Socket.io per la comunicazione in tempo reale tra il server e i client connessi."
    ],
    "note": ""
  },
  "scientific-computing-with-python": {
    "title": "Scientific Computing with Python",
    "intro": [
      "The Scientific Computing with Python curriculum will equip you with the skills to analyze and manipulate data using Python, a powerful and versatile programming language. You'll learn key concepts like data structures, algorithm, Object Oriented Programming, and how to perform complex calculations using a variety of tools.",
      "This comprehensive course will guide you through the fundamentals of scientific computing, including data structures, and algorithms."
    ],
    "note": ""
  },
  "data-analysis-with-python": {
    "title": "Analisi dei dati con Python",
    "intro": [
      "L'analisi dei dati esiste da molto tempo, ma fino a pochi anni fa, gli sviluppatori l'hanno praticata utilizzando costosi strumenti proprietari come Tableau. Recentemente però, Python, SQL e altre librerie aperte hanno cambiato per sempre il mondo dell'analisi dei dati.",
      "Nella Certificazione Analisi dei dati con Python, imparerai i fondamenti dell'analisi dei dati con Python. Alla fine di questa certificazione, saprai leggere i dati da fonti come CSV e SQL, e come usare librerie come Numpy, Pandas, Matplotlib, e Seaborn per elaborare e visualizzare i dati."
    ],
    "note": ""
  },
  "information-security": {
    "title": "Sicurezza dell'Informazione",
    "intro": [
      "Con tutto quello che facciamo online, c'è una grande quantità di informazioni sensibili a rischio: indirizzi e-mail, password, numeri di telefono e molto altro.",
      "Con la Certificazione Sicurezza dell'Informazione, costruirai una web app sicura con HelmetJS per apprendere i fondamenti della protezione delle informazioni delle persone online.",
      "Costruirai anche un client TCP e uno scanner Nmap e un port scanner in Python. Questo ti aiuterà a imparare le basi del penetration testing — una componente importante di una buona sicurezza dell'informazione."
    ],
    "note": ""
  },
  "machine-learning-with-python": {
    "title": "Machine Learning con Python",
    "intro": [
      "L'apprendimento automatico (Machine Learning), ha molte applicazioni pratiche che potrai utilizzare nei tuoi progetti o al lavoro.",
      "Nella Certificazione Machine Learning con Python, userai il framework TensorFlow per costruire diverse reti neurali ed esplorare tecniche più avanzate come l'elaborazione del linguaggio naturale e l'apprendimento rinforzato.",
      "Potrai anche immergerti nelle reti neurali e imparare i principi dietro al funzionamento delle reti neurali profonde, ricorrenti e convoluzionali."
    ],
    "note": ""
  },
  "college-algebra-with-python": {
    "title": "Algebra Universitaria con Python",
    "intro": [
      "Questo corso è progettato come un corso universitario di un semestre. Si compone di video didattici, con notebook di Google Colaboratory per seguire in modo interattivo, attività e progetti stimolanti.",
      "Affrontando le varie parti di questo corso in sequenza, otterrai una piena comprensione dell'algebra e di come scrivere del codice Python per risolvere problemi di algebra.",
      "Durante questo corso, costruirai anche un notebook Colab di algebra, che potrai utilizzare come calcolatrice personalizzata. Questo corso (e il codice che scriverai) ti darà le basi per una comprensione più profonda della matematica e della scienza dei dati."
    ],
    "note": ""
  },
  "python-for-everybody": {
    "title": "Legacy Python for Everybody",
    "intro": [
      "Python is one of the most popular, flexible programming languages today. You can use it for everything from basic scripting to machine learning."
    ],
    "note": ""
  },
  "coding-interview-prep": {
    "title": "Preparazione per il colloquio di lavoro per programmatori",
    "intro": [
      "Se stai cercando esercizi di programmazione gratuiti per prepararti al tuo prossimo colloquio di lavoro, sei nel posto giusto.",
      "This section contains dozens of coding challenges that test your knowledge of algorithms, data structures, and mathematics. It also has a number of take-home projects you can use to strengthen your skills, or add to your portfolio.",
      "This work incorporates material from <a href=\"https://www.wikipedia.org/\" target=\"_blank\">Wikipedia</a>, which is licensed under the <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\" target=\"_blank\">Creative Commons Attribution-ShareAlike License 4.0</a>. The original content might have been modified and adapted. For the unaltered version and additional details, see the original page on <a href=\"https://www.wikipedia.org/\" target\"_blank\">Wikipedia</a>."
    ]
  },
  "the-odin-project": {
    "title": "The Odin Project - freeCodeCamp Remix",
    "intro": [
      "The Odin Project was created in 2013 by a lone developer, Erik Trautman. Over the years, an open source community has sprung up to maintain and expand the project.",
      "freeCodeCamp has expanded upon the open source curriculum to make it run interactively in the browser, with tests to evaluate your code and ensure you've understood key concepts.",
      "If you want the original experience of configuring all of The Odin Project to run on your local computer, you can check out the original Odin Project on <a href='https://www.theodinproject.com/' target='_blank' rel='noopener noreferrer nofollow'>The Odin Project website</a>. A huge thanks to The Odin Project community for continuing to maintain this valuable learning resource for developers all around the world.",
      "This course is unofficial, and not endorsed by The Odin Project. Changes to The Odin Project curriculum content have been made, and all instructional material for this course is licensed under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-SA-NC 4.0</a>",
      "<a href='https://creativecommons.org/licenses/by-nc-sa/4.0/deed' target='_blank' rel='noopener noreferrer nofollow'>&copy; The Odin Project</a>",
      "This course includes content from <a href='https://javascript.info/' target='_blank' rel='noopener noreferrer nofollow'>JavaScript.info</a>, which is licensed under <a href='https://creativecommons.org/licenses/by-nc-sa/4.0/' target='_blank' rel='noopener noreferrer nofollow'>CC-BY-NC-SA 4.0</a>."
    ]
  },
  "project-euler": {
    "title": "Progetto Eulero",
    "intro": [
      "Completa le sfide di programmazione sottostanti, dagli enormi archivi del Progetto Eulero. Consolideranno le tue conoscenze in materia di algoritmi e matematica.",
      "Questi problemi variano in difficoltà e, per molti, l'esperienza di apprendimento è a catena induttiva. Cioè, risolvendo un problema, sarai esposto a un nuovo concetto che consente di affrontare un problema precedentemente inaccessibile. Riesci a finirli tutti?"
    ]
  },
  "foundational-c-sharp-with-microsoft": {
    "title": "Free Foundational C# with Microsoft Certification",
    "intro": [
      "Questo corso offre un'introduzione completa alla programmazione in C# trattandone i concetti principali, sintassi e applicazione pratica nello sviluppo di software.",
      "Attraverso esercizi e progetti pratici imparerai i fondamenti di C#, comprese le variabili, i tipi di dati, le strutture di controllo e i principi della programmazione orientati agli oggetti.",
      "Alla fine di questo corso, avrai acquisito le competenze pratiche e le conoscenze necessarie per usare C# con sicurezza creare applicazioni."
    ],
    "note": "Each section below has a trophy associated with it that you must earn on the Microsoft Learn platform. After earning each trophy, you need to verify them on freeCodeCamp. Once you have done those, you can qualify for the certification exam."
  },
  "a2-english-for-developers": {
    "title": "A2 English for Developers (Beta) Certification",
    "intro": [
      "In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the A2 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.",
      "The first half of the curriculum will help you get comfortable with English grammar and usage. It will give you tons of hands-on practice. You'll learn basics like introducing yourself, making small talk, and discussing your work.",
      "In the second half, you'll practice vocabulary specific to software development. You'll learn how to describe code, discuss tech trends, and participate in stand-up meetings.",
      "This entire A2-level curriculum includes 105 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting."
    ]
  },
  "b1-english-for-developers": {
    "title": "B1 English for Developers (Beta) Certification",
    "intro": [
      "In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the B1 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.",
      "It will help you strengthen your foundational skills while introducing more complex grammar and usage. You'll learn how to describe places and things, share past experiences, and confidently use tenses like Present Perfect and Future. Practical communication strategies are included as well, such as managing conversations, expressing opinions, and building agreement or disagreement in discussions.",
      "You'll also focus on applying these skills in professional and technical settings. You'll practice vocabulary and phrases essential for developers, such as describing code, participating in stand-up meetings, and discussing tech trends. Advanced topics include conditionals, comparative structures, and conversation management, so you can prepare for real-world interactions in the tech industry.",
      "This entire B1-level curriculum includes 73 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting."
    ]
  },
  "rosetta-code": {
    "title": "Rosetta Code",
    "intro": [
      "Level up your creative problem solving skills with these free programming tasks from the classic Rosetta Code library.",
      "These challenges can prove to be difficult, but they will push your algorithm logic to new heights.",
      "<a href='https://rosettacode.org/wiki/Rosetta_Code' target='_blank' rel='noopener noreferrer nofollow'>Attribute: Rosetta Code</a>"
    ]
  },
  "full-stack-developer": {
    "title": "Certified Full Stack Developer Curriculum",
    "intro": [
      "This course provides a comprehensive pathway to becoming a Certified Full Stack Developer, covering all the essential technologies required to build modern, scalable web applications from start to finish.",
      "Through a blend of interactive lessons, coding exercises, and real-world projects, you will master both frontend and backend development. You'll work with HTML, CSS, and JavaScript to build responsive user interfaces, explore React and TypeScript for advanced web applications, and learn to manage data with relational databases - and on the backend, you'll use Git, Npm, Node.js, and Python to create powerful server-side solutions.",
      "By the end of this course, you'll have the practical skills and experience to confidently develop complete web applications, preparing you for a successful career as a Full Stack Developer.",
      "This certification will take you a substantial amount of time and effort to complete. If you start now, you may be ready to start the remaining material and final exam when we launch it in the coming months."
    ],
    "chapters": {
      "html": "HTML",
      "css": "CSS",
      "javascript": "JavaScript",
      "frontend-libraries": "Front End Libraries",
      "relational-databases": "Relational Databases",
      "backend-javascript": "Backend JavaScript",
      "python": "Python",
      "career": "Career"
    },
    "modules": {
      "basic-html": "Basic HTML",
      "semantic-html": "Semantic HTML",
      "html-forms-and-tables": "Forms and Tables",
      "html-and-accessibility": "Accessibility",
      "review-html": "HTML Review",
      "exam-html": "HTML Exam",
      "computer-basics": "Computer Basics",
      "basic-css": "Basic CSS",
      "design-for-developers": "Design",
      "absolute-and-relative-units": "Absolute and Relative Units",
      "pseudo-classes-and-elements": "Pseudo Classes and Elements",
      "css-colors": "Colors",
      "styling-forms": "Styling Forms",
      "css-box-model": "The Box Model",
      "css-flexbox": "Flexbox",
      "css-typography": "Typography",
      "css-and-accessibility": "Accessibility",
      "attribute-selectors": "Attribute Selectors",
      "css-positioning": "Positioning",
      "responsive-design": "Responsive Design",
      "css-variables": "Variables",
      "css-grid": "Grid",
      "css-animations": "Animations",
      "review-css": "CSS Review",
      "exam-css": "CSS Exam",
      "code-editors": "Code Editors",
      "javascript-variables-and-strings": "Variables and Strings",
      "javascript-booleans-and-numbers": "Booleans and Numbers",
      "javascript-functions": "Functions",
      "javascript-arrays": "Arrays",
      "javascript-objects": "Objects",
      "javascript-loops": "Loops",
      "review-javascript-fundamentals": "JavaScript Fundamentals Review",
      "higher-order-functions-and-callbacks": "Higher Order Functions and Callbacks",
      "dom-manipulation-and-events": "DOM Manipulation and Events",
      "js-a11y": "JavaScript and Accessibility",
      "debugging-javascript": "Debugging",
      "basic-regex": "Basic Regex",
      "form-validation": "Form Validation",
      "javascript-dates": "Dates",
      "audio-and-video-events": "Audio and Video Events",
      "maps-and-sets": "Maps and Sets",
      "localstorage-and-crud-operations": "localStorage and CRUD Operations",
      "classes-and-the-this-keyword": "Classes",
      "recursion": "Recursion",
      "functional-programming": "Functional Programming",
      "asynchronous-javascript": "Asynchronous JavaScript",
      "review-javascript": "JavaScript Review",
      "exam-javascript": "JavaScript Exam",
      "react-fundamentals": "React Fundamentals",
      "react-state-hooks-and-routing": "React State, Hooks, and Routing",
      "performance": "Performance",
      "testing": "Testing",
      "css-libraries-and-frameworks": "CSS Libraries and Frameworks",
      "data-visualization": "Data Visualization and D3",
      "typescript-fundamentals": "TypeScript Fundamentals",
      "review-front-end-libraries": "Front End Libraries Review",
      "exam-front-end-libraries": "Front End Libraries Exam",
      "python-basics": "Python Basics",
      "python-loops-and-sequences": "Loops and Sequences",
      "python-dictionaries-and-sets": "Dictionaries and Sets",
      "python-error-handling": "Error Handling",
      "python-classes-and-objects": "Classes and Objects",
      "python-object-oriented-programming": "Programmazione Orientata agli Oggetti",
      "python-linear-data-structures": "Linear Data Structures",
      "python-algorithms": "Algorithms",
      "python-graphs-and-trees": "Graphs and Trees",
      "python-dynamic-programming": "Dynamic Programming",
      "review-python": "Python Review",
      "exam-python": "Python Exam",
      "bash-fundamentals": "Bash Fundamentals",
      "sql-and-postgresql": "SQL and PostgreSQL",
      "bash-scripting": "Bash Scripting",
      "sql-and-bash": "SQL and Bash",
      "git": "Git",
      "review-relational-databases": "Relational Databases Review",
      "exam-relational-databases": "Relational Databases Exam",
      "introduction-to-nodejs": "Introduction to Node.js",
      "nodejs-core-libraries": "Node.js Core Libraries",
      "node-package-manager": "Node Package Manager",
      "http-and-the-web-standards-model": "HTTP and the Web Standards Model",
      "rest-api-and-web-services": "REST API and Web Services",
      "introduction-to-express": "Introduction to Express",
      "express-middleware": "Express Middleware",
      "error-handling-in-express": "Error Handling in Express",
      "websockets": "WebSockets",
      "node-and-sql": "Node and SQL",
      "security-and-privacy": "Security and Privacy",
      "authentication": "Authentication",
      "tooling-and-deployment": "Tooling and Deployment",
      "how-to-get-a-developer-job": "How to Get a Developer Job",
      "capstone-project": "Capstone Project",
      "certified-full-stack-developer-exam": "Certified Full Stack Developer Exam"
    },
    "module-intros": {
      "data-visualization": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will be introduced to data visualization and learn how to work with the D3 library."
        ]
      },
      "typescript-fundamentals": {
        "note": "Coming Fall 2025",
        "intro": [
          "In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz."
        ]
      },
      "python-classes-and-objects": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-object-oriented-programming": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-linear-data-structures": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-algorithms": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-graphs-and-trees": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "python-dynamic-programming": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge."
        ]
      },
      "bash-fundamentals": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge."
        ]
      },
      "sql-and-postgresql": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge."
        ]
      },
      "bash-scripting": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz."
        ]
      },
      "sql-and-bash": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz."
        ]
      },
      "git": {
        "note": "Coming Winter 2025",
        "intro": [
          "In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz."
        ]
      },
      "introduction-to-nodejs": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz."
        ]
      },
      "nodejs-core-libraries": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz."
        ]
      },
      "node-package-manager": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz."
        ]
      },
      "http-and-the-web-standards-model": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz."
        ]
      },
      "rest-api-and-web-services": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge."
        ]
      },
      "introduction-to-express": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz."
        ]
      },
      "express-middleware": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz."
        ]
      },
      "error-handling-in-express": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz."
        ]
      },
      "websockets": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz."
        ]
      },
      "node-and-sql": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge."
        ]
      },
      "security-and-privacy": {
        "note": "Coming Fall 2025",
        "intro": [
          "In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge."
        ]
      },
      "authentication": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz."
        ]
      },
      "tooling-and-deployment": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge."
        ]
      },
      "how-to-get-a-developer-job": {
        "note": "Coming Late 2026",
        "intro": [
          "In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more."
        ]
      },
      "capstone-project": {
        "note": "Coming Late 2026",
        "intro": [
          "This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification."
        ]
      },
      "certified-full-stack-developer-exam": {
        "note": "Coming Late 2026",
        "intro": [
          "This will be a 90 question exam testing what you have learned throughout this certification."
        ]
      }
    }
  },
  "javascript-v9": {
    "title": "JavaScript Certification",
    "intro": [
      "This course teaches you core JavaScript programming concepts such as working with variables, functions, objects, arrays, and control flow. You'll also learn how to manipulate the DOM, handle events, and apply techniques like asynchronous programming, functional programming, and accessibility best practices.",
      "To qualify for the exam, you must complete the following projects:",
      "- Build a Markdown to HTML Converter",
      "- Build a Drum Machine",
      "- Build a Voting System",
      "- Build a Bank Account Management Program",
      "- Build a Weather App",
      "Pass the exam to earn your JavaScript Certification."
    ],
    "chapters": {
      "javascript": "JavaScript"
    },
    "modules": {
      "javascript-variables-and-strings": "Variables and Strings",
      "javascript-booleans-and-numbers": "Booleans and Numbers",
      "javascript-functions": "Functions",
      "javascript-arrays": "Arrays",
      "javascript-objects": "Objects",
      "javascript-loops": "Loops",
      "review-javascript-fundamentals": "JavaScript Fundamentals Review",
      "higher-order-functions-and-callbacks": "Higher Order Functions and Callbacks",
      "dom-manipulation-and-events": "DOM Manipulation and Events",
      "js-a11y": "JavaScript and Accessibility",
      "debugging-javascript": "Debugging",
      "basic-regex": "Basic Regex",
      "lab-markdown-to-html-converter": "Build a Markdown to HTML Converter",
      "form-validation": "Form Validation",
      "javascript-dates": "Dates",
      "audio-and-video-events": "Audio and Video Events",
      "lab-drum-machine": "Build a Drum Machine",
      "maps-and-sets": "Maps and Sets",
      "lab-voting-system": "Build a Voting System",
      "localstorage-and-crud-operations": "localStorage and CRUD Operations",
      "classes-and-the-this-keyword": "Classes",
      "lab-bank-account-manager": "Build a Bank Account Management Program",
      "recursion": "Recursion",
      "functional-programming": "Functional Programming",
      "asynchronous-javascript": "Asynchronous JavaScript",
      "lab-weather-app": "Build a Weather App",
      "review-javascript": "JavaScript Review",
      "javascript-certification-exam": "JavaScript Certification Exam"
    }
  },
  "front-end-development-libraries-v9": {
    "title": "Front End Development Libraries Certification",
    "intro": [
      "This course teaches you the libraries that developers use to build webpages: React, TypeScript, and more.",
      "To earn your Front End Development Libraries Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Front End Development Libraries Certification exam."
    ],
    "chapters": {
      "front-end-development-libraries": "Front End Development Libraries"
    },
    "modules": {
      "front-end-development-libraries-certification-exam": "Front End Development Libraries Certification Exam"
    }
  },
  "python-v9": {
    "title": "Python Certification",
    "intro": [
      "This course teaches you the fundamentals of Python programming.",
      "To earn your Python Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Python Certification exam."
    ],
    "chapters": {
      "python": "Python"
    },
    "modules": {
      "python-certification-exam": "Python Certification Exam"
    }
  },
  "relational-databases-v9": {
    "title": "Relational Databases Certification",
    "intro": [
      "This course teaches you the fundamentals of relational databases.",
      "To earn your Relational Databases Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Relational Databases Certification exam."
    ],
    "chapters": {
      "relational-databases": "Relational Databases"
    },
    "modules": {
      "relational-databases-certification-exam": "Relational Databases Certification Exam"
    }
  },
  "back-end-development-and-apis-v9": {
    "title": "Back End Development and APIs Certification",
    "intro": [
      "This course teaches you the fundamentals of back end development and APIs.",
      "To earn your Back End Development and APIs Certification:",
      "- Complete the five required projects to qualify for the certification exam.",
      "- Pass the Back End Development and APIs Certification exam."
    ],
    "chapters": {
      "back-end-development-and-apis": "Back End Development and APIs"
    },
    "modules": {
      "back-end-development-and-apis-certification-exam": "Back End Development and APIs Certification Exam"
    }
  },
  "a1-professional-spanish": {
    "title": "A1 Professional Spanish Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"],
    "chapters": {
      "es-a1-chapter-welcome-to-a1-professional-spanish": "Welcome to A1 Professional Spanish",
      "es-a1-chapter-letters-and-sounds": "Letters and Sounds",
      "es-a1-chapter-greetings-and-introductions": "Greetings and Introductions"
    },
    "modules": {
      "es-a1-module-introduction-and-certification-overview": "Introduction and Certification Overview",
      "es-a1-module-alphabet-accents-and-punctuation": "Alphabet, Accents, and Punctuation",
      "es-a1-module-greetings-and-farewells": "Greetings and Farewells",
      "es-a1-module-introducing-yourself": "Introducing Yourself",
      "es-a1-module-first-questions": "First Questions"
    },
    "module-intros": {
      "es-a1-module-introduction-and-certification-overview": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-alphabet-accents-and-punctuation": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-greetings-and-farewells": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-introducing-yourself": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      },
      "es-a1-module-first-questions": {
        "note": "Coming Winter 2025",
        "intro": ["PLACEHOLDER: Write the module intro here."]
      }
    }
  },
  "responsive-web-design-v9": {
    "title": "Responsive Web Design Certification",
    "intro": [
      "This course teaches the fundamentals of HTML and CSS, including modern layout, design, accessibility, and responsive web development. You'll build practical projects and gain the skills to create professional, user-friendly webpages.",
      "To qualify for the exam, you must complete the following projects:",
      "- Build a Survey Form",
      "- Build a Page of Playing Cards",
      "- Build a Book Inventory App",
      "- Build a Technical Documentation Page",
      "- Build a Product Landing Page",
      "Pass the exam to earn your Responsive Web Design Certification."
    ],
    "chapters": {
      "html": "HTML",
      "css": "CSS",
      "responsive-web-design-certification-exam": "Responsive Web Design Certification Exam"
    },
    "modules": {
      "basic-html": "Basic HTML",
      "semantic-html": "Semantic HTML",
      "html-forms-and-tables": "Forms and Tables",
      "html-and-accessibility": "Accessibility",
      "review-html": "HTML Review",
      "computer-basics": "Computer Basics",
      "basic-css": "Basic CSS",
      "design-for-developers": "Design",
      "absolute-and-relative-units": "Absolute and Relative Units",
      "pseudo-classes-and-elements": "Pseudo Classes and Elements",
      "css-colors": "Colors",
      "styling-forms": "Styling Forms",
      "css-box-model": "The Box Model",
      "css-flexbox": "Flexbox",
      "css-typography": "Typography",
      "css-and-accessibility": "Accessibility",
      "attribute-selectors": "Attribute Selectors",
      "css-positioning": "Positioning",
      "responsive-design": "Responsive Design",
      "css-variables": "Variables",
      "css-grid": "Grid",
      "css-animations": "Animations",
      "review-css": "CSS Review",
      "lab-survey-form": "Build a Survey Form",
      "lab-page-of-playing-cards": "Build a Page of Playing Cards",
      "lab-book-inventory-app": "Build a Book Inventory App",
      "lab-technical-documentation-page": "Build a Technical Documentation Page",
      "lab-product-landing-page": "Build a Product Landing Page",
      "responsive-web-design-certification-exam": "Responsive Web Design Certification Exam"
    }
  },
  "a2-professional-spanish": {
    "title": "A2 Professional Spanish Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"]
  },
  "a2-professional-chinese": {
    "title": "A2 Professional Chinese Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"]
  },
  "a1-professional-chinese": {
    "title": "A1 Professional Chinese Certification (Beta)",
    "note": "This certification is currently in active development. While there isn't a claimable certification available for this section at the moment, one will be available soon. In the meantime, you're welcome to explore the courses we have created below.",
    "intro": ["Placeholder intro"]
  },
  "basic-html": {
    "title": "Basic HTML",
    "summary": [
      "Learn how to build simple webpages using HTML tags to add text, images, and links."
    ],
    "intro": ["Larger intro for the superblock page."]
  },
  "semantic-html": {
    "title": "Semantic HTML",
    "summary": [
      "Discover how to write cleaner, more meaningful HTML using semantic tags that improve structure, accessibility, and SEO."
    ],
    "intro": ["Larger intro for the superblock page."]
  },
  "dev-playground": {
    "title": "Dev Playground",
    "intro": ["Playground for creating and testing challenges"]
  },
  "full-stack-open": {
    "title": "Full Stack Open",
    "intro": ["A good intro is to be added here."],
    "chapters": {
      "part-0": "Fundamentals of Web Apps",
      "part-1": "Introduction to React",
      "part-2": "Communicating with Servers",
      "part-3": "Programming a Server with NodeJS and Express",
      "part-4": "Testing Express Servers, User Administration",
      "part-5": "Testing React Apps",
      "part-6": "Advanced State Management",
      "part-7": "React router, custom hooks, styling app with CSS and webpack",
      "part-8": "GraphQL",
      "part-9": "TypeScript",
      "part-10": "React Native",
      "part-11": "CI/CD",
      "part-12": "Containers",
      "part-13": "Using Relational Databases"
    },
    "modules": {
      "basic-html": "Basic HTML"
    },
    "module-intros": {
      "basic-html": {
        "title": "Basic HTML",
        "intro": [
          "Learn how to build simple webpages using HTML tags to add text, images, and links."
        ]
      }
    }
  },
  "daily-coding-challenge": {
    "title": "Daily Coding Challenge"
  },
  "misc-text": {
    "browse-other": "Browse our other free certifications",
    "courses": "Corsi",
    "steps": "Passaggi",
    "expand": "Espandi corso",
    "collapse": "Chiudi corso",
    "legacy-header": "Vecchi corsi",
    "legacy-desc": "Questi corsi non sono più parte del percorso di certificazioni, ma sono ancora disponibili per avanzare il tuo apprendimento.",
    "legacy-go-back": "Vai alla versione corrente del curriculum.",
    "course-maintenance": "Questi corsi sono in manutenzione. Se non funzionano, puoi imparare come eseguirli localmente su <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "course-disabling-soon": "The browser version of these courses will be temporarily disabled soon and your virtual machines will be deleted. Any progress in your virtual machines will be lost. If you have any files you want from them, you should save them to your computer. We apologize for any inconvenience. We hope to have an improved browser version of these courses available again in the next few weeks.",
    "course-disabled": "These courses are temporarily unavailable to run in the browser. We apologize for any inconvenience. You can learn how to run them locally at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>. We hope to have an improved browser version available again soon.",
    "run-locally": "For now, we recommend running the courses locally on your computer. You can learn how at <0>https://www.freecodecamp.org/news/how-to-run-freecodecamps-relational-databases-curriculum-using-docker-vscode-and-coderoad</0>.",
    "progress-wont-save": "I tuoi progressi non saranno salvati sul tuo account freeCodeCamp quando li esegui localmente.",
    "go-back-to-learn": "Torna alla versione stabile del curriculum.",
    "read-database-cert-article": "Per favore leggi questo post sul forum prima di procedere.",
    "enable-cookies": "Devi abilitare i cookie di terze parti prima di iniziare.",
    "english-only": "I corsi in questa sezione sono disponibili solo in inglese. Siamo solo in grado di tradurre i titoli e le introduzioni in questo momento, non le lezioni stesse.",
    "exam-english-only": "Please note that the certification exam is currently available only in English. The rest of the courses are available in some languages."
  }
}
